{
  "title": "P V. S | [2015] HKCFI 1457 | HKLII",
  "court": null,
  "year": 2015,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2015] HKCFI 1457 P V. S Judgment Information Date 18 Jun, 2015 Action No. HCCT39/2014 Neutral Cit. [2015] HKCFI 1457 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCCT39/2014 HCCT39/2014 P v. S HCCT 39/2014 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO 39 OF 2014 ______________ IN THE MATTER of Order 73 rule 1 of the Rules of the High Court ( Cap 4A ) and IN THE MATTER of an Arbitration Award dated 9 May 2014 (rectified on 21 June 2014) in case No HKIAC/PA 13108 made by an arbitral tribunal of the Hong Kong International Arbitration Centre (the “ Award ” and “ HKIAC ” respectively) and IN THE MATTER of section 81 of the Arbitration Ordinance ( Cap 609 ) and Article 34 of The UNCITRAL Model Law on International Commercial Arbitration (the “ Model Law ”) ______________ BETWEEN P Applicant (Respondent in the Arbitration Proceedings) and S Respondent (Claimant in the Arbitration Proceedings) ______________ Before : Hon Mimmie Chan J in Chambers Date of Hearing : 10 June 2015 Date of Reasons for Decision : 19 June 2015 ___________________________ REASONS FOR DECISION ___________________________ Background 1. This is an application made by P (“ P ”) to set aside an arbitral award made against it on 9 May 2014 (“ Award ”), on the ground that it was unable to present its case in the arbitration. At the end of the hearing on 10 June 2015, I dismissed the application. The following are my reasons. 2. On 28 February 2012, P entered into a share transfer agreement (“ Agreement ”) with S (“ S ”), whereby S agreed to purchase, and P agreed it to sell, 2% of the issued share capital (“ Shares ”) of a company (“ Company ”), at a consideration of RMB 118 million. The Agreement was entered into between the parties on the understanding, as reflected in clause 4.1.9 of the Agreement, that P would make its best endeavors to procure the listing of the Company on the Hong Kong Stock Exchange, and to complete such listing before 31 December 2012. 3. The Agreement further provides for P’s buyback of all the Shares, in the event of the listing not being completed by 31 December 2012. Clause 7.1 of the Agreement states: “除雙方另行協定外，倘若首次公開發行未能于2012年12月31日之前完成，買方可以要求賣方在2013年3月31日之前或雙方另行同意的較晚的日期，向買方回購所有標的股份，回購的價款總額為轉讓價款另加年利率為20%的利息(計息期間為買方履約支付股權轉讓款日至賣方回購所有標的股份之日止。” （Unless otherwise agreed by both parties, in the event that the Initial Public Offering is not completed by 31 December 2012, the Purchaser can make a demand to the Seller to buy back all the shares from the Purchaser before 31 March 2013 or at a later date separately agreed to by both parties. The total amount of the consideration for the buyback shall be the Purchase Price plus 20% interest per annum (interest shall accrue from the date of payment of the Purchase Price by the Purchaser in compliance with this agreement to the date of the Seller’s buy-back of all the shares.)） 4. The listing of the Company did not materialize on 31 December 2012, and on the same day, S made a demand in writing on P, for P to buy back the Shares. It is not disputed that by a letter dated 17 June 2013 (“ Offer ”), P offered to buy back the Shares on 26 July 2013. It is also not in dispute that on 25 July 2013, S accepted the Offer in writing. 5. S claims that in breach of clause 7.1 of the Agreement, P failed to make payment of the RMB 118 million (being the consideration for the Shares under the Agreement) on or before 26 July 2014, as agreed. Pursuant to the arbitration clause contained in the Agreement, S commenced arbitration in Hong Kong by its notice stated 29 July 2013 (“ Arbitration ”), to seek a declaration that P was in breach, specific performance of the Agreement, damages, and interest. 6. In its Defence filed in the Arbitration, P claims that the dispute in connection with the Agreement had already been resolved, in that the parties had reached a separate agreement relating to the buyback of the Shares. P alleges that there had been negotiations from 31 December 2012, as to the amount and the terms of the buyback under the Agreement. According to its Defence, P’s Offer of 17 June 2013 was accepted by S on 25 July 2013, and such offer and acceptance constituted “an independent and separate agreement” for P’s buyback of the Shares from S. On behalf of P, counsel argued at the hearing on 10 June 2015 that the Agreement had effectively been varied as a result of the negotiations (“ Variation Defence ”). 7. On the above basis, P claims (in paragraph 8 (c) of its Defence) that clause 7.1 no longer operates for the buyback arrangement, and denies that it was in breach. 8. P highlighted (in paragraph 9 of the supporting affirmation of Yeung) that, at the heart of its defence in the Arbitration, its case was that the Offer from P and S’s acceptance constituted a new and separate agreement, such that S’s recourse under the new agreement was different, and clause 7 of the Agreement was no longer operative. P further argued that the “dispute” to be resolved pursuant to the arbitration clause was the alleged breach of the new agreement, and not the alleged breach of clause 7 of the Agreement, and that S had “prematurely” referred such dispute to arbitration. P claims that under the arbitration clause in the Agreement, a dispute is to be referred to arbitration only if the parties fail to resolve such dispute within 90 days, and such 90 days only commenced to run from 26 July 2013, whereas the Notice of Arbitration was issued by S on 29 July 2013. 9. P further denies that it had failed to pay the RMB 118 million. It claims that it had on 28 August 2013, 18 September 2013 and 15 November 2013 caused a total sum of RMB 22.3 million to be transferred to S’s designated account, pursuant to the mutual agreement between S and P, and as directed by S (“ Payment Defence ”). 10. In the course of the Arbitration, the Arbitrator sought submissions from the parties as to whether or not the Arbitration should be conducted on the basis of documents only, and whether oral evidence was required. There was a lengthy exchange of correspondence amongst the solicitors acting for P, the solicitors acting for S, and the Arbitrator. P’s solicitors repeatedly and on various occasions referred to the need to seek discovery and to file evidence on whether there were negotiations between the parties, and whether there was breach of the Agreement. The Arbitrator was not satisfied that P had identified the key issues to be addressed, and why oral evidence was necessary in light of the pleadings, and did not accede to P’s request for witness statements to be filed. 11. On 28 March 2014, P filed a Notice of Challenge of the Arbitrator, claiming that the Arbitrator was biased. This challenge was dismissed by the Hong Kong International Arbitration Centre. The Arbitration continued, and the parties agreed to proceed with the Arbitration on the documents only. 12. On 9 May 2014, the Arbitrator issued his Award. In essence, he found that there was no separate or independent agreement between the parties to buy back the Shares, and that such separate agreement only constituted S’s forbearance to sue under the Agreement. He considered that the arbitration clause in the Agreement was wide enough to cover the dispute between the parties under the Agreement and what constituted the buyback arrangement. The Arbitrator considered that P had failed to establish what in fact was alleged to have been agreed under any new or mutual agreement as a result of the alleged negotiations, which was different from the Agreement as pleaded by the parties in the Arbitration. He ruled that by failing to pay for the Shares by 31 December 2012 on S’s demand, or on 31 March 2013, or by 26 July 2013 as agreed on 25 July 2013, P was clearly in breach of the Agreement. The Arbitrator considered that P had acknowledged its indebtedness to S under the Guarantee it signed on 18 November 2013. P was accordingly ordered to pay a sum of RMB 151.2 million, with interest, to S. 13. On 17 September 2014, P applied under s 81 (2) (a) (ii) of the Arbitration Ordinance Cap 609 (“ Ordinance ”) to set aside the Award, on the ground that it was unable to present its case by virtue of its inability to adduce witness statements and factual evidence in the Arbitration. Applicable legal principles 14. In Grand Pacific Holdings Ltd v Pacific China Holdings Ltd (in liq) (No 2) [2012] 4 HKLRD 1 (CA), in reversing the lower court’s decision to set aside an arbitral award, the Court of Appeal made it clear that “the conduct complained of must be serious, even egregious, before a court could find that a party was unable to present his case”. At para 105 of the judgment, the Court explained: “An error would only be sufficiently serious if it has undermined due process… Even so, the Court may refuse to set aside the award if the court is satisfied that the arbitral tribunal could not have reached a different conclusion. How a court may exercise its discretion in any particular case will depend on the view it takes of the seriousness of the breach. Some breaches may be so egregious that an award would be set aside although the result could not be different.” 15. In Grand Pacific , the tribunal refused leave to the applicants to file submissions on foreign law and on illegality issues affecting the contract. On the application to set aside the award, the Court of Appeal held that the tribunal was entitled to impose terms and timetable for expert evidence to be filed and for submissions to be made, and to use such procedures as appropriate to the case, in order to avoid unnecessary delay and expenses. The Court would not interfere with what it considered to be a case management decision which was fully within the discretion of the Tribunal, but further held that even if there was a violation of due process and a sufficiently serious error could be shown, if it had no effect on the outcome of the arbitration, the Court would not exercise its discretion to set aside the award for a non-material error (paragraphs 98 - 105 of the judgment of Tang VP, as he then was). The burden is on the applicant to show that he had or might have been prejudiced by the error. Whether the Award should be set aside 16. As can be seen from the decision of the Court of Appeal in Grand Pacific , the burden is on P to establish a serious or egregious error which undermines due process, and further, that it has suffered prejudice as a result of such error, before the Court will exercise its discretion to set aside the Award. 17. It was within the Arbitrator’s case management powers to order a hearing on documents only, and to refuse P’s application to adduce factual evidence. Whether the Arbitrator’s decision to make such an order constitutes an egregious error, or a serious irregularity, so as to amount to an undermining of due process, depends on whether the Arbitrator had grounds to exclude the factual evidence, the relevance and materiality of the evidence sought to be produced by the party, whether they relate to and had an impact on the issues in dispute to be determined by the Arbitrator in the Arbitration, and whether the parties can be said to have been seriously prejudiced by the exclusion of the evidence. 18. In the course of the hearing on 10 June 2015, I made it clear that at this stage when P seeks this Court to set aside the Award, it is no longer sufficient for it to argue (as it sought to do before the Arbitrator) that factual evidence can be filed, or should be filed, in various aspects, eg “to illuminate the full background and key issues”, or “evidencing the ... variation of the Agreement”. What P is required to do is to establish that there was evidence which it sought to file, and could have filed, in the Arbitration, which could have materially affected the Award or the outcome of the Arbitration, but which it was unable to do or prevented from doing, so that it was unable to properly present its case. 19. From the evidence filed by P in support of this application to set aside, P (through its solicitor) could only make general, unparticularised statements as to the evidence which it had sought to produce in the Arbitration. It claimed that witness evidence was required in various areas, including evidence of “the intention of the parties” and the factual matrix to the Agreement, as to the meaning of “dispute” in the arbitration clause of the Agreement; airline receipts showing the frequency of travel of the parties; the intention of the parties at the time of the part payments made in August to December 2013 (relating to the Payment Defence); and generally as to the consideration for the Variation Defence. 20. As for P’s reference to the need to file evidence of the negotiations between the parties, it is pertinent to note that according to the Defence, the Offer from P and S’s acceptance of the Offer constituted the alleged new agreement on the buyback. These are the same documents relied upon by S in its claims against P. The terms of the Offer are as set out in paragraph 5 (k)(i) and (ii) of the Defence: that P shall buy back the Shares from S on 26 July 2013, and further buy back 4.83% of the shares in the Company held by S’s nominee, Sky Success, on 30 August 2013. No other terms are pleaded in the Defence as forming part of the alleged new agreement. 21. In the light of how P’s Defence is pleaded, I agree with the Arbitrator that factual evidence was either not admissible, or not required from the parties, on their subjective intention of the meaning of “dispute”, or the construction of the Agreement and of the arbitration clause, or on their negotiations leading to the Agreement and/or the alleged new agreement. According to the Arbitrator, it was just a question of construction and of law, whether the alleged new agreement was separate to the Agreement, and whether the alleged new agreement was supported by consideration. 22. P was not able to identify, whether in its correspondence with the Arbitrator, or in its affirmation in support of the setting aside application, the precise facts on which it sought to rely, to support any legal argument that could have been made by its counsel at the Arbitration, that there was valid consideration for the new agreement, in substitution for the agreement to buy back under clause 7.1 of the Agreement. The following explanation was given in the affirmation filed in support by P’s solicitor: “The existence of practical benefits constituting consideration could not be gleaned and understood merely from the documents in the parties’ Lists of Documents, but required explanation from witnesses. Such explanation included the financial position of the parties at the time of entering into the New Buy-back Agreement, the considerations of corporate reputation, concerns of shareholders, circumstances of the financial market, the ability of both sides to pursue lawsuit, and the established harmonious relationship of the parties.” 23. This, in my view, is only a general exposition of what could have been deposed to, in support of an argument of practical benefits constituting legal consideration, as opposed to what P claims to be the relevant facts which applied to its case and which can assist its Defence. P did not identify what the relevant parties’ financial position was at the material time which was claimed to be relevant; did not state whether there were in fact concerns of corporate reputation, and if so, what such concerns were; did not state what the situation of the financial market was at the material time, which was claimed to be relevant to the existence of practical benefits; and did not specify what the alleged abilities of the parties to pursue lawsuit were, or whether there was a harmonious relationship, and how that would have shown the existence of valuable consideration. 24. As for the reference to airline receipts and the frequency of travel of the parties during the time of the negotiations, again, P has not begun to explain how these were relevant to the issues in dispute for determination in the Arbitration, why evidence from witnesses was required in this context, and how any frequency of travel would shed light on the alleged new agreement, or the facts to show the existence of consideration. 25. With regard to the Payment Defence and the evidence which P sought to adduce in relation thereto, paragraph 8 (e) of the Defence pleads that P had made transfers in August, September and November 2013 pursuant to the “mutual agreement” between the parties, and as directed by S. There is nothing in the Defence, nor in the affirmation filed in support of the setting aside application, as to what the alleged “mutual agreement” or S’s direction was, which would assist or further P’s defence to S’s claim of P’s breach of the Agreement. It is not alleged in P’s Defence that the payments in August, September and November 2013 of the total sum of RMB 22.3 million were in full and final settlement of the amount payable under the Agreement, or the alleged new agreement. 26. S does not dispute that the payments in August 2013, September 2013 and 15 November 2013 were made to the bank accounts in question, but denies that these payments related to P’s buyback of the Shares from S. In the Arbitration, S relied on a Guarantee dated 18 November 2013, after the date of the 3 alleged payments, whereby P acknowledged its liability to S for the entire sum of RMB 118 million, and its obligation to buy back the Shares. The Arbitrator considered that this is evidence of P’s admission of its debt to S, and that such debt remained owing as at 18 November 2013. 27. In all the above circumstances, I fail to see how the Arbitrator’s refusal to permit P to file factual evidence on the part payments, and on the unparticularised “mutual agreement”, could have had any material effect on P’s Defence, and how the Award could have been materially different if P had been given the opportunity to put in factual evidence. P has simply failed to discharge its burden of showing that it had suffered material prejudice as a result of any error on the Arbitrator’s part. Conclusion 28. I am not satisfied that there had been a serious error in the conduct of the Arbitration. Even if there was an error, I am not satisfied that P had been materially prejudiced by the error, and I will not exercise by discretion to set aside the Award. 29. The application was accordingly dismissed, and P is to pay the costs of the application on an indemnity basis ( A v R (Arbitration: Enforcement) [2009] 3 HKLRD 389 ), with certificate for Counsel. (Mimmie Chan) Judge of the Court of First Instance High Court Mr Kenneth YF Wong, instructed by Lennon & Lawyers, for the applicant Ms Rachel Lam, instructed by Gall, for the respondent Look up this case on Lawcite Noteup",
  "length": 19003,
  "headers_seen": [
    "Background",
    "Applicable legal principles",
    "Whether the Award should be set aside",
    "Conclusion"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2015/1457",
  "query": "Model Law",
  "ts": "2025-10-16T10:53:21",
  "ok": true
}