{
  "title": "CHESAPEAKE ASIA-PACIFIC LTD V. NIRVANA (ASIA) LTD AND OTHERS | [2009] HKDC 82 | HKLII",
  "court": null,
  "year": 2009,
  "date": null,
  "content": "HKLII Databases District Court [2009] HKDC 82 CHESAPEAKE ASIA-PACIFIC LTD V. NIRVANA (ASIA) LTD AND OTHERS Judgment Information Date 27 Apr, 2009 Action No. DCCJ2941/2006 Neutral Cit. [2009] HKDC 82 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History DCCJ2941/2006 DCCJ002941/2006 CHESAPEAKE ASIA-PACIFIC LTD v. NIRVANA (ASIA) LTD AND OTHERS DCCJ 2941/2006 IN THE DISTRICT COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION CIVIL ACTION NO. 2941 OF 2006 ____________ BETWEEN CHESAPEAKE ASIA-PACIFIC LIMITED Plaintiff and NIRVANA (ASIA) LIMITED 1 st Defendant PRO-ART PEOPLE ASIA LIMITED 2 nd Defendant YU WAI KWOK 3 rd Defendant _____________ Coram: HH Judge Lok in Court Dates of trial: 13, 14, 15, 16 January & 12 February 2009 Date of handing down of judgment: 28 April 2009 _______________________ JUDGMENT _______________________ 1. This is a commercial dispute arising out of a contract between a company and its former sub-contractor for the supply and production of premier point-of-sale display retail units and related merchandises. Background of the case 2. The Plaintiff is a subsidiary of a United States company engaged in the business of supplying value-added specialty paperboard packaging, plastic packaging and luxury point-of-sale displays with target customers including premier multinational companies involved in, inter alia , the supply and marketing of international premium branded products such as watches and cosmetics. 3. One of its customers was PAC Team SA, a Switzerland-based company, which had a clientele of international branded luxurious goods suppliers. In October 2002, the Plaintiff’s president, Mr. Peter Lee, came to know one Mr. Alain Borle who was the president of PAC Team SA. In order to reduce the costs for producing point-of-sale displays, PAC Team SA planned to outsource some of the production work to the suppliers in the Mainland China. However, as the production of such products involved a lot of technology know-how and intellectual property rights owned by various multinational companies, PAC Team SA had some reservation in dealing directly with companies in Hong Kong or the Mainland. As the Plaintiff had a good business reputation and profile, PAC Team SA agreed to outsource the production work through the Plaintiff. Under their arrangement, PAC Team SA would place orders with the Plaintiff for the supply of the point-of sale displays and packaging and the Plaintiff would then engage various sub-contractors to carry out the actual production work. Such kind of business relationship started in 2003. In order to enhance its business management, PAC Team SA incorporated PAC Team Asia Pacific Ltd. (“PAC”) in July 2004 to conduct its business in Hong Kong and China. For the purpose of this judgment, PAC Team SA and PAC are collectively referred to as “the PAC Team Group”. 4. The 1 st Defendant became one of the Plaintiff’s sub-contractors for the supply of the products for the PAC Team Group on 4 May 2004. Before that, the 1 st Defendant had to sign a non-disclosure agreement (“the Non-Disclosure Agreement”) and a mutual confidentiality agreement (“the Mutual Confidentiality Agreement”) with the Plaintiff. The relevant terms of the Non-disclosure Agreement are as follows: “I am pleased that [the Plaintiff] has appointed [the 1 st Defendant] to render professional services, and in its capacity as a subcontractor to [the Plaintiff], both parties agree to the following terms for compliance: - Customer Contact: As a subcontractor, [the 1 st Defendant] agrees not to contact [the Plaintiff’s] customers in regard to pricing and related issues, including but not limited to rendering direct service to [the Plaintiff’s] customers. - Intellectual Property and Non-disclosure: Bother parties agree to comply the ‘Mutual Confidentiality Agreement’ as signed on May 4, 2004 ………” On the other hand, the Mutual Confidentiality Agreement prohibits the 1 st Defendant and its employees to use, disclose, copy or allow access to the Plaintiff’s “confidential information” without the prior written consent of the Plaintiff, and “confidential information” was defined in the Mutual Confidentiality Agreement to include, inter alia , project information, trading partners and customer list and contacts. These 2 Agreements were signed by the 3 rd Defendant on behalf of the 1 st Defendant. 5. After the 1 st Defendant became one of the Plaintiff’s sub-contractors, the 1 st Defendant produced various point-of-sale displays for the customers of the PAC Team Group, including Roger Dubius, Dunhill, Movado and Tissot. By reason of its position as the Plaintiff’s sub-contractor, the 1 st and the 3 rd Defendants had the opportunities to meet the senior staffs of the PAC Team Group and even some of the staffs of the clients of the PAC Team Group to discuss the actual production work of the point-of-sale displays. 6. In November and December 2004, the Plaintiff placed an urgent order to the 1 st Defendant to produce 6,000 units of Tissot point-of-sale displays. On or about 25 January 2005, the Plaintiff came to know that the 1 st Defendant had supplied a quotation to the PAC Team Group concerning a “repeat order” of 8,000 units of Tissot point-of-sale displays. The Plaintiff complained that such direct business dealing was in breach of the provisions in the Non-Disclosure Agreement. The Plaintiff immediately made a protest to the PAC Team Group and the 1 st and the 3 rd Defendants, and the Plaintiff eventually secured the “repeat order” of the Tissot point-of-displays from the PAC Team Group. As there was no diversion of business or order in this particular case, Mr. Wong, counsel for the Plaintiff, agrees that this complaint would not form part of the claims against the Defendants. 7. The Plaintiff later found out that during the period from September 2005 to March 2006, the PAC Team Group had issued a number of purchase orders to the 2 nd Defendant for the supply of point-of-displays for the PAC Team Group’s various customers including Tissot, and such complaint now forms the basis for the existing claims against the Defendants. 8. The relationship between the different Defendants can be summarised as follows. The 1 st Defendant was a company engaged in the business of manufacturing and supply of point-of-sale displays and packaging. The 1 st Defendant was incorporated in March 2003 with the 3 rd Defendant, one Wong Ting Tat (“TT Wong”) and one Timelink Century Co. Ltd. as directors and shareholders each holding equal shares. From about 1 October 2004, the shareholders of the 1 st Defendant were the 3 rd Defendant, TT Wong, one Lee Kwok On (“Lee”) and one Wong Chiu Man (“CM Wong”) each holding 25% of the shares. With effect from 18 July 2005, Lee and CM Wong also became the directors of the 1 st Defendant. The 3 rd Defendant ceased to be a director of the 1 st Defendant on 1 March 2006 and transferred all his shares to TT Wong on 16 March 2006. 9. The 2 nd Defendant was a company also engaged in the manufacturing and supply of point-of-sale displays and packaging. Lee and CM Wong had been the shareholders and directors of the 2 nd Defendant since 1999. In a certain period of time in 2005, the 1 st and the 2 nd Defendants shared the same registered address. In March 2005, both Lee and CM Wong ceased their directorship with the 2 nd Defendant and transferred their respective shares to one Madam Ho Yin Hung (“Madam Ho”) who is the wife of CM Wong. The claims and the issues 10. It is the Plaintiff’s case that, at all material times, the 1 st and the 2 nd Defendants were related and associated companies, and the 3 rd Defendant was working for both the 1 st and the 2 nd Defendants in diverting the Plaintiff’s business to the 2 nd Defendant. 11. By reason of the aforesaid, the Plaintiff brought the following causes of action against the Defendants: (i) against the 1 st Defendant, for breach of the Non-Disclosure Agreement and the Mutual Confidentiality Agreement for having direct business dealing with the PAC Team Group and providing confidential information to the 2 nd Defendant; (ii) against the 2 nd and the 3 rd Defendants, for inducing, procuring and assisting in the 1 st Defendant’s breach of the Non-Disclosure Agreement; and (iii) against all the Defendants, for unlawful interference with the Plaintiff’s business with intent to cause loss and damage and conspiracy to injure the Plaintiff’s interest. 12. The total amount of the Plaintiff’s claims is US$101,816.332 or equivalent to HK$794,167.39. 13. In this action, the 1 st Defendant and the Plaintiff have also filed respectively a Counterclaim and a Counterclaim to Counterclaim against the opposite parties. Both of these counterclaims were settled in the trial. 14. According to the pleadings filed by the parties, the issues in the remaining Plaintiff’s claims are: (i) whether the term in the Non-Disclosure Agreement prohibiting direct business dealing between the 1 st Defendant and the Plaintiff’s clients (“the Non-Competition Clause”) is wider than necessary for protection of the legitimate interest of the Plaintiff thereby constituting a restraint of trade and are therefore invalid and unenforceable; and (ii) whether the 2 nd Defendant knew about the Non-Competition Clause in the Non-Disclosure Agreement and whether the Defendants had committed the tort of inducing the 1 st Defendant to breach the Non-Disclosure Agreement, unlawful interference or conspiracy to injure the Plaintiff’s business interest. Non-Competition Clause 15. The main complaint relating to the Non-Competition Clause is that there is no time limit in respect of the restraint. According to the plain meaning of such clause, it would mean that the 1 st Defendant can never receive a direct order from the Plaintiff’s customers once it becomes a sub-contractor of the Plaintiff. Taking into account that it is only a small market for the supply of such speciality display units, it is very easy for the Plaintiff to monopolize its position in the market. Further, by subjecting the sub-contractors to such restraint, it would be open for the Plaintiff to place a small order from a particular sub-contractor, and once that order is made, that sub-contractor would be barred, without a time limit, from receiving any other direct orders from the Plaintiff’s customers. This would be grossly unfair on the sub-contractors like the 1 st Defendant. 16. It is trite law that all covenants in restraint of trade are prima facie unenforceable at common law and are enforceable only if there are reasonable with reference to the interests of the parties concerned and of the public. Unless the unreasonable part can be severed by the removal of either part or the whole of the covenant in question, its inclusion renders the covenant or the entire contract unenforceable (see: Chitty on Contracts , 29 ed., vol. 1, para. 16-075). 17. As to the test of reasonableness, the following passage in Chitty on Contracts is relevant: “While all restraints of trade to which the doctrine applies are prima facie unenforceable, all, whether partial or total, are enforceable if reasonable. As was said by Lord Macnaghten in Nordenfelt v Maxim Nordenfelt & Co: ‘It is a sufficient justification, and indeed it is the only justification, if the restriction is reasonable – reasonable, that is, in reference to the interests of the parties concerned and reasonable in reference to the interests of the public, so framed and so guarded as to afford adequate protection to the party in whose favour it is imposed, while at the same time it is in no way injurious to the public’. In determining reasonableness the court ‘is entitled to consider whether or not a covenant of a narrower nature would have sufficed for the covenantee’s protection.’ Even if the restraint is unlimited in time or in space it will be upheld if it is reasonable, although the absence of such a limit ‘is a remarkable feature prima facie needing justification.’ ……… In determining reasonableness the court does not apply any doctrine of ‘proportionality’, that is, an assessment of whether there is a substantial equivalence between the scope of the restraint and what the covenantor received for entering into it. To introduce such a doctrine would be to revive the now discredited doctrine that in assessing the reasonableness of the restraint the court should also consider the adequacy of the consideration.” (para. 16-091) 18. In reply to the Defendants’ complaint, Mr. Wong submits that the restraint would end with the termination of the appointment of the 1 st Defendant as the Plaintiff’s sub-contractor. Although the Non-Disclosure Agreement contains no express provision for its determination, such contract may be determined by reasonable notice on the part of one or both of the parties. In such case, the restraint would not be for an unlimited period of time. 19. However, assuming that the Non-Disclosure Agreement can be determined by reasonable notice, the restrictions prohibiting competition and direct dealing with the Plaintiff’s customers still remain. As the Non-Competition Clause contains no express time limit relating to the restraint, the 1 st Defendant cannot deal with the Plaintiff’s customers even if the appointment of the 1 st Defendant as the Plaintiff’s contractor is terminated. 20. In fact, Mr. Peter Lee of the Plaintiff, in his oral testimony, agrees that the restraint would remain after termination of the business relationship between the Plaintiff and the 1 st Defendant. In fact, this was the whole point of the protection, otherwise the 1 st Defendant could just simply give notice to the Plaintiff to terminate the appointment and then proceed to take the orders from the Plaintiff’s customers. This, according to Mr. Peter Lee, was totally unethical and contrary to the restraint in the Non-Competition Clause. Hence, the fact that the Non-Disclosure Agreement could be terminated by reasonable notice cannot assist the Plaintiff’s case. 21. The crux of the matter is that there is no time limit in the restraint. At the trial, Mr. Peter Lee is being asked whether it is reasonable to impose the restraint say, 10 years, after the termination of the business relationship between the Plaintiff and the 1 st Defendant. Facing such a question, even Mr. Lee expresses some doubt and cannot offer a ready answer. Hence, to impose a restraint may be reasonable. But without limiting the time for the effect of the restraint, the Non-Competition Clause becomes an unreasonable restraint of trade clause. 22. In this regard, I certainly have some sympathy with the Plaintiff. As I see it, the Plaintiff’s president, Mr. Peter Lee, is a man of integrity. He would observe a high level of business ethics and he demands his business associates to observe the same. However, in order to protect its interest as a “middleman” between the ultimate customers and the suppliers, the Plaintiff, like a real property estate agent who introduces a potential purchaser to an owner, can only rely on properly drafted covenant contained in a legal contract. If the restraint is wider than necessary for the protection of the legitimate interest of the Plaintiff, I am afraid that the Plaintiff would only have itself to blame. In fact, I understand from Mr. Lee that there was another more detailed version of the non-competition clause prepared by the legal advisers of the Plaintiff or the Plaintiff’s parent company. However, in order to avoid the use of complicated and elaborated legal provisions, Mr. Peter Lee decided to adopt the abbreviated version of the Non-Competition Clause as now contained in the Non-Disclosure Agreement. Unfortunately, without a time limit in the Non-Competition Clause, such “home-made” clause is simply wider than necessary for the protection of the legitimate interest of the Plaintiff. Further, the court cannot rewrite the clause to impose a reasonable time limit for the restraint, and neither can the court sever or remove the objectionable part of the restraint from the covenant in question. In such case, the court has no option but to strike down the clause. Whether, in accepting the orders from the PAC Team Group on the part of the 2 nd Defendant, the Defendants had committed the tort of inducing the 1 st Defendant to breach the Non-Competition Clause, unlawful interference or conspiracy to injure the Plaintiff? 23. The Plaintiff’s remaining claims are based on the validity of the Non-Competition Clause. If the clause is struck down by the court, it was quite legitimate for the 2 nd Defendant to receive orders directly from the PAC Team Group (see: Clerk & Lindsell on Torts , 19 ed., at para. 25-23, where it is stated that it is not tortious to induce a breach of a contract which is unlawful as being an unreasonable restraint of trade), and so the Plaintiff’s remaining claims must fail. The aforesaid ruling is, therefore, sufficient to dismiss the Plaintiff’s claims. However, since the parties have devoted considerable time at the trial to deal with the evidence about the second issue, I feel obliged to give my ruling on such issue as well. 24. In support of the Plaintiff’s claims on inducing the breach of contract, unlawful interference and conspiracy to injure the Plaintiff’s business interest, the Plaintiff relies on the close relationship and the nexus between the different Defendants as mentioned above. The Plaintiff therefore says that the 2 nd Defendant must have had knowledge of the Non-Competition Clause, and the Defendants must have had conspired together to divert PAC Team Group’s orders from the Plaintiff to the 2 nd Defendant. 25. It is common ground that in the period from September 2005 to March 2006, the 2 nd Defendant had received various orders from the PAC Team Group relating to the supply of point-of-sale displays. In reply to the Plaintiff’s complaint, the 3 rd Defendant and Madam Ho, the shareholder and director of the 2 nd Defendant, try to offer an explanation at the trial. According to them, the 2 nd Defendant was a separate company owned and run by Madam Ho. The 2 nd Defendant had no knowledge of the Non-Competition Clause, and there was no conspiracy on the part of the Defendants in diverting the orders from the Plaintiff to the 2 nd Defendant. 26. After listening to their evidence, I do not find them to be impressive witnesses. Firstly, it is clear from the company search records that the 1 st Defendant, the 2 nd Defendant and one Man & On Exhibition Contractors Co. Ltd. were related companies. They were owned by more or less the same group of persons but at different periods of time. These companies carried on very similar businesses and it is very difficult for me to understand why there were various transfers of shareholdings in these companies in 2005, in particular after the Plaintiff had made the protest about the direct business contact between the 1 st Defendant and the PAC Team Group in January 2005. Further, it is clear that Madam Ho had all along played a very limited role in assisting her husband, CM Wong, in running the latter’s business, and she did not know very well about the business of the 2 nd Defendant. In such circumstances, what was the purpose of transferring the shareholdings in the 2 nd Defendant from Lee and CM Wong to Madam Ho in 2005? Because of such unusual transfer of shareholdings, I have reason to believe that this was done pursuant to the further development of the business relationship between the 2 nd Defendant and the PAC Team Group in 2005, and the 2 nd Defendant must have had knowledge of the Non-Competition Clause when it received the orders from the PAC Team Group. Hence, if the Non-Competition Clause is not struck down, these findings may prima facie assist the Plaintiff’s claims. 27. However, I still have some reservation in my mind as to whether these facts alone are sufficient to establish the tort of inducing the breach of contract, unlawful interference or conspiracy to injure the Plaintiff’s interest. Undoubtedly, there is no evidence before the court to show that the Defendants had done anything to solicit the orders from the PAC Team Group. In fact, the evidence and the correspondence in the present case indicate that the PAC Team Group was quite eager to get the Plaintiff out of the business venture. By dealing directly with the supplier, the PAC Team Group could reduce the costs of production by eliminating the profit taken up by the middleman, ie. the Plaintiff. Hence, the evidence seems to suggest that Mr. Alain Borle, being a “smart businessman” as described by Mr. Peter Lee, and other staffs of the PAC Team Group took the initiative to contact the 3 rd Defendant for the supply of quotations for further orders (see: the e-mail messages from Mr. Alain Borle to Mr. Peter Lee dated 26 January 2005 and the e-mail message from Ms. Agnes Poon to the 3 rd Defendant dated 26 January 2005). Further, the evidence also shows that the relationship between the Plaintiff and the PAC Team Group became tense in December 2005 (see: the e-mail message from Mr. Peter Lee to Mr. Alain Borle dated 2 December 2004, and also the dispute over payment as seen in the e-mail messages between Mr. Alain Borle and Ms. Agnes Poon dated 8 & 9 October 2004) and after the Plaintiff made the protest about the direct business contact between the PAC Team Group and 1 st Defendant in January 2005. As the staffs of the PAC Team Group already had direct contact with the 1 st and the 3 rd Defendants by working on the previous orders, it was likely that the PAC Team Group took the initiative to approach the Defendants for the supply of quotations in respect of the future orders. In such case, it was the PAC Team Group who had procured the 2 nd Defendant to receive the orders by-passing the Plaintiff, and the Defendants had all along been acting passively in the transactions. If that was the case, I doubt whether accepting orders alone is sufficient to establish the torts alleged by the Plaintiff in the pleading. Further, one must bear in mind that the Non-Competition Clause only prohibits the 1 st Defendant from doing business directly with the PAC Team Group. Unless the Plaintiff can prove that the 2 nd Defendant received the orders as agent on behalf of the 1 st Defendant, there was no breach of the agreement concerned. Although there was some connection and association between the 1 st and the 2 nd Defendants, there is still insufficient evidence before the court to conclude that the 2 nd Defendant was acting as the 1 st Defendant’s agent in these transactions. In any event, the parties’ legal representatives have not offered a lot of assistance on these particular issues, and so I do not propose to give a definite ruling on these now turn out to be academic issues. 28. In the Amended Statement of Claim, it is also pleaded that the 1 st Defendant was in breach of the provisions in the Mutual Confidentiality Agreement in passing the confidential information to the 2 nd Defendant. For the confidential information, I take that it refers to the business contacts of the PAC Team Group. However, as the evidence suggests that it was the PAC Team Group who had taken the initiative to approach the Defendants for further orders, there is no issue of passing of confidential information in this case. 29. By reason of the aforesaid, in particular my ruling on the validity of the Non-Competition Clause, I dismiss the Plaintiff’s claims. I also make an order nisi that the costs of the Plaintiff’s claims be to the Defendants with certificate for counsel, which shall be made absolute 14 days after the handing down of this judgment. (David Lok) District Judge Mr. Kevin C. W. Wong, instructed by Messrs. Y. C. Lee, Pang, Kwok & Ip, for the Plaintiff Mr. Kenneth K. H. Shum, instructed by Messrs. Jal N. Karbhari & Co., for the Defendants Look up this case on Lawcite Noteup",
  "length": 23985,
  "headers_seen": [
    "Background of the case",
    "The claims and the issues",
    "Non-Competition Clause"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkdc/2009/82",
  "query": "non-disclosure agreement",
  "ts": "2025-10-17T10:45:08",
  "ok": true
}