{
  "title": "NAM SHUM LAND INVESTMENT CO LTD V. 郭村 | [2009] HKDC 113 | HKLII",
  "court": null,
  "year": 2009,
  "date": null,
  "content": "HKLII Databases District Court [2009] HKDC 113 NAM SHUM LAND INVESTMENT CO LTD V. 郭村 Judgment Information Date 19 May, 2009 Action No. DCMP2629/2008 Neutral Cit. [2009] HKDC 113 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History DCMP2629/2008 DCMP002629/2008 NAM SHUM LAND INVESTMENT CO LTD v. 郭村 DCMP 2629/2008 IN THE DISTRICT COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION MISCELLANEOUS PROCEEDINGS NO. 2629 OF 2008 ------------------------ IN THE MATTER OF Order 113 of the Rules of the District Court and IN THE MATTER of all those pieces or parcels of ground registered in Land Registry as Lot No. 78 and the Remaining Portion of Lot No. 97 all in Demarcation District No. 135, Yuen Long, New Territories BETWEEN NAM SHUM LAND INVESTMENT COMPANY LIMITED Plaintiff and 郭村 Defendant ---------------------- Coram: Deputy District Judge Frederick Chan in Chambers (open to the public) Date of Hearing: 15 th May 2009 Date of Handing Down Decision: 20 th May 2009 ---------------------- DECISION ---------------------- The Order 1. On 30 th October 2008, the Plaintiff and the Defendant appeared before me at a hearing ( “the Hearing” ) at the end of which I made the following order upon the consent of the Defendant: “UPON the application of the Plaintiff by way of Originating Summons filed herein on the 25 th day of September 2008 AND UPON reading the Affirmation of Lam Hon Wan Nelson together with exhibit thereto filed herein on the 25 th day of September 2008 AND UPON hearing the Solicitors for the Plaintiff and the Defendant appearing in person IT IS ORDERED that: … The Plaintiff do recover possession of Lot No. 78 and the Remaining Portion of Lot No. 97 all in Demarcation District No. 135, Yuen Long, New Territories, in particular, the areas colored brown on the “Lot Nos. 78 & 79 RP in DD 135” plan annexed hereto for the purpose of identification only” (“ the Possession Order ”). 2. On 14 th January 2009, the Plaintiff issued a praecipe for writ of possession and a writ of possession against the Defendant pursuant to the Possession Order to seek for recovery of the parts of Land Lots No.78 and 79 (“ the Land ”). The Leave to Appeal 3. No doubt galvanized into action by the Plaintiff’s attempts to enforce the Possession Order against him, the Defendant issued an inter parte summons on 19 th February 2009 to apply for leave to appeal against the Possession Order out of time and for a stay of execution of the Possession Order (“ the Leave Application ”). His subsequent application for legal aid was however dismissed by the Director of Legal Aid on 7 th April 2009. 4. Culled from the Defendant’s 2 affirmations dated 12 th March 2009, his contentions for the Leave Application can be summarized as follows: (a) He and his family members have been living in the Land for many years; (b) At the Hearing, he agreed to the making of the Possession Order as he thought that the Plaintiff would pay him reasonable compensation; (c) His uncle, a Mr. Kwok Chun came from the Mainland China to Hong Kong to settle down; (d) Mr. Kwok Chun [1] had lived in the Land Lot 135 since 1961; (e) In about 1979, the Defendant came to Hong Kong to start a new life; (f) In about 1980, Mr. Kwok Chun passed away and his children gave permission to the Defendant to move into the Land Lot 135 to live there; (g) In about 1982, the Defendant and his family moved into the Land Lot 135 to reside there; at that time, Madam Kwok Chi Shum [2] who was Mr. Kwok Chun’s grand-daughter was already residing there; (h) In about 1983, Madam Kwok Chi Shum successfully applied for a Crown Land Permit for the use of the Land; (i) Subsequently and in 1983, Madam Kwok Chi Shum moved out from the Land Lot 135 and the Defendant continued to reside there with his family with the permission of Madam Kwok Chi Shum. 5. From what was said by the Defendant in his affirmation, he is relying on a defence of adverse possession against the Plaintiff and he is arguing that the Plaintiff’s paper title to the Land has been extinguished. The Issue 6. I am of the view that the following issue (“ the Issue ”) arose for determination: “Given that the Possession Order was granted against the Defendant upon his consent, whether in the present circumstances of the case the Leave Application should be granted?” The Law 7. There is a dearth of local authorities on the proper approach which the Court should adopt when confronted with an application by a party for leave to appeal belatedly against a consent order on the ground that he or she was mistaken and that the true facts of the case (if made known to the Court) could not have supported the consent order. 8. When dealing with the Issue, I have borne in mind the following legal principles: (a) In the Court of Appeal’s decision of Lui Sik Kuen v. Lee Suk Ling [1992] 2 HKLR 371 , it was held that a party may apply to set aside a consent order or judgment of the court by either an appeal or a fresh action; (b) In the English Court of Appeal’s decision of Robinson v. Robinson (Practice Note) [1982] 1 WLR 786 , Lord Justice Ormrod said at pp. 786-787: “There is no doubt that both the Court of Appeal and the judge at first instance have jurisdiction with which we are faced in this case, where the application is to set aside a final order. Lord Diplock said so in de Lasala v. de Lasala [1980] AC 546 , 561: “Where a party to an action seeks to challenge, on the ground that it was obtained by fraud or mistake, a judgment or order that finally disposes of the issues raised between the parties, the only way of doing it that are open to him are be appeal from the judgment or order to a higher court or by bringing a fresh action to set it aside”. … The essence of the distinction is that the power to vary usually reflects changes of circumstances subsequent to the date of the order, whereas the power to set aside arises when there has been fraud, mistake, or material non-disclosure as to the facts at the time the order was made. From the point of view of convenience, there is a lot to be said for proceedings of this kind taking place before a judge at first instance, because there will usually be serious and often difficult issues of fact to be determined before the power to set aside can be exercised. These can be determined more easily, as a rule, by a judge at first instance. Moreover he can go on to make the appropriate order which we cannot do in this court. I think that these proceedings should normally be started before a judge at first instance, although there may be special circumstances which make it better to proceed by way of appeal ” (emphasis added); (c) In the House of Lords’ decision of Barder v. Caluori [1980] AC 20 , the facts were that the wife and husband agreed to a consent order whereby the husband agreed to transfer the entire matrimonial home to the wife who would be awarded the custody of the 2 children. About a month later, the wife killed the 2 children and committed suicide. The husband applied for leave to appeal out of time against the consent order on the ground that the transfer order was premised upon a common mistake that the matrimonial home should house the 2 children and the wife; (d) the husband succeeded at first instance but the English Court of Appeal set aside the decision; (e) the husband took the case to the House of Lords and prevailed; (f) in delivering the unanimous judgment of the House of Lords, Lord Brandon dealt with the issue of leave to appeal out of time against a consent order as follows: “There can, in my opinion, be no doubt that the consent order dated 20 February 1985 was agreed between the husband and the wife through their respective solicitors, and approved by the registrar, upon a fundamental, though tacit, assumption. The assumption was that for an indefinite period, to be measured in years rather than months or weeks, the wife and the two children of the family would require a suitable home in which to reside. That assumption was totally invalidated by the deaths of the children and the wife within five weeks of the order being made (at p. 40) … My Lords, the result of the two lines of authority to which I have referred appears to me to be this. A court may properly exercise its discretion to grant leave to appeal out of time from an order for financial provision or property transfer made after a divorce on the ground of new events, provided that certain conditions are satisfied. The first condition is that new events have occurred since the making of the order which invalidate the basis, or fundamental assumption, upon which the order was made, so that, if leave to appeal out of time were to be given, the appeal would be certain, or very likely, to succeed . The second condition is that the new events should have occurred within a relatively short time of the order having been made. While the length of time cannot be laid down precisely, I should regard it as extremely unlikely that it could be as much as a year, and that in most cases it will be no more than a few months. The third condition is that the application for leave to appeal out of time should be made reasonably promptly in the circumstances of the case. To these three conditions, which can be seen from the authorities as requiring to be satisfied, I would add a fourth, which it does not appear has needed to be considered so far, but which it may be necessary to consider in further cases. That fourth condition is that the grant of leave to appeal out of time should not prejudice third parties who have acquired, in good faith and for valuable consideration, interests in property which is the subject matter of the relevant order (at p. 41)” (emphasis added); (g) Lord Brandon stated the raison detre for the court’s stringent approach of granting leave to appeal out of time against a consent order as follows: “My Lords, the question whether leave to appeal out of time should be given on the ground that assumptions or estimates made at the time of the hearing of a cause or matter have been invalidated or falsified by subsequent events is a difficult one. The reason why the question is difficult is that it involves a conflict between two important legal principles and a decision as to which of them is to prevail over the other. The first principle is that it is in the public interest that there should be finality in litigation. The second principle is that justice requires cases to be decided, so far as practicable, on the true facts relating to them, and not on assumptions or estimates with regard to those facts which are conclusively shown by later events to have been erroneous (at p.41)”. Discussion 9. In the present case, the Defendant’s new allegations of having been in adverse possession of the Land only surfaced well after the Possession Order. The Plaintiff submitted and I agreed that the Leave Application was taken out by the Defendant quite late. That aspect of delay has been considered by me. 10. The Defendant claimed that at the Hearing and when things were transpiring, he had mistakenly thought that the issue of compensation for his possession of the Land would be dealt with by the Plaintiff later. 11. However, from the Transcripts of the Hearing, it is clear that the Defendant had made no mention of the circumstances surrounding his alleged occupation of the Land at the Hearing. It is also relevant to note that he told that Court at the Hearing that he did not require time to consider his position and he went on to agree to the Possession Order. 12. In determining the Issue, mutatis mutandis, I would respectfully apply the guidance laid down by Lord Brandon in the Barder’s case by analogy. In so holding, I have not lost sight of the trite principle in law that a party who wishes to set aside a default judgment which was regularly obtained must prove not only a credible defence but a defence with a reasonable prospect of success. 13. My focus was therefore firmly placed on the merits of the putative appeal of the Defendant. All matters considered, I am of the view that the Defendant’s new allegations of adverse possession would not avail him in the Leave Application for the following reasons: (a) On the basis of his affirmation evidence, the Defendant argued that he was allowed by Mr. Kwok Chun’s children to enter into the Land and Mr. Kwok Chun was a trespasser of the Land since 1961; (b) In 1980, Mr. Kwok Chun passed away and the Land was occupied by his grand-daughter, Madam Kwok Chi Shum; (c) In 1982 and with the permission of Mr. Kwok Chun’s children, the Defendant moved to reside in the Property; (d) In 1983, Madam Kwok Chi Shum moved out of the Land and the Defendant continued to occupy the Land with his family with her permission; (e) The Defendant stressed that his entrance into the Land in 1981 and the subsequent occupation was (all along) with the permission and blessing of Madam Kwok Chi Shum; (f) In other words, the Defendant’s possession and occupation of the Land could be traced back to Madam Kwok Chi Shum; (g) In law, it could be argued that the Defendant was the licensee of Madam Kwok Chi Shum; (h) It is crucial to note that the Defendant is not claiming possessory title independently from Madam Kwok Chi Shum or the estate of Mr. Kwok Chun; nor is he claiming that he has dispossessed Madam Kwok Chi Shum; (i) The Crown Land Permit which was granted to Madam Kwok Chi Shum in about 1983 also poses an insurmountable hurdle to the Defendant’s claim for possessory title; (j) In the Privy Council’s decision of Sze To Chun Keung v. Kung Kwok Wai David & Another [1997] 1 WLR 1232 , the squatter went into occupation of the plaintiff’s land in 1955 and in 1961, he was granted with a Crown land permit which (in return for HK$21) allowed him to occupy the land for a temporary period and to erect a store, kitchen, pigsty and accommodation; since then, the defendant had remained in occupation; the squatter’s claim for possessory title was upheld by the Judicial Committee of the Privy Council; (k) Regarding the Crown land permit, Lord Hoffmann opined at p. 1235 that: “After the grant of the Crown permit, the defendant remained in physical possession of the land. It was wholly enclosed and the defendant manifested the outward intention of excluding all other persons, including the owner and the Crown, which had granted him a right of exclusive occupation … But the effect of the permit was that he possessed on behalf of the Crown. By accepting the benefit of the permit, he became estopped from denying the Crown had the right to allow him to occupy. For the purposes of limitation, therefore, possession from 1961 must be regarded as having been in the Crown, which possessed through licensee, the defendant. Was that possession adverse to the plaintiffs? Their Lordships consider that it was. The position of the Crown was no different from that of any other person who had taken possession by a licensee. The situation would have been no different if, for example, the defendant had sold his possessory title to a company which allowed him to remain in occupation and run the store as its manager. The fact that the Crown was also the grantor of the lease under which the plaintiffs were entitled to the land is irrelevant … Thus the grant of the Crown land permit transferred possession to the Crown but did not stop the running of the limitation period”; (l) Put to the highest, if what was said by the Defendant in his affirmation were to be believed, the licensee under the Crown Land Permit was Madam Kwok Chi Shum and not the Defendant; (m) In the circumstances and as far as possessory title to the Land is concerned, the Defendant is not the one who is entitled to lay a claim; (n) Therefore, the Defendant has no defence to the Plaintiff’s claim for possession of the Land. 14. My view is fortified by the Court of Final Appeal’s decision in Cheung Yat Fuk v. Tang Tak Hong (2004) 7 HKCFAR 70 . There, a squatter trespassed into the land of the plaintiff for 7 years and he purported to grant a tenancy agreement to his tenant for 30 years. When the plaintiff finally issued legal proceedings to claim for possession of the land, the squatter pleaded that he had a possessory title. 15. The case ended up before the Court of Final Appeal which determined this issue: “Can a squatter acquire a possessory title to land through his tenant’s occupation of the land (at p. 72)?” 16. The answer given by our Court of Final Appeal was yes. In an illuminating judgment, Mr. Justice Bokhary observed at pp. 74-75 that: “7. It is well established that a squatter can grant a lease or even a tenancy of land of which he is a squatter … Principle 8. Mr. Alan Leong SC for the appellant rightly concedes that a squatter can be in adverse possession of land through his licensee’s occupation of the land. But he contends that a squatter cannot be in adverse possession of land through his tenant’s occupation of the land. I can see no good reason in principle for drawing such a distinction between a tenancy granted by a squatter and a licence granted by a squatter. The granting of a tenancy by a squatter is at least as much an act done in the assumed character of owner as the granting of a licence by a squatter. If anything, the former is even more obviously so than the latter. Authorities 9. Because turning to the cases, I note that learned authors of Megarry and Wade, The Law of Real Property (6 th ed., 2000) equate without distinction adverse possession through a tenant with adverse possession through a licensee. They say this (at p. 1309 para. 21-017): “The adverse possessor need not himself be in physical possession of the land. If he grants a tenancy or licence, the tenant or licensee possesses on his behalf and is estopped from denying the licence or tenancy” … Conclusion 19. The conclusion to which I have come on principle and persuasive authority is as follows. When a squatter grants a tenancy and receives rent, he is acting inconsistently with the title of the paper owner, and that puts the squatter in adverse possession of the land through his tenant. The squatter can in that way acquire a possessory title to the land through his tenant’s occupation of the land”. 17. Applying the Cheung Yat Fuk ’s case to the instant case, it could be concluded that vis-à-vis the occupation of the Land, the Defendant is only a licensee of Madam Kwok Chi Shum. 18. It is not appropriate for me to elaborate further on whether Madam Kwok Chi Shum is the proper person to make a claim for the possessory title to the Land given that she is not a party in the present proceedings. No such finding is made nor intended to be made by me. Conclusion 19. I have given the present case my most anxious considerations and at the end I am driven to the conclusion that even if the Defendant is able to make good all his allegations on the possession of the Land since 1982, he is not the proper person to claim for the possessory title of the Land. In short, he has no defence in the present proceedings brought against him by the Plaintiff. 20. The Defendant’s putative appeal is without merits. To paraphrase what Lord Brandon had said in Barder ’s case, the Defendant’s intended appeal is not one that “if leave to appeal out of time were to be given, the appeal would be certain, or very likely to succeed”. 21. In my view, the answer to the Issue is no. Orders 22. In the circumstances, I would make the following orders in respect of the Leave Application: (a) The Defendant’s application for leave to appeal against the Possession Order be dismissed with costs; (b) The Defendant’s application for a stay of execution of the Possession Order be dismissed with costs; (c) The Defendant shall pay the costs of the Leave Application to the Plaintiff forthwith, and such costs to be taxed if not agreed. 23. I have directed that when this judgment is handed down, an English interpreter and a Hakka interpreter should be at hand to explain the contents of this judgment to the Defendant. (Frederick H. F. Chan) Deputy District Judge Representation: Mr. Ambrose Ng of Messrs. Liu Chan Lam, solicitors for the Plaintiff. The Defendant, unrepresented, appearing in person. [1] The English transliteration of 郭珍. [2] The English transliteration of 郭志琛. Look up this case on Lawcite Noteup",
  "length": 20392,
  "headers_seen": [
    "The Order",
    "The Leave to Appeal",
    "The Issue",
    "The Law",
    "Discussion",
    "Conclusion",
    "Orders"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkdc/2009/113",
  "query": "possession order",
  "ts": "2025-10-17T10:41:40",
  "ok": true
}