{
  "title": "SECRETARY FOR JUSTICE V. THE SUN NEWS PUBLISHER LTD. AND ANOTHER | [2002] HKCFI 290 | HKLII",
  "court": null,
  "year": 2002,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2002] HKCFI 290 SECRETARY FOR JUSTICE V. THE SUN NEWS PUBLISHER LTD. AND ANOTHER Judgment Information Date 21 Jan, 2002 Action No. HCMP6152/2001 Neutral Cit. [2002] HKCFI 290 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCMP6152/2001 HCMP006152/2001 SECRETARY FOR JUSTICE v. THE SUN NEWS PUBLISHER LTD. AND ANOTHER HCMP006152/2001 HCMP 6152/2001 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE MISCELLANEOUS PROCEEDINGS NO. 6152 OF 2001 ------------------- IN THE MATTER of an application by the Secretary for Justice for leave to apply for an Order of Committal AND IN THE MATTER of criminal proceedings in HCCC No. 57 of 2000 ------------------- BETWEEN SECRETARY FOR JUSTICE Applicant AND THE SUN NEWS PUBLISHER LIMITED 1st Respondent LEE CHUNG PAK 2nd Respondent ------------------- Coram: Hon Sakhrani J in Court Date of Hearing: 22 January 2002 Date of Judgment: 22 January 2002 ________________________ J U D G M E N T ________________________ 1. This is an application by the Secretary for Justice for the 1st respondent, the Sun News Publisher Limited, and the 2nd respondent, Lee Chung Pak, to be punished for their contempt of court in relation to two articles published in the Sun newspaper on 21 and 22 March 2001. These articles were published during the criminal trial of Lam Shing Tak in High Court Criminal Case No. 57 of 2000 in the Court of First Instance for the murder and kidnapping of a four year-old boy. The 1st respondent is the publisher of the Sun newspaper. The 2nd respondent is and was at all material times the Chief Editor of the newspaper. The Sun newspaper is a popular Chinese language newspaper in Hong Kong with a wide circulation of over one million and ranks third in terms of newspaper circulation. It also has a website. 2. The background facts to the kidnapping and murder are that on the 30 June 1999 a young boy aged four was kidnapped. At around 5 p.m. on 30 June 1999 at Wong Chuk Hang Estate the young boy was collected from his kindergarten school by his father. They went together on foot to a take-away food shop. The boy's father went inside the shop to collect some food which he had ordered beforehand and the boy stayed outside. When the father came out of the shop the little boy was missing and his father spent the next hour or so searching unsuccessfully for him around the estate before reporting the matter to the police. At about the time that the father came out of the shop a man was seen to be carrying a boy in school uniform who was crying. Some three days later, i.e. on 3 July 1999, the little boy's decomposing body was found floating in the sea not far from Tsing Yi Island. It was wrapped in adhesive tape and his thumbs had been tied together with a plastic strap. At a subsequent autopsy the pathologist concluded that the boy could have died from drowning, from suffocation or possibly an overdose of drugs. 3. The defendant in the criminal trial for the murder and kidnapping of the young boy was Lam Shing Tak. His trial commenced before Jackson J. on 12 March 2001 at the Court of First Instance. Before empanelling a jury the judge conducted a voir dire to determine the admissibility of Lam's cautioned statements. This lasted from 12 March to 21 March 2001. On 21 March 2001 the judge ruled that the statements were admissible and the trial was adjourned to the following day, 22 March. It was intended that the jury would be empanelled on 23 March and that the trial would proceed. 4. On 22 March 2001 when the court convened the judge's attention was drawn to an article appearing in the Sun newspaper the previous day i.e. 21 March. This has been referred to as the first article in the proceedings before me. This was an article entitled \"inhumane brutality\". It discussed the murder case that Lam was being tried for. It identified the child by name. It described and discussed purported forensic evidence in the case which was fictitious and a motive for the killing. It also indicated that the sequel to be published the following day would be about how one drop of blood led to the arrest of the murderer. 5. At the hearing on 22 March 2001 the judge also obtained the sequel published on that day in the Sun newspaper. This has been referred to as the second article. It was entitled \"one drop of blood led to the arrest of the murderer\". The second article published a photograph of the child and identified Lam as the suspect by his nickname and by his relationship with the child's mother. It also described the purported evidence against him some of which was also fictitious. The suggestion in the article that a blood stain was found in the suspect's home was also fictitious. Both articles were accompanied by a number of photographs which had nothing to do with the case. There is no doubt that these articles were sensational articles. Both the first and second articles were published before any evidence had been led in the trial and just before the jury was about to be empanelled. 6. On 22 March 2001 the judge had a letter sent to the Chief Editor, the 2nd respondent, of the Sun newspaper prohibiting any such further publication. The trial was adjourned to the following day, 23 March 2001. 7. On 23 March 2001 after discussing the matter with counsel the judge determined that the articles prejudiced Lam's right to a fair trial. The judge also expressed the view that he was absolutely astonished by the articles. He adjourned the trial and ordered that it be re-listed but not earlier than six months. The trial eventually continued in September and October 2001. 8. The issue at the trial was whether Lam Shing Tak kidnapped and murdered the child. The evidence against Lam consisted mainly of : （1） The child's DNA sample found on the outside of plastic gloves found in Lam's residence. Lam's DNA was found on the inside of the gloves; （2） Plastic straps found in Lam's residence were similar to a plastic strap used to bind the child's thumbs; （3） The child's mother identified Lam in the video tape of the place where the child was abducted; （4） Lam had his hair cut before going to the police station to be questioned; and （5） Lam's false accounts of his movements on 30 June 1999. 9. Lam's defence was that he did not kidnap or murder the child. On 5 October 2001 the jury convicted Lam of the child's murder. The judge sentenced him to life imprisonment. Lam was also convicted of kidnapping and he was sentenced to 18 years' imprisonment. 10. Mr. Blanchflower SC, for the Secretary for Justice, has in his careful and very helpful written submissions succinctly set out the legal principles applicable to the proceedings before me. To the credit of the 1st and 2nd respondents they do not dispute the contentions of the Secretary for Justice that the publication of the articles do indeed amount to contempt of court. There is no defence in law available to the respondents and the respondents have conceded their liability for contempt of court. 11. The contempt of court in this case is the wrongful interference with the administration of justice by the publication of the two articles at a time when the trial of Lam Shing Tak was ongoing. 12. The mens rea of contempt is an intention to publish the articles. Intention to interfere, influence or prejudice the administration of justice is irrelevant to the question of whether or not one is guilty of contempt although these are relevant matters in relation to the penalty. The test is whether the publication of the articles was calculated to interfere with the course of justice ( R v. Odhams Press Ltd. and others, Ex parte Attorney-General [1957] 1 QB 73 ). It has been held that \"calculated\" in this context meant \"likely\" ( Attorney-General v. South China Morning Post and another [1984] HKC 500). 13. For a publication to amount to a contempt of court, it is not necessary that a fair trial is actually prejudiced. The test is whether there is a real risk of prejudice. 14. I have no doubt, having read and considered the articles, that the publication of the articles taken either individually or together amounted to a very serious contempt of court. There was a real risk of prejudice to Lam's trial which was ongoing at the time of their publication on 21 and 22 March 2001. The trial commenced on 12 March and was ongoing at the time. They referred to the kidnapping and the murder with which Lam was charged and purported to rely on the work of the pathologist who was involved in the investigation of the case. This was untrue. They also referred to purported evidence against Lam which had not been adduced at the trial. They referred also to purported conversations with investigating officers which were fictitious but gave the impression that they were true. 15. The trial judge commented that a good deal of what appeared in the articles was simply untrue. He said : \" It's a fiction and an extremely dangerous one and there is, to my mind, a very real risk of there being serious prejudice to this defendant receiving a fair trial at this time.\" 16. There is no doubt in my mind that any potential juror would be prejudiced by what he would have read in the articles. The judge's views are, of course, not determinative of the matter although the court should give due weight to it. I agree with the views of the trial judge. I have no doubt that at the time that the articles were published there was a real and serious risk of prejudice to Lam receiving a fair trial by reason of the publication of the articles taken either individually or together. 17. The Secretary for Justice has established to my satisfaction beyond reasonable doubt that the respondents were in contempt of court and I so find. I find that the respondents are guilty of contempt of court. Before I determine the penalty to be imposed I shall hear counsel on the matter. [After hearing submissions] 18. As regards the penalty to be imposed on the respondents, Mr. Wong Yan Lung, counsel for the respondents, has with his customary care, courtesy and eloquence urged a number of matters before me on behalf of them. The respondents have, of course, accepted liability for their contempt of court and they have thereby saved the court's time by not disputing the contentions on the question of liability for contempt of court. It is to their credit that they have conceded that they are liable for contempt of court. 19. Mr. Wong has emphasized that his clients never had any intention to interfere with the fair trial of Lam. This, of course, is not a defence but is relevant to the penalty to be imposed. I accept that there was no deliberate intention by the respondents to interfere with the fair trial of Lam. It is plain from the statement of agreed facts that starting from 18 October 2000 the Sun newspaper began to publish on a daily and continuous basis, series of articles on various crimes, criminal investigation processes and experience of other disciplined services. Between 18 October 2000 and 20 March 2001, a total of nine series had been published. The tenth series was the ?forensic evidence? series. The two articles in question were articles under this series and were published on 21 and 22 March after the ninth series had finished on 20 March 2001. The preparation of the ?forensic evidence? series had in fact started in early February 2001 with thirty chapters planned. The persons responsible for this series were a Miss Sze, the news editor and section head of the Special Case Section and a Mr. Wong, a reporter. 20. I accept that substantial research work on the ?forensic evidence? series generally had begun in early February 2001. This included general information gathering and interviews with a retired PRC surgeon with expertise in forensic medicine. Originally, fictitious cases were considered for the series but subsequently a decision was made by Miss Sze and her superiors that real incidents should be preferred rather than imaginary events. This was done to impress readers. The case with the title 'killing of the abducted child case' was the first case chosen for publication. That was the very subject matter of the trial that Lam was facing. The 'killing of the abducted child case' was the first case chosen to be published because it was a major and startling case at the time it happened and there were more resources available including other news cuttings. I accept, as was urged by counsel for the respondents, that the reporter Mr. Wong had also drawn on what had been reported in other news reports of the kidnapping and murder. And although these were not accurate reports the situation was not that the reporter had wantonly made up things himself to feature in the articles in question. 21. It has been urged upon me that the two articles were published as part of the ?forensic evidence? series which was planned and prepared as a collective project and which was part of a wider publication agenda of the Sun newspaper. I accept this as I do the fact that in the two articles there was no reference to the trial and that the publication of the two articles was not by reference to or prompted by the ongoing trial. I accept that it was a coincidence that the two articles were published about nine days after the trial against Lam had commenced on 12 March 2001. 22. It has also been submitted that Miss Sze and the reporter Mr. Wong and the 2nd respondent did not know that the trial had already started on 12 March 2001 and that the jury was about to be empanelled. It was only upon the receipt of the letter sent by the judge's clerk on 22 March 2001 that they realized that the trial was ongoing and that the jury was about to be empanelled. I accept this. The 2nd respondent promptly said as much in the letter dated 29 March 2001 from his solicitors to the clerk to the judge. However, it should be borne in mind that the criminal case against Lam Shing Tak was, of course, listed in the law notices in the South China Morning Post and the daily cause list of the court for the dates that the trial was proceeding. Although the law notices in the South China Morning Post were in English and the daily cause list, which was bilingual, were not distributed to the public at large, the failure by the responsible persons at the Sun newspaper to notice that the trial of Lam was ongoing shows a measure of negligence on their part. There were no checks made to see if the trial was pending or was imminent before publication of the articles. But I am satisfied that there was no intention to interfere with the fair trial of Lam. 23. It has also been urged upon me that both Miss Sze and the reporter Mr. Wong had explained to the respondents that they had mistakenly thought that they were only writing about a case which had already been solved and concluded. Despite the valiant efforts of Mr. Wong Yan Lung I am unable to accept that on the material before the court. I am unable to accept that Miss Sze and Mr. Wong could have been mistaken that the case had been concluded. The news report of the Sun newspaper published on 16 December 1999 made it plain that the suspect had only been arrested the day before, i.e. on 15 December 1999, and was charged with the kidnapping and murder. Also, in the second article itself published on 22 March 2001 it was also stated that the suspect was only formally arrested on 15 December 1999. The reporter Mr. Wong and Miss Sze were, of course, responsible for the publication of the second article. It is, in my view, incredible that Miss Sze and Mr. Wong, the reporter, could have been mistaken about the case being concluded at the time of the publication of the articles. I am wholly unable to accept this. 24. Mr. Wong has also submitted that the trial of Lam was not in fact aborted but adjourned and that the costs of the voir dire proceedings were not wasted. A jury had not yet been empanelled when the trial was adjourned. I take this into account. 25. I also take into account the fact that both respondents have a clear record. This is the first time that either of them has been found guilty of contempt of court. 26. I have also considered all the other matters urged upon me by Mr. Wong, counsel for the respondents, and the various authorities that he has referred to. Each case is, of course, decided on its own facts and I do not think that I need to go into the authorities as the facts are all different. 27. I accept also that at an early stage when called upon by Jackson J. to explain the matter the respondents immediately replied by a letter dated 29 March 2001 written by the solicitors with a full explanation accompanied by detailed documentation. After receipt of the letter of 22 March the respondents immediately ceased further publication of the articles and also deleted the articles from the website and I have also been told that the respondents have abandoned altogether the remaining twenty-eight chapters of the ?forensic evidence? series. Also, at an early stage by the letter of 29 March 2001 the respondents have expressed their deep regrets and unreserved apology for having allowed the two articles to be published. 28. It has also been urged upon me that the respondents have taken their wrongs seriously. They immediately suspended both Miss Sze and the reporter Mr. Wong from their duties. They were also considering taking disciplinary measures against them and I have been told that both Miss Sze and Mr. Wong have resigned from the newspaper. The 2nd respondent was the Chief Editor at the material time. As such he must take responsibility for what is published whether or not he knew that proceedings were at the time pending or imminent. As I have said the Sun newspaper is a popular newspaper with a wide readership of over one million. As the Chief Editor of this popular newspaper he should have put in place steps to prevent contempts of this nature before publication of the articles. No such steps were put in place. There is no evidence of any responsible steps either before or after the publication of the two articles taken by the 2nd respondent as the Chief Editor to prevent a recurrence of a contempt of this nature. It seems to me that the court must regard as very serious the respondents' contempt of court. The Sun newspaper, as I have said, has a wide circulation, ranking third in terms of newspaper circulation. The articles were of a sensational nature and no doubt were published with a view to increase sales and readership of the newspaper. 29. It seems to me that the appropriate penalty to be imposed in all the circumstances on the 1st respondent is a fine of $150,000.00 and I so order. As regards the 2nd respondent, he as the Chief Editor has the overall editorial responsibility for what appears in the newspaper. I am satisfied that in all the circumstances and because of all the matters put before me this is not an appropriate case for imposing a custodial sentence on him. In my judgment the appropriate penalty against the 2nd respondent would be a fine in the sum of $30,000.00 and I so order. I also order that the respondents pay the costs of these proceedings to the Secretary for Justice. I am not satisfied, however, that this is a proper case for ordering them to pay indemnity costs. Costs to be taxed if not agreed. The respondents are to have 14 days to pay the fines imposed. 30. Finally I would like to express my gratitude to both counsel for all their assistance rendered to me. (Arjan H. Sakhrani) Judge of the Court of First Instance Representation: Mr. Michael Blanchflower SC of Department of Justice for the Applicant Mr. Wong Yan Lung instructed by M/s Iu, Lai & Li for the 1st and 2nd Respondents Look up this case on Lawcite Noteup",
  "length": 19836,
  "headers_seen": [
    "[After hearing submissions]"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2002/290",
  "query": "contempt of court",
  "ts": "2025-10-16T12:11:32",
  "ok": true
}