{
  "title": "AIG INSURANCE HONG KONG LTD V. LYNN MCCULLOUGH AND ANOTHER | [2020] HKCFI 1793 | HKLII",
  "court": null,
  "year": 2020,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2020] HKCFI 1793 AIG INSURANCE HONG KONG LTD V. LYNN MCCULLOUGH AND ANOTHER Judgment Information Date 29 Jul, 2020 Action No. HCMP2216/2018 Neutral Cit. [2020] HKCFI 1793 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCMP2216/2018 HCMP2216B/2018 AIG INSURANCE HONG KONG LTD v. LYNN MCCULLOUGH AND ANOTHER HCMP 2216/2018 [2020] HKCFI 1793 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE MISCELLANEOUS PROCEEDINGS NO 2216 OF 2018 ________________________ BETWEEN AIG INSURANCE HONG KONG LIMITED Plaintiff and LYNN MCCULLOUGH 1st Defendant WILLIAM MCCULLOUGH 2nd Defendant ________________________ Before: Deputy High Court Judge Leung in Chambers Date of Hearing: 18 October 2019 Date of Decision: 30 July 2020 ____________________ DECISION ____________________ 1. The defendants (“the McCulloughs”) are US citizens residing in Texas, USA. The plaintiff (“AIG”) has obtained ex parte [1] from this court an anti-suit injunction, together with leave for service of proceedings out of jurisdiction, enjoining the McCulloughs from taking further action in their legal proceedings against AIG in the court of the State of Miami, Florida, USA without compliance with the relevant insurance policy, in particular the Hong Kong arbitration clause. AIG applied for continuation of the injunction [2] , whereas the McCulloughs applied to have it discharged and the leave to serve out set aside or the proceedings herein stayed. The applications went before DHCJ Blair. The learned deputy judge handed down his decision on 3 July 2019. He allowed AIG’s application, continued the injunction subject to adjustment in terms, and dismissed the McCulloughs’ applications (“the Decision”). He also handed down his decision on costs on 16 August 2019 (“the Costs Decision”). 2. This is the McCulloughs’ application for leave to appeal against both the Decision and the Cost Decisions. A. Background 3. Briefly, Mrs McCullough sustained serious personal injury during an excursion in the Caribbean, for which the McCulloughs filed a lawsuit in the Miami court for damages against the corporate defendants responsible for operating the excursion. At one stage, the director of one of the defendants, Mr von der Goltz (“von der Goltz”), was also joined as a defendant. Von der Goltz sought an indemnity under a director and officer liability insurance policy taken out by his company with AIG, which is subject to coverage limit of US$5 million (“the Policy”). AIG disputed coverage of von der Goltz in respect of the McCulloughs’ claim, except for his defence costs. 4. The McCulloughs and those defendants then proceeded to arbitration with a “high-low agreement” behind, which set an agreed range of the award. The arbitration award was eventually issued, and judgment was entered by the court in terms of the award against those defendants, including von der Goltz, in the sum of US$65.5 million, which is the top end of the agreed range. 5. It was at that point when the McCulloughs amended their lawsuit in the Miami Court by joining AIG as a defendant for the purpose of what is known as a “bad faith” claim against it (“the Third Amended Complaint”). The “bad faith” claim, under Florida law, is a common law tort claim against AIG for allegedly failing to act in good faith in handling, litigating and settling the US proceedings as the insurer of von der Goltz. That resulted in a judgment in excess of the policy limits against von der Goltz as the insured. The McCulloughs contended that had AIG honoured the Policy and provided von der Goltz with the US$5 million policy coverage, he would have been able to settle their claim. AIG’s failure has thus exposed von der Goltz to excessive liability under the US$65.5 million judgment. The McCulloughs now have the right to claim against AIG directly for such sum. 6. The Policy provides [3] that the governing law is that of Hong Kong, and any dispute in respect of, amongst others, the coverage shall be determined by HKIAC (Hong Kong International Arbitration Centre) arbitration in Hong Kong (“the Dispute Resolution Clause”). Therefore AIG filed a motion in the Miami Court to compel arbitration in Hong Kong and to dismiss the Third Amended Complaint. 7. Meanwhile, AIG applied ex parte to this court on 18 December 2018 and obtained the anti-suit injunction with leave to serve out. 8. In response, the McCulloughs applied in the US to enjoin AIG from taking any further steps in the legal proceedings in Hong Kong (effectively an anti-anti-suit injunction). 9. The parties’ respective inter partes applications in the Hong Kong Court mentioned above came before DHCJ Blair on 23 April 2019. The learned deputy judge reserved his decision after hearing. 10. In the meantime, Hon Gayles J of the Miami Court handed down in May 2019 the following decision: (1) The bad faith claim may be brought by a third party whose claim against the insurance policy was the subject of the alleged bad faith. The claim is founded upon the obligation of the insurer to pay when all the conditions under the policy would require an insurer, exercising good faith and fair dealing towards its insured, to pay. (2) The Florida court limits the bad faith claims against insurers to cases where coverage under the insurance policy has been determined . An injured third party must first obtain a resolution of some kind in favour of the insured on the coverage issue before pursuing the bad faith claim against the insurer. The McCulloughs’ claim against AIG in the absence of the determination of the underlying coverage in favour of the insured was premature. Instead of dismissing the claim, the learned judge stayed the McCulloughs’ lawsuit against AIG. (3) As to AIG’s motion, according to Florida law, the McCulloughs were not signatories to the Policy and could not be bound by the arbitration agreement contained in the Policy, and therefore could not be compelled to arbitrate in Hong Kong. AIG’s motion was thus refused. 11. Both the McCulloughs and AIG responded to the above decision of Gayles J. The McCulloughs applied to lift the stay of proceedings and sought leave to further amend their complaint, this time to seek determination by the Miami Court of the coverage issue in their favour. AIG lodged an appeal against the court’s refusal to compel the McCulloughs to Hong Kong arbitration. 12. Considering the further written submissions of the parties after the above decision of Gayles J, DHCJ Blair handed down the Decision. As mentioned, the learned deputy judge dismissed the McCulloughs’ applications and continued the anti-suit injunction subject to refinement of its wordings. Costs were ordered in favour of AIG on a nisi basis. The McCoulloughs applied to vary the nisi costs order, which DHCJ Blair refused (except for the costs of the call over hearing on 4 January 2019) ie, the Costs Decision. 13. The McCulloughs seek to appeal almost every aspects of the Decision and the Costs Decision on the grounds set out in their draft notice of appeal. B. Leave to appeal – the principles 14. Leave to appeal shall not be granted unless the appeal has a reasonable prospect of success, or there is some other reason in the interests of justice why the appeal should be heard: section 14AA of the High Court Ordinance , Cap 4 . Reasonable prospect of success involves the notion that the prospect of succeeding must be reasonable and therefore more than fanciful, without having to be probable: see SMSE v KL [2009] 4 HKLRD 125 at §17. 15. Where the appeal is against the exercise of the discretion of the court below, the appellate court will not lightly interfere unless it is demonstrated that the court below has misunderstood the law or the evidence or the exercise of his discretion was plainly wrong such that it was outside the generous ambit within which a reasonable disagreement is possible: see Mimi Kar Yee Wong Hung v Severn Villa Ltd [2012] 1 HKLRD 887 at §31; Hong Kong Civil Procedure 2020 (Vol 1) (“ HKCP ”) at §59/2A/4. C. Service out of jurisdiction [4] 16. For this part of the intended appeal, the McCulloughs argue as follows: (1) DHCJ Blair failed or erred in finding whether AIG has shown a good arguable case that its claim in this action falls within the scope of O11, r1 (1)(d) of the Rules of the High Court , Cap 4A for service out. (2) The learned deputy judge failed to consider whether it is proper to grant leave for service out pursuant to O11, r4(2). The learned deputy judge also failed to consider adequately or at all the McCulloughs’ application to set aside the leave for service out. C1. O11, r1(1)(d) – the contractual gateway to jurisdiction 17. It is argued that DHCJ Blair failed to consider whether AIG has shown a good arguable claim that is within the ambit of O11, r1(1)(d). Instead, he simply focused on whether AIG has shown a high degree of probability that the McCulloughs are bound by the Dispute Resolution Clause, which, they say, was also wrong. 18. AIG commenced these proceedings for declaration and anti-suit injunction on the basis of the Dispute Resolution Clause, and took the contractual gateway to the Hong Kong jurisdiction. There is the obvious question of whether the McCulloughs, who are claiming in tort in the Miami Court and as non-parties to the Policy, are bound by the clause to arbitrate in Hong Kong. In answering the question, the first issue, again undisputed by the McCulloughs in the hearing before the learned deputy judge [5] , was the characterization of their claim in the Miami Court from the perspective of the Hong Kong Court exercising the supervisory jurisdiction of the arbitration under the clause. It was argued that as the McCulloughs’ claim against AIG is not contractual in nature and that they are not bound by the clause, the contractual gateway is not open to AIG. As the learned deputy judge summarized [6] , this was exactly how the argument was advanced before him on behalf of the McCulloughs [7] . 19. DHCJ Blair disagreed with the argument advanced by the McCulloughs. Applying the test, which was undisputed [8] , DHCJ Blair characterized the substance of the McCulloughs’ claim as contractual in nature and there is a high probability that the McCulloughs, albeit non-parties, are bound by the Dispute Resolution Clause. Such conclusion mirrors a good arguable case in its claim for the declaration and anti-suit injunction in enforcement of the clause in this action. Hence the availability of the contractual gateway to the Hong Kong jurisdiction. 20. In the circumstances, the criticism by the McCulloughs in respect of how the learned deputy judge approached the question of whether the contractual jurisdiction gateway was open to AIG is not entirely fair. As to DHCJ Blair’s conclusion on the substance of the characterization of the McCulloughs’ claim and the existence of a good arguable claim by AIG, and thus whether the gateway is indeed open to AIG, this is another ground of appeal discussed below. 21. The McCulloughs also take issue as to the scope of O11, r1(1)(d)(iii), which they say DHCJ Blair has failed to (adequately) consider. Essentially, it is argued that all that AIG seeks is for the Hong Kong court to determine the policy coverage issue, which is a question of construction instead of a claim for substantive relief under the terms of the Policy. They distinguish Youell & Ors v Kara Mara Shipping Ltd & Ors [2000] 2 Lloyd’s Rep on the facts. 22. In Youell , the claim for anti-suit injunction was incidental to the claim for a declaration in respect of the right of the underwriter claimants against the defendants to the effect that the underwriters were not liable to pay under the relevant insurance policies. The McCulloughs say there is no such contractual claim for substantive relief in the present case. 23. Literally, the gateway under O11, r1(1)(d)(iii) is open to a claim that is brought (i) to enforce, rescind, dissolve, annul or otherwise affect a contract; or (ii) to recover damages or obtain other relief in respect of the breach of a contract, such as contract being governed by Hong Kong law. AIG claims declarations that the McCulloughs are bound by the Dispute Resolution Clause, and that any dispute regarding coverage under the Policy should be resolved in accordance with the mechanism agreed under that clause. It seeks a corresponding order to restrain the McCulloughs from breach of that clause in the context of their Miami proceedings. In that sense, the claim of AIG may well be categorized as one to enforce the contract, albeit apparently against non-parties. In particular, it is difficult to see how the Chinese version of the word “enforce” (“強制執行”) in this paragraph of the sub-rule, which the McCulloughs deploy in their argument, serves to cast light on the meaning of the word that, according to the McCulloughs, its English version is said to fail to clearly convey. 24. By substantive relief, one refers to the remedy claimed on the basis of a party’s legal rights: see Kayden Ltd v SFC (2010) 13 HKCFAR 696 at §27, citing Mercedes-Benz AG v Leiduck [1996] 1 AC 284 at 301-302, per Lord Mustill. AIG is enforcing its contractual right to have any dispute in respect of policy coverage determined by the agreed mechanism. For a claim of such nature, declaration and injunctive relief are indeed the effective relief: see Youell at §§44-45. It cannot be suggested that they are not substantive relief just because they per se do not represent a contended result of the determination of the rights according to the terms of the Policy. Nor can it be suggested that the learned deputy judge extended the long-arm jurisdiction over what is no more than an issue of construction of contract that does not fall within O11, r1(1)(d). 25. For the above reasons, and subject to the discussion below in respect of the merits of AIG’s claim, I have reservation about this part of the intended appeal. C2. Whether it was proper to grant leave to serve out/whether leave should be set aside 26. DHCJ Blair summarized the grounds for the McCulloughs’ application that the leave to serve out should be set aside [9] . Apart from arguing that AIG failed to show a high degree of probability that they are bound by the Dispute Resolution Clause or a serious issue to be tried, the McCulloughs also argued that in exercising his discretion DHCJ Blair failed to consider whether this case is a proper one for service out within O11, r4(2). The argument is based on forum conveniens considerations, namely that AIG failed to show that Hong Kong is distinctly and clearly the most appropriate forum for the resolution of the dispute. 27. DHCJ Blair ruled that the consideration of forum conveniens does not arise [10] . Essentially, once it is decided that the party initiating the foreign proceedings is bound by an agreement to arbitrate in the contractual forum, the applicant for an anti-suit injunction in the contractual forum need not show further that arbitration in the contractual forum is more appropriate than the foreign proceedings. As the learned deputy judge quoted, “the parties’ contractual agreement does that for him”, and this applies where a remote party is in effect seeking to enforce the terms of the contract without regard to the dispute resolution provision [11] . 28. The McCulloughs argue that the above reasoning of DHCJ Blair is wrong in law. They argue that even if they were bound by the Dispute Resolution Clause, the present case is unique in that such arbitration in Hong Kong will concern the coverage of the Policy, which is merely one issue of their claim in the Miami Court. DHCJ Blair, they argue, should have applied the forum conveniens considerations and refused to compel them to arbitration in respect of such issue in Hong Kong in these circumstances. That, they suggest, is the approach set out in Yantai Wanhua Polyurethanes Co Ltd v Pur Products Ltd [2013] 1 HKLRD 590 and HKCP at §12/8/2. 29. Yantai involved a choice of law instead of a choice of forum agreement, a material difference that Hon Anthony To J in that case cared to highlight, saying that the former was not to be elevated to the latter [12] . It was on this basis that the balancing exercise in the Spiliada argument became relevant in that case. 30. §12/8/2 of HKCP relates to O12, r8, which provides that a defendant may dispute jurisdiction or ask the court to decline exercising jurisdiction over a claim initiated by the plaintiff in Hong Kong. The grounds that the defendant may advance in support of such an application include that the plaintiff is bound by an exclusive jurisdiction agreement and that there are pending proceedings between the parties in respect of the same cause of action in another jurisdiction. In such context, §12/8/2 refers to what the court said in Lammas Global Corporation v Barclays Bank (Suisse) SA , HCA 2411/2009 (13 April 2011) [13] . 31. In Lammas Global Corporation , the plaintiff commenced action in the Hong Kong Court, which was found to be in breach of the exclusive jurisdiction clause (for the Swiss forum) in the contracts between the parties. Hon Saunder J in that case made clear that he would not approach a jurisdiction challenge based on an exclusive jurisdiction clause by embarking upon a Spiliada balancing exercise because the view taken by the English and Hong Kong court is that a party should not be released from a contractual agreement as to jurisdiction on the basis of matters of convenience which were foreseeable at the time of their making of the agreement. To successfully resist the defendant’s application for stay, the plaintiff would need to cross the high hurdle of demonstrating that full effect should not be given to the exclusive jurisdiction clause for reasons not foreseeable at the time of contract. Relying on that, the McCulloughs argue that they were not even parties to the Policy, let alone any contemplation at the time when the Policy was issued that they may become bound by the Dispute Resolution Clause. 32. I doubt what the court said in Lammas Global Corporation assists the McCulloughs in the present context. First, once it is established that there is a high probability that the McCulloughs, notwithstanding the fact that they are non-parties to the Policy, are bound by the Dispute Resolution Clause for the purpose of determination of the coverage issue, the fact that they are non-parties to the Policy, and therefore could not foresee that they would be so bound, cannot at the same time be a strong reason for not giving effect to the clause. Second, the proceedings herein were commenced by AIG to enforce the agreed dispute determination mechanism in Hong Kong by way of declaratory and anti-suit injunctive relief. It was for the claim for such relief that leave to serve out had to be considered. As DHCJ Blair found, what Hon Godfrey Lam J said in Dickson Valora Group (Holdings) Company Limited & Anor v Fan Ji Qian [2019] 2 HKLRD 173 applies in such context so that the Hong Kong Court should hardly decline jurisdiction on the ground that the foreign jurisdiction is somehow the more proper forum for determining the claim for such relief. 33. In these circumstances, the McCulloughs could not be right in criticizing DHCJ Blair for failing to consider whether it was proper to grant the leave out pursuant to O11, r4(2). There is equally no basis for the criticism that the learned deputy judge has failed to adequately consider the grounds of their application to set aside the leave to serve out. 34. Similarly, when it came to whether the anti-suit injunction in the present context should be granted (the merits of which are challenged under the ground of appeal discussed below), DHCJ Blair never denied that the court retains a discretion. Only that the court’s approach is that unless there are strong reasons to the contrary, an anti-suit injunction will ordinary be granted to restrain a party from suing in a non-contractual forum [14] . In applying whether there are such strong reasons, the approach likewise does not fall within the forum conveniens principles that would have been applicable in the absence of such agreement [15] . D. Merits of the anti-suit injunction – characterisation of the McCullough’s claim [16] 35. The key to the prospect of success of the intended appeal is the substance of DHCJ Blair’s characterization of the McCulloughs’ claim against AIG and whether the McCulloughs, albeit non-parties, should be bound by the Dispute Resolution Clause to arbitrate the issue of the policy coverage in Hong Kong. 36. On behalf of the McCulloughs, it is argued that DHCJ Blair erred by failing to appreciate that their claim in the Miami Court as a whole is to assert an independent common law right of claim in tort [17] . In their reply submissions, they stress that their claim is wider in scope and entirely separate from any contractual claim under the Policy. In the oral submissions on their behalf, it was emphasized that determination of the coverage is but one of the issues of their claim in the Miami Court. 37. The Decision literally shows that DHCJ Blair did appreciate the nature of McCulloughs’ bad faith claim. After setting out the respective arguments of the parties [18] , the learned deputy judge actually took a course which was both constructive to the McCulloughs’ case and in line with the relevant case law of Florida, namely to approach the matter on the basis that the claim in the Miami Court is a common law tort claim, allowing a third party an independent right to sue an insurer where the insurer has failed to act in good faith in handling a claim brought by the third party against an insured [19] . Only that such formulation of the claim according to the Florida law per se is not the answer to the characterization of such claim for the purpose before the Hong Kong Court. 38. DHCJ Blair also recorded the parties’ agreement that this is a matter of the lex fori , i.e., the law of Hong Kong [20] . The relevant case law [21] set down the principle that a party to an arbitration agreement will be held to the agreement. This applies to a remote party to the agreement such as an insurer seeking to exercise the rights of the insured by way of subrogation and a third party seeking to exercise the rights of the insured against the insurer by virtue of statute. It is this that gives rise to the need to distinguish between the case where the assertion of such third party’s right, be it by way of subrogation or statute, is to enforce the obligation created by the contract and the case where it is to enforce a liability entirely independent of the contract. DHCJ Blair noted that it is necessary to look beyond the formulation of the claim and to identify the question at issue [22] . He derived support from, amongst others, The Prestige [2015] 2 Lloyd’s Rep 33. 39. The learned deputy judge proceeded to apply the principle to the circumstances of the present case. He found that the determination of the coverage is a requisite content of the obligation of AIG which is effectively the condition precedent to the right of direct claim by the McCulloughs against AIG in the Miami Court. He concluded that this is contractual in nature under Hong Kong law. Applying the principle in Dickson Valora Group (Holdings) Co Ltd (above) and Qingdao Huiquan Shipping Company v Shanghai Dong He Xin Industry Group Co Ltd [2018] EWHC 2009 (Comm), the learned deputy judge concluded that AIG is entitled to prevent such determination from being pursued otherwise than by the contractually agreed mode, ie, arbitration in Hong Kong. 40. The McCulloughs argues that DHCJ Blair has misread or misunderstood The Prestige , and that the application of the relevant law to the context of the present case was erroneous. They also propose an analogy to be drawn with the situation where a contracting party sues a third party in tort for inducing breach of contract, in which there is an arbitration clause. 41. The Decision in this respect is a reasoned one. That said, as the learned deputy judge fairly acknowledged [23] , difficult questions may arise as to how a particular claim brought by a remote party is to be characterized, and the characterization question in the present case is novel to the extent that it has not arisen in a similar factual context before. Considering the argument advanced on behalf of the McCulloughs in this respect, I am prepared not to rule out its prospect on appeal. There is good reason for placing the characterization question in the context of the present case before the appellate court for consideration. 42. In these circumstances, I am prepared to give leave in respect of this ground of appeal. The outcome of the appeal on the characterization question will have bearing on whether AIG has a good arguable case for engaging the contractual jurisdiction gateway for service out (see §16(1) above) and whether the leave to serve out should be set aside (see part of §16(2) above). To that extent, I should give leave to the McCulloughs to appeal against the Decision in respect of that as well. E. Exercise of discretion E.1 Abuse of process [24] 43. The alleged abuse of process relates to delay and urgency. As to delay, the McCulloughs complained about the application for the anti-suit injunction being taken out on 18 December 2018 whilst AIG became aware of the claim against it at the end of October 2018. As to urgency, the McCulloughs complained about AIG’s decision to proceed by way of an ex parte application with notice which was illusory. 44. DHCJ Blair rejected the complaint about delay, in view of the procedural history and the extent of the alleged delay [25] . The learned deputy judge sympathized with the complaint about the brevity of the notice of the ex parte application. However, he found that overall, time was genuinely pressing and afforded AIG with sufficient reason to proceed the way it did in order to ensure that its position would be protected. On these grounds, even if he were to discharge the ex parte injunction, the learned deputy judge would have been prepared to re-grant the injunction inter partes [26] . 45. I accept the submission on behalf of AIG that these are considerations that the learned deputy judge was entitled to take into account and the conclusion that he was in the circumstances entitled to reach. As a matter of exercise of discretion, I am not satisfied that a reasonable prospect that the appellate court would interfere in this respect is shown. E2. Change of case [27] 46. This is framed in the draft notice of appeal under the ground of material non-disclosure. The complaint of the McCulloughs before DHCJ Blair was that AIG proceeded ex parte and obtained an order to enjoin them from proceeding with their claim in the Miami Cout, whereas it made clear at the inter partes stage that it only sought to enjoin them from litigating the coverage issue. They argued that the court, actually this court, was then misled into granting the injunction ex parte, and the injunction should have been discharged for material non-disclosure. DHCJ Blair did not agree that AIG has changed its case, and considered that its position was made sufficiently clear to this court at the ex parte hearing. The learned deputy judge proposed that the terms of the injunction would need adjustment in order to put this beyond doubt [28] . 47. By way of submission, the McCulloughs argue that AIG’s change of case per se suffices as a ground for discharging the injunction (and setting aside the leave to serve out). Reliance is placed on Kayden Ltd (above). Kayden Ltd is an authority for the strict approach of the court in exercising its discretion under O11. The extraordinary nature of the long-arm jurisdiction asserted under O11 calls for special care on the plaintiff’s part to ensure full disclosure to the court of the basis on which such jurisdiction is invoked, and to enable the defendant to be apprised of the nature of the claim which he has to meet, if and when he seeks to discharge the order for service out. 48. Be that on the facts of Kayden Ltd or Parker v Schuller (1901) 17 TLR 299 [29] , the objectionable feature was invariably the attempt to assert at the inter partes stage another legal basis of claim or a distinct cause of action, which was not before the judge at the ex parte hearing. That would by nature be true change of case. 49. Insofar as whether AIG has in fact changed its case on the scope of the claim for anti-injunction between the ex parte and the inter partes stages, what this court is called upon to do concerns purely whether DHCJ Blair erred in making his finding with reference to the materials before him. Whilst I happen to be the coram at the ex parte stage, I would guard against introducing my understanding of the matter then. Otherwise it would constitute evidence from this bench that was not available at the hearing before DHCJ Blair. 50. The fact is that the McCulloughs could not found its claim in the Miami Court without the coverage issue already determined in their favour. That was always what drove AIG to insist on its right to have that issue resolved by the agreed mechanism under the Dispute Resolution Clause. That was the basis of its claim for the declaratory and anti-suit injunctive relief. The affidavit evidence and submission before this court at the ex parte hearing as well as the attention of this court to the actual terms of the anti-injunction, as recorded by the transcript of the hearing, should speak for themselves. I am of the view that DHCJ Blair was entitled, in view of these materials, to find that AIG has made its position sufficiently clear at the ex parte hearing, and there was no material change of case on the part of AIG at the inter partes stage. In view of DHCJ Blair’s finding that there was no change of case as such on the part of AIG, the circumstances here materially differ from the true case of change of position that brought about the conclusions in cases like Parker and Kayden Ltd . The factual basis for this ground is thus lacking. E3. Inconsistent judgments between the Miami Court and the Hong Kong Court [30] 51. The McCulloughs complain about AIG’s steps taken in the Miami Court and then the present proceedings. 52. AIG has entered appearance in the Miami Court to set aside the default judgment and to compel the McCulloughs to arbitration in Hong Kong. With its appeal against the Miami Court’s decision to refuse to accede to AIG’s latter application, the application in Hong Kong for an anti-suit injunction, the McCulloughs argue, is for the same effect. 53. DHCJ Blair observed that the steps taken by AIG in the Miami Court were to resist instead of submitting to the jurisdiction. Such observation must be correct. The learned deputy judge considered the necessity for an anti-suit injunction in Hong Kong, in view of the fact that the McCulloughs filed a further amended complaint to seek to restore the Miami proceedings for the exact purpose of determining the coverage issue after Gayles J’s decision in May 2019. He also considered the proportionality of how AIG has acted in attempting first in the Miami Court and then in the Hong Kong Court to prevent the McCulloughs from pursuing in the Miami Court without complying with the agreed mechanism for resolving the coverage issue in Hong Kong. This was what the learned deputy judge was entitled in the circumstances to conclude, and I do not agree he was wrong in principle. 54. The McCulloughs also argue that the effect of continuing the anti-suit injunction amounts to inconsistent decisions in respect of the same subject between the two jurisdictions. This is premised on their understanding of the decision of Gayles J as having the effect that the Miami Court is the appropriate and preferred forum to the Hong Kong Court for the resolution of the coverage issue. 55. In the exercise of his discretion, DHCJ Blair did not lose sight of the principle of judicial comity, and that inconsistent decisions between jurisdictions in respect of the same matter should be avoided if possible [31] . However, the learned deputy judge did not accept that the anti-suit injunction granted by the Hong Kong Court would be inconsistent with the decision of Gayles J. First, the McCulloughs’ understanding of the decision of Gayles is incorrect. What Gayles J merely decided was that the McCulloughs, being non-parties to the Dispute Resolution Clause, could not be compelled under Florida law to arbitrate in Hong Kong. Second, and in any event, the enforceability of the Dispute Resolution Clause against the McCulloughs, be they parties to the Policy or not, is really a matter to be decided from the perspective of the Hong Kong Court exercising the supervisory jurisdiction of the arbitration by applying the Hong Kong law. Dickson Valora Group (Holdings) Company Limited (above) refers. 56. Subject to the ground in respect of which leave is granted as mentioned above, I am not satisfied that this ground has reasonable prospect of success on appeal. F. Application for stay [32] 57. The McCulloughs complain that whilst DHCJ Blair captured the grounds of their application for stay of proceedings in favour of the Miami Court, the learned deputy judge failed to consider the application adequately or at all. In particular, the McCulloughs argue that the learned deputy judge considered forum non conveniens for the purpose of the anti-suit injunction but failed to do so in the context of the stay application. 58. It appears to me that the distinction that the McCulloughs seek to make above is more theoretical than real. Noting the case law that in the absence of strong contrary reason, an anti-suit injunction will ordinarily be granted to restrain a claimant from pursuing proceedings in a non-contractual forum, and concluding that there is a high probability that the McCulloughs, albeit non-parties, are so bound by the Dispute Resolution Clause in the circumstances of the present case, the learned deputy judge indeed considered that forum non conveniens did not arise to defeat the enforcement of the clause. As AIG points out, the application for stay on forum non conveniens principle became otiose. In line with Dickson Valora Group (Holdings) Company Limited (above), it would also be odd to stay the proceedings here and prefer the Miami Court as the forum for the purpose of determining whether AIG should be entitled to the anti-suit relief and declaration sought in these proceedings. G. The Costs Decision 59. The ground of appeal against the Costs Decision is that even on the basis of the conclusion of the learned deputy judge, AIG should nevertheless be liable for the McCulloughs’ costs of opposing the continuation of the injunction. The major ground is the alleged change of case of AIG. 60. As mentioned, the learned deputy judge did not accept that there was change of case, and hence no material non-disclosure either. Further, along with their opposition to the continuation of the injunction, the McCulloughs also took out their application for orders to set aside the leave to serve out and to stay the present action in favour of the proceedings in the Miami Court. The learned deputy judge decided in favour of AIG and against the McCulloughs. 61. In terms of the event of the various applications before him, the learned deputy judge was quite entitled to make the costs order that he did. It cannot be said that his exercise of discretion as to costs, which he explained in the Costs Decision, was erroneous in principle. I therefore do not see reasonable prospect that the appellate court would intervene in this respect. H. Conclusion 62. I give leave to appeal to the extent as summarized in §42 above. Leave to appeal on the other grounds is refused. For the avoidance of doubt, the Costs Decision, in respect of which leave to appeal on the grounds proposed is refused, will now be subject to the result of the appeal in respect of which the above leave is granted. 63. In view of the above event of this application, half of the costs of this application should be to AIG to be taxed, if not agreed, with certificate for two counsel; and half of the costs of this application should be in the cause of the appeal. I make a nisi costs order to that effect, which shall become absolute without further order of the court, if there is no application in 14 days for variation. (Simon Leung) Deputy High Court Judge Mr Charles Manzoni SC, Mr Toby Brown instructed by Kennedys for the Plaintiff Mr Benjamin Yu SC, Ms Elizabeth Cheung, Ms Jennifer Fan instructed by Luk & Partners in association with Morgan, Lewis & Bockius for the Defendants [1] On notice. [2] Continued in the interim by DHCJ William Wong, SC on 28 December 2018 and Hon Au-Yeung J on 4 January 2019. [3] Clauses 8.9 and 8.12. [4] §§1-6 of the draft notice of appeal. [5] See section C2 of the submissions on behalf of the McCulloughs at the hearing on 23 April 2019. [6] §§32; 52-53. [7] See §4 and section C2 of the submissions at the hearing on 23 April 2019. [8] §§31-32 of the submissions on behalf of the McCulloughs at the hearing on 23 April 2019. [9] §32(1)-(3) of the Decision. [10] §§90-92 of the Decision. [11] §91 of the Decision, citing from Ever Judger Holdings Co at §58; Qingdao Huiquan Shipping Company v Shanghai Dong He Xin Industry Group Co Ltd [2018] EWHC 3009 at §35. [12] At §26. [13] Where Hon Saunders J applied The Eleftheria [1969] 1 Lloyd’s Rep 237, The Pioneer Container [1994] 2 AC 324 and Noble Power Investment Ltd v Nissei Stomach Tokyo Co [2008] 5 HKLRD 631 . [14] See §51 of the Decision. [15] See §92 of the Decision. [16] §§7-8 of the draft notice of appeal. [17] §28 of the written submissions on behalf of the McCulloughs. [18] §§63-64 of the Decision. [19] §§65-66 of the Decision. [20] §55 of the Decision. [21] §§56-62 of the Decision. [22] §§60; 69 of the Decision. [23] §§60; 67 of the Decision. [24] §9 of the draft notice of appeal. [25] §§87-89 of the Decision. [26] §§83-84 of the Decision. [27] §10 of the draft notice of appeal. [28] §97. [29] See §§35-41 of Kayden Ltd . [30] §13 of the draft notice of appeal. [31] §101 of the Decision. [32] §12 of the draft notice of appeal. Look up this case on Lawcite Noteup",
  "length": 38464,
  "headers_seen": [
    "A. Background",
    "B. Leave to appeal – the principles",
    "C. Service out of jurisdiction [4]",
    "C1. O11, r1(1)(d) – the contractual gateway to jurisdiction",
    "C2. Whether it was proper to grant leave to serve out/whether leave should be set aside",
    "D. Merits of the anti-suit injunction – characterisation of the McCullough’s claim [16]",
    "E. Exercise of discretion",
    "E.1 Abuse of process [24]"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2020/1793",
  "query": "anti-suit injunction",
  "ts": "2025-10-16T10:47:11",
  "ok": true
}