{
  "title": "A AND OTHERS V. D | [2020] HKCFI 2887 | HKLII",
  "court": null,
  "year": 2020,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2020] HKCFI 2887 A AND OTHERS V. D Judgment Information Date 12 Nov, 2020 Action No. HCCT52/2020 Neutral Cit. [2020] HKCFI 2887 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCCT52/2020 HCCT52/2020 A AND OTHERS v. D HCCT 52/2020 [2020] HKCFI 2887 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO 52 OF 2020 ____________________ IN THE MATTER of a Final Award on Merits dated 21 May 2020 in HKIAC/A18020 made by the HKIAC and IN THE MATTER of section 81 of the Arbitration Ordinance ( Cap 609 ) and Article 34 of the UNCITRAL Model Law on International Commercial Arbitration ____________________ BETWEEN A 1 st Applicant B 2 nd Applicant C 3 rd Applicant and D Respondent ____________________ Before: Hon Mimmie Chan J in Chambers Date of Hearing: 21 October 2020 Date of Decision: 13 November 2020 _____________ D E C I S I O N _____________ 1. On 28 August 2020, the 1 st and 2 nd Applicants issued an Originating Summons (“ OS ”), to set aside an arbitral award dated 21 May 2020 (“ Award ”) which was made in an arbitration in Hong Kong between the Respondent and the Applicants (“ Arbitration ”) and administered by the Hong Kong International Arbitration Centre (“ HKIAC ”). The grounds of the setting aside application are that the 2 nd Applicant and the 3 rd Applicant in these proceedings (and the Respondents in the Arbitration) were not parties to the arbitration agreement, and that the arbitration agreement relied upon was not valid. 2. In the OS, only the 3 rd Applicant sought a retrospective extension of time to apply to set aside the Award. 3. The OS was set down for a hearing of 30 minutes on 21 October 2020. 4. Two days before the scheduled hearing, the 1 st and 2 nd Applicants issued a summons, for retrospective extension of time for the 1 st and 2 nd Applicants to make the application to set aside the Award. 5. The Respondent sought, at the hearing on 21 October 2020, an order from the Court for the immediate dismissal of the OS (following the practice advocated in G v M HCCT 36/2009, 14 September 2009 and Dubai International Real Estate v Al Almadiah Contracting and Trading [2018] HKCFI 613 ). The reasons were that all the Applicants had received the Award by email on 21 May 2020. The statutory deadline for making the application to set aside the Award expired on 21 August 2020 (3 months from the parties’ receipt of the Award, as set out in Article 34 (3) of the Model Law). The application by the OS issued on 28 August 2020 was out of time. The 1 st and 2 nd Applicants did not seek any time extension before the application by OS was made, until 19 October 2020. In any event, none of the Applicants, in purporting to seek an extension of time, had given any satisfactory explanation for the delay. The Court has no power to extend the three-month period provided for in Article 34 (3) of the Model Law (adopted by section 81 of the Arbitration Ordinance (“ Ordinance ”) (“ Jurisdiction Argument ”). Even if the Court had any power to extend time, the Court should not exercise its discretion in favour of the Applicants, in the absence of any good reason to do so on the facts of this case. 6. The Applicants maintained that the Court has the jurisdiction and power to grant an extension of time for an application to be made under Article 34 (3) (as held in Sun Tian Gang v Hong Kong & China Gas (Jilin) Ltd [2016] 5 HKLRD 221 ), and since the Respondent claims that that decision was wrong, the Applicants should be given the opportunity to fully argue this important point at an adjourned hearing. The Applicants maintained that they have established on the evidence a viable and arguable case on the OS and the application for extension of time as sought, and their application should not be summarily dismissed. 7. In their evidence, the 1 st and 2 nd Applicants sought to rely on the affirmation of their solicitor in Hong Kong, and the draft affirmations of their lawyers on the Mainland who had the conduct of the Arbitration, in which it was claimed that the Mainland lawyers had not received the Award which was sent by the Tribunal to them by email on 21 May 2020 at 5:27 pm. The 3 rd Applicant also claimed in his affirmation that the Tribunal had sent the Award to his email account, but his secretaries had not taken notice of it and did not report the matter to him. 8. The Applicants claim that it was only when their Mainland lawyers received the original Award, on 29 May 2020, that they became aware of the Award. The 1 st and 2 nd Applicants claim that their application made on 28 August 2020 was within time, and that the summons issued on 19 October 2020 was only out of abundance of caution. 9. In the limited time available at the first hearing on 21 October 2020, Counsel for the Applicants was not able to make submissions on the Jurisdiction Argument. Nor did Counsel for the Respondent seek to make further submissions, relying on the fact that even on the assumption that the Court has the jurisdiction and power to extend time under Article 34, the Applicants have not established a good case at all for an extension, and the Court should not exercise its discretion in their favour. 10. In fairness to the Applicants, the issue of whether there is jurisdiction and power for the Court to extend the time under Article 34 to set aside an award will have to be determined in another case at an opportune time, when both parties can have the opportunity to make full submissions. 11. Even in Sun Tian Gang v Hong Kong & China Gas (Jilin) Ltd, this Court made it clear (at paragraph 95 of the judgment) that bearing in mind the objectives of the Ordinance that there should be finality in an award, the short period of 3 months set out in the Model Law should not, as a general rule, be extended “unless the applicant can establish to the satisfaction of the court that there are good reasons to do so”. The facts in Sun were exceptional, and stated to be such in the judgment. 12. On the facts of this case, the Applicants have come nowhere near the necessary threshold for the Court to exercise its discretion to extend the time sought. 13. Leaving aside all the other irregularities referred to by Counsel for the Respondent (such as the absence of any application made by the 1 st and 2 nd Applicants to extend time before the issue of the OS, the absence of proper amendment to the OS, and their failure to mention in the first affirmation filed in support of the OS that a copy of the Award had been sent by email to them on 21 May 2020), up to the hearing on 21 October 2020, none of the Applicants have given any reason to explain why they were unable to apply to set aside the Award before the expiry of the 3 months’ period on 21 August 2020, and after they had notice of the Award when their lawyers received the original copy on 29 May 2020. There was not even an excuse raised, that they were preoccupied, or required time to review the Award or to consult their lawyers. The receipt of the Award 14. On the undisputed evidence, the Tribunal sent the Award by email on 21 May 2020 to the email accounts of the Applicants, which accounts were the same as those notified by them to the Tribunal for communication with the Tribunal, the HKIAC and the Respondent (as Claimant) in the Arbitration. The email account for the 1 st and 2 nd Applicants was that of their lawyers on the Mainland (“ Mainland Lawyers Account ”). The email account for the 3 rd Applicant was his own. 15. On 27 November 2019, the Mainland lawyers of the 1 st and 2 nd Applicants had sent an email to the Tribunal and the HKIAC, to confirm that they had authority to receive and respond to email communications from the Tribunal, the Respondent and their legal representatives. In the course of the Arbitration (and in particular, on 3 December 2019), emails had in fact been exchanged between the Mainland lawyers for the 1 st and 2 nd Applicants, the Tribunal and HKIAC, using the Mainland Lawyers Account. 16. Under Article 3 of the Model Law (adopted in section 10 of the Ordinance), any written communication is deemed to have been received if it is delivered at its mailing address, and the communication is deemed to have been received on the day it is so delivered. Section 10 (2) of the Ordinance states that if a written communication is sent by any means by which information can be recorded and transmitted to the addressee, the communication is deemed to have been received on the day it is so sent. 17. Article 2.1 of the 2013 HKIAC Administered Arbitration Rules (“ Article 2.1 ”) further states: “2.1 Any notice or other written communication pursuant to these Rules shall be deemed to be received by a party or arbitrator or by HKIAC if: (a) delivered by hand, registered post or courier service to (i) the address of the addressee or its representative as notified in writing in the arbitration; or (ii) in the absence of (i), to the address specified in any applicable agreement between the relevant parties; or (iii) in the absence of (i) or (ii), to any address which the addressee holds out to the world at the time of such delivery; or (iv) in the absence of (i), (ii) or (iii), to any last known address of the addressee; or (b) transmitted by facsimile, email or any other means of telecommunication that provides a record of its transmission, including the time and date, to: (i) the facsimile number or email address (or equivalent) of that person or its representative as notified in the arbitration; or (ii) in the absence of (i), to the facsimile number or email address (or equivalent) specified in any applicable agreement between the relevant parties; or (iii) in the absence of (i) and (ii), to any facsimile number or email address (or equivalent) which the addressee holds out to the world at the time of such transmission.” 18. By the operation of Article 2.1 and/or section 10 (2) of the Ordinance, the Award was deemed to have been received by the Applicants on the date of the email sent to the Mainland Lawyers Account, on 21 May 2020. If the Applicants wish to displace the deeming provisions and to rebut the presumption of receipt, there should be sufficient and credible evidence adduced to show that they had not in actual fact received the Award by the email on 21 May 2020. 19. The 1 st and 2 nd Applicants seek to rely on the unsigned draft affirmations of their Mainland lawyers, Ms Yang and Ms Tu. These were in identical terms, exhibited to the signed affirmation of Leung Chu Ming Danny, the Hong Kong solicitor for the 1 st and 2 nd Applicants, made on 19 October 2020 (2 days before the scheduled hearing). Leung claims that the “finalized drafts” of Yang and Tu were to support the application for extension of time to set aside the Award, and that the contents of the draft affirmations had been “reviewed and confirmed” by Yang and Tu. Leung further states that he had been informed by Yang and Tu that “in the limited time available they were unable to execute” the affirmations before a Chinese notary. 20. I agree with the criticisms made by Leading Counsel for the Respondent on the evidence filed on behalf of the 1 st and 2 nd Applicants. It is no excuse to have a last minute draft affirmation of Yang and Tu, produced 2 days before the hearing, when the service of the Award should have been appreciated as a critical issue in the application to set aside. The time and manner of dispatch and receipt of the Award are important and the deciding issues. These issues should have been addressed, in detail and in good time before the hearing scheduled by the Applicants for the OS which they issued on 28 August 2020. It is unacceptable for cursory affirmations to be prepared at the last minute, with scanty details, and to excuse such lack of particulars or the timely and proper signing and attestation of the affirmations by alleged lack of time. 21. Leung states in his affirmation that the contents of the draft Yang and Tu affirmations had been “reviewed and confirmed” by them, with no particulars as to how and when such confirmation had been given. Mr Ho SC pointed out that based on the identical contents of the Yang and Tu draft affirmations, and their brevity, it is dubious whether Yang and Tu had themselves prepared their affirmations, to explain in their own words the circumstances of and reasons for their alleged lack of receipt and notice of the email of the Award. Mr Ho argued that it is more likely that the language of the drafts had simply been prepared for Yang and Tu by Leung, and that it is unlikely that Yang and Tu had seriously reviewed the drafts and considered the accuracy of the facts stated for them. The statements of truths were not signed. 22. To demonstrate the lack of care shown by Yang and Tu, and to highlight the sloppy manner of the preparation of the draft affirmations, Mr Ho referred to the fact that the Mainland Lawyers Account was stated to be “sincereparters.com”, instead of “sincerepartners.com”. Not only does this show the cavalier attitude of the lawyers towards the affirmations, but the statement by Yang and Tu, that any Award sent to “sincereparters.com” (a wrong email account) was not received, does not in fact assist the Applicants’ case at all. 23. In any event, Yang and Tu only stated that they had not received the email on 21 May 2020, without giving any reason at all why, when other emails had been sent from and received in the Mainland Lawyers Account, the particular email of 21 May 2020 could have been lost, and not received. Yang and Tu could only state that the cause of their not receiving the email could not be known. 24. I find the evidence of the 1 st and 2 nd Applicants, that the email of 21 May 2020, which the Tribunal had sent together with the Award to their lawyers’ email account designated for the Arbitration, had not been received by their lawyers, to be totally unconvincing. Such excuse is rejected, and I accept the Respondent’s evidence that the Award was sent to and deemed to have been received by the 1 st and 2 nd Applicants. 25. As for the 3 rd Applicant, he admitted that the email with the Award had been sent to and received on 21 May 2020. He only claims that it was due to the oversight and inadvertence of the secretaries, that the matter was not reported to him. Despite having been informed by his lawyers that the original Award was received on 29May 2020, he took no steps to apply to set aside the Award before the expiry of 3 months on 21 August 2020. 26. No reason has been given by any of the Applicants for their failure to take any steps to apply to set aside the Award between 21 May 2020 and 28 August 2020. In the absence of any good reason shown to explain the delay and inactivity, I cannot see why the Court should exercise its discretion and grant time to the Applicants. Merits of the application to set aside 27. On behalf of the Applicants, Mr Chen argued that the Court should take into account the merits of the application to set aside. This is coupled with the fact that the alleged delay is only 7 days (from 21 August to 28 August 2020) and the Respondent should not be prejudiced by any time extension granted. 28. The Applicants rely on 2 grounds to set aside the Award. The first is that the 2 nd and 3 rd Applicants were not parties to the arbitration agreement, and the second ground is that the arbitration agreement (to which the 1 st Applicant is a party) was invalid under PRC law, for lack of a foreign element to subject the parties to arbitration in Hong Kong. 29. The arbitration agreement was contained in clause 17 of the underlying Transfer Agreement made between the Respondent as the seller, the 1 st Applicant as purchaser, the 2 nd Applicant, the 3 rd Applicant and another party as guarantors. Clause 17.1 provides for PRC law as the governing law of the Transfer Agreement and clause 17.2 states that “both parties” agreed that all disputes arising out of the performance of the Transfer Agreement or related to the Transfer Agreement shall be resolved by consultation, and in the event that the dispute could not be resolved, arbitration shall be commenced in Hong Kong. 30. The Applicants highlighted the fact that the term “both parties” in clause 17.2 was defined in the Transfer Agreement to mean the Respondent and the 1 st Applicant jointly, and further, only the Respondent and the 1 st Applicant had the right under the arbitration clause to nominate arbitrators. The second point cannot be determinative of the question as to whether the 2 nd and 3 rd Applicants were parties to the arbitration agreement. A party to an arbitration agreement (and in particular a multi-party arbitration agreement) may agree not to have the right to nominate an arbitrator, and be content with an arbitral tribunal consisting of arbitrators appointed by other parties, or by a designated institution. 31. As commercial minded parties, the parties to the Transfer Agreement are presumed to intend that any and all disputes arising out of the relationship in which they had entered or purported to enter should be decided by the one same tribunal ( Fiona Trust & Holding Corporation v Privalov [2007] 4 All ER 951 ). Despite the fact that the term “both parties” was defined in the Transfer Agreement to mean the Respondent and the 1 st Applicant jointly, there is no other clause in the Transfer Agreement which provides for the manner of dispute resolution as between the parties other than the Respondent and the 1 st Applicant. Nor has the court been referred to any other agreement made between the 2 nd Applicant, the guarantors and the Respondent which governed their relationship and provides for a dispute resolution mechanism other than by arbitration in Hong Kong. 32. I agree with the Respondent, that it makes no commercial sense to hold that the 1 st , 2 nd and 3 rd Applicants and the Respondent had intended the arbitration agreement in clause 17.2 to apply only to the Respondent and the 1 st Applicant, with the mechanism for disputes relating to the remaining parties to the Transfer Agreement to be undecided. The obligations of the 2 nd and 3 rd Applicants are in the nature of guarantee obligations, and are closely related to the liability of the 1 st Applicant to the Respondent under the Transfer Agreement. They must have intended all disputes to be determined in the same manner, namely, by arbitration in Hong Kong. 33. There is no express agreement between the parties as to the governing law of the arbitration agreement. The determination of that law is a question of construction, a matter of interpretation of the relevant clauses of the underlying contract and of the arbitration agreement itself, read in the light of the surrounding circumstances and commercial sense. 34. Hong Kong was the chosen seat of the Arbitration, and HKIAC was designated as the arbitral institution to administer the Arbitration. These indicate the parties’ intention for the arbitration agreement to be governed by Hong Kong law, as being the law which has the closest and most real connection, instead of PRC law. Clause 17.1 may be construed as providing for PRC law to govern the Transfer Agreement itself, which is of course separate from the arbitration agreement. 35. If the arbitration agreement is governed by Hong Kong law, there is no requirement for the existence of any foreign element as a precondition for arbitration. The Applicants’ argument that the arbitration agreement is illegal for lack of any foreign element is unsustainable. 36. As Mr Ho submitted, and I accept, if the arbitration agreement is governed by PRC law, and assuming that it is a correct proposition that the arbitration agreement could be invalid under PRC law on the basis of a lack of foreign-related elements, such contention of the Applicants is itself a strong indicator that the parties did not intend the arbitration agreement to be governed by PRC law, with the potential result that the arbitration agreement could become invalid ( Sulamerica Cia Nacional de Seguros SA v Enesa Engelharia SA [2013] 1 WL 102). 37. Further, even if the arbitration agreement was governed by PRC law, the Tribunal was satisfied that there were sufficient foreign related elements in the Transfer Agreement, considering that it involved the inclusion of a non-PRC party who assumed guarantee obligations on behalf of the Respondent, and also the fact that the procurement of the majority of the equipment under the Transfer Agreement would necessitate import from non-PRC suppliers. 38. For all the above reasons, even considering the merits of the Applicants’ application for setting aside, there are no prospects in the application to persuade the Court to exercise its discretion to grant time and indulgence to the Applicants. Conclusion and disposition 39. In all the circumstances of this case, I find no good reason to exercise any discretion which the Court has to extend time for the Applicants to set aside the Award. The OS and the Summons are both dismissed, with costs to be paid by the Applicants to the Respondent, on indemnity basis. (Mimmie Chan) Judge of the Court of First Instance High Court Mr David Chen, instructed by Lu & Partners LLP, for the 1 st to 3 rd applicants Mr Ambrose Ho SC and Mr Justin Tang (Solicitor Advocate), instructed by Linklaters, for the respondent Look up this case on Lawcite Noteup",
  "length": 21556,
  "headers_seen": [
    "The receipt of the Award",
    "Merits of the application to set aside",
    "Conclusion and disposition"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2020/2887",
  "query": "Model Law",
  "ts": "2025-10-16T10:53:27",
  "ok": true
}