{
  "title": "DICKSON VALORA GROUP (HOLDINGS) CO LTD AND ANOTHER V. FAN JI QIAN | [2019] HKCFI 482 | HKLII",
  "court": null,
  "year": 2019,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2019] HKCFI 482 DICKSON VALORA GROUP (HOLDINGS) CO LTD AND ANOTHER V. FAN JI QIAN Judgment Information Date 19 Feb, 2019 Action No. HCMP1954/2018 Neutral Cit. [2019] HKCFI 482 Parallel Cit. [2019] 2 HKLRD 173 [2019] 2 HKC 275 Download MS Word Judgment Corrigendum Reading Options Translation Toggle Highlight Case History HCMP1954/2018 HCMP 1954/2018 [2019] HKCFI 482 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE MISCELLANEOUS PROCEEDINGS NO 1954 OF 2018 ____________________ IN THE MATTER OF an application for injunctive relief under Section 21L of the High Court Ordinance (Cap 4) ____________________ BETWEEN DICKSON VALORA GROUP (HOLDINGS) 1 st Plaintiff COMPANY LIMITED (迪維集團(控股)有限公司) DICKSON VALORA (LIANYUNGANG) 2 nd Plaintiff PROPERTY CO LIMITED (迪維(連雲港)置業有限公司) and FAN JI QIAN (樊紀乾) Defendant ____________________ Before: Hon G Lam J in Court Date of Hearing: 31 January 2019 Date of Judgment: 20 February 2019 Date of Corrigendum: 26 March 2019 _________________________ C O R R I G E N D U M _________________________ In the judgment of the above case given by the Court of First Instance on 20 February 2019, the correction reads as follows: - 1. At page 7, Paragraph10, line G: the words “01%” should read “0.1%”. Dated this the 26 th March 2019 (Carol Yeung) Clerk to Hon G. Lam J HCMP1954/2018 DICKSON VALORA GROUP (HOLDINGS) CO LTD AND ANOTHER v. FAN JI QIAN HCMP 1954/2018 [2019] HKCFI 482 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE MISCELLANEOUS PROCEEDINGS NO 1954 OF 2018 ____________________ IN THE MATTER OF an application for injunctive relief under Section 21L of the High Court Ordinance ( Cap 4 ) ____________________ BETWEEN DICKSON VALORA GROUP (HOLDINGS) COMPANY LIMITED (迪維集團(控股)有限公司) 1 st Plaintiff DICKSON VALORA (LIANYUNGANG) PROPERTY CO LIMITED (迪維(連雲港)置業有限公司) 2 nd Plaintiff and FAN JI QIAN (樊紀乾) Defendant ____________________ Before: Hon G Lam J in Court Date of Hearing: 31 January 2019 Date of Judgment: 20 February 2019 _________________ J U D G M E N T _________________ A. Introduction 1. This is an application by the plaintiffs for an anti‑suit injunction restraining the defendant from taking steps in the legal proceedings he had commenced in the Mainland against the plaintiffs on the ground that the dispute should be referred to arbitration. The issues include whether there is an arbitration clause in the contract being sued upon by the defendant, what the court’s approach should be in the absence of privity to the arbitration agreement, whether the application is precluded by issue estoppel arising from a Mainland judgment, and whether there are other reasons why the injunction should be refused. B. The background facts 2. In around 2010 a few investors based in Mexico, including Mr Domingo Rodriguez, agreed with a Mainland Chinese resident, Mr Fan Jiqian (“ Fan ”), to pursue the business opportunity of developing a commercial and residential real estate project in the Gangyu district of Jiangsu Province in Mainland China in cooperation with Walmart. Through their respective corporate vehicles, namely, Moravia CV (“ Moravia ”), a Netherlands company, owned by the Mexican investors, and Dickson Holdings Enterprise Co Ltd (“ DHE ”), a Hong Kong company, owned by Fan, they agreed to set up a joint venture company in Hong Kong with the name of Dickson Valora Group (Holdings) Co Ltd (“ the Company ”). 3. Shortly after the incorporation of the Company, the three parties, namely, DHE, Moravia and the Company entered into a Shareholders Agreement on 24 December 2010. The initial shareholdings in the Company were equally split, with DHE and Moravia each holding 500,000 shares out of a total of 1 million shares in the Company. 4. The Shareholders Agreement, written in both Chinese and English, makes provisions, inter alia , relating to the raising of funds for the project and the management and organisation of the Company. In broad terms Moravia would advance loans of a total of US$3.5 million to the Company, to be transferred on to its wholly‑owned subsidiary called Dickson Valora (Lianyungang) Property Co Ltd, ie the 2 nd plaintiff herein (“ the Subsidiary ”) to be applied towards acquisition of the land for the development. DHE was to try to raise additional funds to complete the project. At the end of the agreement there is a clause which lies at the heart of the present application: “ IX. Governing law This Agreement shall be governed by and construed in accordance with Hong Kong law. Any dispute, controversy or claim arising out of or relating to this Agreement, or the breach, termination or invalidity thereof, shall be settled by arbitration under the Hong Kong International Centre Administered Arbitration Rules in force at the date of this Agreement (the “Arbitration Rules”): [1] (i) the place of arbitration shall be in Hong Kong at the Hong Kong International Arbitration Centre (HKIAC); (ii) there shall be three arbitrators, all of whom shall be appointed according to the Arbitration Rules; (iii) the arbitration proceedings shall be conducted in the English language; (iv) the decision of the arbitrators shall be final, binding and conclusive upon the parties to the dispute, their successors and permitted assigns, and they shall comply with such decision in good faith; and (v) each party to the dispute to submit itself to the jurisdiction of the courts where the award by the arbitrators is sought to be enforced. Notwithstanding the foregoing, judgment upon the award may be entered in Hong Kong, or any court having jurisdiction over the parties or their assets. During the period when the dispute is being resolved, except for the matter being disputed, the parties shall in all other respects continued their implementation of the Contract.” 5. On 21 January 2011 the same three parties entered into a Supplementary Agreement adjusting the amount of the loan to be advanced by Moravia to US$3.25 million and providing for a “success fee” of US$3 million payable to DHE upon the fulfilment of certain conditions including the repayment of all the loans from Moravia and more than 50% of the saleable floor area in the project having been sold. DHE is required to play a key role in achieving success. The Supplementary Agreement states in its recital: “ Dickson, Moravia and the Company have agreed to enter into this Agreement for the purpose of governing their relationship as shareholders in relation to the Company, Dickson, Moravia and the Company for setting out the company’s managing affairs had signed a Shareholder Agreement on the 24 th Day of December 2010, for the articles of incorporation of the Company have a complete explanation, Dickson, Moravia and the Company have agreed to entered this supplementary agreement for a complement of the shareholder agreement and for managing the affairs of the upon the terms set out in this Agreement as a complement of the articles of incorporation of the Company” [ sic ] [2] 6. Clauses 1 and 2 provide: “ 1. Subject to Moravia will advance a total USD$3,250,000 … To the Company (the “loan”); Provided that Dickson has duly fulfilled all of its obligations to the Company, Dickson shall be entitled to a success fee of up to USD$3,000,000 … (the “Success Fee”). The Success Fee is payable only after: The Company will not in any way impair financial conditions and operation of the Project Company or the PRC Subsidiary that the loan has been fully discharged and repaid to Moravia. 2. Dickson, Moravia and the Company agreed: with rich sources in Wal‑mart (China) group and local government, Dickson shall play key role in achievement for so‑called “SUCCESS”; and also the preconditions or definitions for “SUCCESS” in above clause shall include the following issues well‑prepared, such as: [6 conditions are then set out concerning the success of the project]” [ sic ] 7. The amount of funds required for the land auction subsequently increased substantially. In addition to the initial US$3.25 million, a second tranche of US$3 million was provided by a bank loan guaranteed by Moravia and a third tranche of US$4 million was to be provided by Moravia in December 2011. In consequence, a document called “Addendum of Supplementary Agreement” was entered into between the same three parties to deal with, inter alia , the success fee. There were three executed versions of the Addendum dated 4, 8 and 16 December 2011 respectively, the last of which is the relevant one here (“ 3 rd Addendum ”). It starts with the recital: “ Dickson, Moravia and the Company have agreed to enter into this Addendum of Supplementary Agreement.” 8. It provides that DHE will transfer 22.5% shareholding in the Company to Moravia so that the former becomes a 27.5% minority shareholder and the latter a 72.5% majority shareholder. It then provides: “ 4. All parties agreed that after MORAVIA becomes the majority shareholder in the Company, or Moravia shall take responsibility to charge the issues in project finance, and meanwhile, Dickson’s duty shall focus on the local governmental matters. Both parties has duty to participate in project management. Dickson will have the right to appoint two representatives in the Project Company to participate in the project management matters. The details will be decided by the Board of Directors later on. 5.1 All parties agree that Mr Rodolfo Padilla Cordero, Mr Marcos Edid Rayek (investors of Moravia) and Mr Fan Ji Qian (investor of Dickson) deserve 9 million USD success fee (These 9 Million USD Success Fee can be paid by the Project Company) (3 million for each person) as long as Joint Venture Company successfully completes the land development in LIANYUNGANG and the company has the capability of payment after the sales income, Mr Fan Ji Qian will receive the first partial payment of the sequences of payments (1 Million USD each partial payment). 5.2 After the payments have been made for the 9 million USD success fee, the company shall effect dividend distribution payments in accordance with the shareholder’s share ratio of 72.5%/27.5%. 6. This addendum cancels all other previous success fee agreements between the two parties.” [3] [ sic ] 9. It should be noted that despite that clause 5.1 states that the three named individuals deserve the success fees of US$3 million each, none of them is stated to be a party to or signed the 3 rd Addendum in his own capacity. Likewise, although clause 5.1 states that the success fees may be paid by the “Project Company”, ie the Subsidiary, it is not stated to be a party and did not execute the 3 rd Addendum by any representative. 10. For reasons that need not be gone into for present purposes, the relationship between the two sides subsequently broke down. In late 2012 and early 2013, the Company, under the control of Moravia, forfeited and cancelled the shares held by DHE, and capitalised Moravia’s loans by allotting to it 28,750,000 shares. Mr Rodriguez subsequently became a holder of 01% of the shareholding. 11. Five years later, in December 2017, DHE presented a petition to the High Court of Hong Kong (in proceedings numbered HCMP 2665/2017) against Moravia, Mr Rodriguez and the Company, in which it complains against the forfeiture of shares and the allotment of new shares to Moravia and seeks relief from unfairly prejudicial conduct under ss 724‑725 of the Companies Ordinance ( Cap 622 ). 12. On 24 May 2018, DHE further took out a summons in the petition proceedings for interlocutory injunctive relief to restrain the disposal of (i) Moravia’s and Mr Rodriguez’s shares in the Company, (ii) the Company’s shares in its direct or indirect subsidiaries (including the Subsidiary), and (iii) any business carried on or operated by the Company or its subsidiaries. On 25 May 2018, Lisa Wong J made an interim order, pending the substantive hearing of the summons, requiring the respondents to give at least 10 days’ notice to DHE prior to any intended disposition. On 13 June 2018, Moravia and Mr Rodriguez applied by summons for the petition to be struck out on the ground that DHE was no longer a member of the Company, alternatively for an order staying all further proceedings on the basis of the arbitration clause in the Shareholders Agreement. This summons came to be heard on the same date as the application for anti‑suit injunction herein and a separate decision on it will be handed down. 13. Meanwhile, unknown to Moravia or the Company, on 6 June 2018 Fan had commenced an action in the Shenzhen Qianhai Cooperation Zone People’s Court (“ Qianhai Court ”) against the Company and the Subsidiary claiming the success fee of US$3 million pursuant to the 3 rd Addendum. For convenience I shall refer to them collectively as “ the Companies ”. Subsequently Fan obtained from the Qianhai Court a freezing order on 22 August 2018 and an execution order on 27 August 2018. The effect of the execution order was that over 40 apartments held by the Subsidiary in the project were impounded for 3 years. The freezing order meant that the assets of the Company and the Subsidiary (up to a limit of RMB19,168,200) were frozen. It was only on 27 August 2018 that the Companies became aware of the Qianhai proceedings and the execution order when the relevant properties were sealed off by court officials. The Companies also only became aware of the freezing order at around that time when a proposed lender refused to lend money to them after discovering the freezing order from public records. 14. The Qianhai proceedings and the orders made therein had a serious and immediate effect on the fund‑raising and marketing efforts of the project at a time when it was nearing completion. As a consequence, the Companies swiftly engaged lawyers in the Mainland and lodged a challenge to the jurisdiction of the Qianhai Court on 30 August, contending that the matter was subject to the Hong Kong arbitration clause in the Shareholders Agreement. On 10 September they in addition lodged an application to contest the freezing order on the ground that the amount frozen together with the properties affected by the execution order greatly exceeded US$3 million, the amount claimed by Fan. 15. After a hearing on 18 September 2018, the Qianhai Court gave its decision on 8 October, releasing 16 of the apartments from the execution order and 30% of the Company’s shares in the Subsidiary from the freezing order. But it also rejected the Companies’ jurisdictional challenge, in terms set out in §49 below. 16. The Subsidiary and the Company lodged an appeal on 15 and 29 October respectively, which as I understand the position will be disposed of on paper. As at the date of the hearing before me the appellate court has not yet rendered its decision. 17. On 7 November 2018, the Companies instituted the proceedings herein by originating summons seeking an anti‑suit injunction against Fan, ie an injunction to restrain him from pursuing the Qianhai proceedings and commencing any other similar proceedings in Mainland China. C. Issues 18. Ms Rachel Lam who appeared on behalf of the Companies made clear that their application is based on the arbitration clause in the Shareholders Agreement and not simply on ordinary forum non conveniens considerations. In particular, she relied on the court’s approach in cases between parties to an arbitration agreement under which an anti‑suit injunction will ordinarily be granted to restrain a party from suing in a non‑contractual forum unless there are strong reasons to the contrary. The fountain head of the principles underlying that approach is the decision of the English Court of Appeal in The Angelic Grace [1995] 1 Lloyd’s Rep 87, which has been applied in Hong Kong in Ever Judger Holding Co Ltd v Kroman Celik Sanayii Anonim Sirketi [2015] 2 HKLRD 866 and Sea Powerful II Special Maritime Enterprises (ENE) v Bank of China Ltd [2016] 1 HKLRD 1032 ; [2016] 3 HKLRD 352 (CA); see also Compania Sud Americana de Vapores SA v Hin Pro International Logistics Ltd (2016) 19 HKCFAR 586 at §57. 19. On that basis the arguments before me fall into four main points, which are discussed below in turn: (1) whether the arbitration clause in the Shareholders Agreement is incorporated into the 3 rd Addendum; (2) whether the principles established by cases starting from The Angelic Grace apply in the present case given that Fan is not a party to the Shareholders Agreement or the 3 rd Addendum; (3) whether the Qianhai Court’s judgment rejecting the Companies’ jurisdictional challenge has given rise to an issue estoppel against the Companies; and (4) if the Angelic Grace principles apply, whether there are strong reasons not to grant the injunction. D. Arbitration agreement 20. The first issue is whether the 3 rd Addendum is subject to the arbitration agreement contained in the Shareholders Agreement. This is a question of contractual interpretation and incorporation. Both sides’ arguments were based on the application of Hong Kong law to this issue (subject to the issue estoppel point raised on behalf of Fan which is separately dealt with below). 21. Art 7 of UNCITRAL Model Law, made effective by s 19 of the Arbitration Ordinance ( Cap 609 ), provides: “ (6) The reference in a contract to any document containing an arbitration clause constitutes an arbitration agreement in writing, provided that the reference is such as to make that clause part of the contract.” 22. As Kaplan J held in Astel‑Peiniger Joint Venture v Argos Engineering & Heavy Industries Co Ltd [1995] 1 HKLR 300 at 306‑307 and Gay Constructions Pty Ltd and another v Caledonian Techmore (Building) Ltd [1995] 2 HKLR 35 at 39, it is not necessary for there to be explicit reference to the arbitration clause; a reference to the document containing that clause may be sufficient. 23. Ms Lam also relied on s 28 of the Conveyancing and Property Ordinance ( Cap 219 ) which provides: “ Any instrument (whether executed before or after the commencement of this section) expressed to be supplemental to a previous instrument shall be read and have effect as if the supplemental instrument contained the full recital of the previous instrument.” 24. If a document containing an arbitration clause is merely deemed repeated as a recital in a later agreement, I doubt it would suffice to incorporate the arbitration clause. But there is more in the present case. The 3 rd Addendum is an addendum, ie an appendix or a subsidiary addition, to the Supplementary Agreement. Relevantly for present purposes, it substitutes a provision on success fees in place of that in the Supplementary Agreement. The Supplementary Agreement itself is expressly intended to be a “complement” — to form a complete whole — with the Shareholders Agreement. All three documents were executed between and only between the same three parties, so that each party to the later documents was fully aware of the content of the previous documents. There is no doubt in my mind that the documents are intended to be read and take effect together as a whole and that, in particular, the Supplementary Agreement and the 3 rd Addendum are not standalone documents but are intended to be read as part and parcel of Shareholders Agreement. 25. Neither the Supplementary Agreement nor the 3 rd Addendum contains separate provisions on general matters such as choice of law or dispute resolution, which are of particular importance in a project such as this involving businessmen and entities from multiple jurisdictions. It seems to me plain that the general provisions in the Shareholders Agreement are intended to govern these two later documents of a supplemental nature. As Lord Hoffmann said in Fiona Trust and Holding Corporation v Privalov [2007] UKHL 40 , at §6, albeit in the different context of deciding the scope of an arbitration clause: “ In approaching the question of construction, it is therefore necessary to inquire into the purpose of the arbitration clause. As to this, I think there can be no doubt. The parties have entered into a relationship, an agreement or what is alleged to be an agreement or what appears on its face to be an agreement, which may give rise to disputes. They want those disputes decided by a tribunal which they have chosen, commonly on the grounds of such matters as its neutrality, expertise and privacy, the availability of legal services at the seat of the arbitration and the unobtrusive efficiency of its supervisory law. Particularly in the case of international contracts, they want a quick and efficient adjudication and do not want to take the risks of delay and, in too many cases, partiality, in proceedings before a national jurisdiction. ” 26. The same considerations inform the question at hand. From a practical point of view, it would be wholly uncommercial to suggest that if there should be a dispute between Moravia and DHE, for example, about the success fees, the parties contemplated that it would not be regulated by the choice of law clause and the arbitration clause in the Shareholders Agreement. It would be unrealistic to suppose that the parties intended that their disputes under the Shareholders Agreement and the 3 rd Addendum respectively would be resolved in different fora by different modes of adjudication under different governing laws. 27. I conclude therefore that the 3 rd Addendum is subject to the arbitration clause in the Shareholders Agreement. E. The principles on the grant of anti‑suit injunction 28. It is clear from his claim form in the Qianhai proceedings that Fan’s claim is squarely based on the 3 rd Addendum as a contract. In his own affirmation in these proceedings he said the Companies are liable to pay him the success fee “pursuant to” the 3 rd Addendum, giving rise to “contractual claims” and a “personal contractual dispute”. Although the Subsidiary is not explicitly a party to the contract, Fan claims against both Companies to enforce their promise or undertaking [4] to him as expressed in the 3 rd Addendum. No distinction is made by Fan between the Company and the Subsidiary so far as the obligation allegedly owed to him is concerned. Nor should any distinction be made between them for present purposes because Fan clearly takes the position that both the Company and the Subsidiary owe him contractual obligations under the 3 rd Addendum: see Sea Premium Shipping Ltd v Sea Consortium Pte Ltd [2001] EWHC 540 (Admiralty); The MD Gemini [2012] EWHC 2850 (Comm), §15; Dell Emerging Markets (EMEA) Ltd v IB Maroc.com SA [2017] EWHC 2397 (Comm), §§33‑34; ACE Seguradora SA v Fair Wind Navigation SA [2017] EWHC 3352 (Comm) §8; Raphael, The Anti‑suit Injunction , §10.23. 29. DHE is the counterparty to the 3 rd Addendum, the Supplementary Agreement and the Shareholders Agreement. There is no dispute that it is bound by the arbitration clause assuming it is incorporated into the 3 rd Addendum. If, instead of Fan, DHE had commenced proceedings in the Mainland seeking an order for the success fee to be paid to Fan (analogous to the order for specific performance in Beswick v Beswick [1968] AC 58 ), DHE would clearly be acting in breach of the arbitration clause. 30. In contrast, it is common ground that Fan is not a party to the 3 rd Addendum, the Supplementary Agreement or the Shareholders Agreement. As such, the precise juridical basis for his claim for the success fee is not clear and has not been explained. Since the contract on which he relies is, as I have found above, governed by Hong Kong law, the questions of what rights he has under that contract and whether in seeking to enforce those rights he is subject to the arbitration clause must, in my view, also be governed by Hong Kong law. In any event as neither party has adduced evidence of Mainland law on these questions it seems to me I ought to apply Hong Kong law. 31. As a matter of the common law of Hong Kong, in general only a person who is a party to a contract can sue on it: B + B Construction Ltd v Sun Alliance and London Insurance Plc [2000] 2 HKC 295 at 301B‑F. The doctrine of privity has been reformed by the Contracts (Rights of Third Parties) Ordinance ( Cap 623 ), but that statute has no application in this case since all the agreements were entered into before it came into operation. [5] It should be noted that even under that statute the enforcement of the term by a third party “is subject to any other term of the contract relevant to the term” (s 4(4)). 32. Outside of statute there exist various devices at common law which are sometimes employed to temper the strictures of the doctrine of privity. One is to say that a promise by one contractual party to another to pay a sum of money to a third party is held on trust by the promisee for the benefit of the third party. Another device is an assignment by the promisee to the third party of the benefit of the promise. A further technique is to treat the promisee as having acted as an agent for the third party or for both himself and the third party in receiving the promise (though this is not strictly an exception since it renders the third party a party to the contract). 33. It is not clear on what specific basis in Hong Kong law Fan claims to be able to sue on the 3 rd Addendum while insisting he is not a party to it, or whether he is relying on certain Mainland legislation similar in effect to the Contracts (Rights of Third Parties) Ordinance . For present purposes I am prepared to assume that Fan has a prima facie cause of action under the 3 rd Addendum against the Companies for the success fees. Whatever the precise basis may be, however, it is undeniable that his right is derived from the contract in the 3 rd Addendum. 34. Let it further be assumed that, because Fan is not a party to the contract, he cannot be said to be acting positively in breach of contract or promise by commencing and pursuing the Qianhai proceedings. Does it make a difference for present purposes that instead of procuring his corporate vehicle (DHE), which is a party to the contract, to bring proceedings to enforce it, Fan has instituted proceedings in his own name to enforce the contract as a third party? 35. The Companies contend that it makes no difference and that The Angelia Grace principles apply with equal force in the present case. Reliance is placed on a line of English authorities which, the Companies submitted, establish that The Angelic Grace principles apply where a person (albeit not a contractual party to the arbitration clause) seeks to enforce a right conferred by a contract that contains the arbitration clause. 36. In Schiffahrtsgesellschaft Detlef Von Appen Gmbh v Wiener Allianz Versichrungs AG and Voest Alpine Intertrading GmbH (The Jay Bola) [1997] CLC 993, a vessel was chartered by the owners to time‑charterers, who in turn chartered her to another party for a part cargo from Sao Sebastiao to Bangkok on the Gencon form, governed by English law and containing a London arbitration clause. The vessel suffered a fire and the cargo was seriously damaged. An insurer made payments to the voyage‑charterer and cargo owners. The shipowners admitted liability for the casualty. A decree of limitation was pronounced by the Admiralty Court in London, limiting as well the liability of the time‑charterers. The insurer commenced an action in Brazil since judgment there would not be subject to the limitation. The time‑charterers applied to the English court for an anti‑suit injunction to restrain the insurer from proceeding in Brazil, relying on the arbitration clause in the voyage charterparty. The English court held that the insurer’s Brazilian action was based on the enforcement of rights derived from the voyage charterer against the time-charterers. On that basis, Hobhouse LJ held (at pp 1000-1001): “ … the rights which the insurance company has acquired are rights which are subject to the arbitration clause. The insurance company … is not entitled to assert its claim inconsistently with the terms of the contract. One of the terms of the contract is that, in the event of dispute, the claim must be referred to arbitration. The insurance company is not entitled to enforce its right without also recognising the obligation to arbitrate. … The insurance company is failing to recognise the equitable rights of the time charterers. The equitable remedy for such an infringement is the grant of an injunction.” Similarly, Scott VC held (at pp 1007‑1008): “ WAV is bound by the arbitration agreement not because there is any privity of contract between WAV and DVA but because Voest’s contractual rights under the sub‑charter‑party, to the benefit of which WAV has become entitled by subrogation, are subject to the arbitration agreement which, too, is part of the sub‑charter-party. WAV cannot enforce those contractual rights without accepting the contractual burden, in the form of the arbitration agreement to which those rights are subject (cf. Halsall v Brizell [1957] Ch 169 and Tito v Waddell (No 2) [1977] Ch 106 at p 309). WAV is, through subrogation, an assignee from Voest of Voest’s contractual rights against DVA. DVA is contractually entitled, whether as against Voest or any assignee from Voest, to require the enforcement of those rights to be pursued by arbitration. WAV’s attempt to enforce those rights otherwise than by arbitration is a breach of DVA’s contractual entitlement. I agree with Lord Justice Hobhouse that DVA’s remedy is, prima facie , the grant of an injunction to restrain the attempt.” 37. In West Tankers Inc v RAS Riunione Adriatica di Sicurta SpA (The Front Comor) [2005] 2 Lloyd’s Rep 257, a vessel chartered to the owners of an oil refinery severely damaged the oil jetty at the refinery. The charterparty contained a London arbitration clause. The charterers commenced arbitration proceedings against the shipowners in London, claiming for their uninsured losses. In respect of the insured losses, the insurers paid the charterers and commenced court proceedings in Sicily against the shipowners. Colman J of the English High Court held that an anti‑suit injunction should be granted, stating (at §33): “ Accordingly, by reference to The Jay Bola , supra , it is to be concluded that the defendant insurers have, under Italian Law, by subrogation become entitled to enforce, the insured charterer’s right of action in delict against the Owners, but that, by reference to English Law, their duty to refer their claim to arbitration is an inseparable component of the subject matter transferred to the insurers.” [6] 38. In Shipowners’ Mutual Protection and Indemnity Association (Luxembourg) v Containerships Denizcilik Nakliyat ve Ticaret AS (The Yusuf Cepnioglu) [2016] 1 CLC 687, a vessel was operating on a liner service between Turkey and North Africa when it grounded and became a total loss. The charterers commenced arbitration proceedings in London against the owners pursuant to the terms of the time charter. The owners were insured with a P&I club on terms which provided the club would only be liable if the owners had paid the claims against them and, further, that an arbitration award was a condition precedent to the club’s liability. The charterers brought proceedings in Turkey in which they sought to attach the club’s assets in Turkey as security for a claim pursuant to a Turkish statute which gave them a right of direct action against the club. The club sought an anti‑suit injunction in the English court to restrain the charterers from pursuing the Turkish proceedings. The English court held that despite a Turkish statute was involved, the essential content of the right sought to be enforced was a contractual right arising from the charterparty. In essence the charterers became entitled under the Turkish statute to enforce for their own benefit the contract between the owners and the club . Longmore LJ said at §21: “ Once it is decided that the charterers are exercising an essentially contractual right, it must follow that the charterers are bound to accept that their claim is governed by English law and must be arbitrated in London. The charterers’ proposed substantive Turkish proceedings would be a contravention of that obligation. The question therefore arises whether, as a matter of English law, the Club is entitled to an injunction to restrain the charterers from instituting or continuing with such proceedings.” 39. Longmore LJ then applied the principle in The Jay Bola , preferring it to Through Transport Mutual Insurance Association (Eurasia) Ltd v New India Assurance Association Co Ltd (The Hari Bhum) [2005] 1 All ER (Comm) 715, another Court of Appeal’s decision, and held that: “ the Club’s application for an injunction is made:- ‘ to protect a contractual right … that the dispute be referred to arbitration, a contractual right which equity requires the [third party/victim] to recognise.’ It is only by way of an injunction to restrain Turkish proceedings that the charterers in the present case can be required to recognise the Club’s right to have the dispute referred to arbitration.” On this basis Longmore LJ said (at §34) that the right approach is to apply The Angelic Grace and ask whether there are good reasons why an injunction should not be granted, without any need for the Club to show vexatious or oppressive conduct on ordinary forum non conveniens considerations. 40. Moore‑Bick LJ gave a concurring judgment, holding: “ It is now well‑established that a person who becomes entitled to enforce a contractual obligation can do so only in accordance with its terms. … The Club’s rules also provide for arbitration in London and it is now well established that a person who becomes entitled to enforce an obligation which is subject to an arbitration clause must do so by arbitration in accordance with the clause [citing The Jay Bola ].” 41. By suing in his own name in the Mainland, it is said that there is no breach of contract because Fan is not a party to the arbitration clause. As such, Fan argues that no anti‑suit injunction should issue. This argument in my view takes too narrow a view of the principle in The Angelic Grace . The basis for the court’s intervention is the same in the case of a claimant who has become entitled to enforce an obligation but is not a party to a contract of any kind with the defendant, as in the case of a claimant who is an original party to an arbitration agreement. The court is willing to intervene by granting an anti‑suit injunction to restrain such a claimant from enforcing the obligation by proceedings abroad instead of by arbitration, “ not because the claimant is party to a contract containing an arbitration agreement (which it is not), but because enforcement by arbitration alone is an incident of the obligation which the claimant seeks to enforce and because the defendant is therefore entitled to have any claim against him pursued in arbitration. It is the right not to be vexed by proceedings otherwise than in arbitration that equity will intervene by injunction to protect.” “ The principle can be seen at work most clearly in cases involving the original parties to an agreement containing an arbitration clause and it is not surprising, therefore, that in The Angelic Grace Millett LJ should have expressed the view that in those circumstances an injunction should be granted to restrain a breach of the arbitration agreement unless there was good reason not to do so. However, although he drew a distinction between such a case and a case where an injunction is sought on the general ground that the foreign proceedings are vexatious or oppressive, but where no breach of contract is involved, with all due respect to what was later said by this court in The Hari Bhum , I do not think that he can have had in mind a case such as the present. True it is that this is not a case in which a breach of contract is involved, but nor is it a case in which the Club is seeking to restrain the proceedings in Turkey on the general ground of vexation or oppression. It has very much more the character of the former than the latter, since the right which equity is asked to protect by injunction is the same in the case of a remote party as in the case of an original party. In each case sufficient grounds for intervention are to be found in the commencement of proceedings contrary to the terms of the arbitration agreement. ” The Yusuf Cepnioglu , §§49-50, per Moore‑Bick LJ. 42. Mr Anson Wong SC who appeared for Fan submitted that The Jay Bola was explicable on the basis that the insurer had by subrogation stepped into the shoes of the voyage charterers. It was said that, as an assignee the insurer was understandably held to be bound by all the equities to which the assigned right was subject. He submitted that neither the charterers in The Yusuf Cepnioglu nor Fan in the present case was a subrogated party or an assignee or transferee of the right under the contract. In his submission, the court in The Yusuf Cepnioglu wrongly applied The Jay Bola which was a subrogation case, and should not be followed in Hong Kong. 43. With respect, the answer again lies in the judgment of Moore‑Bick LJ in The Yusuf Cepnioglu where his Lordship said at §55: “ … The Jay Bola proceeds on the basis that the right to have the claim against it determined by arbitration is an incident of the obligation which the claimant is seeking to enforce and does not depend on the existence of a contract between the claimant and the defendant. If that is right, there is no distinction of principle between the position of a claimant who is an original party to a contract containing an arbitration clause and one who is a remote party in the sense described earlier. The grounds upon which equity will intervene, as explained in The Jay Bola , are the same in each case, namely, to protect the defendant’s right to have the claim determined in arbitration. The commencement of proceedings contrary to the arbitration clause is, I would suggest, sufficiently vexatious and oppressive, or at any rate sufficiently unconscionable and unjust, to provide sufficient grounds for the court’s intervention by way of the equitable remedy of an injunction. The position is no doubt at its clearest when the proceedings are between original parties to the arbitration agreement, but the rationale of the decision in The Angelic Grace applies equally to both cases. ” 44. For his submissions Mr Wong also relied upon the English Court of Appeal’s decision in The Hari Bhum , but for the reasons explained in The Yusuf Cepnioglu and in Raphael, The Anti‑suit Injunction , §10.17, I prefer the reasoning in The Jay Bola and The Yusuf Cepnioglu which seems to me, with respect, cogent and just. 45. Neither an assignee of contractual rights nor a subrogee to such rights becomes a party to the contract in the full sense. Obligations under the contract do not as such pass by assignment or subrogation to them to render them liable for breach. The cases have shown however that their conscience is nevertheless bound by the conditions integral to the rights they have acquired, which they can therefore be restrained by equity from asserting in a manner inconsistent with those conditions. This approach applies, in my view, equally to a claimant such as Fan, who asserts rights under the 3 rd Addendum which are subject to the arbitration clause, irrespective of whether he does so through the common law devices referred to in §32 above or by reliance on some Mainland law with similar effect to the Contracts (Rights of Third Parties) Ordinance . 46. Even if Fan is not an assignee of the DHE’s rights under the contract, it is plain that his rights to the success fee, if any, are derived from the promise made by the Companies to DHE, of which the arbitration clause forms an inseparable part. The promise of the success fee was subject to the enforcement mechanism chosen by the parties to the contract, namely, arbitration in Hong Kong. Insofar as he has any direct right, Fan’s claim is clearly one “arising out of or relating to” the contract and is justiciable only in accordance with that contractual mechanism. It is no less unconscionable of Fan to make a claim under the contract in a different forum than it would be for DHE to do so, even though there would be a breach of contract only in the latter case: see The Jay Bola at p 1001D‑F. In pursuing court proceedings in the Mainland against the Companies, Fan is seeking to claim a benefit under the contract without recognising the condition to which it is plainly subject. Such conduct in my view falls within the principles expounded in The Angelic Grace , The Jay Bola and The Yusuf Cepnioglu . The Companies have the right to prevent a claim against them based on their contractual obligations being pursued otherwise than by the contractually agreed mode, viz arbitration in Hong Kong. [7] Unless an injunction is granted such right will be rendered wholly ineffective and valueless. 47. For the above reasons I consider that in determining whether an anti‑suit injunction should be granted against Fan in this case, this court should be guided by The Angelic Grace approach. It should grant an injunction to restrain Fan from acting inconsistently with the inherent conditions forming part of the promise of success fees, unless there are strong reasons for not doing so. F. Issue estoppel 48. Fan contends that an issue estoppel has arisen from the judgment of the Qianhai Court given on 8 October 2018 rejecting the Companies’ jurisdictional challenge. 49. In its decision the Qianhai Court stated: “ The Court is of the view that although there is an arbitration clause in the Shareholders’ Agreement, which was signed by Fan Jiqian, the three parties to the Agreement are [DHE, Moravia and the Company]. Fan Jiqian did sign the Agreement, but nothing in it concerns his personal benefits. He was acting in the capacity of the representative of DHE, and his signing of the Agreement, by nature, is for the purpose of performing the duty for DHE. There is no binding effect on him. What Fan Jiqian has relied on for the present action are two supplemental agreements, one dated 8 December 2011 and the other 16 December 2011, in which no corresponding arbitration clause can be found. Furthermore, the parts concerning Fan Jiqian in those two supplemental agreements, in substance, are related to the rights set out by the parties to the Agreement for the non‑parties. Although the contents of the supplemental agreements, to a certain extent, have a connection with the Shareholders’ Agreement previously signed, the part on the personal benefits of Fan Jiqian exists independently. Also, in short, Fan Jiqian is not a party who has entered into the Shareholders’ Agreement, and is not bound by the its arbitration clause. Nor is there any arbitration clause in the contract relied on by him in this action. The objection to jurisdiction raised by the two Defendants cannot be established. In short, pursuant to Articles 127(1) and 154(1)(ii) of the Civil Procedure Law of the People’s Republic of China, it is held that the objection to jurisdiction raised in this case by the two Defendants be dismissed.” [8] 50. Mr Wong submitted on behalf of Fan that the following issues have been determined by the Qianhai Court: (i) Fan is not a party to the Shareholders Agreement; (ii) Fan’s entitlement to the success fee has a separate and independent existence from the Shareholders Agreement; and (iii) under this separate arrangement, there is no arbitration clause binding on Fan. 51. In answer, Ms Lam relied on s 3 of the Foreign Judgments (Restriction on Recognition and Enforcement) Ordinance ( Cap 46 ) (“ FJRREO ”) which provides: “ (1) Subject to this section, a judgment given by a court of an overseas country in any proceedings shall not be recognized or enforced in Hong Kong if— (a) the bringing of those proceedings in that court was contrary to an agreement under which the dispute in question was to be settled otherwise than by proceedings in the courts of that country; and (b) the person against whom the judgment was given— (i) did not bring or agree to the bringing of those proceedings in that court; and (ii) did not counter‑claim in the proceedings or otherwise submit to the jurisdiction of the court. (2) Subsection (1) does not apply where the agreement referred to in paragraph (a) of that subsection was illegal, void or unenforceable or was incapable of being performed for reasons not attributable to the fault of the party bringing the proceedings in which the judgment was given. (3) In determining whether a judgment given by a court of an overseas country should be recognized or enforced in Hong Kong, the court in Hong Kong shall not be bound by any decision of the court of the overseas country relating to any of the matters mentioned in subsection (1) or (2). (4) ……” 52. S 4 provides in addition a person shall not be treated as having submitted to the jurisdiction of the overseas court by taking steps for certain purposes, such as to contest the jurisdiction of the court, to ask the court to dismiss or stay the proceedings in favour of arbitration, or to obtain the release of property seized. These are precisely the steps taken by the Companies in the Qianhai proceedings. 53. Ms Lam submitted that s 3(1) is applicable here. The argument ran as follows: (1) Since “overseas country” is defined as “any place outside Hong Kong” (see s 2), and “judgment” means “any judgment or order (by what name called) given or made by a court in any civil proceedings”, the decision of the Qianhai Court rejecting the Companies’ jurisdictional challenge is a judgment given by a court of an overseas country. (2) The proceedings in which it was given are the Qianhai proceedings, which have been brought in the Qianhai Court contrary to the arbitration agreement under which the dispute in question — Fan’s claim for the success fee — was to be settled by arbitration in Hong Kong, that is to say, otherwise than by proceedings in any Mainland court. (3) The Companies, as the persons against whom the judgment was given, did not agree to the bringing of proceedings in the Qianhai Court; nor did they counterclaim in those proceedings or otherwise submit to the jurisdiction of that court. In particular, s 4 makes clear that the steps taken by the Companies in the Qianhai proceedings did not amount to submission. (4) It follows from s 3(1) that the Qianhai Court’s decision “shall not” be recognized or enforced in Hong Kong. (5) Further, by virtue of s 3(3), in determining whether s 3(1) applies, this court “shall not be bound” by the Qianhai Court’s decision relating to the issues that, according to Fan, have given rise to an issue estoppel: see Tracomin SA v Sudan Oil Seeds Co Ltd [1983] 1 WLR 662 , 670F (Staughton J); [1983] 1 WLR 1026 , 1030H, 1034G-H (CA); AES Ust‑Kamenogorsk Hydropower Plant LLP v Ust-Kamenogorsk Hydropower Plant JSC [2010] EWHC 772 (Comm) §41; [2011] EWCA Civ 647 , §§149‑151; [9] see also Johnston, The Conflict of Laws in Hong Kong (3 rd ed by Paul Harris SC), at §9.073. 54. For his part, Mr Wong disputed point (2) above. He submitted that there was no relevant “agreement” here within the meaning of s 3(1)(a) of the FJRREO. The agreement has to be an agreement between the parties to the litigation in the court of the “overseas country” but in the present case the arbitration agreement is between DHE, Moravia and the Company. 55. I am unable to accept this construction of s 3(1)(a). The statute does not require that the plaintiff in the foreign jurisdiction must be a party to the agreement, or that he would be liable for breach of contract by bringing the forum proceedings, but simply that the bringing of the relevant proceedings in the overseas court was “contrary to an agreement under which the dispute in question was to be settled otherwise than by proceedings in the court of that country”. This in my view essentially raises the same issue as I have dealt with above, namely, whether Fan’s claim is subject to the arbitration clause. It follows from my conclusions above that (i) the dispute in question was, under the 3 rd Addendum which incorporates the arbitration clause, to be settled by arbitration in Hong Kong rather than by court proceedings in the Mainland; and (ii) the bringing of the Qianhai proceedings by Fan was contrary to that agreement. Accordingly, s 3 applies by reason of which the Companies’ contentions in this court are not barred by any relevant issue estoppel. G. Discretionary factors 56. As stated above, the proper approach to this application requires good reasons to be demonstrated by Fan why an injunction should not be granted to restrain him from proceeding in a way that repudiates the integral condition of the right he seeks to assert under the 3 rd Addendum. 57. Mr Wong submitted that there was delay in the application. I do not think that in taking slightly more than two months after learning of the Qianhai proceedings to issue the application for anti‑suit injunction in Hong Kong the Companies were guilty of inexcusable or inordinate delay, particularly having regard to the flurry of steps they needed to take in the Mainland in order to ameliorate the effects of the freezing and execution orders. The present case is a far cry from Sea Powerful II , where the injunction-plaintiff was evading service in the Mainland for 8 months, and delayed in applying for injunctive relief in Hong Kong for more than a year with the motive that the 12‑month limitation period for the injunction-defendant to commence arbitration in Hong Kong would expire and the injunction-defendant would be left without a remedy in any available forum. [10] No prejudice has been suffered by Fan as a result of the time taken, except perhaps as regards the costs incurred in the jurisdictional challenge, which is adequately met by the Companies’ offer to compensate him: see The Jay Bola , at p 1004B‑D; Akai Pty Ltd v People’s Insurance Co Ltd [1998] 1 Lloyd’s Rep 90, 108. 58. Nor is the delay serious when viewed against the progress of the Qianhai proceedings. Those proceedings have not gone on to an advanced stage. The Qianhai Court has only dealt with the interim preservation remedies and the Companies’ jurisdictional challenge. The case has not gone on to any contest on the substantive merits. 59. Mr Wong further submitted that the Companies’ conduct was abusive in applying for an injunction here only after having failed in the jurisdictional challenge in the Mainland. The Companies, he said, were “blowing hot and cold” [11] and trying to have “two bites of the cherry”. It would follow from this submission that a failed jurisdictional challenge in the overseas court would necessarily be fatal to an application for anti-suit injunction in Hong Kong, but I do not think that is correct. As Lord Mance said in AES Ust‑Kamenogorsk Hydropower Plant LLP v Ust‑Kamenogorsk Hydropower Plant JSC [2013] UKSC 35 , §61: “ In some cases where foreign proceedings are brought in breach of an arbitration clause or exclusive choice of court agreement, the appropriate course will be to leave it to the foreign court to recognise and enforce the parties’ agreement on forum. But in the present case the foreign court has refused to do so, and done this on a basis which the English courts are not bound to recognise and on grounds which are unsustainable under English law which is accepted to govern the arbitration agreement. In these circumstances, there was every reason for the English courts to intervene to protect the prima facie right of AESUK to enforce the negative aspect of its arbitration agreement with JSC.” 60. That a failed jurisdictional challenge in the overseas court is no bar in itself to an application for anti-suit injunction was also recognised by the English Court of Appeal in Ecobank Transnational Incorporated v Tanoh [2015] EWCA Civ 1309 , in the passages of the judgment of Christopher Clarke LJ (esp §133) quoted at length by the Court of Appeal in Sea Powerful II at §21 with apparent approval. In Ecobank , the court said that comity is not concerned with “judicial amour propre ” or “the need to avoid offence to individual judges (who are made of sterner stuff)”, [12] but analysed comity in terms of the need to avoid wastage of resources in different jurisdictions. At §133, Christopher Clarke LJ stated: “ … The fact that at some stage the foreign court has ruled in favour of its own jurisdiction is not per se a bar to an anti‑suit injunction: see AES . But, as each stage is reached more will have been wasted by the abandonment of proceedings which compliance with an anti‑suit injunction would bring about. That being so, the longer an action continues without any attempt to restrain it the less likely a court is to grant an injunction and considerations of comity have greater force. ” 61. In the present case, the Companies had within days of becoming aware of the Qianhai proceedings sought to put a stop to them, albeit by lodging a challenge in that court to its jurisdiction instead of applying in Hong Kong for an anti‑suit injunction. It is common ground that nothing the Companies have done so far in the Qianhai proceedings amounted to submission to the jurisdiction of the Qianhai Court. I do not think it is entirely accurate to describe their conduct as “blowing hot and cold” — their stance in the Qianhai proceedings and in these proceedings are consistent, namely, that the claims should be referred to arbitration in Hong Kong. Nor can they be criticised for lodging a jurisdictional challenge in the Qianhai proceedings. The evidence shows that, unless the Companies raised a jurisdictional challenge promptly within the time allowed for filing their defence (15 days for the Subsidiary which is located in the Mainland, and 30 days for the Company which is located outside), they would be regarded under Mainland law as having accepted the Qianhai Court’s jurisdiction. 62. In the circumstances of this case having regard in particular to the further matters below I do not consider it was abusive for the Companies to apply for the injunction after having failed in the jurisdictional challenge at first instance and at the same time as an appeal was lodged in Qianhai. 63. First, as mentioned above, the Qianhai proceedings are not far advanced and therefore the wastage of resources, if an anti‑suit injunction is granted, will not be unduly substantial. 64. Secondly, as the Court of Appeal said in Sea Powerful II at §18, the importance of comity considerations is “reduced” in the present type of case which involves foreign proceedings that are inconsistent with the contractual mode of dispute resolution. In a case such as this the court is not being asked to grant an anti-suit injunction on forum non conveniens considerations involving the comparison of the two jurisdictions to identify the more appropriate forum, but to issue an injunction so that the dispute can be dealt with by and only by the contractually stipulated mechanism. This court acts to uphold the contract on principles which do not in any way prefer Hong Kong as the seat of litigation or arbitration. 65. Thirdly, the Qianhai Court can, in my respectful opinion, reasonably be expected to understand that this court is, for the reasons explained above, bound by statute (viz. the FJRREO) not to recognize or enforce the Qianhai Court’s decision on the jurisdiction challenge. This does not flow from any value judgment on the jurisprudence of the Qianhai Court but is simply an incidence of the legal principles as I find to be applicable in this case. 66. Fourthly, to be placed in the balance against comity considerations is the unambiguous policy of the Hong Kong courts in support of arbitration. Arbitral agreements and processes require the support and protection of the courts. As has been observed by Lord Hoffmann in The Front Comor [2007] UKHL 4 at §19, the jurisdiction to grant anti-suit injunction is an “important and valuable weapon in the hands of a court exercising supervisory jurisdiction over the arbitration” against a person who ought to be required to observe the arbitration agreement but has instead brought proceedings elsewhere. “It promotes legal certainty and reduces the possibility of conflict between the arbitration award and the judgment of a national court. ” 67. Fifthly, whereas there was uncontradicted evidence in Sea Powerful II that the Mainland courts there would be likely to regard the application for anti‑suit injunction as “an intrusion or obstruction of the judicial sovereignty of the Chinese courts” [13] , in the present case there is evidence that the relevant court — the Qianhai Court — is a “judicial reform demonstration court”, which is a recently‑established court receptive to common law principles: a substantial number of its judges had studied common law in universities in Hong Kong and co‑adjudicators from Hong Kong are involved from time to time in cases involving this territory. The available evidence from the Qianhai Court itself concerning its policy is that: “ by taking advantage of its centralized jurisdiction over foreign‑related and Hong Kong, Macao, Taiwan‑related cases, [the Qianhai Court] learns from and draws on internationally applicable judicial philosophies, promotes the reform of the foreign-related and Hong Kong, Macao, Taiwan‑related judicial mechanism, widens and deepens external exchange and cooperation, so as eventually to improve China’s judicial credibility, both inter‑regional and international.” [14] 68. Sixthly, the Qianhai Court has not applied Hong Kong law in reaching its jurisdictional decision. With its emphasis on cross‑border legal disputes and innovative outlook it will readily appreciate that the application of Hong Kong law to the issues may lead to conclusions different from those it has reached apparently without assistance from the parties on Hong Kong law. There are numerous authorities in the common law in which the court granted an anti‑suit injunction in favour of a party who had not submitted to the foreign jurisdiction notwithstanding that the foreign court had ruled in favour of its own jurisdiction. The fact that the foreign court did not apply correctly or at all the law of the forum jurisdiction was a significant consideration: Akai Pty Ltd v People’s Insurance Co Ltd [1998] 1 Lloyd’s Rep 90, 105‑106; Donohue v Armco Inc [2000] 1 Lloyd’s Rep 579, §§49‑51 & 96 [15] ; see also AES Ust‑Kamenogorsk Hydropower Plant LLP v Ust‑Kamenogorsk Hydropower Plant JSC , cited at §59 above. Giving effect to the choice of governing law is an important consideration having a potential bearing on the substantive rights of the parties. 69. Seventhly, in support of his argument on comity, Mr Wong submitted that this case has strong connections with the Mainland and it is not appropriate for the Hong Kong courts to interfere. I recognise that Fan is a Mainland resident, the Subsidiary is a Mainland company and the project is situated in the Mainland. But at the same time it must not be forgotten that the Company — the joint venture vehicle — is a Hong Kong company, the contract is governed by Hong Kong law and stipulates that “[a]ny dispute, controversy or claim arising out of or relating to” the agreements is to be submitted to arbitration in Hong Kong under Hong Kong arbitration rules. These features are explicable by the fact the foreign and Chinese investors have consciously chosen Hong Kong (a Special Administrative Region albeit part of China) as a mutually acceptable neutral ground, quite possibly for some of the reasons mentioned in Fiona Trust referred to in §25 above. Such choices are an important part of the bargain between commercial men, and should not be easily neglected or thwarted. 70. It was also submitted on behalf of Fan that it was reasonable for him to bring proceedings in the Mainland because that is where the Companies’ assets are located. In my opinion this factor carries little weight. There is nothing to suggest that if Fan brings his claim by arbitration and obtains an award in his favour, it will not be readily enforced by the Mainland courts. 71. Finally, I should mention, if only to register this court’s disapproval of it, that it was submitted on behalf of Fan that any injunction granted would be “wholly toothless”. [16] As a thinly veiled threat of non‑compliance, it is in my opinion not a reason at all against granting an injunction. As has been said long ago in Re Liddell’s Settlement Trust [1936] Ch 365 at 374: “It is not the habit of this court in considering whether or not it will make an order to contemplate the possibility that it will not be obeyed”; see also Castanho v Brown & Root (UK) Ltd [1981] AC 557, 574 ; South Buckinghamshire District Council v Porter [2003] 2 AC 558 , §32. H. Fan’s belated summons to set aside service or for stay 72. There was in addition a late summons taken out by Fan seeking to set aside service of the originating summons on him, alternatively a stay of these proceedings on the ground of forum non conveniens , which was given short shrift at the hearing. 73. After the originating summons was issued, numerous steps were taken by the Companies to have it served on Fan, including through the Hong Kong solicitors who had been acting for DHE in the petition proceedings (which also turn out to be the firm who now act for Fan in these proceedings) and service at the Hong Kong address given by Fan himself in his affirmations filed in the petition proceedings and in the corporate filings for DHE in Hong Kong. Eventually service was effected on Fan pursuant to leave to serve out granted by Deputy Judge William Wong SC on 7 December 2018, who also directed that the originating summons be heard on 31 January 2019 together with the extant summons for strike out and stay in the petition proceedings. Leave to serve out was based on RHC Order 11 rule 1(1)(d)(iii), namely, that the claim is brought to enforce a contract governed by Hong Kong law: see The Jay Bola , at p 1002H‑1003D. 74. Fan did not then say he was not properly served or that the originating summons should not be heard. In fact, he took out a summons in these proceedings on 4 January 2019, not to contest jurisdiction, but to ask for later hearing dates for substantive argument of the originating summons, and submitted proposed procedural directions for that purpose including directions for the filing of evidence by Fan “in opposition to” the originating summons which clearly meant evidence on the merits of the originating summons. Fan’s summons was heard by Au‑Yeung J on 10 January 2019, when his counsel (not Mr Wong) addressed the court as to why further time was needed by reference to the substantive arguments on the originating summons. Not a word was said that could remotely suggest Fan would contest jurisdiction. 75. It was only on 23 January 2019 that Fan issued his late summons, supported by his affirmation made on 21 January and filed on 22 January. Without obtaining directions from the court, Fan procured the summons to be fixed for hearing on 31 January 2019 at 10am for 3 minutes. 76. In these circumstances what was done was in my view an abuse and at the hearing I declined to spend any time on this eleventh‑hour summons. It seems to me clear that Fan voluntarily recognised this court has jurisdiction to hear and determine the originating summons. The stance and steps taken by him or on his behalf up to 23 January (or at least 21 January) were not explicable except on the basis that he accepted this court should hear the originating summons substantively. The summons of 23 January was a monumental afterthought and came far too late. In addition, the stay sought on forum non conveniens grounds seems to me nonsensical. How the Qianhai Court can possibly be the more appropriate forum for the trial of the claim for an anti‑suit injunction escapes me. If instead what is being said is that the underlying claim for the success fee will be more appropriately tried in the Qianhai Court, then this is simply an argument against the anti-suit injunction on the merits, and the application for stay is a surplusage that can serve no purpose other than obfuscation of the real issue. I. Conclusion 77. For the above reasons there will be an injunction in terms of the originating summons upon the condition that the Companies shall reimburse Fan as to his reasonable costs incurred in the jurisdictional challenge and appeal in the Qianhai proceedings. There will further be an order nisi that Fan do pay the Companies the costs of these proceedings, to be taxed if not agreed, with certificate for two counsel. (Godfrey Lam) Judge of the Court of First Instance High Court Ms Rachel Lam, Mr Terrence Tai and Ms Jasmine Cheung, instructed by Angela Wang & Co, for the Plaintiffs Mr Anson Wong SC, Mr Alan Kwong and Mr Michael Ng, instructed by William KW Leung & Co, for the Defendant [1] The Chinese version of this paragraph reads: 「因本協議及其違約、終止、無效所生任何爭議、糾紛，各方同意根據本協議達成之日生效的香港國際仲裁規則的規定，提交仲裁裁決。」 [2] The relevant sentence in the Chinese version reads: 「Dickson, Moravia與合資公司一致同意為股東協議簽署本補充協議。」 [3] The Chinese version reads as follows: 「4. 各方一致同意：在MORAVIA成為多數控股股東後，MORAVIA將負責項目所需融資事務，同時，DICKSON將負責所有當地政府事務。雙方共同參與項目管理。Dickson公司有權利委派兩個代表去項目公司參與項目管理。具體管理參與細節將在董事局開會討論決定。 5.1 各方一致同意：如合資公司在該土地開發項目開始銷售後且有能力支付時，有銷售收入時即支付Mr Rodolfo Padilla Cordero, Mr Marcos Edid Rayek（Moravia的投資者）and樊紀乾先生（Dickson的投資者）將有權先行獲得總共900萬美金的成功費（其成功費可在項目公司支取）（他們每人各自有權獲得300萬美金）。樊紀乾先生將第一個支取成功費（每次100萬美元）。 5.2 在支付此筆900萬美元的成功費以後，合資公司會按照新的股權比例72.5%/27.5%的比例支付股息。 6. 取消之前雙方約定的關於成功費的所有其他條款。」 [4] In Chinese: “承諾” [5] See s 3(1) of the Ordinance. [6] The case was appealed directly to the House of Lords which made a reference to the European Court of Justice on a question concerning the grant of an injunction to restrain proceedings in another Member State of the European Union in the light of EC Regulation 44/2001 : see [2007] UKHL 4 . There was no appeal on the point relevant for present purposes. [7] See per Scott VC in The Jay Bola at p 1009A. [8] The Chinese original reads: 「本院認為：本案所涉的股東協議中雖然約定了仲裁條款，且樊紀乾在該股東協議中簽名，但該協議的三方當事人是迪新公司、MORAVIA C.V. 以及迪維集團，樊紀乾雖然在該協議上簽名，但該協議中並未涉及到樊紀乾的個人獲利，樊紀乾的身份是迪新公司的代表人，其簽名在性質上屬於代迪新公司履行的職務行為，對其個人沒有約束力。而樊紀乾據以在本案起訴的是2011年12月8日、16日的兩份補充協議。該協議並無相應仲裁條款約定。而且，該補充協議關於樊紀乾的部份本質上是協議的主體為主體之外的第三人設立了相關權利。雖然補充協議與之前的股東協議在內容上有一定的關聯性，但是有關樊紀乾個人獲益的部份是獨立存在的。同時，綜上，樊紀乾不是股東協議的簽訂方、不受該協議中相關仲裁條款的約束。樊紀乾據以起訴的合同依據中也沒有仲裁條款。兩被告的管轄異議不能成立。綜上，根據《中華人民共和國民事訴訟法》第一百二十七條第一款、第一百五十四條第一款第（二）項之規定，裁定如下：駁回兩被告在本案中提出的管轄權異議。……」 [9] There was no appeal on that point to the UK Supreme Court; see [2013] UKSC 35 , at §§9-10. [10] See §§33, 53, 57-60 of Anthony Chan J’s judgment; §27 of the Court of Appeal’s judgment. [11] A phrase Mr Wong adopted from Anthony Chan J’s judgment in Sea Powerful II at §63. [12] Ecobank at §§132 & 134. [13] §23 of the Court of Appeal’s judgment. [14] See White Paper of the People’s Court of Shenzhen Qianhai Cooperation Zone on Serving and Safeguarding Development of Free Trade Zone (2018). [15] The appeal to the House of Lords did not affect the present point: [2002] 1 Lloyd’s Rep 425. [16] §55 of Fan’s Skeleton Submissions. Look up this case on Lawcite Noteup",
  "length": 67522,
  "headers_seen": [
    "A. Introduction",
    "B. The background facts",
    "C. Issues",
    "D. Arbitration agreement",
    "E. The principles on the grant of anti‑suit injunction",
    "F. Issue estoppel",
    "G. Discretionary factors",
    "H. Fan’s belated summons to set aside service or for stay"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2019/482",
  "query": "anti-suit injunction",
  "ts": "2025-10-16T10:47:27",
  "ok": true
}