{
  "title": "L V. M | [2016] HKCFI 1368 | HKLII",
  "court": null,
  "year": 2016,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2016] HKCFI 1368 L V. M Judgment Information Date 9 Aug, 2016 Action No. HCCT16/2016 Neutral Cit. [2016] HKCFI 1368 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCCT16/2016 HCCT16/2016 L v. M HCCT 16/2016 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO 16 OF 2016 ______________ IN THE MATTER of Section 34 of the Arbitration Ordinance ( Cap 609 ) and Article 16(3) of the UNCITRAL Model Law on International Commercial Arbitration and IN THE MATTER of Order 73 of the Rules of the High Court ( Cap 4A ) and IN THE MATTER of an Arbitration ______________ BETWEEN L Plaintiff (Respondent in the Arbitration) and M Defendant (Claimant in the Arbitration) ______________ Before : Hon Mimmie Chan J in Chambers Date of Hearing : 13 July 2016 Date of Decision : 10 August 2016 _____________ D E C I S I O N _____________ Introduction 1. On 31 March 2015, M as Claimant issued a Notice of Arbitration (“ NOA ”) in respect of its dispute with L, and its claim for US$20,154,892.27 to be paid by L as the balance of the purchase price of TV kits sold and delivered by M to L (“ Claim ”). The Claim was submitted to the HKIAC for arbitration (“ Arbitration ”), by reference to a Mutual Claims Settlement Agreement dated 2 February 2015 (“ MCSA ”) made between M, L and ME and the arbitration agreement contained in clause 8 thereof. 2. Arbitrators were appointed in accordance with the HKIAC Administered Arbitration Rules (“ HKIAC Rules ”). In its Answer to the NOA, L challenged the jurisdiction of the arbitral Tribunal, on the basis that the Claim is not a matter which is the subject of an arbitration agreement. 3. In an Interim Award dated 28 January 2016 (“ Award ”), the Tribunal ruled that it has jurisdiction to deal with the Claim under the MCSA. On 5 April 2016, L applied to this Court under s 34 (1)(3) of the Arbitration Ordinance Cap 609 (“ Ordinance ”) for a decision on the Tribunal’s jurisdiction, and to seek a declaration that the Claim does not fall within the arbitration clause pursuant to which the Claim was referred to arbitration. Background 4. L agreed to purchase and M agreed to sell to L what were described as TV kits (“ Goods ”), which were kits of parts for television sets, which kits were then used by L to assemble into televisions, for sale and distribution in the European Union. According to L, the agreement was made orally on 21 May 2013, evidenced by and recorded in a document entitled “Agreement from Meeting M-L on 21 May 2013” (“ Minutes ”) which was signed by the representatives of L and M in Shenzhen. This sale and purchase agreement is accordingly made partly orally, and partly evidenced in writing (“ Master Agreement ”). The Minutes set out (inter alia) the parts to be supplied, the specifications, the unit cost, the shipment plan which covered June and July 2013, and additional order quantities which may be placed from June to August 2013. 5. It is not disputed by the parties that pursuant to the Master Agreement, L placed its first purchase order with M in May 2013, and that L had continued to place orders for the Goods after August 2013 (the timeframe contemplated under the Master Agreement), until April 2014. L claims that all these orders were governed solely by the Master Agreement, which did not contain any provision for the resolution of disputes, whether by arbitration, or by any other form. The evidence from L, which is not disputed by M, is that the parties never discussed dispute resolution at all, when the Master Agreement was made in May 2013. 6. In October 2013, a document entitled “Memorandum of Understanding” was signed between L and M (“ MOU ”). What is not disputed is that by then, it was agreed between the parties that some components necessary for the manufacture of the television kits, including TV panels, chassis and power boards (“ Parts ”), would be sourced by L from its own suppliers, and would be supplied to M for use in its production of the Goods for delivery under the Master Agreement. It was also agreed that the Parts would be invoiced to M’s affiliated or associated company, ME, for payment to be made by M/ME to L. 7. The MOU sets out various terms and conditions relating to the supply of items for the Goods and of the Parts, and contains a dispute resolution clause (clause 21), which provides: “This MOU shall be governed by the laws of Hong Kong. In the event that any dispute between the Parties arising in connection with this MOU cannot be resolved within a period of thirty (30) days on the basis of mutual consultation, then either of the Parties may refer such dispute to Hong Kong International Arbitration Centre for arbitration in English under the arbitration rules of Hong Kong International Arbitration Centers.” 8. In the NOA, M claims (in paragraph 8) that the terms of the agreement made between L and M for the sale and purchase of the Goods were summarized in the MOU. On its part, L claims (in paragraph 30 of the Answer) that the MOU only relates to the supply of the Parts. 9. It is further undisputed that as the parties’ relationship progressed, other documents were signed in December 2013, January 2014 and April 2014, relating to the method of payment of the Goods and the Parts. In December 2013, a document entitled “Guarantee and Mutual Claims Settlement Agreement” (for convenience only, referred to hereinafter as “ Guarantee ”) was signed by L, M and ME. It recites as follows: “Herewith the parties agreed to settle mutual claims as follows. L is supplying components, predominantly panel/open cell parts to ME. At 30 November 2013, there is a confirmed amount outstanding from ME to L of US$9,835,505.92. The payment of this amount is due as Appendix 1. Same time, (M) is supplying L with TV sets/kits. At 30 November 2013, the confirmed outstanding amount from L to (M) is US$19,944,112.68. The payment of this amount is due as Appendix 2. L has open account limit from (M) in value of US$19 million. In order to enable shipments of further pending POs, the parties agreed upon the following: 1. Parties agreed to offset the mutual claims so that the debt from ME to L is offset against the debt of L to (M) monthly. 2. As such, the amount due from L to (M) of US$19,944,112.68 will be reduced by the amount due from ME to L of US$9,835,505.92 and the net due amount from L to (M) will become US$10,108,606.76.... 3. L will pay for the AR balance in time as AP clear off. ...” 10. The relationship is clearly explained in the recitals to the Guarantee. L had an open account limit of US$19 million, the effect of which was that M could not make further shipments to L if the limit was exceeded, and the parties’ agreement to sign the Guarantee was to reduce L’s debt to M by the set-off arrangement, such that further shipments of the Goods can be made. The appendices to the Guarantee set out the invoices and delivery notes issued by L for the Parts and by M for the Goods, and the amounts payable by ME and L respectively. 11. The Guarantee contains an arbitration clause, as clause 8 provides: “Any dispute shall be settled by amicable negotiations between 3 parties, in case any parties can not be reached ( sic ) amicable agreement, all disputes arising in connection with this contract shall be submitted to Hong Kong International Arbitration Centre, Rules and regulations of the Centre shall be applied. The awards of arbitration (s) shall be final and binding upon there ( sic ) parties.” 12. Similar set-off agreements were made and signed by the parties in January 2014 and April 2014, relating to the status of the parties’ accounts as at 15 January 2014 and 15 April 2014. Each of these Guarantees made on 15 January 2014 and April 2014 contain arbitration clauses substantially similar to clause 8 above. 13. Disputes arose between the parties sometime in May 2014, as to whether the Goods supplied by M complied with the standards required under the Master Agreement, whether payments were due and payable by L, and whether and how there should be a set-off of the invoices outstanding from L and ME respectively. The parties finally reached agreement on a set-off of US$4,103,760.83, and the MCSA dated 2 February 2015 was signed by L, M and ME in March 2015. 14. The MCSA provides as follows: “L is supplying components, predominantly panel/open cell parts to ME. At 31 December 2014, there is a confirmed amount outstanding from ME to L of US$4,103,760.83. Herewith the parties agreed to settle mutual claims as follows: 1. Parties agreed to offset the mutual claims so that the debt from ME to L is offset against the debt of L to (M). 2. As such the amount due from L to (M) will be reduced by the amount due from ME to L, the total amount is US$4,103,760.83. 3. Details of related invoices from L to ME are attached in Appendix 1. 4. If ME could not pay for its debt, this debt would be offset automatically by (M). 5. ME shall be released from the debt due to L upon the effective date of this agreement. 6. This agreement shall be governed by the laws of Hong Kong, excluding conflict of law rules and principles. 7. This agreement shall come into force upon the signing of all three parties. 8. In the event that any dispute between the parties arising out of or in connection with this agreement then any party shall refer such dispute to the Hong Kong International Arbitration Centre for arbitration in English under the arbitration rules of the Hong Kong International Arbitration Centre.” 15. In the NOA, M expressly referred to clause 8 of the MCSA as the relevant arbitration agreement, pursuant to which the Claim was referred to arbitration. 16. According to Mr X of L, by signing the MCSA, L only agreed to the arbitration clause being applied to the set-off of the sum of US$4,103,760.83, and never agreed that the arbitration clause would apply to the overall agreement for the sale and purchase of the Goods, which remains governed by the Master Agreement. L maintains that M’s Claim is made for the allegedly outstanding price of the Goods sold under the Master Agreement, and accordingly, the Claim does not fall within clause 8 of the MCSA, which is the arbitration agreement relied upon by M in the NOA. According to L, the Tribunal is wrong in its Award in finding that it had jurisdiction. 17. The parties do not dispute that the Court is to make a finding on the jurisdiction of the Tribunal on a de novo basis, and that the court has to be satisfied that the Tribunal was right on the question of its jurisdiction ( S Co v B Co [2014] 6 HKC 421 ). Nature of dispute 18. According to the NOA, the Claim is for L’s payment of the balance of the purchase price of the Goods sold and delivered by M to L during the period from January 2014 to April 2014, in the total sum of US$20,154,892.27 (“ Balance ”), after setting-off the sum of US$4,103,760.83 (the amount specified in the MCSA). 19. In determining whether there is a dispute, and the nature of the dispute between the parties, the Court should consider not just the Claim as can be seen from the NOA or the Statement of Claim, but should also look at the affidavit evidence filed by the parties, and the Points of Defence, if any is served, in order to consider the denials and issues raised, and any admission to the Claim made. It is only upon reviewing the Answer, Points of Defence, and any evidence filed on behalf of the respondent/defendant, that the issues of the claims which are in dispute can be understood, and identified. I therefore consider that it is relevant to consider the Defence and Counterclaim filed by L in the Arbitration on 17 June 2016, and grant leave to M (on its summons issued on 4 July 2016) to produce the Defence and Counterclaim as evidence. 20. In the Answer, L denies that the Goods were sold and delivered under the MOU, claiming that it was pursuant to the Master Agreement that the orders were placed and the Goods sold. In the Defence and Counterclaim which was served by L without prejudice to its challenge to the jurisdiction of the Tribunal, L claims that the Goods were defective, that M was in breach of a condition of the Master Agreement, and that L was entitled to refuse payment for the balance of the purchase price claimed for the Goods. By way of Counterclaim, L seeks payment of the amounts paid to M for the Goods over the years, including the amounts settled under the 3 Guarantees and the sum of US$4,103,760.83 settled or set-off under the MCSA. 21. Even if the Counterclaim is not to be considered (on the basis that it was served by L without prejudice, and would be pursued only if the Court finds that the Tribunal has jurisdiction over the Claim), it is clear from the NOA, the Answer and the evidence filed for the purpose of the challenge to jurisdiction that the Claim is clearly for payment of the price of the Goods sold and delivered by M to L, and that the dispute between the parties is whether L is liable for such payment, whether the Goods are defective as L claims, and whether L is liable for payment of the Balance. If the Counterclaim is to be pursued, the dispute raised by the Counterclaim is whether M is liable to refund the amounts paid by L for the Goods. 22. There is also dispute between the parties as to whether the Claim is properly made under the MOU, or whether the sale and purchase of the Goods is purely governed by the Master Agreement. According to L, there is no dispute between the parties under the MCSA, which does not relate to the Claim for payment sought by M. Is there an arbitration agreement? 23. Section 34 of the Ordinance applies Article 16 of the Model Law, which provides that the arbitral tribunal may rule on its jurisdiction. Under s 34 (2) of the Ordinance, the power of the Tribunal to rule on its own jurisdiction includes the power to decide what matters have been submitted to arbitration in accordance with the arbitration agreement. 24. “Arbitration agreement” is defined in Article 7 of the Model Law, which applies by virtue of s 19 (1) of the Ordinance. Under Option I of Article 7, “arbitration agreement” is an agreement by the parties to submit to arbitration all or certain disputes “which have arisen or which may arise” between them “in respect of a defined legal relationship”, whether contractual or not. An arbitration agreement may be in the form of an arbitration clause in the contract, or in the form of a separate agreement. The MCSA 25. In the NOA, M expressly refers to and relies on clause 8 of the MCSA for its reference of the Claim to the Tribunal. L suggests that this is the only clause to which the Tribunal and the Court should have regard, when determining whether the Tribunal has jurisdiction over the Claim. M disputes this, and argued that there is no need for a claimant to identify the specific arbitration clause relied upon in the NOA. According to M, the Court should consider the entire trading relationship between the parties which began in May 2013 and continued until April 2014, and bear in mind that in the course of the development of such relationship, the parties had entered into various agreements after the Master Agreement, including the MOU, the Guarantees of December 2013, January 2014 and April 2014, and finally, the MCSA, all of which contain arbitration clauses. The fact that such clauses were not identified in the NOA can be cured by amendment, and does not affect the substantive jurisdiction of the Tribunal, if there was in fact a valid arbitration agreement. 26. Dealing first with clause 8 of the MCSA, the terminology used is wide, covering “ any dispute between the parties arising out of or in connection with ” the MCSA. The words “arising out of or in connection with” are widely construed. In Tommy CP Sze & Co v Li & Fung (Trading) Limited [2003] 1 HKC 418 , Ma J (as the Chief Justice then was) stated : “Words like ‘in connection with’ or ‘connected therewith’ are wide in nature and will cover all disputes other than those entirely unrelated to the transaction covered by the contract in question: see Mustill & Boyd: Commercial Arbitration , at 119.” 27. Para 2-103 of Russell on Arbitration (24 th edition, 2015) states that “in connection with” may be sufficient to catch disputes arising under another contract related to the contract containing the arbitration clause. This was confirmed in UDL Contracting Ltd v Apple Daily Printing Ltd [2008] 2 HKC 534 . 28. The principles of construction of contracts are clear. Interpretation is the ascertainment of the meaning which the document would convey to a reasonable person having all the background knowledge which would reasonably have been available to the parties in the situation in which they were at the time of the contract. The contract is to be interpreted objectively. Hence, the law excludes from the admissible background the previous negotiations of the parties and their declarations of subjective intent (such as the declaration by Mr X). 29. On the face of the MCSA, L, M and ME agreed: (1) to offset their “mutual claims”; (2) that the debt due from ME to L (which the parties confirmed to be a sum of US$4,103,760.83 outstanding as at 31 December 2014) was to be offset against “the debt of L to M” (L has emphasized the fact that this debt of L was not quantified, and not expressly confirmed to be outstanding - to be contrasted with the amount outstanding from ME to L); (3) that the amount due from L to M would be reduced by the amount due from ME to L of US$4,103,760.83 (the annexure to the MCSA shows that the outstanding amount under the invoices issued to L was US$56,470.99 after set-off); (4) if ME could not pay its debt to L under the invoices, the debt “would be offset automatically by M”; and (5) M would be released from the debt due to L upon the effective date of the MCSA. 30. Against the background of the relevant dealings between the parties, there can be no doubt that any debt due from L to M (as referred to in the MCSA) can only be reference to the amount due from L to M for the Goods sold and delivered by M to L. L acknowledged, by the MCSA, that there was some (albeit unquantified) amount which was due from L to M, and this must be for Goods which had been sold and delivered to L before 31 December 2014, under the invoices set out in the annexure to the MCSA. There is no express admission of liability for the debt due, and the debt is not expressly quantified in the body of the MCSA, but that does not in my view detract from the MOU’s reference to and the acknowledgment of a debt due from L. Although there was a set-off and reduction of the said debt pursuant to the MCSA, as agreed, L now seeks in the Arbitration to dispute its liability to make payment for the Goods by reason of the defects in the Goods (and further seeks repayment by its Counterclaim of the price paid or set-off). This dispute clearly falls within the arbitration clause of the MCSA, as one which is in connection with the debt acknowledged by L to be due under, and hence in connection with matters covered by, the MCSA. Even if the amount fell due under the Master Agreement, as L maintains, the Claim cannot be said to be “entirely unrelated” to the MCSA. 31. The assertion made by Mr X, in the Arbitration and in these proceedings after dispute has arisen, that he had never intended clause 8 of the MCSA to extend to and cover the disputes arising under the Master Agreement, is self-serving, and in any event carries little if any weight in the objective construction of the MCSA and clause 8. The MOU 32. The NOA relies on clause 8 of the MCSA, but also refers to the MOU as the contract containing the terms of the sale and purchase of the Goods. The MOU likewise contains an arbitration clause, providing for “any dispute” between the parties “arising in connection with” the MOU to be referred to arbitration. 33. L denies that the MOU governs the agreement between L and M for the sale and purchase of the Goods. In its Answer to the NOA, L claims that the MOU only addressed the supply of the Parts by L to M. L also claims that the MOU was stated (in clause 11) to be subject to the parties’ negotiation and execution of formal contracts between them. 34. The MOU was made between L and M. ME was not a party. The recitals refer to L’s purchase from M, and M’s sale to L, of the “Products” set out in the MOU. There is no dispute that the only products sold by M to L are the Goods, and not the Parts - which were sold by ME to L. 35. The Parts were mentioned in clauses 2 to 5 of the MOU. These state that L would specify the standards, suppliers and requirements of the Parts which would be purchased by M, and that L would be liable for the Parts provided or specified by L. Clause 3 of the MOU expressly provides that L would sell the Parts to M “according to the agreement the parties separately agreed”. 36. Construed as a whole, the MOU relates to the sale and purchase of the Goods, as well as providing for L’s liability for the Parts provided and specified by it. 37. Although L argued that the MOU was subject to the parties’ negotiation of a formal contract, and that the MOU related to the sale and purchase of the Parts only, it is accepted by Mr X of L that M and L did not, after the date of the MOU, conclude any other formal contract for the sale and purchase of the Parts. It is however not in dispute that L had continued to supply Parts to ME, and that the parties had agreed to the arrangement for the mutual set-off of the amounts payable under the invoices for the Goods and those for the Parts. Clause 20 of the MOU also provides that the MOU shall come into force on signature by both L and M and shall continue in effect until the replacement of the MOU with a formal contract or further agreement. 38. The dispute as to whether M is entitled to the Balance for the Goods sold to L is clearly a dispute within the scope of the arbitration clause in the MOU, as a dispute which arises in connection with the MOU and M’s sale of the Goods - which are amongst the products set out in the MOU, if not the very subject matter of the MOU. 39. The fact that the terms of the sale and purchase of the Goods may be set out in a separate contract or document does not mean that the parties cannot rely on the arbitration agreement set out in the MOU (Art 7(1), Model Law). The identification of the arbitration agreement in the NOA 40. L argued that clause 21 of the MOU is not the arbitration agreement identified in the NOA, and accordingly, the Tribunal cannot assume jurisdiction over the Claim under or by virtue of clause 21 of the MOU. 41. I agree with Mr Manzoni SC, Leading Counsel for M, that so long as the Court is satisfied that there is a valid arbitration agreement between the parties, and that the Claim falls within the scope of the arbitration agreement, so as to confer jurisdiction on the Tribunal, M’s failure to identify clause 21 of the MOU in the NOA is at most an omission or defect in the arbitral procedure, which can be cured by amendment, and does not affect the substantive jurisdiction of the Tribunal. 42. L referred to the HKIAC Rules. Article 4.3 of these Rules provides for the matters required to be included in a notice of arbitration. They include a demand that the dispute be referred to arbitration, the names of the parties, a copy of the arbitration agreement invoked, a reference to the contract or other legal instruments out of or in relation to which the dispute arises, and a description of the general nature of the claim. 43. As Mr Manzoni highlighted, the NOA included copies of the MCSA and the MOU, both of which include the arbitration clauses. 44. Article 4.7 of the HKIAC Rules provides that if a notice of arbitration is incomplete, HKIAC may request the claimant to remedy the defect, and if the claimant fails to comply, the notice of arbitration shall be deemed not to have been validly submitted and the arbitration shall be deemed not to have commenced without prejudice to the claimant’s right to submit the same claim at a later date in a subsequent notice of arbitration. 45. Neither the Tribunal nor HKIAC in this case ever requested M to remedy any defect with regard to the NOA. There is no non-compliance on the basis of which the NOA can be said to be deemed not to have been validly submitted, for the arbitration to be deemed not to have been commenced. 46. I have not been referred to any other provision of either the HKIAC Rules or the Ordinance, nor to any authority, to support the contention that M’s failure to identify clause 21 of the MOU in the NOA as the arbitration agreement relied upon for the reference of the Claim to the Tribunal is a matter which affects the substantive jurisdiction of the Tribunal. The Tribunal’s jurisdiction is determined in law by the existence of an arbitration agreement, the construction of the scope of such agreement and the nature and scope of the dispute referred to arbitration. As Mr Manzoni pointed out, the requirement that the arbitration agreement must be included in the NOA in order to vest jurisdiction in the Tribunal is inconsistent with the fact that under the Ordinance, an arbitration agreement may arise after the arbitration is commenced. Under Article 7 (5) of the Model Law (incorporated by s 19 of the Ordinance), an arbitration agreement may be contained in an exchange of statements of claim and defence in which the existence of an agreement is alleged by one party, and not denied by the other. Such an arbitration agreement would not, and could not, have been identified in the notice of arbitration. 47. I therefore agree with Mr Manzoni that any question as to the defects in the NOA can be cured by amendment, do not affect the substantive jurisdiction of the Tribunal in respect of the Arbitration, and are procedural matters to be dealt with by the Tribunal within its jurisdiction. 48. In any event, in my judgment, the NOA identified clause 8 of the MCSA as the arbitration agreement relied upon, and the Claim is on construction within the scope of that arbitration clause. The absence of an arbitration clause in the Master Agreement 49. On behalf of L, it was also argued that in the construction of the MCSA and the MOU, and the arbitration clauses contained therein, due heed should be taken of the fact that the Master Agreement does not contain an arbitration clause, that the MOU and the MCSA which contain the arbitration clauses were entered into after the Master Agreement, and in particular, that at the time of the MCSA, there was already a dispute which had arisen between the parties. It was argued that the arbitration clauses in the agreements subsequent to the Master Agreement should be construed narrowly in the context, to apply only to matters that the parties clearly wanted to refer to arbitration. Referring to Francis Travel v Virgin Atlantic Airways (1996) 39 NSWLR 160 , 165 it was argued that wide construction of an arbitration agreement should apply only when parties agree, at the time of making the contract and before any disputes have arisen, to refer any dispute arising out of the agreement to arbitration. 50. First, I do not consider that there is merit in the argument that an arbitration agreement should be construed narrowly or more stringently just because at the time it was entered into, a dispute has already arisen between the parties. An arbitration agreement may, by definition under Article 7 of the Model Law, extend to disputes which have already arisen. The relevant clause in the MCSA is already in wide terms, covering “any dispute arising in connection with” the MCSA. I do not agree that there is much distinction between the language used in clause 8 of the MCSA and that found in the model clause recommended by the HKIAC. [1] 51. In the Award, the Tribunal relied on Lord Hoffman’s judgment in Fili Shipping Co Ltd and Others v Premium Nafta Products Ltd [2007] BUS LR 1719, in finding that the Claim falls within the arbitration clause set out in the MCSA. In Fili Shipping , Lord Hoffman referred to the construction of an arbitration clause “starting from the assumption that the parties, as rational businessmen, are likely to have intended any dispute arising out of the relationship in which they have entered or purported to enter to be decided by the same tribunal”. 52. In arguing that the Tribunal was wrong in its finding on jurisdiction, Mr Coleman SC for L submitted that there is no legal presumption in favor of arbitrability, which requires a party contending that a question is outside the scope of the arbitration to point to very clear language that this is so ( ACD Tridon v Tridon Australia [2002] NSWSC 896 ; and TCL Airconditioner (Zhongshan) Co Ltd v Castell Electronics Pty Ltd [2009] VSC 55 ). Reliance was placed on the decision of the English Court of Appeal in Trust Risk Group SpA v AmTrust Europe Limited [2015] EWCA Civ 437 , where Lord Justice Beatson referred to the scope of the Fiona Trust presumption (in Fiona Trust & Holding Corporation v Primalov [2007] 1 Lloyd’s Rep 254), and to Sebastian Holdings Inc v Deutsche Bank AG (No 2) [2011] 1 Lloyd’s Rep 106. At paragraph 48 of his judgment, Lord Justice Beatson observed: “The current (16 th ) addition of Dicey, Morris and Collins states (at para 12-110) that: ‘Where a complex financial or other commercial transaction is put in place by means of a number of interlinked contracts, and each has its own provision for the resolution of disputes, the point of departure will be that it is improbable that a jurisdiction clause in one contract, even expressed in ample terms, was intended to capture disputes more naturally seen as arising under a related contract... Even if the effect is that there will be a risk of fragmentation of the overall process for the resolution of disputes, this is not by itself sufficient to override the construction, and consequent giving effect to, the complex agreements for the resolution of disputes which the parties have made.’ In short, what is required is a careful and commercially-minded construction of the agreements providing for the resolution of disputes. This may include enquiring under which of a number of inter-related contractual agreements a dispute actually arises, and seeking to do so by locating its centre of gravity and thus which jurisdiction clause is ‘closer to the claim’. In determining the intention of the parties and construing the agreement, some weight may also be given to the fact that the terms are standard forms plainly drafted by one of the parties.” 53. Whether or not there is a legal presumption in favor of arbitrability and the “one-step”/“one jurisdiction” approach, I agree that it is a useful starting point in the construction of the agreements in question. The aim and the principles of interpretation of a commercial contract are to objectively ascertain the intention of the parties as reasonable commercial men at the time when they made the contract, giving the words they used their natural and ordinary meaning in the context of the agreement itself, the commercial purpose of the agreement, the parties’ relationship, and the relevant facts surrounding the commercial transaction so far as known to the parties. 54. Trust Risk and Sebastian Holdings concern cases in which there is a series of agreements, each of which has its own provision with differently expressed choices of jurisdiction and/or law and/or mode of dispute resolution. The court in Trust Risk highlighted (in paragraph 49 of the judgment of Lord Justice Beatson) the difference between a complex series of agreements about a single transaction or enabling particular types of transactions, and the situation in which there is a single contract creating a relationship which is followed by a later contract embodying a subsequent agreement about the relationship. It was pointed out that where the contracts are not “part of one package”, it may be easier to conclude that the parties chose to have different jurisdictions to deal with different aspects of the relationship. 55. In the present case, I cannot agree that the Master Agreement, the MOU, the MCSA and the Guarantees are different transactions entered into between L and M, to the extent that they are not “part of one package”. They are all related, and all concern M’s sale and supply to L of the Goods, being kits for assembly into television sets. The MOU relates to the same sale and purchase of the Goods, in addition to providing for L’s supply of the Parts as per its own specifications (as to the standards and suppliers) and on its own liability. As Mr Manzoni emphasized, the Guarantees and the MCSA are essentially to vary the method of payment for the Goods, from cash payment to the arrangement for set-off against the price payable by ME for the Parts, to enable shipment of the Goods and performance to continue under the Master Agreement. 56. Moreover, the Master Agreement is silent as to the mode of dispute resolution. It does not contain an express jurisdiction clause which is inconsistent with the arbitration clauses the parties agreed to incorporate into each of the agreements governing their relationship, from the time of the MOU in October 2013 to the MCSA in February 2015. This is distinguishable from cases in which there are different contracts with multiple forum clauses - which may be taken as an indication of the parties having expressed an intention not to have their disputes resolved by one and the same forum. 57. No authority has been cited to support the argument made on behalf of L that because the parties failed to include a forum clause in the Master Agreement, this is equivalent to the parties agreeing to submit their dispute to the courts. I agree with Mr Manzoni that the parties’ failure to nominate a court of a particular jurisdiction means only that the court of any state can assert jurisdiction, subject to their conflict of laws rules. The absence of a jurisdiction clause in an agreement, and the parties’ failure to provide for their submission to or confer jurisdiction on a particular court does not, by itself, demonstrate the intention of the parties that there should be different forums for the resolution of the disputes arising under their commercial relationship. 58. Having considered the overall relationship between L and M from the time of the Master Agreement, and the evolution of such agreement with the parties’ execution of the MOU in October 2013, the Guarantees in December 2013 and early 2014, and finally the MCSA in February 2015, and the fact (as emphasized by M) that the parties have consistently adopted an arbitration clause in each of the agreements since October 2013, I consider that in the context, the parties as reasonable businessmen must have intended at the time of the MOU and the MCSA that any dispute which may arise in connection with their agreement to sell and purchase the Goods and the Parts, including any dispute as to be amounts payable for the Goods and the Parts, should be resolved by arbitration, as provided for in clause 21 of the MOU, and clause 8 of the MCSA. In any event, the dispute as to L’s liability for payment of the Goods under the Master Agreement is certainly not unrelated to the transaction covered by either the MOU or the MCSA ( Getwick Engineers Limited v Pilecon Engineering Limited HCA 558/2002). Conclusion 59. For all the above reasons, I conclude that the Tribunal is correct in its finding that it has jurisdiction over the Claim made by M against L in the Arbitration. L’s application for the declaration sought is dismissed, with costs. I make an order nisi that the costs of the Originating Summons of 5 April 2016 (including the costs of M’s summons of 4 July 2016) are to be paid by L on an indemnity basis, with certificate for 2 counsel. (Mimmie Chan) Judge of the Court of First Instance High Court Mr Russell Coleman SC and Mr James Wood (Solicitor Advocate),instructed by Lipman Karas, for the plaintiff Mr Charles Manzoni SC and Mr Julian Lam, instructed by Baker & McKenzie, for the defendant [1] Mr Coleman placed emphasis on the words “disputes... or claims have arisen” in the model clause. On my reading of these words in their proper context, they only serve to invite parties to describe the contract under which the disputes have arisen. Look up this case on Lawcite Noteup",
  "length": 36587,
  "headers_seen": [
    "Introduction",
    "Background",
    "Nature of dispute",
    "Is there an arbitration agreement?",
    "The MCSA",
    "The MOU",
    "The identification of the arbitration agreement in the NOA",
    "The absence of an arbitration clause in the Master Agreement"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2016/1368",
  "query": "Model Law",
  "ts": "2025-10-16T10:53:34",
  "ok": true
}