{
  "title": "KARS AISA LIMITED V. RISHI KUMAR BHATNAGAR AND ANOTHER | [1988] HKCFI 258 | HKLII",
  "court": null,
  "year": 1988,
  "date": null,
  "content": "HKLII Databases Court of First Instance [1988] HKCFI 258 KARS AISA LIMITED V. RISHI KUMAR BHATNAGAR AND ANOTHER Judgment Information Date 25 May, 1988 Action No. HCA783/1988 Neutral Cit. [1988] HKCFI 258 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCA783/1988 HCA000783/1988 KARS AISA LIMITED v. RISHI KUMAR BHATNAGAR AND ANOTHER HCA000783/1988 1988 No. A783 IN THE HIGH COURT OF JUSTICE HONG KONG ----------------- BETWEEN KRAS ASIA LIMITED Plaintiff and RISHI KUMAR BHATNAGAR 1st Defendant POSSEHL HONG KONG PRECISION MACHINING LTD. 2nd Defendant -------------------- Coram: Hon. Jones J. in Chambers Dates of hearing: 10th and 11th May 1988 Date of handing down judgment: 26th May 1988 ----------------- JUDGMENT ----------------- 1. I have before me an application by the defendants to discharge an Anton Piller order made ex parte by Mayo J. in favour of the plaintiff on the 28th January 1988. 2. The plaintiff company was incorporated in Hong Kong in 1973 and is a subsidiary of Kras Corporation of Pennsylvania in the United States. The plaintiff designs, manufactures and sells precision manufacturing equipment for the semi-conductor industry. Moulds are designed and manufactured individually for each customer in accordance with information supplied by the customer on a 'Mold Information Sheet'. The plaintiff claims that this document has been prepared by its employees over a number of years and has been changed at various times to take into account developments in technology. There ate 28 different 'Mold Information Sheets' which are stored in the plaintiff's computer. 3. After all relevant information has been obtained from a customer, a proposal drawing is prepared for the customer's consideration by one of the plaintiff's draughtsmen. The latest versions of each form are stored on one computer disc and when a particular form is required, it is printed out using such disc. The 'Mold Information Sheet' is regarded by the plaintiff as a particularly important document for the running of the business. The plaintiff claims copyright in the 'Mold Information Sheet' and its proposal drawings. 4. The 1st defendant joined the plaintiff on the 6th April 1981 and was employed as a production manager until he resigned on the 15th June 1987 after giving four months' notice which expired on the 15th October 1987. At the time of his resignation, he was reminded by the plaintiff's managing director Mr Leet of the terms of two agreements that he had entered into at the time of his employment. The agreements were an employment agreement and a non-disclosure agreement. Particular attention was drawn to clauses 8 and 11 of the employment agreement which read as follows :- \"(8) The Employee shall not At any time during his employment hereunder (except so far as is necessary and proper in the course of his employment) or afterwards disclose to any person any information as to the practice business dealings or affairs of the Company or any of its customers or clients or as to any other matters which may come to his knowledge by reason of his employment. (11) Upon the termination of his employment by any cause or by any means whatsoever the Employee shall not for a period of twelve (12) months next thereafter undertake or carry on either alone or in partnership nor be employed or interested directly or indirectly in any capacity whatever in any business within the Colony of Hong Kong which shall be in direct competition with the business of the Company.\" It is conceded that the 2nd defendant is a direct competitor of the plaintiff so that the period prescribed under clause 11 of the employment agreement, if it is held to be valid, does not expire until October 1988. With regard to the non-disclosure agreement, particular reference was drawn to clauses 1 and 2 which read as follows :- \"1. During the period of employment with the Company and for a period of two (2) years thereafter, I will not use, or disclose to others, any of the Company's (and of its subsidiaries and related companies for whom I have performed services) inventions or its discoveries or its secret or confidential know-how, knowledge, processes, products, procedures, systems, programs, data information, including customer and prospective customer lists and information, which I may obtain, discover, learn of or develop during the course of my employment, whether developed by me or not, unless authorized or instructed so to do by the Company in writing. I recognize that in certain areas, the company has secret or confidential know-how, knowledge, processes, products, procedures, systems, programs, data information, including customer and prospective customer lists and information which it intends to maintain secret and confidential for as long as possible and I agree that with respect to such areas, which the Company has given or will give me written notice, I will not at any time, during or after the termination of my employment with the Company, use or disclose to others any such secret or confidential know-how, knowledge, processes, products, procedure, systems, programs, data information, including customer and prospective customer lists and information unless authorized or instructed so to do by the Company in writing. The obligation recited in the second sentence of this paragraph shall be superior to that recited in the first sentence of this paragraph. 2. I further agree that upon termination of employment with the Company all trade names, patents, copyrights, designs, drawings, work papers, engineering or other data, photograph samples, models, literature, records, books, teaching aids, sales aids and any and all papers or documents relating to know-how, knowledge, processes, products, procedure, systems, programs, data information, including customer and prospective customer lists and information being made, rendered, used or under development by the Company (or of any subsidiary or related company) shall remain or become the sole property of the Company alone and I shall immediately return or deliver to the Company the original and/or all copies of such items which are in my possession or under my care, custody or control. \" 5. In his affidavit of the 28th January 1988 in support of the application for the ex parte order Mr Leet states that he was informed on the 17th September 1987 by Ethel Hou, the plaintiff's assistant engineering manager, that she had received a telephone call from the 1st defendant asking whether she or other employees of the plaintiff would be prepared to do some mould design work for him. After obtaining legal advice the plaintiff engaged Commercial Trademark Services (Hong Kong) Ltd, a firm of private investigators who specialise in intellectural property rights to commence an investigation into the activities of the 1st defendant. Enquiries made by one of the firm's investigators revealed that the 1st defendant was employed by the 2nd defendant as a consultant. On the pretext that the investigator wanted to do business with the 2nd defendant, a number of meetings were held at the 2nd defendant's premises at which Mr H T Ho, the 2nd defendant's managing director was present while the 1st defendant was present on two occasions. After various discussions the investigator requested quotations for certain moulds and machinery. At the last meeting on the 30th November 1987, it is alleged that the 1st defendant showed to the investigator a 'Mold Information Sheet' which he invited the investigator to complete. The 1st defendant also gave a drawing ex. ALSY-14 to the investigator to show what the-finished mould would look like. Quotations were eventually submitted to the investigator by the 2nd defendant. 6. As a result of the investigations that were carried out, the plaintiff suspected that the 1st defendant had removed documents from the plaintiff's premises which he had copied and passed on to the 2nd defendant. The plaintiff contends that the Mold Information Sheet' given to the investigator had been substantially copied from the plaintiff's document, ex. JFL-4 and even has the same reference number. With regard to the drawing handed to the investigator, Mr Leet in his first affidavit in support of the ex parte application said that it was, without doubt, a copy of one of the plaintiff's proposal drawings. However, although the plaintiff keeps copies of its proposal drawings, a copy of the one in question could not be found. The plaintiff alleged that the 1st defendant should not have been in possession of copies of the plaintiff's 'Mold Information Sheet' or the proposal drawing nor should have allowed the 2nd defendant to have had access to them. Accordingly, the plaintiff contends that the 1st defendant was in breach of the employment and non-disclosure agreements and by reproducing the plaintiff's documents, had infringed its copyright. 7. Apart from the documents that have been referred to, the plaintiff also believes that other documents and records belonging to the plaintiff have been copied or removed or were removed from the plaintiff's premises before the 1st defendant left his employment. In those circumstances, the plaintiff was of the opinion that the full extent of the 1st defendant's unlawful activities would have been impossible to ascertain without obtaining an Anton Filler order, for if he had been placed on notice, he would have been likely to destroy or conceal the evidence of his acts which Mr Leet described as dishonest. Although the plaintiff did not consider that the 2nd defendant or those associated with the 2nd defendant other than the 1st defendant would attempt to destroy or conceal evidence and would comply with any order that the court might make, an order was sought because the relevant documents and records on the 2nd defendant's premises were in the charge of the 1st defendant and therefore it was likely that only the 1st defendant would know their whereabouts with the result that the 2nd defendant was obliged to rely upon the 1st defendant to identify them. 8. At the ex-parte hearing, the latest version of the plaintiff's 'Mold Information Sheet', was produced, ex. JFL-4, and was endorsed 'confidential'. However, in Mr Leet's second affidavit made on the 18th March 1988, he avers that it had never been alleged that the 'Mold Information Sheet' was a confidential document and that its availability and distribution was not a material consideration. I was only informed by Mr Garland who appeared for the plaintiff in his submission in reply that the document had been endorsed as 'confidential' by the plaintiff's solicitor. Exactly why this had been done was not satisfactorily explained, nor was there any affidavit from the plaintiff's solicitor dealing with this matter. 9. The endorsement on the writ of summons that the plaintiff through counsel undertook to issue after the hearing of the application for the ex-parte order included a claim for an injunction against the 1st defendant for acts done in breach of the two agreements and infringement of the plaintiff's copyright in its 'Mold Information Sheet' and proposal drawing. A claim for infringement of copyright was also made against the 2nd defendant. 10. Upon the evidence of the investigator and Mr Leet, Mayo J. made the order in favour of the plaintiff against both defendants. Mayo, J.'S order was executed on the 29th January 1988 at the 2nd defendant's premises in the presence, inter alia, of the plaintiff's solicitor Mr C.W. Britton. At the time of the execution of the order, Mr H.T. Ho of the 2nd defendant produced the original drawing from which ex. ALSY-14 had been copied together with three other original drawings in respect of the same mould. The 1st defendant informed Mr Britton that the drawings had been made by someone on behalf of the 2nd defendant and that a drawing fee of $3,000 had been paid to that person. Upon being questioned about the plaintiff's 'Mold Information Sheet', ex. ALSY-16, the 1st defendant told Mr Britton that this form was common and the plaintiff had given the form to all its customers. Mr Ho produced and handed to Mr Britton the original 'Mold Information Sheet' which had been printed out from one of the 2nd defendant's computers while Mr Britton also received at his request a computer print-out of the 'Mold Information Sheet' ex. CWB-4. 11. After he left the employment of the plaintiff, the 1st defendant signed a contract of employment with a West German company, Diacut (Hong Kong) Limited, but this contract was subsequently terminated. He then became a consultant with the 2nd defendant which is a company within the Possehl Group of companies. The original Possehl Company was formed in 1847 by Mr Ludwig Possehl in Lubeck, Germany, the company being named L. Possehl & Co. which was a sheet-metal and coal company. The or group today has in excess of 80 companies situated around the world. After the death of the founder, the company was transferred to the Possehl Foundation which is now the sole beneficiary of the company's assets. The charter of the Foundation states that the Foundation will devote its profits to the social and charitable aims for the City of Lubeck where Mr Possehl was born. 12. The 1st defendant denies that he has copied or removed any of the plaintiff's documents. He said that prior to the plaintiff using the 'Mold Information Sheet', it was substantially similar to ones being used by competitors of the plaintiff. However, he claimed that the 'Mold Information Sheet' on which the 2nd defendant based its own sheet had been received from a customer in India. He went on to say that the plaintiff's 'Mold Information Sheet' was widely distributed and would be available to the 2nd defendant without his intervention and had been created quite independently by the 2nd defendant. The 1st defendant also denied that he had been in breach of the employment and the non-disclosure agreements. 13. Mr Ho on behalf of the 2nd defendant denied that the 1st defendant had reproduced the plaintiff's computer disc upon which the engineering department forms of the plaintiff are stored. He said that the 'Mold Information Sheet' that was supplied to the investigator was received in about July 1987 and that at no time had the 1st defendant supplied the 2nd defendant with any of the plaintiff's documents and in particular the 'Mold Information Sheet'. However, he agreed that the 2nd defendant's sheet was derived through the plaintiff's sheet. Mr Ho denied that ex. ALSY-14 was copied from the plaintiff's proposal drawing while the drawing given to the investigator was not a drawing, of the mould alleged by the plaintiff. 14. There was other evidence before me upon the application to discharge, but it does not take the matter any further. That evidence contains a number of allegations by the deponents on each side which are in dispute. As this is an interlocutory application, I am not in a position to make any findings of fact on this evidence. Nevertheless, Mr Garland invited me to draw what can only be described as' adverse inferences against the 1st defendant, having regard to the fact that when he left his employment with the plaintiff, he entered into a contract of employment with Diacut in which there was a similar restrictive covenant imposed to that which appears in the plaintiff's employment agreement, not to carry on business of the same description in Hong Kong for one year after the agreement had been determined. Accordingly it was submitted that as the 1st defendant was conversant with such a restriction, his bona fides should be taken into consideration although Mr Garland was not prepared to allege that he had been dishonest despite the evidence of Mr Leet. However I am unable to accept this submission which was based upon disputed facts. Dishonesty has not in fact been pleaded by the plaintiff. 15. Since the writ was issued, the plaintiff has abandoned its claim in copyright in respect of the drawing. Mr Garland explained that the plaintiff has dope so because the drawing has been lost. Nevertheless, a party is not deprived from pursuing a claim in copyright for an original which has since been lost, see Lucas v Williams & Sons (l) . However, the main thrust of the plaintiff's action arises from the allegations of breach of the two agreements which it is accepted cannot be determined upon the present application. 16. When the matter came before me, both defendants wave an undertaking that it will refrain from reproducing in any form the plaintiff's 'Mold Information Sheet'. This undertaking was accepted but the plaintiff opposed the defendant's application to discharge the order. 17. Mr Rogers who appeared on behalf of the defendants submitted that the order made on the 28th January 1988 should be discharged on the grounds that there was material non-disclosure by the plaintiff in failing, to dray to the attention of Mayo J. that the 'Mold Information Sheet' was not confidential, and was made upon inadequate evidence by reason of the fact that there was no likelihood that the material alleged to be that of the plaintiff would be destroyed by either of the defendants. 18. It has been said on numerous occasions that an Anton Piller order provides a draconian remedy to be used when a dishonest defendant is likely to destroy or conceal evidence in order to defeat the ends of justice. Mr. Garland submitted that it was not appropriate to consider the application to discharge at the interlocutory stage if the only reason for the application was to enforce the cross-undertaking as to damages and that it should properly be stood over to be dealt with at the trial. In support of his submission, he cited Booker McConnell plc and Another v Plascow and Others (2) and Dormeuil Fréres SA and Another v Nicolian International (Textiles) Ltd. (3) . However those cases have no relevance where there has been a failure to disclose material facts within the knowledge of the plaintiff upon the, ex-party hearing when the order should not have been made. In fact in the Dormeuil case, the parties had agreed that some form of injunction was necessary which is not accepted in the instant case by the defendants. 19. Where a party seeks relief upon an ex-parte application, he must make a full disclosure of all material facts within his knowledge and if he fails to do so, the order will be discharged, see R. v The General Commissioners of Income Tax for Kensington (4) . Even if the failure to disclose such material facts arose as a result of an error of judgment and was not deliberate, the order must again be discharged without investigating its merits, see Thermax Limited v Schott Industrial Glass Limited (5) . 20. Mr Garland relies upon the evidence suggesting acts of dishonesty by the 1st defendant although he does not go so far as to allege actual dishonesty, and also upon the evidence of the breach of the agreements. As I have said the allegations relating to these matters cannot be dealt with at this stage. The only live issue that remains is the 'Mold Information Sheet' for reliance is no longer placed upon the drawing. 21. It is clear from the denials of the defendants and the fact that the 'Mold Information Sheet' was not a confidential document it could quite easily have come into the possession of the 2nd defendant from a source other than the 1st defendant. There is the defendants' evidence that it could have been supplied by a customer in India. It is evident that the document, although mistakenly described as confidential, was not confidential to the plaintiff and that this was a material fact that was not disclosed to Mayo, J. It was obviously a matter that would have weighed heavily when he came to make his decision. Again Mr Leet's affidavit in support lacked candour when he emphatically stated that the proposal drawing that was produced by the 1st defendant was one of the plaintiff's drawings. Further, apart from an assertion that the plaintiff believed that the 1st defendant might destroy the evidence, there was no evidence placed before the court to justify such an assertion. No such assertion was made against the 2nd defendant whom the plaintiff believes would have co-operated with the plaintiff and have obeyed any order made by the court. The reasons given by the plaintiff that the order was necessary against the 2nd defendant because the 1st defendant was in effect in control of those documents was toally unwarranted and misconceived. There was no evidence to justify such an order being made against the 2nd defendant. 22. With regard to the 1st defendant, there was clearly a material non-disclosure by the plaintiff that the 'Mold Information Sheet' was not confidential while there was a failure to disclose the fact that the source of the 2nd defendant's possession of this document need not necessarily have been the 1st defendant. Further there was no evidence to support the plaintiff's assertion that there was a grave danger that the evidence might be destroyed. The plaintiff's conduct leading to the making of the order was an abuse based upon material non-disclosure and inadequate evidence. Upon these grounds it is quite clear that the order should never have been made. The order of Mayo J. will therefore be discharged. (B.L. Jones) Judge of the High Court (1) (1892) 2 Q.B. 113. (2) [1985] R.P.C. 425. (3) The Times 5th May 1988. (4) [1917] 1 K.B. 486. (5) [1981] F.S.R. 289 . Representation: Mr P. Garland (Deacons) for the Plaintiff. Mr A.G. Rogers, Q.C. and Mr A Poulter (Fairbairn, Catley, Low & Wong) for the Defendants. Look up this case on Lawcite Noteup",
  "length": 21702,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/1988/258",
  "query": "non-disclosure agreement",
  "ts": "2025-10-17T10:45:15",
  "ok": true
}