{
  "title": "FUBON BANK (HONG KONG) LTD V. NG WAI KONG | [2021] HKCFI 1558 | HKLII",
  "court": null,
  "year": 2021,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2021] HKCFI 1558 FUBON BANK (HONG KONG) LTD V. NG WAI KONG Judgment Information Date 31 May, 2021 Action No. HCMP1238/2020 Neutral Cit. [2021] HKCFI 1558 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCMP1238/2020 HCMP1238/2020 FUBON BANK (HONG KONG) LTD v. NG WAI KONG HCMP 1238/2020 [2021] HKCFI 1558 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE MISCELLANEOUS PROCEEDINGS NO 1238 OF 2020 ____________ IN THE MATTER of All That piece or parcel of ground registered in the Land Registry as SECTION A OF LOT NO.1610 IN DEMARCATION DISTRICT NO.123 Together with any building or buildings erected thereon now known as No.22 Ng Uk Tsuen, Ping Shan, Yuen Long, New Territories, Hong Kong and IN THE MATTER of a Legal Charge dated 6 th September 2018 and registered in the Land Registry by Memorial No. 18092600780036 and IN THE MATTER of Order 88 of the Rules of the High Court , Cap 4A ____________ BETWEEN FUBON BANK (HONG KONG) LIMITED Plaintiff and NG WAI KONG (吳偉江) Defendant ____________ Before: Hon Au-Yeung J in Chambers Closing Date for Written Submission: 31 May 2021 Date of Decision: 1 June 2021 _____________ D E C I S I O N _____________ Introduction 1. The Plaintiff is the 1 st Legal Chargee of the Defendant’s property known as No 22 Ng Uk Tsuen, Ping Shan, Yuen Long, New Territories situated at Section A of Lot No 1610 in DD 123 (“ the Property ”) in respect of all moneys of the general banking facilities granted by the Plaintiff to the Defendant. 2. Konew Capital Investment Limited (“ Konew ”) is the 2 nd Legal Chargee of the Property in respect of general credit facilities granted by Konew to the Defendant to the extent of HK$2 million. 3. It is indisputable that the 1 st Legal Charge was created and registered well before the 2 nd Legal Charge, and hence has priority over the latter. 4. The Defendant defaulted in his payment obligation under the 1 st Legal Charge. As a result, on 17 August 2020, the Plaintiff commenced the present Order 88 application for a money judgment and a possession order in respect of the Property. 5. Two days later, on 19 August 2020, Konew commenced its Order 88 application in respect of the 2 nd Legal Charge in the District Court in DCMP 2658/2020 for a money judgment and a possession order in respect of the Property. 6. On 3 February 2021, Master Jacqueline Lee of the District Court granted a money judgment and an order for possession under the 2 nd Legal Charge in favour of Konew in DCMP 2658/2020. 7. On 12 March 2021, the Plaintiff’s present Order 88 application was heard by Master SH Lee. The learned Master was aware that Master Jacqueline Lee had already granted an order for possession in favour of Konew, and took the view that the 1 st Legal Chargee could simply wait for the 2 nd Legal Chargee to take action to realise the Property and pay the 1 st Legal Chargee the outstanding indebtedness due to and secured by the 1 st Legal Charge. As a result, Master SH Lee granted a money judgment but adjourned the Plaintiff’s application for possession order sine die with liberty to restore (“ the Master’s Order ”). 8. On 23 March 2021, the Plaintiff filed a notice of appeal to appeal against the Master’s Order. Legal principles 9. An appeal under Order 58 RHC is a rehearing of the application which led to the order under appeal, and the judge treats the matter as though it came before him/her for the first time. The judge will of course give the weight it deserves to the previous decision of the master, but he/she is in no way bound by it. See Hong Kong Civil Procedure 2021, Volume 1, 58/1/2. 10. The ordinary rule at common law is that where the whole of the sum advanced became due, a mortgagee is entitled as of right to an order for possession of the mortgaged premises (unless the mortgage deed provides otherwise). The court has no jurisdiction to decline the order or to adjourn an application for possession, with the exception of an adjournment for a short time to afford to the mortgagor a chance of paying off the mortgage in full, but this should not be done if there is no reasonable prospect of such payment occurring. See Chekiang First Bank Ltd v Ko Hoi Luen & anor [1999] 3 HKLRD 360 , at 362G-H, following Birmingham Citizens Permanent Building Society v Caunt [1962] 1 Ch 883 , at 912. 11. The court has jurisdiction to make a possession order in favour of a second mortgagee even though a first mortgagee may already have taken possession: Universal Showcards & Display Manufacturing Ltd v Brunt (1984) 128 SJ 581, CA. However, the order must be made subject to the rights of the first mortgagee, and to the rights of any other person deriving title from the first mortgagee: Berkshire Capital Funding Ltd v Street [1999] 25 EG 191, CA. See Emmet and Farrand on Title , (19 th ed), §25.142. 12. The rationale, as stated in Universal Showcards is as follows: “The learned Judge held that, because the Abbey National Building Society were in possession of the house, he had no jurisdiction to make such an order, and indeed said that he regarded the claim as being totally misconceived. In my opinion the learned Judge was in error in coming to that conclusion. The plaintiffs were mortgagees; the Abbey National Building Society were in possession but by the time of the judgment, the defendants might have paid off the Abbey National Building Society, or the Society might have gone out of possession for some other reason. But even if they were still in possession, it might have been open to the learned Judge to give judgment to the plaintiffs, against the defendants for possession – subject to the rights of prior mortgagees.” 13. A first or prior mortgagee must all the more be entitled to an order for possession notwithstanding that a second mortgagee has already taken possession on the strength of an order for possession. Application of the legal principles 14. Clause 6 of the 1 st Legal Charge provides that if the Defendant defaults in payment, the Plaintiff may without consent of the Defendant enter into, take possession of and even sell the Property. 15. Applying the legal principles: (1) The Plaintiff is entitled to an order for possession. (2) Even if Konew has been granted an order for possession of the Property, the Plaintiff’s entitlement to an order for possession is in no way undermined. (3) The Plaintiff as the 1 st Legal Chargee, being the prior encumbrancer whose interest in the land ranks in priority over that of Konew (being the 2 nd Legal Chargee), has priority to enforce its possession order of the Property over Konew. (4) As of the date of this Decision, Konew has not yet entered into possession. 16. Without the possession order, the Plaintiff will not be able to exercise its right to sell the Property, and will be entirely dependent on the action of Konew, notwithstanding that the Plaintiff ranks in priority over Konew. 17. There is no evidence of a reasonable prospect of the Defendant paying off the 1 st Legal Charge in full. 18. The learned Master ought to have made a possession order instead of adjourning the application for possession sine die . Conclusion 19. In the premises, the appeal should be allowed. I make an order as follows: (1) The Master’s Order to adjourn the application for possession order sine die be set aside; (2) The Defendant do within 28 days after service upon him of this Order deliver to the Plaintiff vacant possession of the property comprised in the Legal Charge and known as “ALL THAT piece or parcel of ground registered in the Land Registry as SECTION A OF LOT NO.1610 IN DEMARCATION DISTRICT NO.123 Together with any building or buildings erected thereon now known as No.22 Ng Uk Tsuen, Ping Shan, Yuen Long, New Territories, Hong Kong” which has been charged by the Defendant to the Plaintiff by way of the Legal Charge dated 6 September 2018; (3) Costs of this appeal be to the Plaintiff, to be summarily assessed on solicitor and own client basis; and (4) There shall be summary assessment of costs on the papers on 15 June 2021. The Plaintiff do lodge and serve its costs statement within 2 days, and the Defendant do lodge and serve his grounds of objection 7 days thereafter. 20. I thank Mr Aidan Tam for his assistance. (Queeny Au-Yeung) Judge of the Court of First Instance High Court Written submission by Mr Aidan Tam, instructed by Tim Chan & Co, for the Plaintiff Attendance of Tim Chan & Co was excused The Defendant was not represented and did not appear Look up this case on Lawcite Noteup",
  "length": 8622,
  "headers_seen": [
    "Introduction",
    "Legal principles",
    "Application of the legal principles",
    "Conclusion"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2021/1558",
  "query": "possession order",
  "ts": "2025-10-17T10:41:35",
  "ok": true
}