{
  "title": "G V. P | [2023] HKCFI 2173 | HKLII",
  "court": null,
  "year": 2023,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2023] HKCFI 2173 G V. P Judgment Information Date 22 Aug, 2023 Action No. HCCT110/2022 Neutral Cit. [2023] HKCFI 2173 Parallel Cit. [2023] 4 HKLRD 563 [2023] 6 HKC 518 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCCT110/2022 HCCT110/2022 G v. P HCCT 110/2022 [2023] HKCFI 2173 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO 110 OF 2022 ____________________ IN THE MATTER of a Final Award dated 28 th November 2022 made by the Hong Kong Arbitration Society and IN THE MATTER of Section 84 of the Arbitration Ordinance ( Cap 609 ) and IN THE MATTER of Order 73 Rule 10 of the Rules of the High Court ( Cap 4A ) ____________________ BETWEEN G Applicant and P Respondent ____________________ Before: Hon Mimmie Chan J in Chambers Date of Hearing: 7 August 2023 Date of Decision: 23 August 2023 _____________ D E C I S I O N _____________ 1. This is the application made by the Respondent to set aside the order made by this Court on 2 December 2022 (“ Enforcement Order ”), granting leave to the Applicant to enforce an arbitral award made on 28 November 2022 in Case No HOA-2188/2022 (“ Arbitration ”) of the Hong Kong Arbitration Society (“ Award ”). The grounds for setting aside were not specified in the Respondent’s Summons, but the grounds stated in the Respondent’s affirmation filed on the same day of the Summons are that: there was no valid arbitration agreement between the Applicant and the Respondent; and the Respondent was not given the reasonable opportunity to present arguments in the Arbitration. 2. As this Court held in KB v S HCCT 13/2015, 15 September 2015, it is an abuse of process to issue a summons to set aside an order granting leave to enforce an arbitral award if the grounds for setting aside are not properly set out and disclosed in the summons. The Arbitration Ordinance (“ Ordinance ”) clearly sets out as its object and underlying principles the facilitation of the fair and speedy resolution of disputes by arbitration without unnecessary expense, and provides that the Court should interfere in the arbitration of the dispute only as expressly provided for in the Ordinance. The Court has emphasized that it is not conducive to such objectives and the pro-arbitration policy to require parties and the Court to waste time and costs in speculating on the precise grounds which are relied upon by an applicant to set aside either an arbitral award, or an order granted by the Court to enforce the award as a judgment of the Court. Parties should not expect the Court to be indulgent towards applicants who fail to clearly state in the summons the precise grounds of the Ordinance which are relied upon. It is not for a party to raise grounds only at the hearing. 3. In the Submissions filed for the hearing of the setting aside application, the Respondent’s Counsel stated that the application is for setting aside both the Award and the Enforcement Order, on the grounds set out in the Respondent’s affirmation. However, since more than 3 months have elapsed from the date of receipt of the Award, the application is clearly out of time and is impermissible (Article 34(3) of the Model Law, given effect by section 81 of the Ordinance). The purported application to set aside the Award will not be considered in this Decision. 4. Having heard the parties’ submissions, the application to set aside the Enforcement Order is allowed, for the reasons set out below. Factual background 5. The Applicant is a licensed moneylender in Hong Kong. On 8 September 2022, the Applicant as lender and the Respondent as borrower entered into two agreements, a Loan Agreement and a Supplemental Loan Agreement (“ Supplemental Agreement ”), on essentially the same terms so far as the loan advanced and the repayment terms are concerned. I have not been drawn to any differences in these respects. The only revision set out in the Supplemental Agreement relates to the manner of resolution of disputes arising out of or in connection with the loan. Clause 1 of the Supplemental Agreement states: “Any dispute or difference arising out of or in connection with the Loan Agreement and this Supplemental Loan Agreement shall, at the option of the Claimant (or the Plaintiff, as may be applicable), be referred to and finally resolved by arbitration administrated by the Hong Kong Arbitration Society and in accordance with the HKAS Online Arbitration Rules for the time being in force or by court proceedings in Hong Kong courts. 凡因借款合約及本補充貸款合約所引起的或與之相關的任何爭議或意見分歧，均應由申請人(或原告人，視何者適用而定)選擇提交香港仲裁公會按其現行有效的香港仲裁公會網上仲裁規則進行仲裁，或提交香港法庭進行法院程序，最終解決。” 6. The terms and conditions of the Loan Agreement state Hong Kong law to be the governing law and that the parties “irrevocably submit to the non-exclusive jurisdiction of the courts of Hong Kong”. 7. Clause 3 of the Supplemental Agreement provides as follows: “In the event of any discrepancy or inconsistency between the terms of Loan Agreement and this Supplemental Loan Agreement, the terms of this Supplemental Loan Agreement shall prevail. 借款合約的條款與本補充貸款合約不符或不一致的，以本補充貸款合約的條款為准。” 8. Apart from dispute resolution, the Supplemental Agreement also states, for the Respondent as borrower, his residential address as well as an email address of xyz@china.hk. The Loan Agreement only stated the Respondent’s residential address. Absence of valid arbitration agreement ground 9. The Respondent argued that the dispute resolution clause contained in the Supplemental Agreement is not an arbitration agreement, as there is no element of compulsion of the parties to arbitrate, and that without compulsion, there is no valid arbitration agreement. The Respondent relies on the observation made by Ma J (as His Lordship then was) in Tommy CP Sze & Co v Li & Fung (Trading) Ltd [2003] 1 HKC 418 . Tommy CP Sze ’s case dealt with an application for stay of proceedings under the repealed Arbitration Ordinance Cap 341 , and His Lordship stated at paragraph 18 of the judgment: “It is of course crucial in any application for a stay (whether under s 6 of the Ordinance or art 8 of the Model Law) that there exists an arbitration agreement. By this is meant an agreement between the parties by which present or future disputes or differences between them are required to be resolved by the arbitral process. … An agreement which does not compel parties to have disputes or differences resolved by agreement is not an arbitration agreement for present purposes. Where, for example, an option is given to the parties to go to arbitration if they so choose but with litigation in the courts being an available option as well, this is not truly an arbitration agreement. There must be its element of compulsion in the agreement between the parties that any disputes or differences must be arbitration.” 10. The courts have interpreted an optional arbitration agreement differently in cases such as China State Construction Engineering Corporation Guangdong Branch v Madiford Limited HCA 6563/1991, 2 March 1992, William Company v Chu Kong Agency Co Ltd [1995] 2 HKLRD 139 , Hermes One Ltd v Everbread Holdings Ltd [2016] 1 WLR 4098 , Polytek Overseas Ltd v Grand Dragon International Holdings Co Ltd [2017] 3 HKLRD 258 , Z v Y [2018] HKCFI 2342 , and Kinli Civil Engineering Ltd v Geotech Engineering Ltd [2021] 6 HKC 524 . In Kinli , I set out various authorities considered and argued on clauses which give an option or a choice to the parties between arbitration and litigation. I am not persuaded that the reasoning and analysis of the cases referred to in Kinli , and in particular the finding of the existence of an arbitration agreement even when the clause adopts language such as “may” or “can” (as held in China State, Hermes One and Guangdong Agriculture Co Ltd v Conagra International (Far East) Ltd [1993] 1 HKLR 113 ), do not apply by virtue only of the observation made in Tommy CP Sze as to clauses which do not provide for an element of compulsion. Cases may turn on the different terminology used in the contract, and the contract construed as a whole. At the end of the day, the ultimate question is one of construction of the clause in question, to ascertain the objective intention of the parties at the time of entering into the contract. 11. Even in the more recent case of Aiteo Eastern E & P Co Ltd v Shell Western Supply and Trading Ltd [2022] EWHC 2912 (Comm); [2023] 1 Lloyd’s Rep 1, the English Court continued to follow Hermes One Ltd and found that once an option to arbitrate conferred on a party had been exercised, the other party was bound to arbitrate. 12. In this case, if the dispute resolution clause in the Supplemental Agreement confers an option to litigate, such an option is conferred only on the lender, i.e. the Applicant, and not on the Respondent as borrower. As such, when the Applicant exercised its option and chose arbitration as the method of dispute resolution, in this case by commencing the Arbitration, the Respondent is bound by the Applicant’s choice, an arbitration agreement came into existence and the Respondent is compelled to follow the option conferred on and chosen by the Applicant. On an objective reading of the dispute resolution clause in question, there is no option at all conferred on the Respondent. 13. In my judgment, the Supplemental Agreement contains an arbitration agreement which replaced the dispute resolution clause in the Loan Agreement. Such arbitration agreement is valid and binding on the Respondent, and confers jurisdiction on the tribunal. Inability to present case ground 14. Counsel for the Applicant pointed out that in his affirmation filed in support of the setting aside application, the Respondent only claimed that he was unable to present his arguments in the Arbitration, and this should be a reference to the ground set out in section 86(1)(c)(ii) of the Ordinance, namely, alleged inability to present his case. Counsel highlighted the fact that the Respondent never disclosed, either in the Summons or in his affirmation in support thereof, that he relies on the ground set out in section 86(1)(c)(i) of the Ordinance, that he was not given proper notice of the appointment of the arbitrator or of the arbitral proceedings. 15. If the Respondent was given proper notice of the commencement of the Arbitration or of the appointment of the arbitrator, but consciously decided against participating in the Arbitration or to present his case to the arbitrator by way of arguments and evidence, or to seek a hearing, he cannot thereafter complain of any inability to present his case, which was entirely due to his own fault. The Respondent did not serve any Defence in the Arbitration, and the Arbitration proceeded without the Respondent’s participation. 16. The core issue and determining factor is therefore whether the Respondent had been given proper notice of the Arbitration, and if he can rely on section 86(1)(c)(i) of the Ordinance as a ground to set aside the Award. In dealing with a case on section 86(1)(c)(ii), the Court must consider and the Applicant would have to meet and be prepared to deal with the essential issue of the Respondent’s notice of the Arbitration. Before the Respondent can participate in the Arbitration, to present evidence and arguments, he must first have been given proper and valid notice of the Arbitration. The Applicant must first establish the fact of valid service of the Notice of Arbitration in this case, before dealing with the Respondent’s claim that he did not have the reasonable opportunity to present his case. I therefore cannot see any prejudice to the Applicant, to permit the Respondent to argue whether section 86(1)(c)(i) applies. The lack of notice ground 17. For the reason set out in paragraph 16 above, and on the basis that the underlying objective of the Court is the resolution of disputes in accordance with the parties’ substantive legal rights (Order 1A rule 2(2) RHC), I am prepared to deal with the setting aside application on the basis that the Respondent’s claim in the affirmation, of inability to present his arguments, is made on the basis of and consequent upon his lack of notice of the commencement of the Arbitration. 18. Needless to say, a Notice of Arbitration is the document initiating the Arbitration and is an important document affecting the rights of the Respondent. It is the equivalent of a Writ of Summons in court proceedings, and service thereof is an important step to bring notice of the claims made to the defendant/respondent. 19. The Applicant relies on the fact that notice of the commencement of the Arbitration was served on the Respondent at the email address specified in the Supplemental Agreement. The Applicant relies on the fact that the arbitration clause set out in the Supplemental Agreement states that the Arbitration is to be administered by the Hong Kong Arbitration Society, and in accordance with the HKAS Online Arbitration Rules in force (“ Online Rules ”). According to the Applicant, service of the notice of the Arbitration at the Respondent’s email address stated in the Supplemental Loan Agreement is deemed by Article 2.1 of the Online Rules to have been properly received by the Respondent. 20. Article 2.1 of the Online Rules provides as follows: “2.1 Any notice or other written communication or other arbitration documents (including, amongst others, Arbitration Notice, Response and Award) pursuant to these Rules shall be deemed to be received by a Party or Arbitral Tribunal or by Hong Kong Arbitration Society if: (a) transmitted by methods of electronic service including, amongst others, e-mail, SMS message, electronic message, online arbitration platform message, facsimile, electronic data interchange, electronically via the internet or any other means of telecommunication that provides a record of its transmission, including the time and date, to: (i) the email address or mobile telephone number of the recipient or its representative of which the recipient confirm upon participating the online arbitration proceedings of Hong Kong Arbitration Society (if the electronic delivery address confirmed by the recipient differs from the electronic delivery address mentioned in (ii) and (iii), the electronic delivery address confirmed in the this article shall prevail.); or group message in the online arbitration platform if the recipient is notified the log in account number and password of the online arbitration platform. (ii) in the absence of (i), e-mail , mobile number, account number of instant communication software or social media (including, amongst others, WeChat, Line, Facebook) or facsimile number (or equivalent) specified in any applicable arbitration agreement or any agreement or filled in or used during the registration or transaction of the website under the transaction of the contract; or (iii) in the absence of (i) and (ii), to any e-mail , mobile number, account number of instant communication software or social media (including, amongst others, WeChat, Line, Facebook) or facsimile number (or equivalent) which the recipient holds out to the world at the time of such transmission. (b) in the absence of (a), delivered by hand, post or courier service or in accordance to the offline provision of the relevant arbitration rules to: (i) the address of the recipient or its representative as notified in writing in the arbitration or through online arbitration platform; or (ii) in the absence of (i), to the address specified in applicable arbitration agreement or any agreement between the relevant Parties; or (iii) in the absence of (i) or (ii), to any address which the recipient holds out to the world at the time of such delivery; or (iv) in the absence of (i), (ii) or (iii), to any last known address of the recipient; or delivered the notification by hand, post or courier service or in accordance to the offline provision of the relevant arbitration rules to notify the log in account number and password of the online arbitration platform specified to the recipient during the online arbitration proceedings of Hong Kong Arbitration Society. Hong Kong Arbitration Society may also refer the case to offline proceedings in accordance with the provisions of Article 1.5 hereof.” (Emphases added) 21. On the evidence, the only email address of the Respondent is the one which is stated or given in the Supplemental Agreement, namely: xyz@china.hk. 22. The only evidence on service of the Notice of Arbitration is in the Award itself. The Award states, at paragraph 11, as follows: “ 仲裁通知書於2022年11月7日 以電郵傳送 至答辯人於 貸款申請書中列明 的聯繫方式，即 電郵地址 XYZ@CHINAT.HK，供答辯人以用戶名稱及密碼到網上仲裁平台接收。” (The Notice of Arbitration had on 7 November 2022 been transmitted by email to the mode of contact set out in the application for loan, namely email address XYZ@CHINAT.HK, to provide the Respondent with the user name and password to accept on the online platform.) 23. There is no other evidence adduced by the Applicant, as to how, or when, Notice of Arbitration was served on the Respondent. 24. Neither the Applicant nor the Respondent has adduced in evidence the application for loan which is referred to at paragraph 11 of the Award. The only evidence of any email furnished by the Respondent to the Applicant is that stated in the Supplemental Agreement, and at paragraph 21 above. That email address is different to the one referred to at paragraph 11 of the Award (“ Para 11 Address ”). 25. Article 2.1 of the Online Rules, and the deeming provisions therein contained, as relied upon by the Applicant, cannot apply and do not come into operation at all, when the Notice of Arbitration was not transmitted to the email address “specified in the applicable arbitration agreement”. 26. Since the Respondent did not participate in the Arbitration, there is no evidence of the Para 11 Address having been specified or confirmed by the Respondent, upon his participation in the Arbitration (for Article 2.1(a)(i) to apply). There is no evidence from the Applicant, as to what email was “filled in or used during the registration or transaction of the website under the transaction of the contract” (for Article 2.1(a)(ii) to apply). Nor is there any evidence to support any possible claim that the Para 11 Address (rather than the email address stated in the Supplemental Agreement) is the email which was held out by the Respondent to the world as his email, at the time of the transmission of the Notice of Arbitration. There is no claim, and no evidence, that the Para 11 Address had ever been held out, and how it was so held out by the Respondent. 27. An application to the Court for enforcement of an arbitral award is made ex parte , under section 84(1) of the Ordinance and Order 73 rule 10(3) RHC. The Ordinance only requires that the applicant adduces evidence of the duly authenticated original or a duly certified copy of the award, and the original arbitration agreement or a duly certified copy of it, and Order 73 rule 10(3) sets out the particulars required to be stated for the Court. The application for enforcement is dealt with “mechanistically” ( Re PetroChina International (HK) Corp Ltd [2011] 4 HKLRD 604 , at paras 12-13), and the Court does not examine whether the arbitration agreement or the award is valid. However, when leave is granted to enforce the award on such ex parte application, leave is at the same time granted to the respondent to apply to set aside the order granting leave. It is then for the respondent to prove that one or more of the grounds set out in section 86 of the Ordinance applies, and it is at this stage that the award will be scrutinized by the Court, to see if enforcement of the award may be refused. 28. Despite the pro-arbitration approach, an arbitral award is recognized and enforced by the Court only if the award and the arbitral process leading to the award is structurally intact and there is due and fair process. The solemnity afforded to the award by the Court’s recognition and enforcement cannot be justified, if the award is shown on its own face to be irregular, and contradictory to the terms of the arbitration agreement. The Court cannot enforce any haphazard document as a judgment or order of the Court. Nor should the credibility and integrity of the arbitration process be compromised by the enforcement of an award which cannot stand on its face. Care must therefore be taken by an applicant, to ensure that the documents (including the award in question) presented to the Court in support of an application to enforce the award are all correct, and in order, for enforcement of the award to be allowed by the Court. 29. In this case, the Court cannot turn a blind eye to the fact that the Award on its face refers to notice of the Arbitration having been served at an address or by a mode of service which is different to that stated for the Respondent in the Supplemental Agreement, which is the contract stated to be enforced by the Award. The contents of paragraph 11 of the Award must be taken to be correct and accurate. If it had contained any typographical error, it would have been corrected by the tribunal, on its own accord or on the application of the Applicant, but there has been no amendment of the Award in this case. As I have held, the deeming provision cannot be invoked at all in this case, when the Notice was not sent to the correct email address as is apparent from the Supplemental Agreement. 30. In any event, any deeming provision, if it applies, can be rebutted. In an application made under section 86 of the Ordinance, it is for the Respondent to prove that section 86(1)(c) is made out. In this case, although there is no statement by the Respondent that he did not receive the Notice, he has referred to the obvious discrepancy between the email address stated in the Supplemental Agreement, and the different email address stated at paragraph 11 of the Award where the Notice was said to have been served. 31. On the evidence, I can only find that there was no valid service of the Notice of Arbitration on the Respondent. Not having been properly served with notice of the commencement of the Arbitration, the Respondent had not been given notice of the Arbitration, or of the claims made against him, and consequently was not given the opportunity to present his case before the Award was made against him. Accordingly, he is entitled to rely on the grounds set out in section 86(1)(c)(i) and (ii) of the Ordinance, to set aside the Enforcement Order. Disposition 32. It follows from my findings that the costs of and incidental to the Summons for setting aside are to be paid by the Applicant to the Respondent, on indemnity basis, with certificate for Counsel, and an order nisi is made to such effect. (Mimmie Chan) Judge of the Court of First Instance High Court Ms Sabrina Leung, instructed by Yip & Co, for the applicant Mr Simon So and Mr Herman Ho, instructed by Lim & Lok, for the respondent Look up this case on Lawcite Noteup",
  "length": 23124,
  "headers_seen": [
    "Factual background",
    "Absence of valid arbitration agreement ground",
    "Inability to present case ground",
    "The lack of notice ground",
    "Disposition"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2023/2173",
  "query": "arbitration",
  "ts": "2025-10-14T11:21:01",
  "ok": true
}