{
  "title": "HKSAR V. NG HON MAN | [2008] HKCFI 1338 | HKLII",
  "court": null,
  "year": 2008,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2008] HKCFI 1338 HKSAR V. NG HON MAN Judgment Information Date 6 Mar, 2008 Action No. HCMA1200/2007 Neutral Cit. [2008] HKCFI 1338 Parallel Cit. [2008] 1 HKCLRT 226 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCMA1200/2007 HCMA001200X/2007 HKSAR v. NG HON MAN [English Translation – 英譯本] HCMA 1200/2007 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE MAGISTRACY APPEAL NO. 1200 OF 2007 (ON APPEAL FROM TWCC NO. 2243 OF 2007) _________________ BETWEEN HKSAR and NG HON MAN ( 吳翰閔) Defendant _________________ Before: Hon Barnes J in Court Date of Hearing: 4 March 2008 Date of Judgment: 4 March 2008 Date of Reasons for Judgment: 7 March 2008 __________________________ REASONS FOR JUDGMENT __________________________ 1. The appellant faced the following four charges: Charge (1): Doing an act tending and intended to pervert the course of public justice, contrary to common law. Charge (2): Failing to stop a vehicle after an accident whereby damage was caused to something, contrary to sections 56(1)(b) and 56(5) of the Road Traffic Ordinance , Cap. 374 of the Laws of Hong Kong. Charge (3): Failing to report an accident which involved damage, contrary to sections 56(2A) and 56(6) of the Road Traffic Ordinance , Cap. 374 of the Laws of Hong Kong. Charge (4): Having failed to provide specimens for screening breath test, failing to provide specimens of breath for analysis, contrary to section 39C(1)(a) and (15) of the Road Traffic Ordinance , Cap. 374 of the Laws of Hong Kong. 2. The appellant pleaded not guilty to charges (1), (2) and (3) but pleaded guilty to charge (4). After trial before a magistrate, he was convicted of charges (1) and (2) and acquitted of charge (3). He was also convicted of charge (4) upon his own plea. He was sentenced to 6 months’ imprisonment on charge (1). The appellant initially appealed against both conviction and sentence in respect of charge (1) but subsequently abandoned his appeal against conviction and only proceeded with his appeal against sentence. Facts 3. In short, the prosecution’s case was that the appellant was driving a car and, having bumped against the wall of a building, drove away from the scene. He later returned and falsely claimed to the police officers investigating at the scene that a female present thereat, not he, was the driver. His defence was that he was drunk and not sober and did not know why he had claimed that someone else was the driver. Reasons for sentence 4. The Magistrate’s reasons for sentence are as follows: Sentence 26. Of course, the court is required to thoroughly consider all that is said in mitigation for the defendant. I have taken into account his present job with a monthly salary of $3,000 and the need for him to take care of his parents who are aged 59 and 52 respectively. The defendant’s superior/company has also submitted some documents in mitigation, asking the court to give him a chance. He has two criminal records, both of which relate to offences involving dishonesty. One is forging documents, of which he was convicted in 2001 and for which he was sentenced to a community service order for 160 hours. Then in 2003, he was sentenced to 4 months’ imprisonment for offences of theft, etc. 27. Perverting the course of public justice is a serious offence. In the context of traffic cases, the offence is also serious, be it in the nature of ‘swapping drivers’ or ‘changing seats’ or deceiving police officers by falsely stating the identity of the driver. Having considered the facts of the present case as stated above, the court is of the view that the only appropriate way of dealing with the case is to impose a custodial sentence. I have considered the length of imprisonment. In this incident, the defendant told PW3 in front of groups of police officers that he was not the driver when in fact he was, and then he pointed at Madam AuYeung, saying that she was the driver. Although the defendant was heavily intoxicated at that time, I found that he was clearly aware of what he did. The defendant’s acts were bold as brass, and I consider 6 months’ imprisonment an appropriate starting point. As the defendant pleaded not guilty, he is not entitled to the relevant discount. The defendant is sentenced to 6 months’ imprisonment on the first charge. Ground of appeal 5. The appellant submitted that he felt the sentence was excessive. He claimed that he did not mean to commit the offence and he never intended to pervert the course of public justice, and that he blundered merely because he was drunk. I pointed out to him that as he had of his own accord abandoned the appeal against conviction, I could only consider the sentence on the basis of the Magistrate’s findings of facts and could not consider whether the appellant was guilty or not. 6. The appellant has failed to raise any substantive ground to show that the sentence is excessive. The respondent’s reply 7. Ms Ng for the respondent, replies in her written submission that perverting the course of public justice is a very serious offence and that, save in exceptional circumstances, an immediate custodial sentence is inevitable upon conviction. In support of her argument, she cites the Court of Appeal case of A. G. v. Chan Siu Wai [1997] HKLRD 699. 8. Ms Ng also refers to the two cases of HKSAR v. Yung Wai Siu, HCMA 1051/2000 and HKSAR v. Mok Wai Hung, HCMA 5/2000, both of which involved the same offence, and submits that the starting point of 6 months adopted by the Magistrate is not manifestly excessive. Discussion 9. The offence committed by the appellant is serious. The Court of Appeal has clearly pointed out in Chan Siu Wai that, save in exceptional circumstances, an immediate custodial sentence must be imposed on those who commit such a serious offence. 10. In Mok Wai Hung, the defendant, an off-duty police officer, was also involved in drunk driving. His manner of driving at that time frightened a female worker performing cleaning duties on a highway. She remonstrated with the defendant and an argument ensued. Another worker present at the scene accused the defendant of drunk driving. The defendant then indicated that he would point to another person as the driver of the vehicle if a report was made to the police. The police later arrived and the defendant told them that his girlfriend was the driver of the car. The defendant was sentenced to immediate imprisonment for 6 months. The defendant appealed, contending that the magistrate should have imposed a community service order. The Court of First Instance dismissed the appeal. 11. In Yung Wai Siu, a mobile hawker and certain FEHD officers connived in an act of “substitution” whereby someone was made to stand in for the defendant as the person who had committed the offence of causing obstruction in the street. The magistrate adopted a starting point of 9 months, gave the usual discount for the defendant’s guilty plea, and further reduced the term to 4 months on account of her clear record and health problems. On appeal, the Court of First Instance held that, while the starting point of 9 months was in the circumstances appropriate, the further reduction of the term 4 months was not, and that the term of 4 months was on the low side. 12. In the present case, the appellant, being the driver, failed to stop his vehicle after it bumped into a wall (Charge (2)) and failed to provide specimens for screening breath test (Charge (4)). It was clearly his motive to evade criminal liability when he claimed that someone else was the driver. A deterrent sentence of immediate imprisonment is called for so as to deter emulation of such unlawful behaviour. 13. On the facts of the case, the starting point of 6 months adopted by the Magistrate is in my view not at all excessive. The appellant was convicted after trial and there is no basis for reducing the sentence. Nor is there any exceptional circumstance pertaining to the appellant which justifies a suspended sentence. The appeal is dismissed. (Judianna Barnes) Judge of the Court of First Instance, High Court Ms. Laura Ng, Senior Government Counsel, for the HKSAR. The Defendant in person, present. Translated by the Judgment Translation Unit of the Judiciary and approved by Mr. Edmund Cham, Solicitor. Look up this case on Lawcite Noteup",
  "length": 8401,
  "headers_seen": [
    "Facts",
    "Reasons for sentence",
    "Ground of appeal",
    "The respondent’s reply",
    "Discussion"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2008/1338",
  "query": "drunk driving",
  "ts": "2025-10-17T10:42:15",
  "ok": true
}