{
  "title": "G V. X AND OTHERS | [2023] HKCFI 3316 | HKLII",
  "court": null,
  "year": 2023,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2023] HKCFI 3316 G V. X AND OTHERS Judgment Information Date 18 Dec, 2023 Action No. HCCT58/2021 Neutral Cit. [2023] HKCFI 3316 Parallel Cit. [2024] 1 HKLRD 685 [2024] 2 HKC 585 Download MS Word Judgment Reading Options Translation Toggle Highlight Appeal History HCCT58/2021 HCCT58B/2021 G v. X AND OTHERS HCCT 58/2021 [2023] HKCFI 3316 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO 58 OF 2021 ____________________ IN THE MATTER of Section 92 (1) of the Arbitration Ordinance ( Cap 609 ) and IN THE MATTER of the recognition and enforcement of an arbitral award ____________________ BETWEEN G Applicant and X 1 st Respondent GMCI 2 nd Respondent GMCC 3 rd Respondent ____________________ Before: Hon Mimmie Chan J in Chambers Date of Hearing: 29 September 2023 Date of Written Supplemental Submissions: 11 December 2023 Date of Decision: 19 December 2023 _____________ D E C I S I O N _____________ Background 1. This is another unfortunate case of a long drawn out arbitration and a history of repeated disputes over the award made. 2. The relevant CIETAC arbitration (“ Arbitration ”) was commenced by the Applicant (“ G ”) against the 1 st Respondent (“ X ”) and others on 9 October 2018. The claims made in the Arbitration were that G had been induced by X’s fraud to sell his interests in a company (“ CMC ”) which carried on online music business on the Mainland) at an undervalue of RMB 158 million. In the Arbitration, G sought to rescind the relevant agreements for the transaction, claimed the return of the shares which had been transferred, and asked for substantial damages. 3. On 20 April 2021, the tribunal issued an award in favor of G (“ Award ”), whereby X was ordered to pay a sum of RMB 660,752,667.05, double interest in default of due payment, and arbitration fees of RMB 6,004,000. 4. In May 2021, X applied to the Mainland Court to set aside the Award (“ Mainland Setting Aside Application ). On his part, G also applied to the Mainland Court in June 2021 for leave to enforce the Award. 5. After obtaining a Mareva injunction and disclosure order against X from the Hong Kong Court in July 2021, G applied for leave to enforce the Award in Hong Kong. X opposed G’s application for enforcement in Hong Kong (“ Opposition ”). The grounds of the Opposition are that firstly, he was unable to present his case on G’s additional or revised relief sought in the Arbitration by way of amendment of his claim, and on a formula which the tribunal had come up on its own for the calculation of the damages payable. Secondly, X claimed that the Award had dealt with a difference or disputes which did not fall within the terms of the submission to arbitration, and/or contained decisions on matters beyond the scope of the submission, by virtue of the tribunal allowing the consolidation of the disputes under 8 agreements into a consolidated arbitration and dealing with the disputes arising out of the 8 agreements. It was claimed that the procedure of the Arbitration was not in accordance with the parties’ agreement, and further, that enforcement of the Award would be contrary to public policy for that reason. 6. In July 2021, the Mainland Court made an order to stay the enforcement proceedings on the Mainland pending determination of the Mainland Setting Aside Application. 7. A payment into court was made by X in Hong Kong on 20 September 2021, to secure the discharge of the Mareva injunction. 8. On 12 April 2022, X applied to the Hong Kong Court to stay the enforcement proceedings in Hong Kong pending determination of the Mainland Setting Aside Application. This was after 4 hearings had taken place on the Mainland in relation to the Mainland Setting Aside Application. 9. On 21 June 2022, this Court handed down a Decision (“ June Decision ”). This was on G’s application for enforcement of the Award in Hong Kong, and X’s application for a stay of the enforcement proceedings. In the June Decision: (1) the inability to present case ground of the Opposition was rejected (paragraphs 8 to 23 of the June Decision); (2) it was found (at paragraph 27 of the June Decision) that there are reasonably arguable grounds to be made in the Mainland Setting Aside Application as to the scope of the submission to arbitration, and as the Mainland Court was in the best position to decide on the scope and operation of Article 14 of the CIETAC Arbitration Rules and Mainland law, it would be prudent to stay enforcement of the Award in Hong Kong until the decision of the supervisory Mainland Court is known on this issue. 10. The Court accordingly adjourned G’s application for enforcement of the Award, but in view of the delay which had already taken place since the making of the Award, this Court was only prepared to order a short adjournment. G was granted liberty to apply for a hearing to take place 3 months after the handing down of the June Decision, to seek an order for immediate enforcement of the Award, and for X to show cause why further security should not be ordered in the event that any further adjournment is sought. 11. The adjourned hearing of the application for enforcement was scheduled to take place on 29 September 2023. By then, there had been developments in the Mainland Setting Aside Application, which are outlined below. Notice for re-arbitration 12. On 23 September 2022, the Mainland Court issued a notice (“ Notice ”), notifying CIETAC that the tribunal in the Arbitration had collected evidence on its own without the parties’ examination, which was not in accordance with the relevant CIETAC rules. The Mainland Court directed a re-arbitration to be held pursuant to Article 61 of the Arbitration Law of the PRC. 13. Article 61 of the Arbitration Law provides as follows: “If, after accepting an application for setting aside an arbitral award, the People’s Court considers that re-arbitration can be conducted by the arbitral tribunal, the People’s Court shall notify the arbitral tribunal to conduct re-arbitration within a certain period of time and rule that the setting aside proceedings be suspended . If the arbitral tribunal refuses to conduct a re-arbitration, the People’s Court shall rule that the setting aside proceedings be resumed.” 14. The Mainland law experts of the parties do not appear to dispute that as a result of the Notice, it was for the tribunal to decide whether or not to commence the re-arbitration directed, and that if the tribunal should decide to commence the re-arbitration, the Mainland Setting Aside Application proceedings would be terminated. This is in accordance with Article 22 of the Interpretation of the Supreme People’s Court on Several Issues Concerning the Application of the Arbitration Law of 2008 (“ 2008 Interpretation ”), which states: “If the arbitral tribunal commences re-arbitration within the time period specified by the People’s Court, the People’s Court shall rule that the setting aside proceedings be terminated . If re-arbitration is not commenced, the People’s Court shall resume the setting aside proceedings.” 15. In this case, upon receipt of the Notice, CIETAC did decide to re-arbitrate and it notified the parties of its decision so to do by its letter of 30 September 2022 (“ Re-arbitration Decision ”). 16. Following the Re-arbitration Decision, the Mainland Court issued a ruling on 11 October 2022 to terminate the Mainland Setting Aside Application. 17. According to the evidence of X’s expert, Mr Bai, the effect of the Re-arbitration Decision is that not only the Mainland Setting Aside Application, but the Mainland enforcement proceedings and procedure is automatically terminated, and that such termination is mandatory under Article 20 of the Provisions of the Supreme People’s Court on Several Issues Concerning the Handling of Cases of Enforcement of Arbitral Awards by People’s Courts (“ 2018 Enforcement Provisions ”). Article 20 states that where an arbitral award is set aside/discharged, or there is a decision for re‑arbitration, the Mainland Court “ shall rule that the enforcement be terminated ”. Bai referred to the fact that it was consistent with Article 20 of the 2018 Enforcement Provisions that upon the issue of the Notice and the Re-arbitration Decision, the enforcement procedure commenced including the orders obtained against X’s property on the Mainland was discharged upon termination of the enforcement proceedings. 18. It was on 30 October 2022, that the Mainland Court issued a ruling to discharge the freezing order which had hitherto been made by the Mainland Court against X’s property on the Mainland, and terminated the enforcement of the Award on the Mainland. 19. After the Notice and the Re-arbitration Decision, a new tribunal was enpaneled on the Mainland. Hearings were held, and submissions were made by the parties on the scope of the re-arbitration. The new tribunal invited the parties to make submissions in respect of the 2 pieces of evidence which had not hitherto been examined by the parties: namely, documents on the closing price of US $14.88 and the number of ordinary TME shares as stated in the 2019 Annual Report of the company. This was the “Evidence Issue” referred to by the parties and the new tribunal, and identified by the Mainland Court in the Notice. 20. On 16 March 2023, the parties were informed of the procedural order made by the new tribunal as to the scope of the re-arbitration being limited to the Evidence Issue. Further skirmishes followed, including an attempt made by X to postpone the hearing of the re-arbitration, and then to challenge the impartiality and independence of the presiding arbitrator, and an application for disclosure of third-party funding. Eventually, submissions were finalized and served in the re-arbitration, and the award in the re‑arbitration was issued on 17 November 2023 (“ New Award ”). New Award 21. The new tribunal held that X remains liable to pay damages in the sum of RMB 660,752,667.05. In the New Award, the new tribunal stated that the re-Arbitration ordered under Article 61 of the PRC Arbitration Law was “dependent” on the Mainland setting aside proceedings, and that the new tribunal could only, “on the basis of the Award”, re-arbitrate the issue which was identified in the Notice, namely, that the parties had not examined the two pieces of evidence which had been collected by the original tribunal. It was explained in the New Award that the re-arbitration was confined to and focused on the procedural defect identified by the Mainland Court in the Notice, for the purpose of eliminating the defect. The new tribunal made it clear that the merits and parts of the Award which did not relate to the identified issue would not be examined or adjusted. 22. In essence, the new tribunal considered that the original tribunal was entitled to exercise its discretion to decide the quantum of damages payable by X, and that it was reasonable to order that X should pay the sum awarded in the original Award. Having considered the submissions made by the parties on the evidence collected by the original tribunal, the new tribunal found such evidence to be “true, legal and relevant”. On such evidence and upon the findings of fact and liability made in the Award, the new tribunal declined to make any adjustments to the findings made by the original tribunal. Effect on the Award and the Opposition 23. On the merits of the claims made in the Opposition and the Mainland Setting Aside Application proceedings, the matter now appears clear and beyond doubt. On the procedural issue of whether the matters decided by the original tribunal in the Award were outside the scope of the submission to arbitration, on the basis that the tribunal could not decide the disputes arising out of the 8 agreements involving different parties in a single arbitration, that was not considered by the Mainland Court to be a matter for concern in the Mainland Setting Aside Application. The only matter identified in the Notice for re-arbitration was the Evidence Issue, and this has also been decided in favour of G, after X had been given the opportunity to present his case in the re-arbitration. 24. At the hearing on 29 September 2023, Counsel for X sought to rely on the new developments on the Mainland: namely the Notice, the Re‑arbitration Decision and the commencement of the re-arbitration, as a ground to resist enforcement of the Award. It was contended that by virtue of these developments, the Award was either not “binding” or had been “suspended” by the Mainland Court or under Mainland law. The relevant provision for consideration is section 95 (2)(f) of the Arbitration Ordinance (“ Ordinance ”). It was argued that the June Decision has been overtaken by the material change of circumstance of the issue of the Notice, which had identified a contravention of the CIETAC rules which justified re-arbitration, and that the Court should in that light reconsider the effect of the Award. 25. X relies on Bai’s expert evidence. According to Bai, Article 20 of the 2018 Enforcement Procedures require the Mainland Court to rule that the enforcement proceedings of the Award be terminated when the Re‑arbitration Decision was made. Enforcement orders should be discharged, and the Award therefore ceases to be an appropriate subject of enforcement. Bai refers to various decisions of the Mainland Courts, which held that the original award ceases to be of legal effect, or shall be regarded as invalid, upon the commencement of a re-arbitration. 26. On the strength of such expert evidence, Counsel for X argued that the Award ceased to be “binding”, as a binding or final award can only be regarded as one if it requires specific action and does not serve as a basis for further decisions by the arbitrators (citing para 26.05, Born, International Commercial Arbitration (3 rd ed)). It was contended that as a result of the Re‑arbitration Decision, the rights and obligations of the parties have not been resolved definitively or to preclude the need for further adjudication, and should be regarded as being subject to “ordinary recourse”, as there would be a review of the Award by the new tribunal in the re-arbitration. 27. G’s Mainland law expert, Mr Liu, did not agree with Bai’s views on Mainland law. Liu’s opinion is that notwithstanding the termination of enforcement proceedings on the Mainland, the Award has not been set aside by the Mainland Court. He referred to familiar principles under the New York Convention, that even if an award has been set aside by the supervisory court, it may still be enforced by the enforcement court of another jurisdiction. Liu considered that (with only one exception) the cases cited by Bai related only to domestic arbitrations and they have no application to international arbitrations. Liu also considered that the scope of the re‑arbitration referred to in the Notice was confined to the Evidence Issue, and the Award remained a valid, final and binding award on the other issues of fact and law decided by the original tribunal. 28. I am not persuaded by Bai’s evidence. On their plain reading, Article 20 of the 2018 Enforcement Provisions, Article 264 of the Civil Procedure Law, Article 61 of the Arbitration Law and Article 22 of the 2008 Interpretation to which Bai referred do not provide that the Award shall be set aside, revoked, or even suspended by virtue of any re-arbitration ordered. Article 20 and Article 264 refer to the termination of the enforcement or enforcement proceedings. Article 61 of the Arbitration Law to which the Mainland Court referred in the Notice, and on which Bai relies, refers to the suspension of the proceedings for setting aside/revocation of the Award. Article 22 of the Interpretation likewise refers to the setting aside or revocation proceedings being terminated. 29. The termination of the setting aside proceedings issued by way of challenge to the Award in this case simply means that such challenge proceedings were determined, and came to a halt, without an order made for the setting aside of the Award – as only a re-arbitration was ordered on the Evidence Issue identified by the Mainland Court. 30. One cannot ignore the distinction between an order of the supervisory court for setting aside an award, made as the exclusive recourse against an arbitral award under the New York Convention regime, and an order permitting or refusing enforcement of an award. The latter may be made by a court of enforcement in a jurisdiction where assets of the debtor may be located, irrespective of whether the award had been set aside by the supervisory court. It may of course be possible for the supervisory court to discontinue or terminate the enforcement proceedings in its jurisdiction as a result of the setting aside order it makes, but that does not remove the important distinction between an order to set aside an award and an order whereby enforcement of the award is refused. As Liu rightly pointed out, even if an award is set aside by the supervisory court of the arbitration, it does not follow that enforcement must be refused by a court of enforcement. In Hong Kong, it is also settled that the Court has a discretion to enforce an award even if the grounds set out in section 86, 89 or 95 of the Ordinance (as appropriate) are made out. 31. The provisions of Article 61 of the Arbitration Law, and the clarification contained in Article 104 of the Meeting Minutes of the Symposium on Foreign-related Commercial and Maritime Trial Work of Courts Nationwide, which Bai also cited, are in my view equivalent and similar in intent and purpose to section 81(4) of the Ordinance. This provides: “The court, when asked to set aside an award, may, where appropriate and so requested by a party, suspend the setting aside proceedings for a period of time determined by it in order to give the arbitral tribunal an opportunity to resume the arbitral proceedings or to take such other action as in the arbitral tribunal’s opinion will eliminate the grounds for setting aside.” 32. As in Article 61 of the PRC Arbitration Law, section 81(4) of the Ordinance expressly refers to the suspension of the setting aside proceedings. The suspension which may be ordered is in lieu of setting aside the award, the purpose being to enable the tribunal to take action to eliminate any ground for setting aside. 33. In the interim of the tribunal taking any action as a result of a suspension or remission ordered by the court, the case of Carter (t/a Michael Carter Partnership) v Harold Simpson Associates (Architects) Ltd [2005] 1 WLR 919 made it clear that the award itself remains valid and binding despite having been remitted to the arbitrator. In Carter , the award was remitted to the arbitrator to be put in a form which rendered it enforceable, but in rejecting the contention made that the effect of an order for remittal is to nullify the award, the Privy Council clarified the general status of the award, as follows: “19. The Court of Appeal.. said that the amended award was not a new award. It was amended to put it into enforceable form, that is to say, it was the same award in a better form. Their Lordships agree. There is no rule that a remittal under section 11 necessarily means that the award ceases to have any effect and that the parties start with a clean sheet . The general principle is that the powers and duties of the arbitrator cannot exceed what is necessary to give effect to the order for remittal. If the award is remitted for one specific purpose, such as to amend a name, the arbitrator has no power to amend the award in any other way. … 23. The conclusion their Lordships draw from these exchanges is that on any view, the remittal of the award does not deprive it of legal effect. It continues to operate so as to make the arbitrator functus officio , unable to alter his award, on those matters which were not remitted .” 34. In further support of the proposition that an award remains binding notwithstanding a remittal, and that the tribunal only has a limited scope of inquiry on remission, Counsel for G also referred to the observation made by Lord Sumption in Sans Souci Ltd v VRL Services Ltd [2012] UKPC 6 : “An arbitration award is prima facie conclusive. The court has only limited powers of intervention. It exercises them on well‑established grounds such as (to take the case arising here) the arbitrator’s’ failure to deal with some matter falling within the submission. The reopening by the arbitrators of findings which there were no grounds for remitting and which they had already conclusively decided would therefore have been contrary to the scheme of the Arbitration Act.” 35. The opinion of G’s expert on Mainland law, as to the limited scope of the tribunal in the re-arbitration, is in line with the authorities cited above. In Liu’s opinion, re-arbitration only concerns correction of defects or mistakes in an arbitral award, and is not a separate arbitration. The scope of a re-arbitration under Article 61 of the Arbitration Law is generally limited to the flaws or defects in the arbitral proceedings as determined by the Mainland Court, rather than a re-arbitration of the entire matter. The purpose is to eliminate procedural defects identified in the award. 36. According to Liu, the original Award had not been set aside, is still valid under Mainland law, and the setting aside proceedings have been terminated by order of the Mainland Court. In Liu’s opinion, the cases cited by Bai have no effect on international or foreign-related arbitrations, and the local courts in the cited cases did not have any authority to set aside foreign-related arbitral awards or to declare their status as being of no effect. Termination of enforcement proceedings on the Mainland does not mean that the original award is invalid. Enforcement proceedings are only suspended after the commencement of re-arbitration, but a party may apply to resume the enforcement proceedings after the tribunal rectifies the defect identified in the Notice when the re-arbitration was ordered. 37. In the light of Liu’s evidence and on my reading of the statutes and rules cited by Bai, to the extent that it is claimed or there is provision that the original award is replaced by the award of the new tribunal in the re‑arbitration, that must depend on the scope of the re-arbitration ordered. In this case, the Mainland Court only ordered re-arbitration on the Evidence Issue, and the New Award only replaces the original award on this defined issue, and to the extent that the New Award is in any way different on this issue. In this case, the New Award made in the re-arbitration is the same as the original Award on the question of damages. Any replacement makes no difference in outcome and effect. 38. It transpires that the tribunal in the re-arbitration took the same view of its scope, as is evident from the transcript of the hearing before it on 11 May 2023. The tribunal pointed out that the re-arbitration was dependent on the setting aside application and was limited in scope to the issues identified in the Notice, since the original Award had not been set aside by the Mainland Court and “still has the force of res judicata”. Disposition 39. Having considered the authorities cited by Mr Lam SC for G, and the expert evidence of Liu which I prefer over that of Bai, I conclude that as at the date of the issue of the Originating Summons (“ OS ”), and the date of the hearing on 29 September 2023, the Award remained a valid and binding Award. There was no order of the Mainland Court which set it aside. The Notice only identified the Evidence Issue for the re-arbitration ordered, and it did not have the effect of setting aside the Award under Mainland law. The June Decision of this Court was to stay the enforcement proceedings in Hong Kong to await the determination made by the Mainland Court as to whether the defect complained of by X as to the scope of the submission to arbitration would be recognized by the Mainland Court for the Mainland Setting Aside Application proceedings. It is clear that it was not. The other grounds of X’s complaints for the Opposition in Hong Kong had been considered and rejected by this Court in the June Decision. There is no further ground to refuse enforcement of the Award in Hong Kong. 40. Further, taking into consideration all the new developments identified by X, which his Counsel urged this Court at the hearing in September 2023 to consider, such developments after the issue of the OS and the June Decision must also include, not only the Notice and the re‑arbitration ordered, but also the outcome of the re-arbitration. From that, it is also patently clear that the re-arbitration ordered in September 2022 had no effect on the Award. In the re-arbitration and the New Award, the tribunal has confirmed that, having given the opportunity to X to consider the evidence collected by the original tribunal, and having considered the submissions made by X on such evidence, the award of damages remains unaltered. 41. Accordingly, there is absolutely no ground for this Court to refuse enforcement of the Award. 42. I may also add that on the evidence and the authorities, I see no merit in X’s new assertion, that the New Award is not enforceable as the procedure in the re-arbitration was not in accordance with the parties’ agreement. In any event, that should be separately pursued since X claims that the New Award is independent of the original Award. Any application to set aside the New Award does not render the New Award invalid or unenforceable. In view of the delay to the enforcement of the Award which has already occurred as a result of what has transpired to be unmeritorious challenges to the Award, I reject the suggestion that enforcement of the Award should be further delayed pending the outcome of X’s new application to set aside the New Award. 43. G’s application to enforce the Award is accordingly allowed, and X’s application for stay or adjournment of these enforcement proceedings is dismissed, with costs to be paid by X forthwith on indemnity basis, with certificate for 2 Counsel. These costs can, at G’s option, be summarily assessed in which event a statement of G’s costs should be filed and served within 7 days and X be liberty to file and serve his statement of objection within 14 days thereafter. (Mimmie Chan) Judge of the Court of First Instance High Court Mr Douglas Lam SC and Ms Jacqueline Law, instructed by Reed Smith Richards Butler LLP, for the applicant Mr Paul Shieh SC and Ms Astina Au, instructed by Fangda Partners, for the 1 st respondent Look up this case on Lawcite Noteup",
  "length": 26826,
  "headers_seen": [
    "Background",
    "Notice for re-arbitration",
    "New Award",
    "Effect on the Award and the Opposition",
    "Disposition"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2023/3316",
  "query": "arbitration",
  "ts": "2025-10-14T11:21:15",
  "ok": true
}