{
  "title": "HKSAR V. YIP WING TAI | [2024] HKCFI 2874 | HKLII",
  "court": null,
  "year": 2024,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2024] HKCFI 2874 HKSAR V. YIP WING TAI Judgment Information Date 16 Sep, 2024 Action No. HCCC32/2024 Neutral Cit. [2024] HKCFI 2874 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCCC32/2024 HCCC32/2024 HKSAR v. YIP WING TAI HCCC 32/2024 [2024] HKCFI 2874 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CRIMINAL CASE NO 32 OF 2024 ________________________ HKSAR v Yip Wing-tai ________________________ Before: Hon Barnes J Date: 17 September 2024 at 9.34 am Present: Mr Leung Ting-ngai Antony, SPP of the Department of Justice, for HKSAR Ms Annie Lai, instructed by Kwok, Ng & Chan, assigned by DLA, for the accused Offence: Trafficking in dangerous drugs (販運危險藥物) ___________________________________ Transcript of the Audio Recording of the Sentence in the above Case ___________________________________ COURT: The defendant, Yip Wing-tai, pleaded guilty to one count of trafficking in dangerous drugs, contrary to section 4 (1)(a) and (3) of the Dangerous Drugs Ordinance , Chapter 134 , before a magistrate and was committed to the Court of First Instance of the High Court for sentence. Summary of Facts Admitted by the Defendant On 5 April 2022, police officers set up a road block on Canton Road near the junction of Bute Street, Mong Kok, with a view to intercept suspicious vehicles and persons for inquiry. A private car driven by the defendant stopped at the roadblock and the police noticed the defendant was acting furtively, so the police approached and conducted an inquiry with the defendant. Upon search on the person of the defendant, the police found the following items in a waist bag carried by the defendant. Two plastic bags containing a total of 1.18 grammes of a solid containing 1.01 grammes of ketamine, one HK$20 bank note folded into a packet containing 0.01 grammes of a powder containing cocaine and two plastic bags containing a total of 0.51 grammes of a solid containing 0.44 grammes of cocaine. The defendant was arrested and under caution, he stated that those ketamine was for his own consumption. Upon a subsequent search of the car, the police further found the following items. In a rucksack placed in the rear passenger seat, one red plastic bag containing a black plastic bag, containing five plastic bags containing a total of 69 grammes of a solid containing 45.9 grammes of cocaine and a purple bag containing two pairs of scissors, a marker pen, an electronic scale and some resealable plastic bags. And in the storage compartment at the front passenger seat, one plastic bag containing 19 plastic bags containing a total of 12.2 grammes of a solid containing 10.2 grammes of ketamine. The defendant was arrested again. Under verbal caution, he stated that he understood. A mobile phone and cash in the sum of $6,626.5 were also seized from the defendant. The total amount of dangerous drugs found were 13.38 grammes of a solid containing 11.21 grammes of ketamine and 69.51 grammes of a solid containing 46.34 grammes of cocaine. In a subsequent video-recorded interview, the defendant stated under caution that he worked as a construction worker. He had the habit of consuming ketamine and he would buy from an unknown male at Sai Yee Street, Mong Kok. We will call the unknown male “the Seller”. And he would deliver drugs to others by using the car upon the request of this seller. He had collected drugs and delivered them to others upon the instruction of the Seller for about six to seven times since mid-March 2022. He had given his mobile phone number to the Seller so that the Seller could contact him for giving instructions to him to deal with those drugs. In the late evening on 4 April 2022, he bought some drugs from the Seller again and the Seller promised him a reward of $400 to $500 for collecting and delivering drugs. After he collected some cocaine and ketamine as instructed by the Seller, he placed those drugs in the rucksack and also in the storage compartment of the car which were later found and seized by the police at the roadblock. The drugs seized from his waist bag were for his own consumption. The electronic scale seized was used by him for weighing the drugs. The two pairs of scissors seized were used to open the packets of drugs and the marker pen seized were used by making marks on the package of the drugs. The mobile phone seized was used by him to contact the Seller for receiving instructions on the collection and the delivery of drugs. The cash of $6,626.5 seized was his salary as a construction worker. The estimated street value of all the cocaine seized was $63,194 in powder form and $115,125 in crack form, and the estimated street value of all the ketamine seized was $6,034. Background and Mitigation According to the antecedent statement, the defendant was born in November 1979 and is now 44 years of age. He had two previous convictions, one for drunk driving and one for possession of dangerous drugs. He studied up to Form 3 level and was a renovation worker at the time of arrest. The defendant is single. Ms Annie Lai, counsel for the defendant, gave this court more information on the defendant. Defendant is 44 and single, he received education up to Form 3. His father passed away in 2015 and his mother who works as a part-time cleaner is 73 years of age. Before the arrest, the defendant lived with his mother in a public housing unit and the defendant has an elder brother and a younger brother. The defendant used to work as a renovation worker earning an average monthly income of $12,000 from 2019 to April 2022 and the defendant started taking ketamine in the year 2000 and in 2021 he started to take cocaine as well. Ms Lai had provided this court with the result of the three tests, absurdity, conversion, and ratio test in her submission. Ms Lai submitted that whilst more than one drug was involved, the quantities are not significant and urged this court not to enhance the starting point which is suggested to be 93 months, that is the same as 7 years and 9 months, in particular, bearing in mind that the defendant was a drug abuser himself as shown in the urine test. Ms Lai also submitted that the defendant was remorseful and had pleaded guilty at the earliest opportunity. The defendant wrote to this court expressing his deep remorse. He said it was the lack of income during the pandemic that he was lured to commit the present offence. He asked for leniency so that he could take care of his aged mother. The defendant’s mother, his work partner, and his employer all wrote to this court asking for leniency. There is no need to reiterate what was said, suffice it to say that the defendant was described as a filial son and a hard-working person. His former employer is willing to continue to employ the defendant. Consideration for the Sentence Trafficking in dangerous drugs is a serious offence. A person convicted of this offence on indictment is liable to life imprisonment and a fine of $5 million. I will follow the seven steps as mentioned in the case of HKSAR v Majharul . So the first step, of the two drugs cocaine and ketamine, cocaine is the more serious one. So it will be used as the base drug. The second step, according to the sentencing guideline, for 46.34 grammes of cocaine, that is the case of Rojas and Lau Tak Ming , the starting point is 7 years and 8 months. So 92 months’ imprisonment. The third step is looking at the ketamine involved is 11.21 grammes, which corresponds to a starting point of 4 years, that is the case of Hii Siew Cheng . So the total quantity, adding 11.21 and 46.34 amounts to 57.55 grammes. Now, assuming all the drugs were ketamine, the starting point would be 73 months. If all were cocaine, the sentence would be 98 months. Now, if the ketamine is converted to cocaine, the sentence would be 97 months. Now, with the ratio test, the sentence would be 93 months. So taking all these matters into account, I am of the view that an increase of 3 months to bring the notional starting point of 92 to 95 months is appropriate. The fourth step. Now, since the amount of ketamine is relatively small and the defendant was a user of ketamine, I would enhance the starting point by 1 month only to bring it to 96 months. Now, the fifth step. The defendant acted as a courier, there is no other aggravating factor to further increase the starting point. The sixth step. The defendant pleaded guilty at the earliest available opportunity and is entitled to a full one-third discount and with this discount, the result is 5 years and 4 months, which is equal to 64 months. And there are no other mitigating factor. The final step is to look at this end result and this final sentence of 5 years and 4 months is not unfairly or unjustly crushing or oppressive. So the actual sentence for the offence of trafficking in dangerous drugs, the defendant is sentenced to 5 years and 4 months’ imprisonment. Look up this case on Lawcite Noteup",
  "length": 9030,
  "headers_seen": [
    "Summary of Facts Admitted by the Defendant",
    "Background and Mitigation",
    "Consideration for the Sentence"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2024/2874",
  "query": "drunk driving",
  "ts": "2025-10-17T10:42:21",
  "ok": true
}