{
  "title": "AW AND OTHERS V. PY AND ANOTHER | [2022] HKCFI 1397 | HKLII",
  "court": null,
  "year": 2022,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2022] HKCFI 1397 AW AND OTHERS V. PY AND ANOTHER Judgment Information Date 12 May, 2022 Action No. HCCT47/2021 Neutral Cit. [2022] HKCFI 1397 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCCT47/2021 HCCT47/2021 AW AND OTHERS v. PY AND ANOTHER HCCT 47/2021 [2022] HKCFI 1397 (redacted and amended copy) IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO 47 OF 2021 ____________________ IN THE MATTER of an Arbitration administered by the Hong Kong International Arbitration Centre (“ HKIAC ”) in HKIAC xxxxx (the “ Arbitration ”); and IN THE MATTER of section 81 of the Arbitration Ordinance ( Cap 609 ) and Article 34 of the UNCITRAL Model Law on International Commercial Arbitration; and IN THE MATTER OF Order 73 of the Rules of the High Court ( Cap 4A ) ____________________ BETWEEN AW 1 st Plaintiff AW BJ 2 nd Plaintiff AW BJT 3 rd Plaintiff G 4 th Plaintiff WX 5 th Plaintiff PT 6 th Plaintiff and PY 1 st Defendant W 2 nd Defendant ____________________ Before: Hon Mimmie Chan J in Chambers Date of Hearing: 3 March 2022 Date of Decision: 13 May 2022 _____________ D E C I S I O N _____________ Background 1. These proceedings again concern the disputes amongst the shareholders of AW , which had produced two arbitrations and various proceedings in Hong Kong relating to the awards made. 2. The main protagonists are G and PY . They and others were the beneficial owners of a Mainland company, AW BJ , which carried on a mobile advertising application business on the Mainland. G and PY had transferred their substantial interests in AW BJ to AW (a Cayman Islands company), through a series of variable interest entity (“ VIE ”) contracts. It was through these VIE contracts and structure that the profits of AW BJ were channeled to AW, of which G and PY (through his company W ) were shareholders. The actual shareholding in AW reflected the true ownership of the interests in AW BJ. 3. Some time in 2012, PY/W had transferred some of W’s beneficial interest in AW to 3 individuals, L, Wg and F. 4. In June 2015, an opportunity arose (referred to in the arbitrations as the “ DGCM Transaction ”), whereby the shareholders of AW had the chance to sell their investment in AW to a Mainland company known as DGCM for substantial gain. DGCM approached the management of AW BJ and negotiated for its acquisition of approximately 80% of the shareholding in AW BJ. A Memorandum of Intent was signed for the acquisition at a consideration of RMB 1.04 billion. AW BJ was valued at RMB 1.3 billion, and the proceeds of the sale of the shares were to be distributed to the shareholders of AW based on the classes and percentage of their shareholding, pursuant to which PY was to receive a sum of RMB 152 million for the shares he held in AW in the name of W. The DGCM Transaction and the potential gain to be made by the shareholders of AW by virtue of their interest in AW BJ became the source of the disputes which subsequently erupted, and led to the arbitrations producing the 2 awards which have been made the subject of the setting aside proceedings in Hong Kong. 5. The opportunity posed by the DGCM Transaction necessitated the termination of the VIE structure, so that DGCM could hold AW BJ directly, and in anticipation of the acquisition, a series of agreements were executed between September and December 2015. First, the existing VIE contracts for AW BJ were terminated by a VIE Termination Agreement. A Framework Agreement was then signed on 21 September 2015 amongst the shareholders of AW, whereby the parties’ rights in relation to and under the DGCM Transaction were set out. W/PY was ( inter alia ) granted a right to restore their interest in AW if the DGCM Transaction should fall through. On 11 and 12 September 2015, W also repurchased from Wg and F the AW shares it had sold in 2015 (“ Repurchase ”). Finally, on 15 December 2015, the Share Redemption Agreement was entered into between W and AW. Under the Share Redemption Agreement, AW agreed to redeem from W, and W agreed to sell to AW, approximately 15.8 million shares at the purchase price of RMB 87.5 million. 6. As it transpired, the DGCM Transaction was not completed. A series of proceedings ensued. 7. On 25 January 2017, PY and W as claimants commenced arbitration against AW, AW BJ and others as respondents under the Framework Agreement (“ Arbitration 1 ”). They claimed that the respondents were in breach of the Framework Agreement, clause 6 of which provided that if the DGCM Transaction was not completed by 30 June 2016, the parties to the Framework Agreement would cooperate to restore PY’s shareholding in AW BJ to 34%, and restore W’s shareholding in AW to 16.4%. The claimants sought specific performance of the Framework Agreement, and alternatively, damages. 8. In defence, AW, AW BJ and the other shareholders (for convenience, referred to collectively hereunder as “ AW Group ”) claimed that PY and W were barred from seeking equitable relief. They claimed ( inter alia ) that at the time of the Framework Agreement in September 2015, PY and/or W, as PY’s nominee, had made misrepresentations as to PY/W’s 16.4% shareholding in AW prior to and at the time of the Termination Agreement (“ Shareholding Representation ”), and that such ownership was not subject to any actual or potential disputes (“ Disputes Representation ”). The respondents counterclaimed damages for misrepresentation, and for breach of the Framework Agreement and PY’s breach of fiduciary duties. 9. On 23 June 2017, AW as claimant commenced arbitration against W (“ Arbitration 2 ”) under the Share Redemption Agreement. In Arbitration 2, AW claimed that the Share Redemption Agreement had been induced by misrepresentations made by W, in that PY had assigned a part of his shareholding in AW to Wg, F and L, that proceedings had been commenced by Wg and F against PY in August 2016, and that PY did not in fact own 16.4% of the shareholding in AW prior to and at the time of the Termination Agreement on 10 September 2015. AW claimed in Arbitration 2 that the Share Redemption Agreement had been rescinded by W’s misrepresentations and sought damages. The same claims of misrepresentations were made in Arbitration 1 and Arbitration 2, regarding PY’s shareholding prior to and at the time of the Termination Agreement, and the absence of disputes affecting such shareholding at the time. 10. The Tribunal in Arbitration 1 (“ Tribunal 1 ”) issued its Award on 13 March 2020, dismissing AW Group’s counterclaim of misrepresentation (“ Award 1 ”). On 13 July 2020, the Tribunal in Arbitration 2 (“ Tribunal 2 ”) issued its Award, allowing AW’s claim of rescission of the Share Redemption Agreement for misrepresentation (“ Award 2 ”). In short, the 2 Tribunals arrived at different conclusions and findings on the same facts underlying the misrepresentation claims. 11. On 12 October 2020, W applied to the Court to set aside Award 2, on the ground that it was in conflict with the public policy of Hong Kong, as Tribunal 2 had ignored findings on common issues which had already been determined between the same parties in Award 1, and instead made inconsistent findings despite the fact that one arbitrator had sat on both Tribunal 1 and Tribunal 2, and he did not explain in Award 2 why Tribunal 2’s findings on the same facts were different, or why he did not consider the parties to be bound by the findings he and the other members of Tribunal 1 had already made in Award 1. The details of the setting aside application were set out in this Court’s decision on security, handed down in HCCT 70/2020 on 17 June 2021, and in the Judgment of A Chan, J handed down on 26 January 2022 when His Lordship set aside Award 2. 12. On 10 June 2021, AW Group applied in these proceedings to set aside Award 1 which had been made against it. The grounds relied upon by AW Group are that Tribunal 1’s Partial Final Award in Arbitration 1, dated 13 March 2020 and corrected by the Correction and Interpretation Award of 30 April 2020, and Tribunal 1’s Final Award on Costs dated 13 April 2021 (“ Costs Award ”), were procured by fraud, in that W and PY had dishonestly concealed relevant and material evidence from AW Group and from Tribunal 1 in Arbitration 1. AW Group had consequently been deprived of the reasonable opportunity to present their case in Arbitration 1, Arbitration 1 had not been conducted in accordance with the arbitration agreement or the agreed procedures, and further, enforcement of Award 1 including the Costs Award would be in conflict with the public policy of Hong Kong. 13. AW Group also seek to set aside the Costs Award in that Tribunal 1 had failed to consider and deal with the submissions of AW Group on W’s concealment of evidence, which was relevant to the Tribunal’s determination on costs. It was also claimed that Tribunal 1 had reached findings in the Costs Award which were inconsistent with findings in the Partial Final Award and other parts of the Costs Award, and that enforcement of the Costs Award would be contrary to public policy. 14. Finally, AW Group claim that the Partial Final Award of 13 March 2020, the Correction and Interpretation Award of 30 April 2020 and the Costs Award were authored by unauthorized and unknown third parties. On that basis, AW Group claim that they had been deprived of the right to make submissions on Tribunal 1’s delegation of the award‑writing exercise and the deliberation process to third parties, that Tribunal 1 had exceeded its jurisdiction by such delegation and had failed to adhere to the agreed arbitration procedure, and/or breached its obligations of confidentiality, such that enforcement of the awards would be in conflict with the public policy of Hong Kong. I shall refer to this as the “Authorship Ground”. 15. There is no dispute that by the time the application was made in these proceedings on 10 June 2021 , almost a year had lapsed from AW Group’s receipt of Award 1 and the Correction and Interpretation Award of 13 March 2020 and 30 April 2020 respectively. Any setting aside application should have been taken out by 30 July 2020 , pursuant to section 81 of the Arbitration Ordinance (“ Ordinance” ). PY and W claim that the present application is out of time, there has been inordinate delay, and the Court has no jurisdiction at all to grant any extension of time under section 81 which applies Article 34(3) of the Model Law. 16. On behalf of AW Group, Counsel argued that the Court does have power, or discretion, to extend time, and that time extension should be granted in this case when Award 1 had been obtained by fraud, to which the Court should not turn a blind eye, and that the merits of this case are such that AW Group should be granted the extension to apply to set aside Award 1. In any event, the Costs Award was only issued on 13 April 2021, and the application to set aside the Costs Award was made within the 3 months prescribed under Article 34 (3). 17. Since Counsel relies on the merits of AW Group’s application in claiming that the Court should exercise its power and discretion to extend time for their application to set aside, I will deal with the merits of the case first. Whether the Award was obtained by fraud and deliberate concealment as alleged 18. Clearly, if an arbitral award had been obtained by fraud, it would offend notions of morality and justice to enforce same, and the award may be set aside under the ground of public policy. This was accepted by the Court of Final Appeal in Karaha Bodas Co LLC v Perusahaan Pertambangan Minyak Dan Gas Bumi Negara [2009] 12 HKCFAR 84 . In Grand Pacific Holdings Ltd v Pacific China Holdings Ltd [2012] 4 HKLRD 1 , Tang VP (as His Lordship then was) also referred to corruption, bribery, fraud and other conduct of similar seriousness, as instances which would justify the court’s setting aside of an award. 19. The burden of proving fraud is onerous. In Karaha Bodas Company LLC v Perusahaan Minyak Dan Gas Buni Negara (Pertamina) (2009) 12 HKCFAR 84 , the Court held that an applicant has to show that there are real prospects of success of establishing its claim of fraud before the primary judge, before the case can be remitted. 20. In Mayer Corporation Development Intl Ltd v Alliance Financial Intelligence Ltd and Others [2019] HKCA 777 , the legal principles for setting aside a judgment claimed to have been obtained by fraud are set out by the Court of Appeal: “72. ... There is no dispute as to the legal principles as set out by Aikens LJ in the Highland case at §106, which have been approved by the Supreme Court in Takhar v Gracefield at §§57 and 67 and are as follows: (1) there must be ‘conscious and deliberate dishonesty’ in relation to the relevant evidence given; (2) the fresh evidence must be ‘material’ , in that it demonstrates that the previous relevant evidence, action, statement or concealment was an operative cause of the court’s decision to give judgment in the way it did, or that it would have entirely changed the way in which the first court approached and came to its decision ; and thus the conscious and deliberate dishonesty must be causative of the impugned judgment being obtained in the terms it was; and (3) the question of ‘materiality’ of the fresh evidence is to be assessed by reference to its impact on the evidence supporting the original decision, not by reference to its impact on what decision might be made if the claim were to be retried on honest evidence .” 73... 74.... The requirement that the further evidence is ‘new’, and not simply additional evidence to improve and elaborate on the existing evidence , goes hand in hand with the ‘materiality’ requirement. If the further evidence is just ‘more of the same’, it might not have satisfied the ‘materiality’ requirement applying the criterion in the Highland case.” (emphasis added) 21. In this case, AW Group claim that W/PY had been ordered by Tribunal 1 to disclose all documents in relation to W’s transfer of the shares in AW and/or the Repurchase in 2015, but despite AW’s complaint made in Arbitration 1 that W had failed to make full disclosure, and despite AW’s demand for disclosure of the complete record of the WeChat messages exchanged amongst PY, Wg and F, W had actually concealed WeChat communications between PY and Wg and F during the period between 8 September 2015 and 22 April 2016 (“ Concealed Evidence ”). It was only in June 2020, after Award 1 was published, that AW Group discovered the Concealed Evidence and they claim that such Concealed Evidence was material to the issue of misrepresentation in Arbitration 1. AW Group were able to adduce the additional and Concealed Evidence in Arbitration 2, and this led Tribunal 2 to accept AW’s claims, that the Share Redemption Agreement had actually been induced by misrepresentations made by PY/W. 22. According to Counsel for AW Group, the Concealed Evidence shed light on the following: (1) Wg and F were concerned about the opaqueness of AW’s business and would like to discuss with PY. Yet it was made clear that it was not their intention to withdraw their investment in AW; (2) PY represented to Wg and F that he had had no information about AW and offered to bail them out; (3) PY urged Wg and F to sell their shares in AW to W by the morning of 11 September 2015, to which Wg and F acceded. Wg and F received the funds on 16 September 2015; (4) PY informed Wg and F of the DGCM Transaction, teasing them of their lack of patience in their investment in AW; (5) Wg and F complained about PY’s concealment of the DGCM Transaction from them, and threatened to institute legal proceedings. 23. Applying the test set down by the Court of Appeal in Mayer Corporation , the new evidence sought to be relied upon by AW Group must be “material”, in that the concealment of such evidence was an operative cause of the decision of Tribunal 1 in making Award 1, or that the Concealed Evidence would have entirely changed the way in which Tribunal 1 came to its decision. “Materiality” must be considered by reference to the impact of the Concealed Evidence supporting Award 1. 24. It is therefore relevant to consider the analysis made by Tribunal 1, and the reasons it gave in rejecting the claim of misrepresentation. Significantly, Tribunal 1 found that the material time for considering whether there was any misrepresentation was the date on which PY signed the Termination Agreement, on 16 September 2015. Tribunal 1 found, on the evidence, that at the relevant time of the Termination Agreement, there was no potential or anticipated litigation or arbitration between PY and Wg and F, and accordingly, there was no misrepresentation as to disputes in respect of PY’s shareholding in AW. 25. Materially, it was Tribunal 1’s finding that there was no duty on PY’s part to make voluntary disclosure to Wg and F of the acquisition contemplated by the DGCM Transaction, at the time when the parties were negotiating the buying back of the AW Shares. Tribunal 1 further found that as WG and F only sought damages in the litigation with PY on the Mainland, and did not seek rescission of their sale to PY, the validity of the chain of transactions required under the DGCM Transaction would not be affected, to constitute the Dispute Representation false. According to Tribunal 1, after PY had purchased back the AW shares from Wg and F, PY was legally and factually the owner of the shares, and there was no falsity in the Shareholding Representation at the material time. Whether Tribunal 1 was correct in the findings of law and fact made, is not the issue in these proceedings and is not for review. 26. As Counsel for PY and W highlighted, and I agree, members of Tribunal 1 were not unaware of, and did not shirk from expressing their views in Award 1 on PY’s attempts to maximize his gains from the DGCM Transaction, describing his conduct as “greedy uncooperative and difficult”. Tribunal 1 also pointed out in Award 1 that PY “could very well have behaved in a commercially sharp or morally reprehensible manner”. The Tribunal expressed their views at paragraph 172 of Award 1, in no uncertain terms: “(5) Whether PY has paid a reasonable and fair price for the shares is more controversial. On the one hand, it is a price which Wg and F, presumably having had fair knowledge of the AW Group or Cayman AW, was willing to take, On the other hand and, if PY has disclosed the potential DGCM Transaction, one can expect Wg/F would be certain to demand a much higher premium for their shares. In that sense, PY may have paid an under‑valued price in buying back the shares. It may well be a sharp practice or even short‑sightness on the part of PY in so doing. But short of proving that the buying back was null and void under the relevant law (and no such evidence was placed before us), the Tribunal cannot see why PY should not be regarded as the owners of the shares thereafter. (6) The Tribunal mentioned the above just to say that on balance of probabilities, the Tribunal accepts that: (i) On the face, there is no duty of voluntary disclosure of the pending DGCM Transaction to Wg and F in negotiating a simple and arm‑length settlement agreement in buying back the shares. But it is a much more complicated situation here because PY is having a nomination relationship (代持) which means a kind of trust or fiduciary relationship existed between them. Be that as it may, it may be observed that when these two persons commenced litigation in China against PY, they did not seek rescission of the sale but damages only. Thus, whether PY had acted correctly vis a vis these persons, would not have affected the validity of the chain of transactions required under the DGCM Transaction. (ii) Importantly, the Tribunal is not here to decide PY’s duty of disclosure towards Wg and F in their “Entrustment Management Agreement” (委托管理协议). The Tribunal is merely to decide PY and the Respondents’ relationship in the context of the Framework Agreement. Namely, whether PY, in representing that, after buying back, he now owns the shares, should make full and frank disclosure about the fact that notwithstanding he now owns the shares, but the buying back is less straight‑forward in comparison to a market arm‑length deal? On balance, the Tribunal does not think PY has that duty, failing which he would be considered to have failed to disclose the DGCM Transaction when he should have done so. This, deplorable conduct towards Wg and F, if indeed it was, had no effect on the validity of the chain of transactions required to give effect to the DGCM Transaction.” 27. Tribunal 1 was accordingly well aware, from the evidence and communications which were made available to the Tribunal in the arbitration, that PY had not informed Wg and F of the discussions on the DGCM Transaction, and that there might have been sharp practice or “deplorable conduct” on the part of PY towards Wg and F at the stage of the negotiations, but the Tribunal noted that such deplorable conduct did not have effect on the validity of the chain of transactions required to give effect to the DGCM Transaction. Central to the conclusion drawn by Tribunal 1 was that in their view, there was no legal duty on the part of W/PY to make voluntary disclosure of the DGCM Transaction to Wg and F when they negotiated the Repurchase, and that because no rescission was claimed by Wg and F in their litigation against PY, PY was legally and factually the owner of the shares, and there was no falsity in the Shareholding Representation. 28. Even on the case advocated for AW Group in these proceedings, Counsel only contended that the Concealed Evidence would show PY to have been untruthful in his evidence to Tribunal 1, and that the Concealed Evidence would or might alter the general picture presented by PY to Tribunal 1 in Arbitration 1. In other words, the Concealed Evidence might or would have portrayed PY as a liar, and affected his credibility. The Concealed Evidence showed, for example, that Wg and F claimed they had not said that they wanted to withdraw their investment, but they knew very little about AW; and that PY had claimed that he had no information about AW, but offered to return the money/their investment to Wg and F if that was what they wanted. 29. Insofar as it is alleged that the Concealed Evidence is relevant to discredit the reliability of PY’s evidence generally, I am not satisfied that such evidence would have entirely changed the way in which Tribunal 1 came to their conclusion on the claim of misrepresentation (in the Mayer sense). When the evidence sought to be admitted goes only to credit, the relevant threshold for the second condition of Ladd v Marshall , is that no reasonable tribunal could be expected to act on the evidence of the witness ( A Solicitor v The Law Society of Hong Kong [1966] 1 HKLR 260 at 263I to 264C). The Concealed Evidence does not meet such threshold, and drawing analogy from that, the Concealed Evidence does not come close to meeting the requirements for materiality set out in Mayer . 30. Counsel for AW put emphasis on the fact that Tribunal 2 had considered all the WeChat messages produced, including the Concealed Evidence which had come to light, and concluded in Award 2 that it was PY’s deceptive conduct which had driven the Repurchase, rather than the desire of Wg and F to withdraw from their investment, as PY appeared to suggest. Tribunal 2 concluded that PY must have known and appreciated, at the time of the Repurchase in September 2015, that the concealment of the DGCM Transaction would have excluded Wg and F from the benefit to the increasing value of their shares, and that W/PY must have known that such concealment would attract objection from Wg and F to the DGCM Transaction, and issues to be taken on the title of the shares which were transferred back to PY. 31. However, analysis of the materiality of the Concealed Evidence should be by reference to the impact it may have had on the findings of Tribunal 1, and not by reference to the effect of such evidence on Tribunal 2, nor how Tribunal 2 regarded the evidence which had been presented to Tribunal 2 but concealed from Tribunal 1. It is therefore not particularly helpful to place emphasis on the findings and analysis of the evidence as made by Tribunal 2 in Award 2. Those only demonstrated how Tribunal 2 had considered the evidence before it, the impression Tribunal 2 had on the entirety of the evidence produced in Arbitration 2, and the effect such evidence had on the issues of fact and law considered by Tribunal 2 upon the submissions made in Arbitration 2. 32. Counsel for AW Group relied on the fact that in Award 1, Tribunal 1 had stated that: “short of proving that the buying back was null and void under the relevant law (and no such evidence was placed before us), (Tribunal 1) cannot see why (PY) should not be regarded as the owner of the shares”. Counsel argued that the Concealed Evidence in fact provided the “missing gap”, of proving that the Repurchase was null and void for W/PY’s misrepresentation or deception against Wg and F. However, bearing in mind the importance Tribunal 1 placed on the relief of damages sought by Wg and F in their litigation against PY, I do not agree that the Concealed Evidence provided the so-called missing evidence, when on the analysis undertaken by Tribunal 1, the Tribunal concluded that PY had no duty of disclosure, and took into consideration what the Tribunal regarded as the significant absence of any claim of rescission in Wg and F’s litigation against PY, notwithstanding any claim of alleged misrepresentation. 33. In the passage of the judgment relied upon by Counsel for AW Group, in BVU v BVX [2019] SGHC 69 , the Court emphasized (in paragraph 47) that apart from deliberate concealment of evidence: “… there must be a causative link between the deliberate concealment and the decision in favour of the concealing party (ie the concealment must have substantially impacted the making of the award)”. 34. In my view, and on my reading of Award 1, there is no such causative link between the Concealed Evidence and Tribunal 1’s findings against misrepresentation. 35. In conclusion, AW Group failed to demonstrate to my satisfaction that the Concealed Evidence was the operative cause of Award 1 in the sense that the availability of such evidence would have entirely changed the outcome of Arbitration 1. It has not been shown to my satisfaction that Award 1 was procured by fraud on the part of W/PY in their concealment of evidence. Whether the Costs Award should be set aside for failure to deal with the issue of concealment of evidence 36. As a starting point, any award on costs is a matter of discretion. 37. The complaint made, that the Tribunal had failed to deal with the submissions made by AW Group on the proper costs order to be made in Arbitration 1, and had failed to take into account the Concealed Evidence withheld by W, has no merit. 38. In the Costs Award, the Tribunal had clearly dealt with the submissions and arguments made on behalf of AW Group on the issue of costs: whether it was W or AW Group which was the winning party in Arbitration 1, and whether Tribunal 1 should decide on costs with consideration given to the dishonest conduct of W/PY, the Concealed Evidence which had been deliberately withheld by W/PY and which AW Group claimed was material and only came to light after the issue of the Partial Final Award on liability. 39. Tribunal 1 pointed out in the Costs Award that since the main issues in dispute on liability were both decided in favour of PY and W, and since the relief of specific performance was granted, PY and W should be regarded as the winning party which should be entitled to costs. The Tribunal explained at paragraph 68 of the Costs Award that the Tribunal was bound by its Partial Final Award on the merits, that the Tribunal was functus officio , and that they lacked jurisdiction and power to deal with any new evidence adduced. Tribunal 1 further pointed out, at paragraph 69 of the Costs Award, that any remedy or “cure” for AW Group lies with an application to the supervisory Court, either to set aside or to remit the Partial Final Award on merits to Tribunal 1, to form a new decision on the new evidence in a further award. 40. As Tribunal 1 rightly pointed out, by virtue of Award 1 being a final award on liability, it was simply not possible for the Tribunal to revisit the issue of W/PY’s liability for misrepresentation on the basis of the Concealed Evidence sought to be produced to the Tribunal, nor was it possible for Tribunal 1 to deal with such a serious and contested claim of concealment, by way of an order of costs. The Tribunal explained that they were bound to deal with the question of costs on the basis of the findings on liability and on the relief granted in Award 1. 41. AW Group is not in a position to challenge the Costs Award on the basis that Tribunal 1 had erred in law, or on the facts ( W v AW [2021] HKCFI 1701 ). The claim is that the Tribunal had failed to deal with the Concealed Evidence in the costs order, but on the face of the Costs Award, the Tribunal had considered the matter and explained its decision, with reference to the factors it had considered, and the weight to be given to these matters, in reaching its decision on costs. The weight which the Tribunal gives to the matters taken into consideration is a matter entirely for the Tribunal. 42. I fail to see any inconsistency between the Costs Award and the other findings made by Tribunal 1. The Tribunal had found and stated in the Partial Final Award that PY and W succeeded on liability and that the counterclaims were dismissed. There is no inconsistency between such findings and the finding made in the Costs Award, as to PY and W being the winning party. The fact that Tribunal 1 had made an order nisi on costs in the Partial Final Award does not mean, and cannot be taken to mean, that it was not justified to make the Costs Award after hearing the parties’ submissions. An order nisi is normally made before the parties had been given the opportunity to make their arguments on costs. 43. There is no sound basis to set aside the Costs Order. Whether enforcement of the Award would be contrary to public policy 44. Enforcement of any part of the Award as being contrary to public policy on the ground of fraud has been rejected. 45. The remaining argument for setting aside the Award is based on the Authorship Ground. I find this to be wholly guesswork, and without merits. 46. The claim made by AW Group is that “there were circumstances justifying the inference that the Awards were not in fact the product of Tribunal 1’s independent and impartial deliberation, or its own authorship”. On that basis, it is claimed that Award 1 and the Costs Award should be set aside as AW Group had not been able to present its case to the true decision maker, that Tribunal 1 had failed to adjudicate the dispute in accordance with the agreed arbitral procedure by their impermissible delegation of the adjudication to a third-party, and that in such circumstances, the integrity of Arbitration 1 had been undermined. 47. These assertions have no evidential or factual basis apart from AW Group’s own bare assertions and subjective belief. It is surprising that the assertions have been pursued by AW’s legal advisers to the stage of the substantive hearing. 48. The allegation made does not relate only to authorship of the Awards. The claim is that the Tribunal had improperly delegated the decision making to a third party. That is a serious allegation, and I agree with the submissions made by Mr Whitehead SC on behalf of W/PY, that there must be strong evidence before the Court can conclude that such a grave allegation is established on the balance of probability ( Nina Kung v Wong Din Shin (2005) 8 HKCFAR 387 , at 625- 626). 49. The basis of the allegations made by AW Group is that: first, Tribunal 1 did not appoint a secretary, but an assistant of the presiding arbitrator had attended the substantive hearing throughout Arbitration 1. Secondly, Award 1 and the Costs Award were said to be “of surprisingly low quality”, which gave rise to justifiable doubts on Tribunal 1’s impermissible delegation. Finally, Tribunal 1 failed to disclose the authorship of the relevant awards, despite the queries raised by AW. 50. The fact that an assistant of an arbitrator had attended the substantive hearing cannot raise any inference at all, that such assistant had assumed the authorship of the relevant awards or had played a role in the decision making process. With respect, I do not find the awards to be of “surprisingly low quality”, as the AW Group suggest. Even a badly written award cannot mean that it had been authored by someone other than members of Tribunal 1, nor does it lead to “the only legitimate and irresistible inference”, as AW Group assert, of unauthorized delegation of the decision making process. Clerical, typographical or inadvertent errors, inconsistencies if any, do not suggest improper delegation of the deliberation and decision making process. 51. Other than the professed “suspicions” entertained by the AW Group, there is no concrete evidence at all to support the bold assertion that Award 1 was not the fruit of the individual judgment of members of Tribunal 1. The claim borders on being fanciful, and is no more than an attempt to set aside the undesired result of Arbitration 1 through a spurious claim of the lack of integrity of the arbitration process. 52. The Tribunal’s refusal to entertain the baseless allegations made by AW Group cannot, whether by itself or in conjunction with the other facts relied upon by AW Group in this case, lead to the “irresistible” inference urged upon the Court. As Mr Whitehead pointed out, however, Tribunal 1 had replied to AW Group’s claims. On 8 April 2020, the solicitors for AW Group made inquiry with Tribunal 1, seeking confirmation “if parts of the Partial Final Award (had) been drafted and/or written by any assistant of the arbitrators, and if so, which part and to what extent the assistant had participated in the drafting of the Partial Final Award”. In making such an inquiry, AW Group did not supply any facts to Tribunal 1 to justify their query and the claim made. The solicitors wrote again on 23 April 2021 to press for a confirmation from the Tribunal, and on the same day, Mr Yang on behalf of Tribunal 1 stated clearly in his email that the inquiry made by AW Group was wholly inappropriate, but that all the arbitrators had without reservation signed their names to the Partial Final Award, and had fully and carefully considered the case and unanimously agreed to the terms of the award. It was further stated in the email that the Tribunal was required to observe deliberation secrecy in the preparation of the award. 53. AW Group pursued their enquiry by a further email of 25 April 2021, claiming that they were only seeking confirmation on who had drafted the award, and not how the deliberation had taken place. Tribunal 1’s reply of 27 April 2021 repeated that the question raised was wholly inappropriate, and that the Tribunal would not engage in further correspondence on the matter. 54. Given the baseless accusation, I do not agree that the responses from Tribunal 1 were either improper or inadequate. In any event, there is no evidence at all that there had been any egregious error, or failure to adhere to the agreed procedure, or breach of confidentiality on the part of Tribunal 1, to constitute any ground to set aside any of the awards made in Arbitration 1. The burden of establishing a ground for setting aside an arbitral award lies squarely on AW Group, and the claims they made of misconduct on the part of the Tribunal are serious, necessitating a higher standard of proof which AW Group have come nowhere close to attaining in this self-assumed daunting task. Whether extension of time should be granted 55. On this last but important question, this Court held in Sun Tian Gang v Hong Kong China Gas (Jilin) Ltd [2016] 5 HKLRD 221 that the Court can extend time under Article 34 (3) of the Model Law for an application to be made to set aside an arbitral award. It was made very clear in the decision that the facts in Sun were exceptional, and that an extension of time should not be granted unless the applicant can establish to the satisfaction of the court that there are good reasons to do so. In Sun , there was no evidence of effective delivery and receipt of the award, such that time did not even commence to run. 56. On behalf of AW Group, Counsel argued that in a case where an arbitral award was obtained by fraud and deliberate concealment of evidence, the Court should be ready to grant an extension of time for an application to be made out of time, as courts have recognized that fraud should unravel all (citing Nigeria v Process & Industrial [2021] 1 Lloyd’s Rep 121). Otherwise, it would be egregious, offensive to notions of morality and shocking to the conscience of the court to enforce an award in circumstances to implicate it in a fraudulent scheme. Counsel also relies on the judgment of Lord Denning in Lazarus Estates Ltd v Beasley [1956] 1 QB 702 , that once fraud is proved, it vitiates judgments, contracts and all transactions. 57. Counsel for AW Group sought to place reliance on the approach of the Court of Final Appeal in Astro Nusantara International BV v PT Ayunda Prima Mitra (2018) 21 HKCFAR 118 , and of the Court of Appeal in The Decurion [2012] 1 HKLRD 1063 , to argue that the Court should look at all relevant matters and consider the overall justice of the case, when deciding whether time should be extended. In both cases, the Court had referred to Costellow v Somerset County Council [1993] 1 WLR 256 , and the observations made therein, that the Court’s discretion to extend time (conferred by Order 3 rule 5 RHC) involves “the intersection of two principles”: the first promoting the enforcement of time limits for the expeditious dispatch of litigation in the public interest, and the second recognizing that a plaintiff should not ordinarily be denied adjudication of his claim on the merits because of a procedural fault, unless such default causes prejudice to his opponent for which an award of costs cannot compensate. Counsel highlighted paragraphs 62 to 64 of the judgment of Ribeiro PJ in Astro : “62. The Terna Bahrain Holding Co WLL v Al Shamsi approach of promoting the importance of certain factors and according to others (including the merits) a secondary status is plainly inconsistent with the The Decurion approach of looking at all relevant matters and considering the overall justice of the case, eschewing a rigid, mechanistic methodology. The downgrading of the merits as a factor is particularly inapt in a case like the present, where the Tribunal’s lack of jurisdiction has been conclusively shown. ... 64. It follows, in my judgment, that the test in Terna Bahrain Holding Co WLL v Al Shamsi was inappropriately applied in the present case. It led to a failure to accord proper weight to the established lack of a valid arbitration agreement which, if recognised, would have wholly undermined the central arguments made on Astro’s behalf. Thus, much emphasis was laid on s.2AA(1) which states that the object of the Arbitration Ordinance is ‘to facilitate the fair and speedy resolution of disputes by arbitration without unnecessary expense’...” 58. Astro , of course, was a case concerning an application made to set aside the Hong Kong Court’s order granting leave to enforce an arbitral award. It was an application made under section 89 of the Ordinance, and not one made under section 81 of the Ordinance which incorporates Article 34 (3) of the Model Law which sets out the time limit of 3 months. The observations made by the Court of Final Appeal in Astro were accordingly made on the basis of the undisputed powers and jurisdiction of the Court under Order 3 rule 5 to grant time. 59. Since Sun Tian Gang , there have been decisions in Model Law jurisdictions in which the Courts held that no power is conferred under Article 34 (3) to extend the time period of 3 months imposed for setting aside applications to be made, and that the use of “may not” in Article 34 (3) is prohibitive. Counsel for PY and W referred to Bloomberry Resorts and Hotels Inc & Anor v Global Gaming Philippines LLC & Anor [2021] 1 SLR 1045 , where the Singapore Court of Appeal confirmed that the period of 3 months is mandatory in nature, that the three-month period set out in Article 34 (3) is absolute, which cannot be extended by the court even where fraud is alleged. The Court noted that the permissive nature of the word “may” is not a helpful guide to how the contrary “may not” should be interpreted. 60. Mr Whitehead’s references to cases in Ireland, Malaysia and New Zealand, to the effect that applications to set aside must be made within 3 months, were distinguished by Mr Wong on the basis that the decisions were made without debate or with concessions made by the parties; or that the relevant legislation contained expressed exceptions to the period of 3 months for fraud or corruption. 61. Mr Whitehead referred also to this Court’s observation in American International Group, Inc and anor v X Company HCCT 60/2015, unreported, 30 August 2016, that Article 2A (1) of the Model Law has effect under section 9 of the Ordinance, and Article 2A (1) states that in the interpretation of the Model Law, regard is to be had to its international origin and the need to promote uniformity in its application and the observance of good faith. Authorities from other Model Law jurisdictions can and should accordingly be taken into account when the Court seeks to interpret the Model Law and provisions of the Ordinance which adopt the Model Law. I accept that there should be uniformity in the interpretation of the time limit imposed under Article 34 (3), and the majority view is that the time cannot be extended. 62. In his submissions on the meaning of “may not” in Article 34(4) of the Model Law, Counsel for PY and W referred to section 10B (2) of the Interpretation and General Clauses Ordinance (“ Cap 1 ”), and highlighted the Chinese text of Article 34(3) (set out in the 1 st Schedule to the Ordinance). Section 10B (2) of Cap 1 provides that the provisions of an ordinance are presumed to have the same meaning in each authentic text. The Chinese text of Article 34(3) states: “當事人在收到裁決書之日起三個月後 不得 申請撤銷裁決；已根據第33條提出請求的，從該請求被仲裁庭處理完畢之日起三個月後不得申請撤銷。” ( emphasis added ) 63. Compared to the English text, Counsel pointed out that there is no ambiguity in the Chinese term “不得” used in Article 34(3), to prohibit an application made after 3 months. 64. Whereas the English text of the Model Law employs “shall”, “shall not”, “may” and “may not” in different provisions, and the Chinese text employs “應” for “shall”, and “可以” for “may”, the Chinese text makes no distinction between “shall not” and “may not” (as in Article 1(5) and Article 34(3)), using “不得” in both provisions. The Chinese text further makes no distinction between the mandatory “shall” and “may not”, by employing “不得” for both (as in Article 11(5) and Article 34(3)). 65. With regard to the Court’s power to grant extensions of time, the Court of Appeal held in Bangkok Capital Antique Co Ltd v the Collector of Stamp Revenue [1984] HKC 16 at 19F that a court has no power to extend the period of time limited by statute for doing an act unless the statute so provides. Mr Whitehead also referred to the recent case of Suen Hung Shan v Commissioner of Inland Revenue [2021] 1 HKLRD 175 , where the Court of Appeal observed that the only power which the court has to extend time is in the Rules of the High Court , and that these Rules cannot override strict time limits imposed in statutes themselves, being primary legislation. 66. An important consideration is that in matters governed by the Model Law, section 12 of the Ordinance provides that no court shall intervene except where so provided in the Model Law. 67. I have to accept Mr Whitehead’s submissions, that given section 12 of the Ordinance adopting Article 5 of the Model Law, and the cited decisions of the Court of Appeal, Order 3 rule 5 RHC cannot be invoked by the Court to extend the time prescribed in Article 34(3), when no provision for extension was made in the Article itself. However desirable it is, in the interests of overall justice, for the Court to retain a discretion to grant extensions of time in an appropriate case, justified on the facts to be exceptional and fit for the Court to exercise its discretion, it would be a matter to be resolved by appropriate legislation. 68. Even if the Court should have any power or discretion at all to grant an extension of time under Article 34(3), I consider that AW Group have not established that the discretion should be exercised in their favour in the circumstances of this case. 69. There is no dispute that Award 1, including the Correction and Interpretation Award and the Costs Award, had all been duly received by AW Group upon their issue. The application for setting aside Award 1 should have been made within 3 months, by July 2020, after the handing down of the Correction Award on 30 April 2020. The application to set aside was only made in June 2021, after a lapse of nearly a year, and such undue delay has not been justified by any good reason advanced. 70. AW Group relied on the fact that the alleged fraud and the relevant evidence had been concealed, but even on their case, they had discovered the Concealed Evidence in June 2020, which was around 2 months after Correction Award had been handed down. On 12 June 2020, AW Group referred Tribunal 1 to the Concealed Evidence discovered. A letter was sent by the solicitors for AW Group to Tribunal 1 on 15 July 2020, with submissions made that Tribunal 1 should consider revisiting issues of liability. On 17 July 2020, Tribunal 1 notified AW Group that the Tribunal was bound by the findings on liability already made in Award 1, and had no power to revisit Award 1. It was argued for AW Group that they did not apply in July 2020 to set aside Award 1, as they were anticipating that Tribunal 1 would address the Concealed Evidence in the Costs Award. However, as Counsel submitted for W/PY, the stance of Tribunal 1 had been adequately made clear on 17 July 2020, that the only redress for AW Group in relation to their claim regarding the Concealed Evidence was to apply to the Court for the appropriate relief, of setting aside or remission, and that Tribunal 1 was functus . Mr Whitehead highlighted the fact that AW Group had throughout been acting under legal advice, and that they had made the deliberate decision to proceed with making submissions to Tribunal 1 on the effect of the Concealed Evidence on costs, instead of applying to the Court within the prescribed period of 3 months to set aside Award 1. It lies ill in AW Group’s mouth to claim now that it had been unable to make the application in time, in July 2020. 71. On the evidence, AW Group had in fact complied with the order made in Award 1 for specific performance. According to PY and W, any right to challenge Award 1 has been unequivocally waived by AW Group. On 17 June 2020, AW Group in their email to Tribunal 1 stated that AW Group had already fulfilled all their obligations under Award 1. By another email of 27 November 2020, AW Group further stated that the registration of transfer of the shares to W had been completed, and that the Tribunal’s order for specific performance had already been fully performed. 72. Counsel for AW Group claimed that on G’s evidence, AW had complied with Award 1 as a result of W’s employment of pressure tactics. This is not relied upon as a ground or reason for setting aside Award 1, and G’s assertion cannot be given credence. 73. With the registration of the transfer of the shares claimed, and confirmation to Tribunal 1 and W/PY of AW Group’s full compliance with the order for specific performance under Award 1, I agree that on the evidence, AW Group had acted in a manner which is consistent only with their waiving their rights to challenge Award 1, and such waiver had been communicated in clear terms to both Tribunal 1 and W/PY. In the email dated 17 June 2020 from the solicitors for AW Group, there was a general allusion to AW Group’s reservation of rights, “including but not limited to the right to make any applications or to seek directions from the Tribunal”. However, as Mr Whitehead pointed out, this was in June 2020, before the 3 months’ limit expired. When AW Group continued after July 2020 to confirm, in November 2020, that they had completed registration of the transfer and had fully complied with the order for specific performance, that could only be understood as an election to comply with Award 1 and to waive any rights to challenge same. 74. I conclude that in the circumstances and on the evidence in this case, by reason of the unexplained delay and the lack of merits on the substantive application for setting aside, there is no good reason at all for this Court to exercise any discretion it may have in favour of AW Group, to grant an extension of time for their application. Disposition 75. The application by Originating Summons issued on 10 June 2021 is dismissed. The order nisi is that AW Group are to pay to PY and W their costs of the application (including any costs reserved), on indemnity basis, with Certificate for 2 Counsel. (Mimmie Chan) Judge of the Court of First Instance High Court Mr William Wong SC, Mr Adrian Lai and Mr Martin Lau, instructed by Wilkinson & Grist, for the 1 st to 6 th plaintiffs Mr Robert Whitehead SC and Mr David Fong, instructed by Gallant, for the 1 st and 2 nd defendants Look up this case on Lawcite Noteup",
  "length": 50180,
  "headers_seen": [
    "Background",
    "Whether the Award was obtained by fraud and deliberate concealment as alleged",
    "Whether the Costs Award should be set aside for failure to deal with the issue of concealment of evidence",
    "Whether enforcement of the Award would be contrary to public policy",
    "Whether extension of time should be granted",
    "Disposition"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2022/1397",
  "query": "enforcement of award",
  "ts": "2025-10-17T10:42:01",
  "ok": true
}