{
  "title": "DICKSON VALORA GROUP (HOLDINGS) CO LTD AND ANOTHER V. FAN JI QIAN | [2019] HKCFI 2953 | HKLII",
  "court": null,
  "year": 2019,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2019] HKCFI 2953 DICKSON VALORA GROUP (HOLDINGS) CO LTD AND ANOTHER V. FAN JI QIAN Judgment Information Date 10 Dec, 2019 Action No. HCMP1954/2018 Neutral Cit. [2019] HKCFI 2953 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCMP1954/2018 HCMP1954A/2018 DICKSON VALORA GROUP (HOLDINGS) CO LTD AND ANOTHER v. FAN JI QIAN HCMP 1954/2018 [2019] HKCFI 2953 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE MISCELLANEOUS PROCEEDINGS NO 1954 OF 2018 ____________________ IN THE MATTER OF an application for injunctive relief under Section 21L of the High Court Ordinance ( Cap 4 ) ____________________ BETWEEN DICKSON VALORA GROUP (HOLDINGS) COMPANY LIMITED (迪維集團(控股)有限公司) 1st Plaintiff DICKSON VALORA (LIANYUNGANG) PROPERTY CO LIMITED (迪維(連雲港)置業有限公司) 2nd Plaintiff and FAN JI QIAN (樊紀乾) Defendant ____________________ Before: Hon G Lam J in chambers Dates of Written Submissions: 15 April, 10 and 22 May 2019 Date of Decision on Costs: 11 December 2019 _____________________________ DECISION ON COSTS _____________________________ 1. At the end of my judgment handed down on 20 February 2019: [2019] HKCFI 482 , granting an anti-suit injunction against the defendant, I made an order nisi that the defendant do pay the plaintiffs the costs of the proceedings, to be taxed if not agreed, with a certificate for two counsel. By implication, costs are to be taxed on the party and party basis. The plaintiffs, by summons dated 5 March 2019, seek a variation of the order such that the costs are to be paid by the defendant on an indemnity basis. 2. Two bases are relied upon by the plaintiffs for the proposed variation: first, that the proceedings were necessitated by the defendant’s breach of an arbitration clause; and, secondly, that there was underhand conduct on the part of the defendant throughout these proceedings. 3. As to the first ground, the plaintiffs in their initial submissions rely upon the English cases of Kyrgyz Mobil Tel Ltd v Fellowes International Holdings Ltd (No. 2) [2005] EWHC 1314 (Comm) and A v B (No. 2) [2007] 1 Lloyd’s Rep 358, and a decision in Hong Kong in XL Insurance Company SE v Manley Toys Ltd (unrep, HCA 2233/2013, 19 June 2015). In particular, the plaintiffs submit there are two principled reasons for awarding costs on the indemnity basis. 4. The first point, as I understand the submission, is that where a party acts in breach of an arbitration or jurisdiction agreement such as by bringing proceedings in a forum inconsistent with that agreement, the legal costs incurred by the other side in response ought in principle to be recoverable as damages for breach of contract. It is said that part of the successful party’s costs of the application would be irrecoverable if costs are taxed on the party and party basis, and that this would be unjust. I do not accept this argument. If a jurisdiction agreement is enforced not by an application for anti-suit injunction but by a claim for damages (such as for the additional expenses in having to litigate in the non-contractual forum compared to the contractual forum — see eg Union Discount Co Ltd v Zoller & others [2002] 1 WLR 1517 ), the successful plaintiff will recover in full as damages such additional expenses as he can prove, but the costs of the action for damages themselves will generally still be awarded to him only on the party and party basis. I do not see why an agreement concerning forum should as such be accorded “greater force” or “higher status” such that the costs incurred for its enforcement should as a principle be awarded on the indemnity basis. 5. Furthermore, strictly speaking there is no “breach of contract” by the defendant in the present case, as he is not a party to the arbitration agreement. It is difficult to see how an action for damages for breach could be instituted against him personally. 6. The second reason is that, by suing in breach of an arbitration or jurisdiction agreement, the party has “misused the judicial facilities” of the local or foreign courts, conduct which deserves the court’s disapproval in the form of an order for indemnity costs. This would suggest that all litigants who litigate in breach of a forum agreement should be ordered to pay indemnity costs, whereas there is in fact, as far as I know, no such uniform general practice in Hong Kong, whether for a plaintiff whose action in Hong Kong is stayed based on a jurisdiction agreement in favour of another forum or a party against whom an anti-suit injunction is granted in Hong Kong based on a jurisdiction agreement. The plaintiffs refer to XL Insurance Company SE (a case of anti-suit injunction being granted based on an exclusive jurisdiction clause in favour of Hong Kong courts) in which the court ordered indemnity costs on the basis of A v B (No 2) , but it appears the judge took into account the specific conduct of the defendant in that case. In any event that decision does not seem to me, as yet, to represent a general prevailing practice in this jurisdiction. 7. As the second basis for seeking indemnity costs, the plaintiffs submit that the defendant was guilty of underhand conduct in these proceedings. It is said that he evaded service, that he took out a summons on 4 January 2019 for postponement of the hearing of the originating summons, that he issued a belated summons on 23 January 2019 for an order to set aside service and to stay proceedings on the ground of forum non conveniens , and that he rejected the requests for him to withdraw the Qianhai proceedings. Some of these steps might indeed be questionable tactics but, in the context of both sides taking a “hardball” approach, I do not think that they have crossed the line so as to deserve a special penalty or that the plaintiffs have established on the materials that the defendant was guilty of such conduct as should be regarded as an affront to the court, except in relation to the summons of 23 January 2019, which was indeed characterised as an “abuse” and a “monumental afterthought” in my judgment of 20 February 2019 (see §76). In my view, this justifies an order for indemnity costs in relation to that summons but not otherwise. 8. In their reply submissions, the plaintiffs raise for the first time the line of Hong Kong authorities in which indemnity costs were ordered in proceedings relating to arbitral proceedings, agreements or awards (eg Gao Haiyan v Keeneye Holdings Ltd [2012] 1 HKC 491 ; Pacific China Holdings Ltd v Grand Pacific Holdings Ltd [2012] 4 HKLRD 569 ; Chimbusco International Petroleum (Singapore) Pte Ltd v Fully Best Trading Ltd [2016] 1 HKLRD 582 ). It is not clear that the practice extends invariably to cases of stay or anti-suit injunction in favour of arbitration even as against a person who is not a party to the arbitration agreement . In the English case of Kyrgyz Mobil Tel Ltd & Others v Fellowes International Holdings Ltd & Anor [2005] EWHC 1329 (QB), indemnity costs were awarded against the defendants who were not party to the relevant arbitration clause, but what they did in that case had been characterised as “vexatious and oppressive” (see §43). In the present case, the basis for the grant of an anti-suit injunction against the defendant is that equity requires him to recognise the contractual right of the plaintiffs “to prevent a claim against them based on their contractual obligations being pursued otherwise than by the contractually agreed mode, viz arbitration in Hong Kong”, without any need for the plaintiffs to show vexatious or oppressive conduct on ordinary forum non conveniens considerations (see §§39 & 46 of my Judgment of 20 February 2019). In any event, it appears that the present case is the first of its kind in this jurisdiction in which an anti-suit injunction is granted against a person who is not a party to the arbitration agreement. In these circumstances I do not consider that an award of indemnity costs is warranted. 9. The final costs order will therefore be as follows: (1) The defendant do pay the plaintiffs the costs of and relating to his summons dated 23 January 2019, to be taxed on the indemnity basis if not agreed, with certificate for two counsel. (2) Subject as aforesaid, the defendant do pay the plaintiffs the costs of the proceedings, to be taxed on the party and party basis if not agreed, with certificate for two counsel. (3) There be no order as to costs on the plaintiffs’ summons for variation of the costs order nisi . (Godfrey Lam) Judge of the Court of First Instance High Court Written submissions by Mr Terrence Tai and Ms Jasmine Cheung, instructed by Angela Wang & Co, for the Plaintiffs Written submissions by Mr Michael Ng, instructed by William KW Leung & Co, for the Defendant Look up this case on Lawcite Noteup",
  "length": 8865,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2019/2953",
  "query": "anti-suit injunction",
  "ts": "2025-10-16T10:47:06",
  "ok": true
}