{
  "title": "T V. B | [2021] HKCFI 3645 | HKLII",
  "court": null,
  "year": 2021,
  "date": "2025-10-31",
  "content": "HKLII Databases Court of First Instance [2021] HKCFI 3645 T V. B Judgment Information Date 28 Dec, 2021 Action No. HCCT13/2021 HCCT14/2021 Neutral Cit. [2021] HKCFI 3645 Parallel Cit. [2022] 2 HKC 84 [2022] 1 HKLRD 279 Download MS Word Judgment Corrigendum Reading Options Translation Toggle Highlight Case History HCCT13/2021 HCCT14/2021 HCCT 13/2021 [2021] HKCFI 3645 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO. 13 OF 2021 ________________________ IN THE MATTER OF Order 73 Rule 5 of the Rules of High Court (Cap. 4A) and IN THE MATTER OF an Arbitration Interim Award dated 30 October 2020 in Case No. HKIAC/20052 made by Mr. Philip V. Boulding QC and IN THE MATTER OF Section 81 of the Arbitration Ordinance (Cap. 609) and Article 34 of the UNCITRAL Model Law on International Commercial Arbitration ________________________ BETWEEN T Plaintiff and B Defendant ________________ AND HCCT 14/2021 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO. 14 OF 2021 ________________ BETWEEN T Plaintiff and B Defendant ________________ (Heard together) Before: Hon Coleman J in Chambers (Not Open to Public) Date of Hearing: 1 December 2021 Date of Judgment: 29 December 2021 Date of Corrigendum: 13 January 2022 ________________ CORRIGENDUM ________________ Please note the following corrigendum in the Judgment dated 29 December 2021: - 1. At page 6 between line H and I, the words, “By Summons dated 17 February 2019”, should read as “By Summons dated 17 February 2021”; 2. At page 12 between line L and M, the words, “The Sub-contract was to run from 25 April 2018 to 28 July 2021”, should read as “The Sub-contract was to run from 25 April 2018 to 28 July 2024”; 3. At page 21 between line Q and R, the words, “section 20(5) of the AO is simply inapplicable”, should read as “section 34(5) of the AO is simply inapplicable; 4. At page 23 between line F and G, the words, “The Stay Application falls to be dismissed”, should read as “The Stay Application is granted”; Dated the 13 th day of January 2022 (Alvin Kwok) for Registrar, High Court HCCT13/2021 T v. B HCCT 13/2021 [2021] HKCFI 3645 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO. 13 OF 2021 ________________________ IN THE MATTER OF Order 73 Rule 5 of the Rules of High Court ( Cap. 4A ) and IN THE MATTER OF an Arbitration Interim Award dated 30 October 2020 in Case No. HKIAC/20052 made by Mr. Philip V. Boulding QC and IN THE MATTER OF Section 81 of the Arbitration Ordinance ( Cap. 609 ) and Article 34 of the UNCITRAL Model Law on International Commercial Arbitration ________________________ BETWEEN T Plaintiff and B Defendant ________________ AND HCCT 14/2021 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO. 14 OF 2021 ________________________ BETWEEN T Plaintiff and B Defendant ________________ (Heard together) Before: Hon Coleman J in Chambers (Not Open to Public) Date of Hearing: 1 December 2021 Date of Judgment: 29 December 2021 _______________ J U D G M E N T _______________ A. Introduction 1. By contract dated 10 January 2018 (“Main Contract”), the Defendant was engaged by the Hong Kong Government as the main contractor for certain reclamation and advance works. By contract dated 25 April 2018 (“Sub-contract”), the Defendant engaged the Plaintiff as one of the sub-contractors for part of the Main Contract works. As often in construction projects, the Main Contract and Sub-contract were ‘back-to-back’, with the same completion date of 28 July 2024. 2. The Plaintiff says that the Defendant committed various breaches of the Sub-contract (the details of which are irrelevant for the present purpose) from as early as April 2018, ultimately leading to the Plaintiff’s acceptance of repudiation to bring the Sub-contract to an end on 31 May 2019. Substantial monetary damages are claimed by the Plaintiff. 3. The Sub-contract has an arbitration agreement, Clause 31, the material part of which provides (sic, emphasis added): 31 Disputes 31.1 Sub-Contract Disputes shall be settled in accordance with the provisions of this Clause 31. 31.2 For the purposes of this Clauses 31, a Sub-Contract Dispute shall be deemed to arise when either Party serves on the other a notice in writing (herein called a “Notice of Dispute” which in any event shall only be raised after the completion certificate, or where there is more than one certificate, the last completion certificate, issued by the Relevant Persons under the Main Contract ) stating the nature of such Sub-Contract Dispute… 31.5 If: (i) there is no ADR Procedure in the Main Contract; or (ii) either Party refuses a request for the dispute to be referred to the ADR Procedure under Clause 31.3; or (iii) the Sub-Contract Dispute is referred to the ADR Procedure in accordance with either Clause 31.3 or 31.4 and the ADR Procedure fails to resolve such Sub-Contract Dispute then, in the case of the circumstances set out in Clause 31.5(i), within twenty-eight (28) days of the service of the Notice of Dispute, and, in the case of the circumstances set out in Clauses 31.5(ii) or (iii), within a further twenty eight (28) days of such refusal or failure, as the case may be, either Party may refer the Sub-Contract Dispute to arbitration. Provide always that the Notice of Dispute under this Clause 31 shall only be raised after the completion certificate, or where there is more than one certificate, the last completion certificate issued by the Relevant Persons under the Main Contract … 4. The Plaintiff sought to refer the dispute to arbitration, but the Defendant objected on the basis that it was premature because the completion certificate had not been issued (and because the other conditions precedent had not been satisfied). 5. Mr Philip Boulding QC was appointed as arbitrator (“Arbitrator”) in HKIAC/20052, and he was informed by the Plaintiff that the Defendant had “raised a jurisdictional challenge or dispute”. Thereafter, the shorthand phrase “jurisdictional challenge” was also adopted by the Arbitrator, and by the Defendant. By his Procedural Order No. 1, the Arbitrator gave directions to determine by way of a preliminary issue the validity (or otherwise) of the jurisdictional challenge raised, through exchange of written submissions and an oral hearing held on 24 September 2020. 6. By an Interim Award dated 30 October 2020 (“Award”), the Arbitrator ruled that he did not have jurisdiction on the basis that, on the proper construction of Clause 31, the purported commencement of arbitration was premature. The last paragraph of the Award, §85, headed ‘Decision’, provided: 85. It follows from the contents of the Analysis section of this Interim Award immediately above and I HEREBY DECIDE AND DETERMINE THAT: (i) [the Plaintiff’s] purported institution of the arbitration by Notice of Dispute No.1 and Request for Mediation No.1 was made prematurely having regard to the true meaning and effect of Clause 31 of the Sub-Contract and, in particular, the fact that the Relevant Person under the Main Contract had not issued any completion certificate as referred to therein which is a pre-requisite to the raising of the Notice of Dispute; (ii) I do not have jurisdiction to deal with the disputes purportedly referred to me for my determination, save for the jurisdictional challenge raised by [the Defendant] and as to which I decide in [the Defendant’s] favour. 7. As the introductory words to §85 show, the earlier parts of the Award identify the parties’ competing arguments and the Arbitrator’s analysis as to the proper construction and effect of Clause 31. It might be thought obvious that §85(i) summarises the Arbitrator’s view of the effect of his construction of Clause 31, and identifies that as the reason why he held at §85(ii) that he had no “jurisdiction”. 8. By originating summons dated 29 January 2021 issued in HCCT 13/2021, the Plaintiff applied to set aside §85(i) of the Award (“Set Aside Application”), under section 81 of the Arbitration Ordinance Cap 609 (“AO”) which gave effect to Article 34 of the UNCITRAL Model Law. It should be noted that the application was limited to one seeking to set aside only §85(i), and not §85(ii), the argument being: (1) §85(i) is beyond the parties’ scope of submission to arbitration because the Arbitrator was only appointed to determine the jurisdictional challenge, but not to construe Clause 31. Therefore, §85(i) is liable to be set aside under Article 34(2)(a)(iii). (2) Clause 31 is not valid because, as construed by the Tribunal, Clause 31 precludes the right to have disputes heard and determined within the statutory limitation period and thus liable to be set aside under Article 34(2)(a)(i). 9. By writ and statement of claim dated 2 February 2021 in HCCT 14/2021, the Plaintiff claimed against the Defendant for essentially the same breaches the Plaintiff had sought to have adjudicated by arbitration (“Writ Action”). The basis for the commencement of the Writ Action was that because the Arbitrator ruled that he had no jurisdiction, the consequence dictated by section 34(5) of the AO is that the Court must assume jurisdiction and decide the Sub-contract disputes. 10. By Summons dated 17 February 2019, the Defendant applied to stay the Writ Action in favour of arbitration (“Stay Application”). The Defendant says there is a binding arbitration agreement in Clause 31, which is neither null and void nor inoperative or incapable of being performed. Further, what the Arbitrator decided was actually an ‘admissibility’ issue, rather than a ‘jurisdictional’ issue, and such a decision is not amenable to challenge under section 81 of the AO. 11. The Set Aside Summons and the Stay Summons were, as previously directed, heard together on 1 December 2021. The Plaintiff was represented by Mr Anthony Houghton SC, Mr Vincent Lam, Mr Kurt Ng, and Mr Ben Chan. The Defendant was represented by Mr Charles Manzoni SC. 12. This is my reserved Judgment. B. Key Threads of the Argument 13. The two key threads of the argument, relevant to the overlapping Set Aside Application and Stay Application are: (1) the true nature of the challenge determined by the Arbitrator in the Award, namely whether it was the determination of ‘admissibility’ or ‘jurisdiction’; and (2) the construction and effect of Clause 31, including whether it is contrary to public policy by denying parties their Basic Law rights. 14. It is convenient to deal with those two threads each in turn. The conclusions can then be applied as appropriate to each of the Set Aside Application and the Stay Application. C. Admissibility or Jurisdiction 15. Mr Houghton emphasizes that it was parties’ mutual agreement to submit the prematurity issue to the Arbitrator as a “jurisdictional challenge”. The Arbitrator seized the issue as such, as shown in the Procedural Order No. 1 and the parties argued the issue as such in the 20 September 2020 hearing. The use of language is not disputed by Mr Manzoni. 16. But Mr Manzoni submits that in reality, and as a matter of law, the objection taken was one of admissibility and not one of jurisdiction. Essentially, the terminology of jurisdiction adopted was incorrect. Mr Manzoni invited the Court to consider academic commentaries and to follow the developments in other jurisdictions which have characterized compliance with pre-arbitration procedural steps as a matter of the admissibility of the claim rather than jurisdiction of the tribunal. 17. On a conceptual level, the distinction between what would normally be considered a jurisdictional challenge and the prematurity issue is intuitive. A typical jurisdictional challenge concerns the existence, scope and validity of an arbitration agreement. The answer to such a challenge is a binary one; the tribunal either has jurisdiction or has no jurisdiction. The lack of jurisdiction is permanent, and parties cannot cure the defects by entering into an arbitration clause ex post facto or to rewrite the clause to bring the dispute within its ambit. 18. In comparison, an allegation that the institution of arbitration is premature does not entail a permanent bar to arbitration. The bar is a temporary one. The bar could be removed once the parties have complied with the contractually agreed pre-arbitration requirements. An attempt to enforce pre-arbitration procedures is a positive affirmation of the existence of a valid arbitration agreement, instead of the denial of the agreement. This puts a prematurity objection at the opposite side of a conventional jurisdictional challenge. 19. Mr Manzoni relies heavily on the recent judgment of G Lam J (as G Lam JA then was) in C v D [2021] HKCFI 1474 . In that judgment, G Lam J carefully surveyed the judicial approach towards non-compliance with pre-arbitration procedural requirements in the United Kingdom, Singapore and United States, as well as in academic writings from leading scholars in the area. In C v D , the arbitration agreement provided that parties should first refer a dispute to the CEOs of both companies for resolution first, before going to arbitration. 20. Drawing together strands from G Lam J’s thorough survey, it can be seen that: (1) Section 81 of the AO, incorporating Article 34 of the Model Law, sets out exhaustively the bases on which the Court may set aside an award. (2) It is settled that, if the question raised is a true question of jurisdiction properly falling within Article 34, the Court may review the arbitral decision on the standard of “correctness” and decide the question de novo . But the Court must confine itself to true questions of jurisdiction. (3) Academic works often refer to “jurisdiction of the tribunal” and “admissibility of a claim”. This reflects that a jurisdictional challenge targets the power of the tribunal to hear a claim, whilst an admissibility challenge asks the appropriateness for the claim to be heard by the tribunal, despite its having power to do so. (4) One way of posing the question is to ask whether the objecting party is taking aim at the tribunal or at the claim. (5) A jurisdictional challenge asks whether there is a contractual duty to refer the claim to arbitration at all. The objection is that there is no valid consent to submit a particular claim to arbitration. (6) The objection for an admissibility challenge is not that there is no contractual duty to arbitrate at all, but that it should not be heard by the tribunal, or at least not yet. (7) A challenge concerning timing to institute arbitration, for example whether it is too early or too late, is properly a question of admissibility. So are other pre-arbitration conditions such as issuance of notices in advance. (8) Jurisdiction, and so susceptibility to challenge, is commonly defined to refer to the power of the tribunal to hear a case, whereas admissibility refers to whether it is appropriate for the tribunal to hear it. (9) The fact that a condition is regarded as going to admissibility rather than jurisdiction does not mean it is unimportant. What it does mean is that the arbitral tribunal has jurisdiction and may deal with the question as it sees fit. (10) Questions of admissibility are to be determined by the tribunal. The tribunal’s decision on admissibility, unlike a decision on jurisdiction, is final and not subject to review by courts. 21. C v D was very recently referred to by Mimmie Chan J in Kinli Civil Engineering Limited v Geotech Engineering Limited [2021] HKCFI 2503 , where at §8 the experienced Judge in charge of the Construction and Arbitration List endorsed the view that non-compliance with pre-arbitration procedures or conditions goes to admissibility of the claim and a tribunal’s decision in this regard is not reviewable by the Court. 22. I agree. Adopting the admissibility vis-à-vis jurisdiction distinction: (1) makes sense conceptually; (2) respects the parties’ autonomy; (3) is line with the general trend of judicial restraint from interfering with parties’ agreed dispute resolution regime; (4) serves the object of the AO which is identified at section 3(1) as to facilitate the fair and speedy resolution of disputes by arbitration without unnecessary expense; and (5) will serve to bring Hong Kong in line with the wider international arbitration communities. 23. Of course, as pointed out in C v D at § 52(5), parties are not prevented from agreeing that pre-arbitral procedural requirements should go to the tribunal’s jurisdiction, but such an agreement in an arbitration clause would require clear and unequivocal language. 24. I would add this: if the Court is the master of its own procedural rules, so should be the arbitral tribunal. It is logically sound that a tribunal’s decision on parties’ compliance or non-compliance with pre-arbitration procedures or conditions should be final and non-reviewable by the Court. D. Clause 31 and Limitation Defence 25. Whilst the Plaintiff in the Set Aside Application seeks to set aside the Arbitrator’s “holding” at §85(i) that the issuance of completion certificate for the Main Contract is a pre-requisite for raising a Notice of Dispute, this part of the construction of Clause 31 was common ground between the parties. This is unsurprising, given that this construction is the foundational plank for the Plaintiff’s argument that Clause 31 denies it access to arbitration until a limitation defence will have accrued to the Defendant. 26. Indeed, this point shows the force of Mr Manzoni’s submission that the Plaintiff has approbated and reprobated. The Plaintiff now contends that the arbitration clause previously relied upon by it, and sued under, is not valid under Hong Kong law. But it is forced to suggest that the invalidity arises only as a result of the construction placed upon Clause 31 by the Arbitrator. Yet that is the very construction which the Plaintiff seeks to set aside on the grounds that the Arbitrator exceeded his jurisdiction by deciding it. 27. What was disputed is the effect of the construction that the issuance of completion certificate for the Main Contract is a pre-requisite for raising a Notice of Dispute. 28. The Sub-contract was to run from 25 April 2018 to 28 July 2021, that is for slightly more than 6 years. The Plaintiff emphasizes the common occurrence of delay in large scale construction projects in Hong Kong (with which the Plaintiff is well-familiar) and the intervening Covid-19 pandemic which would push the expected completion of the Main Contract much further down the road. It is said that Clause 31, as construed by the Arbitrator, prohibits parties from instituting arbitration procedures when the dispute is still within the limitation period. 29. Mr Manzoni submits it is not inevitable that all Sub-contract disputes will meet a 6 years’ limitation defence. It is not a built-in design of Clause 31 to prevent parties from resolving disputes before the expiry of limitation periods. The prospects and likelihood of such a defence accruing would be driven by the factual circumstances. Under the original term of the Sub-contract, even for one-off breaches, only those which occurred in the first 3 months would potentially meet a limitation defence at the original completion date of the Main Contract. Mr Manzoni also submits that most breaches in construction projects are continuing breaches, which means that the 6 years’ limitation period would not start running probably until the end of the Main Contract. 30. I agree with Mr Manzoni that the Plaintiff has put its case too high insofar as it sought to present the prospect of a limitation defence as an inevitable consequence of Clause 31. It is not disputed that Clause 31 was voluntarily entered into by the parties, with the completion dates of the Sub-contract and the Main Contract (set to be the same) clearly known. Both parties are also familiar with construction projects in Hong Kong, the commonality of delay, and that breaches include many which are likely to be continuing in nature. What is inherent in the design of Clause 31 is not an inevitable limitation defence but a contractual risk (which both parties accepted with open eyes) of such a defence materializing. 31. The Plaintiff may take the view that that risk has eventuated to its disadvantage, although the Defendant would argue that its counterclaim is equally affected by the potential limitation defence. In any event, the effect of a potential limitation defence on the validity of Clause 31 must be viewed at the time when the arbitration agreement was entered into, not how the factual circumstances have eventuated. A contractual risk may materialize and perhaps in a way with asymmetrical effects on parties. That is inherent in the concept of risk. 32. Although not the main focus of his oral submissions, Mr Manzoni also relies a number of legal devices to circumvent the limitation defence if one does accrue. He says that it is implied into Clause 31 that parties would refrain from taking a limitation defence, that the Defendant has given an undertaking in the hearing that such a defence would not be raised, and that the Defendant would thus be estopped from doing so in the future. Mr Houghton replies that it could not be right if the denial of access to courts could only be circumvented by resorting to implied terms and estoppel. 33. Of course, as I raised at the hearing, not least where HCCT 14/2021 has been commenced, it might be thought that the relevant claim in this case has clearly been brought in time, even if that claim might fall to be stayed in favour of arbitration. Even though such stays are usually regarded as permanent, it is still a stay of an existing claim already made. No limitation issue arises. 34. Since I have decided that the accrual of a limitation defence is not inevitable under Clause 31, there is no need to come up with various legal devices to circumvent such inevitability. 35. The existence of a potential limitation defence has been relied upon by the Plaintiff for the purpose of arguing that Clause 31 is invalid within the meaning of Article 34(2)(a)(i) (in the context of the Set-aside Application) and is also null and void, inoperative and/or incapable of being performed (in the context of the Stay Application). 36. Mr Manzoni submits that the authorities speak with one voice in deciding that questions of limitation go to admissibility rather than jurisdiction. In BBA v BAZ [2020] SGCA 53 , one of the party sought to set aside an arbitral award on the basis that one of the claims was statutorily time-barred. The Court of Appeal of Singapore held (see §§77-80) that a plea of statutory time bar goes to admissibility of the claim instead of jurisdiction of the tribunal. The objection is that the claim is defective rather than that the tribunal has no power to hear the claim. BBA v BAZ was endorsed in C v D . It is alsorecently (22 November 2021) adopted by the Supreme Court of New South Wales in Nuance Group (Australia) Pty Ltd v Shape Australia Pty Ltd [2021] NSWSC 1498 at§132. 37. Almost two decades before the language of admissibility vis-à-vis jurisdiction was accepted in C v D , Ma J (as the former CJ then was), has already adopted in Tommy CP Sze & Co v Li & Fung (Trading) Ltd [2003] 1 HKC 418 the same line of reasoning to rule that a limitation defence does not render an arbitration agreement null and void, inoperative or incapable of being performed under Article 34(2)(a)(i) for the purpose of setting aside an arbitral award. The existence of a limitation defence does not mean that the arbitration cannot proceed, but only that the claim is at risk of being dismissed. A time bar does not defeat the tribunal’s jurisdiction to hear the claim which is conferred by an otherwise valid arbitration agreement. It only provides a defence to a claim. 38. Mr Manzoni submits that the Plaintiff’s attempt to invalidate Clause 31 on the basis of a limitation defence has already been rejected by the Court in Tommy CP Sze . I agree. 39. Basic Law rights were not relied on in Tommy CP Sze . But bringing in reference to the Basic Law does not take the Plaintiff any further, and these points can be dealt with quickly. The ultimate argument falls on public policy and the alleged denial of Basic Law rights only serve as particulars to the public policy ground. The statutory limitation defence is not inherent in the design of Clause 31. The parties did not contract out their rights to commence arbitration when the claim is still alive. Clause 31 places restrictions on parties’ ability to institute arbitration, not the ability to access the courts. Article 35 does not apply to arbitration, and it is also not clear that the Plaintiff (being a company) could rely on Article 35 which protects the right to access to courts of Hong Kong residents. The attempt to fit the Plaintiff’s cause of action in law as a “property” the right to the use of which is protected by Article 105 is, with respect, hopeless. Article 105 is in Chapter V ‘Economy’ and features an individual’s right to compensation when their properties are lawfully deprived by the Government or a Government agency, that is public authorities. 40. Granted, being an arbitration agreement, Clause 31 does restrict the parties’ right to access the court to obtain judicial remedies. But so do all arbitration agreements. This is why the question of compatibility with the Basic Law is not to be examined on a piecemeal basis with regard to specific rules or concepts in arbitration law, but on the basis of the entire scheme of judicial scrutiny of arbitration awards: see, for example, C v D at §52. There is no absolute exclusion of the Court’s involvement, and the extent of available access to the Court is a matter of the parties’ bargain 41. Given that a limitation defence is not inherent in Clause 31, I see no features which set Clause 31 apart from the various multi-tiered arbitration agreements which have long been accepted as valid by the Court. I do not understand the Plaintiff to be launching a constitutional challenge on multi-tiered arbitration agreements as a type. E. The Set Aside Application 42. My finding that the characterization of the question of compliance or non-compliance with pre-arbitration procedures is an admissibility issue – not a true jurisdictional challenge – means that the decision in the Award was one on admissibility. It is not subject to review. In any event, even if one regards the decision of the Arbitrator as concerning his jurisdiction in the true sense, rather than admissibility, section 34(4) of the AO provides that his decision is not subject to appeal, and section 81 of the AO does not apply to a decision declining jurisdiction. 43. That suffices to dismiss the application. I shall, however, go on to consider the Plaintiff’s other arguments. 44. The application is made by the Plaintiff by reference to Article 34(2)(a)(i) and (iii), which provide as follows: An arbitral award may be set aside by the court specified in article 6 only if: (a) the party making the application furnishes proof that: (i) a party to the arbitration agreement referred to in article 7 was under some incapacity; all the said agreement is not valid under the law to which the parties have subjected it or, failing any indication thereon, under the law of this State; or (iii) the award deals with a dispute not contemplated by or not falling within the terms of the submission to arbitration, or contains decisions on matters beyond the scope of the submission to arbitration, provided that, if the decisions on matters submitted to arbitration can be separated from those not so submitted, only that part of the award which contains decisions on matters not submitted to jurisdiction may be set aside 45. On Article 34(2)(a)(iii), Mr Houghton submits that the competence-competence doctrine means that the Arbitrator’s jurisdiction begins and ends with determining his own jurisdiction, and his attempt to construe Clause 31 in §85(i) thus goes beyond parties’ submission. On the other hand, he admits that construing Clause 31 was necessary for deciding the “jurisdictional challenge”. Mr Houghton’s objection, as he put it, was a very narrow one, and to my mind wholly artificial. 46. The submission is that the Arbitrator could set out his understanding of the proper construction of Clause 31 as a “reason” but not as a “holding”. In other words, §85(i) should not appear under the heading “Decision”, although it could appear in the body of the award. This cannot be right. Otherwise, the disposition of the Set Aside Application would turn on – as Mr Manzoni put it – the stylistic choice of the Arbitrator. Indeed, the Arbitrator could have run §85(i) and §85(ii) together as a single paragraph, or he could have added “therefore” at the beginning of §85(ii). He could also be more old-fashioned and dispensed with the use of headings (including “Decision”) altogether. These stylistic choices should not affect the resolution of this application. 47. I also accept that the Arbitrator was clearly requested by the parties to construe Clause 31 and it is impermissible now to argue that it falls outside the scope of parties’ submissions to arbitration. I reject Mr Horton’s submission that when concluding that he did not have jurisdiction, the Arbitrator should have avoided making any purportedly binding finding, decisional determination on the facts or the true meaning and effect of any term of the Sub-contract. The Arbitrator could not have reached that part of the decision which the Plaintiff does not seek to challenge without construing the true meaning and effect of Clause 31. Indeed, as I said as part of the Introduction to this Judgment, it is obvious that §85(i) summarises the Arbitrator’s view of the effect of his construction of Clause 31, and identifies that as the reason why he held at §85(ii) that he had no “jurisdiction”. That is precisely the question submitted to the Arbitrator to determine, as the proper construction of Clause 31 was the foundation for the Defendant’s challenge, and so the foundation for the preliminary question the Plaintiff asked to be determined. 48. On Article 34(2)(a)(i), I have explained above why I do not think that the prospect of being met by a limitation defence would render Clause 31 invalid as being contrary to public policy. As a side note, since this ground attacks the validity of Clause 31, its success would naturally lead to the setting aside of the entire Award, not only §85(i). 49. The Set Aside Application falls to be dismissed. F. The Stay Application 50. The Defendant relies on section 20 (1) of the AO, RHC Order 13 Rules 8(2)(b) and (2A)(b), and section 16(3) of the High Court Ordinance Cap 4 . In essence, they all empower or mandate the Court to stay proceedings in favour of a valid arbitration agreement. 51. The principles to be applied by the Court in stay proceedings are common ground between parties: (1) the clause in question must be an arbitration agreement; (2) the arbitration agreement must not be null and void, inoperative or incapable of being performed; (3) in reality there must be a dispute or difference between the parties; and (4) the dispute or difference between the parties must be within the ambit of the arbitration agreement. 52. The Plaintiff has two arguments to resist the stay. The Plaintiff does not dispute that requirements (1), (3) and (4) are fulfilled. But, first, it contends that requirement (2) is not fulfilled since the prospect of a limitation defence has made Clause 31 null and void, inoperative or incapable of being performed. I have rejected this argument above. 53. The Plaintiff’s second argument turns on section 34(5) of AO, which provides that: Despite section 20, if the arbitral tribunal rules that it does not have jurisdiction to decide a dispute, the court must, if it has jurisdiction, decide that dispute. 54. Mr Houghton relies on the Arbitrator’s express ruling in §85(ii) of the Interim Award that the Tribunal had no “jurisdiction”. Thus, he says, the Court “must” decide the dispute. But again, I have already adopted the approach in C v D in characterising non-compliance with pre-arbitration procedures as really a question of admissibility rather than jurisdiction. What was decided by the Arbitrator was that the Plaintiff’s claim was not admissible for prematurity, but not that he had no jurisdiction in the true sense to hear the claim. Section 34(5) is not applicable. 55. In his reply submissions, Mr Houghton made four points to urge the Court to be cautious in applying C v D . He said that: (1) The distinction drawn in C v D mainly concerns the Set Aside Application, but not the Stay Application. (2) C v D is a first instance decision and is apparently subject to an appeal. (3) The admissibility vis-à-vis jurisdiction distinction is found in academic writings, but not the law. (4) The Court should be circumspect in the re-classifying the prematurity issue as an admissibility issue, given that it was not so argued before the Arbitrator. 56. However, as to these four points: (1) Characterising the prematurity issue as an admissibility issue is clearly important to the Stay Application as well. As the Award is not a decision on jurisdiction, section 20(5) of the AO is simply inapplicable. (2) Whilst C v D is a first instance decision, its thorough review and its legal analysis are highly persuasive, and make conceptual sense for the numerous reasons I have identified. (3) C v D referred to and considered various Court decisions across jurisdictions. Indeed, after C v D , the admissibility vis-à-vis jurisdiction distinction continues to gain traction in national courts this year: see the 22 November 2021 decision of the Supreme Court of New South Wales in Nuance Group (Australia) Pty Ltd v Shape Australia Pty Ltd mentioned above , and the 8 October 2021 English decision in NWA v NVF [2021] EWHC 2666 (Comm). It could not be said that the distinction is only found in academic writing. (4) As already noted above, the Court reviews “true question of jurisdiction” on a de novo basis: see S Co v B Co [2014] 6 HKC 421 . In stark contrast, decisions on admissibility issues are not subject to the Court’s review. It might be asked what is the position about the prior question of characterisation. Both the Hong Kong Court and the English Court did not shrink from re-characterising the prematurity issue as an admissibility issue, despite its being characterized as a jurisdictional challenge by the tribunal, see C v D , The Republic of Sierra Leone v SL Mining Limited [2021] EWHC 286 (Comm) (which was considered in C v D) , and the NWA case. In the conflicts of law landscape, the issue of characterisation is one for the forum generally and the same logic applies here. I see no reason why this Court should be bound by the characterisation adopted by the Arbitrator. The adoption of what seems to me to be an inaccurate label does not change the substance. 57. Further, at least in the context of an application to set aside an award, whenever a Court is faced with an application under section 81/Article 34, the Court must first decide whether the subject matter of the intended challenge falls within that section/Article. In essence, that requires a decision as to whether what is mounted is a question of true jurisdiction. Indeed, that is a jurisdictional question for the Court, because unless the Court finds that the subject matter of the intended challenge falls within the section/Article, the Court has no jurisdiction to grant the relief under the section/Article. 58. The Stay Application falls to be dismissed. G. Result 59. The Plaintiff’s Set Aside Application is dismissed. 60. The Defendant’s Stay Application is granted. 61. As to costs, I see no reason why costs should not follow the event of each application. Therefore, the Plaintiff shall pay the Defendant’s costs of both applications. 62. Further, where a challenge to an award fails, and where an application for a stay in favour of arbitration succeeds, the usual award of costs is on the indemnity basis. But, in this case, given that the admissibility/jurisdiction distinction has only recently been affirmed in Hong Kong, indeed after the current applications were made, in the exercise of my discretion in this case it seems to me that costs should be payable on the party and party basis. 63. If costs are not agreed, I shall assess costs on a summary basis in accordance with the following timetable. The Defendant shall provide a Statement of Costs for Summary Assessment to the Plaintiff and to the Court by 5pm on 12 January 2022. Unless the amount of costs (whether as claimed or in some other amount) is agreed between the parties by 5pm on 19 January 2022, the Plaintiff shall provide its List of Objections to the Defendant and to the Court by 5pm on 26 January 2022. Thereafter, I shall proceed to the assessment. (Russell Coleman) Judge of the Court of First Instance High Court Mr Anthony Houghton SC, Mr Vincent Lam, Mr Kurt Ng and Mr Ben Chan, instructed by Holman Fenwick Willan, for the plaintiff Mr Charles Manzoni SC, instructed by Pinsent Masons, for the defendant Look up this case on Lawcite Noteup",
  "length": 37563,
  "headers_seen": [
    "A. Introduction",
    "B. Key Threads of the Argument",
    "C. Admissibility or Jurisdiction",
    "D. Clause 31 and Limitation Defence",
    "E. The Set Aside Application",
    "F. The Stay Application",
    "G. Result"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2021/3645",
  "query": "Model Law",
  "ts": "2025-10-15T11:34:47",
  "ok": true
}