{
  "title": "李鳳欣 AND ANOTHER V. HARVEST TRADE INVESTMENTS LTD | [2025] HKCFI 2004 | HKLII",
  "court": null,
  "year": 2025,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2025] HKCFI 2004 李鳳欣 AND ANOTHER V. HARVEST TRADE INVESTMENTS LTD Judgment Information Date 15 May, 2025 Action No. HCCT83/2024 Neutral Cit. [2025] HKCFI 2004 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCCT83/2024 html PUBLIC \"-//W3C//DTD XHTML 1.0 Transitional//EN\" \"http://www.w3.org/TR/html4/loose.dtd\" HCCT83/2024 李鳳欣 AND ANOTHER v. HARVEST TRADE INVESTMENTS LTD HCCT 83/2024 [2025] HKCFI 2004 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO 83 OF 2024 _________________ IN THE MATTER of Section 21L of the High Court Ordinance ( Cap 4 ) _________________ BETWEEN 李鳳欣 1 st Plaintiff 龔倩雅 2 nd Plaintiff and HARVEST TRADE INVESTMENTS LIMITED Defendant _________________ Before: Deputy High Court Judge Jonathan Wong in Chambers (Not open to Public) Date of Hearing: 28 October 2024 Date of Further Submissions: 13 November 2024 Date of Judgment: 16 May 2025 _______________ J U D G M E N T _______________ 1. Introduction 1.1 The 1 st and 2 nd Plaintiffs (respectively “ P1 ” and “ P2 ” and collectively “ Ps ”) are respectively the wife and daughter of the late Mr Gong Guoqiang (“ Mr Gong ”). By their originating summons dated 11 July 2024 (“ OS ”), Ps seek an anti-arbitration injunction to restrain the Defendant (“ D ”) from pursuing the arbitral proceedings (“ Current Arbitration ”) commenced at the China International Economic and Trade Arbitration Commission Hong Kong Arbitration Center (“ CIETAC Hong Kong ”). 1.2 In addition to the OS, before me is also D’s summons dated 9 October 2024 (“ Summons ”) for leave to adduce and rely on the 2 nd Affirmation of Mr Wong Kwok Lik (respectively “ Wong 2 nd ” and “ Mr Wong ”). 1.3 At the hearing, Ps were represented by Mr Kenny Lin (with Mr Victor Lau) and D by Mr Clark Wang. 2. Background 2.1 The background matters are largely taken from the Agreed Chronology lodged by the parties. 2.2 On 23 July 2012, the following parties entered into a sale and purchase agreement (“ Agreement ”) in respect of the shares of a Hong Kong company called “华顺达置业有限公司” (“ Holding Company ”): (1) D and Profit Sheen International Limited (“ Profit Sheen ”) as the seller (甲方), (2) Mr Wong as the guarantor of the seller, (3) Truetech Investments Limited (“ Truetech ”) as the purchaser (乙方) and (4) Mr He Zhiqiang (“ Mr He ”) and Mr Gong as the guarantors of the purchaser. 2.3 The sole business of the Holding Company was to hold a Mainland company called “广州市华商贸房产发展有限公司” which held a 74% interest in a real estate project in Guangzhou known as “东湖广场” (“ Project ”). 2.4 On 29 July 2012, the parties to the Agreement entered into a supplemental agreement (“ Supplemental Agreement ” and together with the Agreement “ SPA ”). 2.5 At the time of the execution of the SPA, D was the overwhelming majority shareholder of the Holding Company. Subsequently in October 2017, Profit Sheen assigned its rights under the SPA to D. 2.6 The dispute resolution mechanism under the SPA is set out at Clause 12 of the Agreement: “[12.0] 双方特别约定: 股份转让合同中双方的权利、责任和义务的法律基础及解决合同争议的任何事项，均适用于香港特别行政区法律并受香港特别行政区的司法管辖。 [12.2] 甲、乙双方如对合同的履行有任何争议，应通过友好协商解决；若协商不成，任何一方均可向香港特别行政区司法机关提起诉讼或仲裁进行解决，有关栽决对双方有法律约束力。若有涉及中国内地财产保全的争议事项，如香港特别行政区法院没有权力进行审理或协调的情况下，双方同意中国国际经济贸易仲裁委员会作为进行仲裁和处理争议的仲裁机构。” 2.7 On 29 April 2016, Mr Gong passed away. 2.8 Disputes arose between the parties. On 6 November 2016, D commenced arbitral proceedings against Truetech and Mr He at the China International Economic and Trade Arbitration Commission in the Mainland (“ CIETAC ”), which proceedings were eventually withdrawn by D on 9 May 2019 (“ Withdrawn Proceedings ”). Whilst the Withdrawn Proceedings were afoot, Truetech and Mr He had made challenges against the validity of Clause 12.2 of the Agreement. The primary contention raised by Truetech and Mr He was that Clause 12.2 referred to both litigation in court and arbitration (“或裁或審”) and was therefore invalid. Those challenges were dismissed by the Beijing No 4 Intermediate People’s Court on 19 March 2018 (“ 19/3/18 Judgments ”) on the following basis: “該約定系簽約各方真實意思表示，對有涉及中國內地財產保全的爭議事項雙方同意貿仲作為進行仲裁裁決和處理爭議的仲裁機構，屬於約定明確。故貿仲系雙方約定的仲裁機構，涉案仲裁協議應認定有效。” 2.9 Prior to the withdrawal of the Withdrawn Proceedings, on 17 January 2019, D commenced another set of arbitral proceedings against Truetech, Mr He and Mr Gong at CIETAC (“ Beijing Arbitration ”). In the Request for Arbitration (“ Original Claims ”), reliance was placed on the 19/3/18 Judgments on the validity of Clause 12.2 of the Agreement. 2.10 As Mr Gong had already passed away, on 3 February 2019, D substituted Ps in place of Mr Gong in the Beijing Arbitration. As such, the respondents in the Beijing Arbitration were Truetech, Mr He and Ps (collectively “ Beijing Respondents ”). 2.11 On 15 August 2019, D filed a notice of amendment of the Original Claims in the Beijing Arbitration (“ Amended Claims ”). 2.12 The trial of the Amended Claims and the Beijing Respondents’ counterclaims in the Beijing Arbitration took place on 22 August 2019 and the Arbitral Tribunal published its award on 29 December 2020 (“ Award ”), by which the Arbitral Tribunal largely found in D’s favour. 2.13 On 1 November 2021, D applied to the Guangzhou Intermediate People’s Court to enforce the Award. In May 2023, the sums awarded to D by the Award were satisfied. D received RMB80,459,321.40 in total. 2.14 Thereafter, on 9 February 2024, D commenced the Current Arbitration. The respondents in the Current Arbitration (“ Hong Kong Respondents ”) are the same as those in the Beijing Arbitration, namely Truetech, Mr He and Ps. 2.15 The Hong Kong Respondents have all made jurisdictional challenges to CIETAC Hong Kong which are pending determination (“ Pending Jurisdictional Challenges ”). However, prior of their determination, Ps issued the OS. On the other hand, without prejudice to the Pending Jurisdictional Challenges, Truetech and Mr He filed their defence and counterclaim in the Current Arbitration. 3. Grounds advanced by Ps 3.1 The following grounds are advanced by Ps to justify the anti-arbitration injunction sought. 3.2 First, Ps say that Clause 12.2 of the Agreement is not a valid arbitration agreement (“ Ground (1) ”). 3.3 Secondly, in any event, the commencement of the Current Arbitration on the basis that it should be administered by CIETAC Hong Kong is not permissible under Clause 12.2 of the Agreement (“ Ground (2) ”). 3.4 Thirdly, even were Clause 12.2 of the Agreement a valid arbitration agreement, the Current Arbitration is vexatious, oppressive and/or abusive, on the basis that the disputes between the parties have already been decided in the Beijing Arbitration. Even were res judicata in the narrow sense not applicable, the issues raised in the Current Arbitration offend the rule in Henderson v Henderson (1843) 3 Hare 100 (“ Ground (3) ”). 3.5 Fourthly, P2 is not a proper respondent in the Current Arbitration (“ Ground (4) ”). 4. The applicable principles 4.1 The principles applicable to the grant of an anti-arbitration injunction are set out in 廈門新景地集團有限公司 formerly known as廈門市鑫新景地房地產有限公司 v Eton Properties Limited & Anor [2023] HKCFI 1327 : (1) Whilst the court has the jurisdiction and power under section 21L of the High Court Ordinance Cap 4 to grant an anti-arbitration injunction, the power to grant such an injunction must be exercised not only with great caution and in circumstances which can be shown to be wholly exceptional, but also with due and proper regard to the objectives and principles of the autonomy, independence and finality of arbitration as enshrined in the Arbitration Ordinance Cap 609 (“ AO ”) (§26); (2) Two conditions have to be satisfied before the power to grant an anti-arbitration injunction may be exercised, namely: (a) the injunction does not cause injustice to the claimant in the arbitration, and (b) the continuance of the injunction would be oppressive, vexatious, unconscionable or an abuse of process (§27); (3) Where it is clear that the dispute in question is within the terms of a valid arbitration agreement, the court should refrain from interfering (§28); (4) There can be no doubt that the objectives of autonomy as set out at section 3 of the AO, and the policy of minimal curial intervention in arbitration, as repeatedly emphasized by the court, must be borne in mind when an application for anti-arbitration injunction is considered (§33). 4.2 In the context of the grounds raised by Ps, it is pertinent to note the following further observations. 4.3 First, Grounds (1), (2) and (4) essentially raise a dispute over the validity of Clause 12.2 of the Agreement. Where there is a dispute over the validity of an arbitration agreement, it would generally be appropriate for that issue to be left in the first instance to be determined by the arbitral tribunal ( Eton Properties §29). Analogously, in respect of an application to stay court proceedings in favour of arbitration, section 20(1) of the AO gives effect to Article 8 of the UNCITRAL Model Law. Article 8 of the Model Law provides as follows: “(1) A court before which an action is brought in a matter which is the subject of an arbitration agreement shall, if a party so requests not later than when submitting his first statement on the substance of the dispute, refer the parties to arbitration unless it finds that the agreement is null and void, inoperative or incapable of being performed. (2) Where an action referred to in paragraph (1) of this article has been brought, arbitral proceedings may nevertheless be commenced or continued, and an award may be made, while the issue is pending before the court.” 4.4 In the above regard, the principles governing a stay in favour of arbitration are well-established. As set out at Mice Engineering Ltd v Johnson Controls Hong Kong Limited [2022] HKCFI 2768 §§17-18 (and the further cases cited therein): (1) On a stay application under section 20 of the AO, the court would consider the following questions: (a) is there an arbitration agreement between the parties, (b) is the clause in question capable of being performed, (c) is there in reality a dispute or difference between the parties and (d) is the dispute or difference between the parties within the ambit of the arbitration agreement; (2) The onus is on the applicant for stay to demonstrate only that there is a prima facie case that the parties are bound by an arbitration clause, and unless the point is clear, the court should not attempt to resolve the issue and the matter should be stayed in favour of arbitration, as it is for the tribunal to decide first on its jurisdiction. 4.5 In my view, the above established principles governing a stay application made under section 20 of the AO provide an analogously useful reference. As noted at Eton Properties §29 (citing Claxton Engineering Services Ltd v TXM [2012] 1 CLC 326): “In many of the cases which concern whether an anti-arbitration injunction should be granted there is an issue as to whether there is any or any valid arbitration agreement. One can well understand why it would generally be appropriate for that issue to be left in the first instance to be determined by the arbitration tribunal.” 4.6 Secondly, in cases where the question of res judicata or issue estoppel is raised (as here by Ground (3)), Eton Properties §53 observes as follows: “… In this context, the Court must recognize and accept that it is within the jurisdiction of the tribunal to decide questions of res judicata or issue estoppel, which go to the merits of the defence and can be raised by the Plaintiff as an answer to the claims made by the Defendants in the New Arbitration , and the tribunal can determine whether the issues decided and findings made by either the tribunal in the 1 st Award or 2 nd Award, or by the Hong Kong courts in HCCL 13 on the claim for breach of the Promise affect the relief sought by the Defendants in the New Arbitration.” (emphasis added) 4.7 It is right, however, to point out that a limited anti-arbitration injunction was granted in Eton Properties (§58), on the bases that the plaintiff in that case had clearly shown that some issues were not covered by and not within the scope of the relevant arbitration agreement and any arbitration of such issues vexatious, oppressive and an abuse of process in seeking to attack various judgments of the Hong Kong courts. 4.8 To supplement the preceding paragraph, the following observations are also made in SA v KB [2016] 2 HKLRD 1249 : “[110] The position would of course be different if the Guangdong Court had already given judgment. Provided that the judgment satisfies the criteria for giving rise to res judicata or issue estoppel, it may be (and I put it no higher than that) that the successful party in the Guangdong Action can rely on the judgment as a bar to re-opening in the arbitration those issues which have been determined by the judgment. Indeed, it may be possible, based on the doctrine of res judicata, to seek an injunction to restrain an arbitration: Glasgow and South-Western Railway Co v Boyd & Forrest 1918 SC (HL) 14 …” (emphasis added) 4.9 With the above principles in mind, I turn to address the grounds advanced by Ps. However, before doing so, I should set out a number of preliminary observations. 4.10 First, the issues raised by Ps in the Pending Jurisdictional Challenges are identical to those which fall for determination in the OS. Although not addressed in the evidence, I enquired and was told by the parties at the hearing that the Pending Jurisdictional Challenges have been held up due to the fact that one of the arbitrators had to be replaced due to an issue of conflict. There is no suggestion that following the replacement of the conflicted arbitrator, the constituted arbitral tribunal would not then proceed to deal with the Pending Jurisdictional Challenges. 4.11 The question the court then raised with Mr Lin was whether there was any justification for the court to determine the same issues in parallel, especially given the principles set out in the preceding section. Mr Lin initially submitted that were the arbitral tribunal to determine the Pending Jurisdictional Challenges against Ps (namely deciding that the arbitral tribunal does have jurisdiction over the Current Arbitration), that decision would be final and Ps would be left without recourse. 4.12 The initial position adopted by Mr Lin is plainly incorrect. In the course of the hearing, Mr Lin was referred to section 34 of the AO. Section 34 adopts Article 16 of the UNCITRAL Model Law. Article 16(3) provides as follows: “The arbitral tribunal may rule on a plea referred to in paragraph (2) of this article either as a preliminary question or in an award on the merits. If the arbitral tribunal rules as a preliminary question that it has jurisdiction, any party may request, within thirty days after having received notice of that ruling, the court specified in article 6 to decide the matter, which decision shall be subject to no appeal ; while such a request is pending, the arbitral tribunal may continue the arbitral proceedings and make an award.” (emphasis added) 4.13 In other words, were the Pending Jurisdictional Challenges determined against Ps, they clearly have recourse pursuant to section 34 of the AO to request the court to decide the matter on a de novo basis. 4.14 In the light of the principles set out above, it seems to me that the existence of the Pending Jurisdictional Challenges is a weighty factor against the grant of the injunctive relief sought by Ps, at least in respect of Grounds (1), (2) and (4) which are typical jurisdictional challenges often dealt with in an application made pursuant to section 20 of the AO. Unless there is a clear cut conclusion, it seems to me that Ps have a difficult task of demonstrating that deferring the decision at first instance to the arbitral tribunal would be vexatious, oppressive and/or abusive, which as set out at SA §89, has to be established on the balance of probabilities. 4.15 Secondly, whilst I agree with Mr Wang that Ground (3) is a merit issue, I do not agree with his primary position that Ps are asking the court to usurp the function of the arbitral tribunal and Ps should not even be permitted to raise Ground (3). As pointed out at §§4.6-4.8 above, in an appropriate case, the court should not hesitate to halt proceedings which are vexatious, oppressive and/or abusive. 4.16 The third preliminary observation is on D’s submission that Ps are estopped from contending against the validity of Clause 12.2 of the Agreement in the Current Arbitration by reason of their participation in the Beijing Arbitration. No direct authority has been cited by Mr Wang in support of this proposition. One can well understand that having participated in the Beijing Arbitration, Ps cannot then turn around to disavow the validity of the Beijing Arbitration, for example in the enforcement stage. But it seems to me that it is an entirely different proposition to suggest that Ps are now estopped from challenging the Current Arbitration, especially where the circumstances between the Beijing Arbitration and the Current Arbitration are different, not least in terms of the disputed issue on the seat of the arbitration. In any event, for the reasons set out below, this part of Mr Wang’s submission is not germane to my resolution of the issues in the present case. 5. Ground (1): Whether valid arbitration agreement 5.1 I reproduce here again Clause 12.2 of the Agreement, with my annotations in square brackets: “甲乙双方如对合同的履行有任何争议，应通过友好协商解决 [Friendly Negotiation Procedure]；若协商不成，任何一方均可向香港特别行政区司法机关提起诉讼或仲裁进行解决，有关栽决对双方有法律约束力 [Dispute Resolution Clause]。若有涉及中国内地财产保全的争议事项，如香港特别行政区法院没有权力进行审理或协调的情况下，双方同意中国国际经济贸易仲裁委员会作为进行仲裁和处理争议的仲裁机构 [Further Condition]。” 5.2 There is no dispute that the Friendly Negotiation Procedure does not feature in the present deliberation. 5.3 Ps rely on a number of matters to contend that Clause 12.2 is not a valid arbitration agreement. 5.4 First, Mr Lin argues that by Clause 12.0 of the Agreement (reproduced at §2.5 above), parties have agreed to submit to the jurisdiction of the Hong Kong court and as such there was no valid arbitration agreement. 5.5 I do not agree. As has been held at Tongcheng Travel Holdings Limited v OOO Securities (HK) group Limited [2024] HKCFI 2710 §32, it is eminently arguable that the inclusion of a jurisdictional clause in favour of the Hong Kong court may be construed to mean that the Hong Kong court is to have supervisory jurisdiction over arbitral proceedings commenced. 5.6 Secondly, Mr Lin argues that by the Dispute Resolution Clause, the parties have agreed to litigate or arbitrate at the Hong Kong Judiciary which is an impossibility as the Hong Kong Judiciary does not conduct arbitration. 5.7 I am unable to accept Mr Lin’s construction of the Dispute Resolution Clause is the sensible or only sensible construction. In my view, it is plainly arguable that the Dispute Resolution Clause should be construed as providing the options to either bring litigation in the Hong Kong court or proceed with arbitration. I note in particular that unless the Further Condition is satisfied (upon which CIETAC would be the agreed institution to administer the arbitration), the parties have not agreed on the applicable arbitral rules and procedures. In such circumstances, the Hong Kong court clearly has a role even at the commencement of an arbitration which does not satisfy the Further Condition, for example in the appointment of arbitrators under section 24 of the AO. 5.8 Thirdly, Mr Lin argues that Clause 12.2 of the Agreement does not contain a mandatory agreement to arbitrate, in that it contemplates either litigation or arbitration as an option for dispute resolution. 5.9 However, as has been held at William Company v Chu Kong Agency Co Ltd [1995] 2 HKLR 139 §§10-15, an arbitration agreement giving the parties the option to have their disputes either through arbitration or litigation is not void for uncertainty. At §14, Kaplan J said as follows: “In my judgment, this clause should be construed in the following manner. The parties have agreed on arbitration or litigation in China. When a dispute arises, the claimant has a choice. He can either seek arbitration or litigation in China. Once he has made the choice that is the end of the matter and the defendant will have no say. Once arbitration or litigation in China is chosen that creates a binding choice to which the court will usually give effect.” 5.10 In the more recent case of G v P [2023] HKCFI 2173 , Mimmie Chan J observed as follows: “[10] The courts have interpreted an optional arbitration agreement differently in cases such as China State Construction Engineering Corporation Guangdong Branch v Madiford Limited HCA 6563/1991, 2 March 1992, William Company v Chu Kong Agency Co Ltd [1995] 2 HKLRD 139 , Hermes One Ltd v Everbread Holdings Ltd [2016] 1 WLR 4098 , Polytek Overseas Ltd v Grand Dragon International Holdings Co Ltd [2017] 3 HKLRD 258 , Z v Y [2018] HKCFI 2342 , and Kinli Civil Engineering Ltd v Geotech Engineering Ltd [2021] 6 HKC 524 . In Kinli, I set out various authorities considered and argued on clauses which give an option or a choice to the parties between arbitration and litigation. I am not persuaded that the reasoning and analysis of the cases referred to in Kinli, and in particular the finding of the existence of an arbitration agreement even when the clause adopts language such as “may” or “can” (as held in China State, Hermes One and Guangdong Agriculture Co Ltd v Conagra International (Far East) Ltd [1993] 1 HKLR 113 ), do not apply by virtue only of the observation made in Tommy CP Sze as to clauses which do not provide for an element of compulsion. Cases may turn on the different terminology used in the contract, and the contract construed as a whole. At the end of the day, the ultimate question is one of construction of the clause in question, to ascertain the objective intention of the parties at the time of entering into the contract. [11] Even in the more recent case of Aiteo Eastern E & P Co Ltd v Shell Western Supply and Trading Ltd [2022] EWHC 2912 (Comm); [2023] 1 Lloyd’s Rep 1, the English Court continued to follow Hermes One Ltd and found that once an option to arbitrate conferred on a party had been exercised, the other party was bound to arbitrate .” (emphasis added) 5.11 For the above reasons, I am not persuaded by Mr Lin that Ps have shown that there is no prima facie case that Clause 12.2 of the Agreement amounts to a valid arbitration agreement. As such, I do not regard an anti-arbitration should be granted on the basis of Ground (1). I am not satisfied that deferring Ground (1) to the arbitral tribunal for determination at first instance is vexatious, oppressive and/or abusive. 6. Ground (2): The Further Condition 6.1 As I understand Mr Lin, there are two levels of arguments mounted in relation to Ground (2). 6.2 First, Mr Lin contends that in order for the parties to resort to arbitration administered by CIETAC, the Further Condition requires (1) that the disputes involve the preservation of assets in the Mainland and (2) that the Hong Kong court has no power to rule on or coordinate the disputes. Mr Lin says that the Further Condition is not satisfied. 6.3 Secondly, even were the Further Condition satisfied, the proper arbitral institution to administer the arbitral proceedings is CIETAC, not CIETAC Hong Kong. 6.4 In relation to Mr Lin’s first argument, the following factual matters are pertinent. D commenced the Current Arbitration on 9 February 2024. Shortly thereafter, on 15 March 2024, D, in aid of the Current Arbitration, obtained an asset preservation order from the Guangzhou Intermediate People’s Court against Truetech, Mr He, and Ps (“ Asset Preservation Order ”). However, it appears that only assets belonging to Mr He were identified in the Asset Preservation Order. 6.5 Two points are made by Mr Lin. First, he says that D’s claims in the Current Arbitration do not involve any preservation of assets in the Mainland. Secondly, he argues that the Asset Preservation Order does not identify any assets belonging to Ps. 6.6 In my view, there is plainly a prima facie case that the Further Condition is satisfied, therefore entitling it to commence a CIETAC arbitration, for the following reasons: (1) In granting the Asset Preservation Order, the Mainland court expressly referred to the Current Arbitration, and made reference to the Arrangement Concerning Mutual Assistance in Court-Ordered Interim Measures in Aid of Arbitral Proceedings by the Courts of the Mainland and of the Hong Kong Special Administrative Region (“ Arrangement ”) [1] . It seems to me that it is at least arguable that on its proper construction, the Further Condition is not only satisfied by the type of preservation akin to RHC Order 29, rule 2 (preservation of subject-matter of cause or matter), as opposed to, as here, a “ Mareva ” type preservation of assets; (2) I am also of the view that there is plainly a prima facie case that where, as here, only assets of one of the Hong Kong Respondents (Mr He) is subject to the Asset Preservation Order, that fact should not have the result of a fragmentation of the proceedings such D has to pursue Mr He and the other Hong Kong Respondents by way of separate proceedings. 6.7 In relation to Mr Lin’s second argument, I think Mr Wang has fairly accepted that there is a tension between the Beijing Arbitration and the Current Arbitration. Mr Wang explains that, as a matter of practicality, the Beijing Arbitration was instituted in the Mainland since the Arrangement was not in effect at the time of the commencement of the Beijing Arbitration, and as a result, D was unable to obtain any asset preservation order in aid of arbitration in Hong Kong. Prior to the commencement of the Beijing Arbitration, on 15 January 2019, D did obtain an asset preservation order in aid of the Beijing Arbitration. Mr Wang, however, submits that the previous tension does not detract from the clear intention of the parties, namely to arbitrate in Hong Kong. He therefore reasons that the Current Arbitration satisfies the second limb of Article 76(2) of the CIETAC Rules [2] . Article 76 of the CIETAC Rules provides: “1.CIETAC has established the CIETAC Hong Kong Arbitration Center in the Hong Kong Special Administrative Region. The provisions of this Chapter shall apply to arbitration cases accepted and administered by the CIETAC Hong Kong Arbitration Center. 2. Where the parties have agreed to submit their disputes to the CIETAC Hong Kong Arbitration Center for arbitration or to CIETAC for arbitration in Hong Kong, the CIETAC Hong Kong Arbitration Center shall accept the arbitration application and administer the case .” (emphasis added) 6.8 On reflection, I can see the force of Mr Lin’s following counter-arguments. He points out that CIETAC Hong Kong had not been established at the time of the execution of the SPA. Therefore, even were the Further Condition satisfied, the parties must have intended that the arbitral proceedings would be one “seated” in the Mainland. Mr Lin therefore reasons that the Article 76(2) of the CIETAC Rules does not assist D. 6.9 The difference between an arbitration administered by CIETAC and one administered by CIETAC Hong Kong may be significant. Were the arbitral proceedings administered by CIETAC Hong Kong, under Article 77 of the CIETAC Rules, unless otherwise agreed by the parties, the place of arbitration shall be Hong Kong and the law applicable to the arbitral proceedings shall be the arbitration law of Hong Kong and the arbitral award shall be a Hong Kong award. 6.10 I agree with Mr Wang that Mr Lin’s second argument is one concerning the interpretation of CIETAC Rules. In arguing that Article 76 of the CIETAC Rules has not been satisfied, Ps are not disputing the intention to arbitrate but whether the arbitration should be administered by CIETAC or CIETAC Hong Kong. 6.11 I further agree with Mr Wang that the propriety of commencement of the Current Arbitration at CIETAC Hong Kong should properly be characterized as a procedural dispute. The combined effect of Articles 2(2) [3] , 2(3) [4] and 2(6) [5] of the CIETAC Rules, is (1) CIETAC Hong Kong is a branch of CIETAC, (2) the CIETAC Arbitration Court may authorize and designate a sub-commission/arbitration centre (including CIETAC Hong Kong) to administer relevant cases having regard to the circumstances of such cases and (3) importantly, in the event of any dispute on the precise sub-commission/arbitration centre, a decision shall be made by CIETAC. 6.12 Further, according to Article 87(2), the CIETAC Rules shall be interpreted by CIETAC. 6.13 I therefore accept Mr Wang’s submission that the foregoing factors are such that Ground (2) should at first instance be decided in the Pending Jurisdictional Challenges. 6.14 For the above reasons, I am of the view that Ground 2 does not justify the grant of an anti-arbitration injunction. 7. Ground (3): Whether current arbitration vexatious, oppressive and/or abusive 7.1 The parties have at my request prepared a Scott Schedule which is annexed hereto as Annexure 1. The Scott Schedule has helpfully set out (1) the claims pursued in the Original Claims, (2) the claims pursued in the Amended Claims, (3) the parties’ respective positions on what was decided in the Beijing Arbitration, (4) the parties’ respective positions on the claims pursued in the Current Arbitration and (5) the parties’ respective positions on whether the identified claims should be injuncted. As may be seen from the Scott Schedule, the relevant issues for present purposes are Issues (2), (5), (6), (7), (8) and (9). 7.2 According to the Request for Arbitration for the Current Arbitration, Issue (5), namely whether Ps are liable to pay liquidated damages in the sum of RMB 100,000,000 is an alternative claim (Request for Arbitration §75(1)(d)). 7.3 Similar to the observations made at Eton Properties §50, a particular feature in the present case is that the SPA has not been terminated and is continuing. At Eton Properties §50, Mimmie Chan J observed as follows: “In this case, it has to be borne in mind that, as the Hong Kong courts have recognized, the 1 st Award is for the Agreement to be continued to be performed. There is as yet no order by any tribunal or court to the effect that the Agreement has been terminated, or that the parties have been discharged therefrom, the courts and the tribunal rejecting the argument that performance of the Agreement is impossible. The Defendants therefore have a right to invoke the arbitration clause in the subsisting Agreement, and to submit to arbitration any dispute “arising from the performance of the Agreement” , in accordance with and as provided for in the relevant Article 13 of the Agreement. They claim that the performance, or the purported/attempted performance, of the Agreement has demonstrated that it should be terminated, and that with the passing of the Civil Code and the amendment of the Contract Law, the Defendants have now become entitled to seek termination of and their discharge from the Agreement, notwithstanding that they were held to have been in breach of the Agreement.” (emphasis added) 7.4 It is part of D’s case (disputed by Ps) that the claims made in the Current Arbitration are based on events which occurred between 2019 and 2023 and causes of action that only arose after the Beijing Arbitration was already in progress or after it was completed. As is plain from the Scott Schedule, res judicata in the narrow sense is only made in respect of Issues (5) and (8). For the other issues, Ps’ argument is that they should or could have been raised in the Beijing Arbitration. 7.5 No authority has been cited by Ps to show that an anti-arbitration injunction has been granted on the basis that the rule in Henderson v Henderson has been offended. As Ps accept, by reference to Ngai Few Fung v Cheung Kwai Heung [2008] 2 HKC 111 , it is one thing to refuse to allow a party to relitigate a question which has already been decided, it is quite another to deny him the opportunity of litigating for the first time a question which has not been previously adjudicated on. In so far as the rule in Henderson v Henderson suggests that there is a presumption against the brining of successive actions, the Court of Appeal considered that that is a distortion of the true position. 7.6 In my view, unless a point is clear cut on the present material, the less I say about the dispute the better. As has been pleaded in the Defence and Counterclaim filed by Truetech and Mr He in the Current Arbitration, Ground 3 is specifically raised as a defence. Having considered the Scott Schedule and the submissions, I am not satisfied that there is a clear-cut answer on Issues (2), (6), (7), (8) and (9) and they should be left for adjudication in arbitration, in accordance with the general approach set out at §4.6 above. 7.7 I am however satisfied that Ps have clearly shown that Issue (5), namely that relating to the issue of liquidated damages was decided against D in the Beijing Arbitration. I do not agree with Mr Wang’s submission that the Award never decided on the enforceability of the liquidated damages clause itself. 7.8 The following is stated at pages 107-108 and 117 of the Award: “… 依照案涉《合同》及《补充协议》的约定， 被申请人如违约要承担以下三类违约金，即以按月息率 3% 向申请人 给付利息补偿金未付股份转让价款、 1 亿元的履约保证金、以及自应付未付日起，按未付款余额每天 0.05% 复利计付的 额外利息补偿金。其中 1 亿元违约金支付条件为，未能按照 约定交易交割时限、约定贵任和须完成的一切工作和义务等，在守约方向违约方书面通知后 10 天内，仍未作出令守约方 满意的整改 ;对于月息 1%的利息和月息率 3%利息补偿金的 起算日为首次转让成交日，即 2012 年 8 月 9 日，而非逾期 之日;对于日 0.5%。计算的额外利息补偿金，第一年的年利率 将达到 222.68%。仲裁庭认为， 根据香港法律，某个违约损害赔偿条款是否构成无效的惩罚性条款，重点审查该等条款 是否具如下特点之一 : 第一，相应的违约金金额是否是守约人基于对违约可能造成损失的真诚估算而确定的，是否存在夸张的、过高的、不合情理、不成比例的情形 ; 第二，出现 违约时相应的利率是否增加、是否具有溯及力 ; 第三，相应的违约金金额或利率设置的目的是为了弥补违约损失，还是为了 恫 吓对方使得其不敢违约 ; 第四，相关违约金是否存在不区分违约情形轻重而一律要求支付该等违约金。仲裁庭认为，依照香港法律标准，案涉合同关于违约金的约定应显然 明显过高，不区分违约轻重一律适用，且具有溯及力，已经超出弥补违约损失的目的，属于过高的、夸张和不合理的惩罚性条款，故不应被执行。 仲裁庭注意到，申请人在其变更后的仲裁请求中将复利请求撤回，主张本案实际年息仅为 36%, 即便加上 1 亿元违 约金，亦属于有效条款;同时提出暂不主张复利，但不放弃该部分权利。 仲裁庭认为，前述关于该违约金条款无效的判定是基于对该条款整体而言，申请人仅依据该条款的部分内容提出本项仲裁请求并不影响该条款在法律上的定性，香港法律也不允许仲裁庭通过调低支付违约金额以部分执行该 等无效的惩罚性条款，因此，即使在申请人主动调减其违约请求金额的情况下，由于申请人主张违约赔偿所依据的合同条款属惩罚性的无效条款，其据此提出的仲裁请求亦无法得到仲裁庭的支持。 仲裁庭还注意到，申请人主张，与被申请人违约给申请人造成损失相比较，案涉合同规定的违约金并非过高，被申 请人存在拖欠缴纳华商贸公司应付未付税费款项约 6,000 多 万元，以及未经申请人同意擅自处分或售卖华商贸公司和申请人资产等多项违约行为，给申请人造成重大经济损失。仲裁庭认为，申请人未能提供相应证据证明其上述主张，故，对申请人的这一主张，仲裁庭不予支持。 对于申请人的笫五项仲裁请求，即请求裁决第一被申 请人向申请人支付合同违约金《履约保证金》一亿元整，请求第二被申请人对该项支付义务承担连带清偿贵任，第三被申请人和笫四被申请人在继承龚国强遗产的范围内对该项支付义务承担连带清偿 责 任。 如前所述，仲裁庭认为，申请人的本项仲裁请求所依据的合同条款属于惩罚性的无效条款，不具有执行力，故，申 请人的本项仲裁请求无法得到仲裁庭的支持。 ” (emphasis added) 7.9 In my view, the above passages have dealt with the enforceability of the liquidated damages clause against D, on the basis that it was penal in nature. As such, I agree with Mr Lin that it matters not that the breaches relied on by D in the Current Arbitration are different from those in the Beijing Arbitration. 7.10 I am therefore satisfied that D’s claim for liquidated damages in the Current Arbitration is vexatious, oppressive and an abuse of process in seeking to attack the Award. Insofar as necessary, I also take into account that D’s claim for liquidated damages is an alternative claim, and to that extent, any potential injustice caused is as a result mitigated. 8. Ground (4): Locus of P2 8.1 Section 22(1) of the AO provides: “Unless otherwise agreed by the parties, an arbitration agreement is not discharged by the death of a party and may be enforced by or against the personal representatives of that party.” 8.2 In the present case, P1 is the administratrix of the estate of the late Mr Gong in Hong Kong. It is accepted by Mr Lin that D can legitimately commence the Current Arbitration against P1 in her capacity as the administratrix of the estate. 8.3 P2, however, is only sued as a beneficiary of the estate of the late Mr Gong. D points out that the letter of administration in respect of the estate of the late Mr Gong only deals with the Hong Kong real properties. D relies on the fact that under PRC Succession Law: (1) P1 and P2 are the only members of the category of beneficiaries entitled to inherit at least Mr Gong’s sizeable pool of landed properties located in the Mainland, (2) there is no division of labour between a legal representative and a beneficiary, and (3) P1 and P2 are liable to repay the debt of Mr Gong to the extent not higher than the value of the estate that they are entitled to inherit. 8.4 But for the existence of Ground (2), I would have granted an anti-injunction on the basis that P2 is not a proper party. In my view, D cannot derive assistance from PRC Succession Law. According to D’s PRC law expert: “ 根据《继承法》第 33 条“继承遗产应当 清 偿被继承人依法应当缴纳的税款和债务，缴纳税款和清偿债务以他的遗产实际价值为限 。 超过遗产实际价值部分，继承人自愿偿还的不在此限 …”之规定，对被继承人龚国强的税款和债务的消理和偿还主体，是龚国强的继承人。龚国强的继承人必须在继承龚国强的遗产价值范围内承担龚国强的生前债务。所以，龚国 强对《合同》以及《补充协议》产生的债务，也应由龚国强的第一顺序继承人在继承龚国强遗产价值范围内承担偿还和清理义务。 继承人在中国内地完成继承的方式，是由继承人根据法律文书将遗产 申请过户至继承人名下，或者以其他方式进行清理和分配。继承人实际上 履行了遗产代理人的职责。李凤欣、龚倩雅作为龚国强的继承人，也可以成为龚国强大陆财产实际上的遗产代理人。” 8.5 In my view, Article 33 of the PRC Succession Law only mandates that the entitled beneficiaries are liable to settle the tax liabilities and debts of the deceased. The Current Arbitration is only concerned with the adjudication stage, namely to ascertain whether Mr Gong is indebted to D as claimed. It seems to me that it is only when D prevails against P1 (in her capacity of the personal representative of the late Mr Gong) then P2 may become relevant in the process of execution. In my view, under section 22(1) of the AO, only P1 and not P2 is the proper party to the arbitration agreement set out in Clause 12.2 of the Agreement. 8.6 However, there is an uncertainty on how CIETAC would decide on Ground 2 in the Pending Jurisdictional Challenges, for example whether CIETAC may decide that the Current Arbitration should be administered by one of its branches in the Mainland, and upon that eventuality, whether Article 77 of the CIETAC Rules continues to apply, namely the law applicable to the arbitral proceedings (as opposed to the proper law of the dispute) is the arbitration law of Hong Kong. 8.7 I therefore am not minded to grant an anti-arbitration injunction on the basis of Ground (4). 9. The Summons 9.1 Wong 2 nd consists primarily of submissions. I do not find that it has any influence on the result of the case. 9.2 I dismiss the Summons. 10. Conclusion 10.1 For the above reasons, I grant an order in terms of OS §§(1) and (2) but only in respect of D’s claim against Ps for liquidated damages. In case of disagreement, parties are to submit a draft order for my approval within 7 days hereof. 10.2 I also make an order that D is to pay to Ps the costs of the Summons to be taxed if not agreed. In respect of the OS, it seems to me that given only the limited success of Ps, a fair order is that D should pay to Ps 30% of the costs of the OS (including any costs reserved) to be taxed if not agreed. The above costs orders are on an nisi basis. (Jonathan Wong) Deputy High Court Judge Mr Kenny Lin and Mr Victor Lau, instructed by Simon C.W. Yung & Co., for the 1 st - 2 nd Plaintiffs Mr Clark Wang, instructed by Kwok, Ng & Chan, for the Defendant Annexure 1 [1] 《最高人民法院关于内地与香港特别行政区法院就仲裁程序相互协助保全的安排》 [2] Both parties have referred to the version which came into effect on 1 January 2024. [3] CIETAC has an Arbitration Court (“Arbitration Court”), which performs its functions in accordance with these Rules under the direction of the authorized Vice Chairman and the President of the Arbitration Court. [4] CIETAC is based in Beijing. It has sub-commissions or arbitration centers (Appendix I) [including CIETAC Hong Kong]. The sub-commissions/arbitration centers are CIETAC’s branches, which accept arbitration applications and administer arbitration cases with CIETAC’s authorization. [5] The parties may agree to submit their disputes to CIETAC or a sub-commission/arbitration center of CIETAC for arbitration. Where the parties have agreed to arbitration by CIETAC, the Arbitration Court shall accept the arbitration application and administer the case. Where the parties have agreed to arbitration by a CIETAC sub-commission/arbitration center, or have agreed to arbitrate or conduct the oral hearing in the province, autonomous region, or centrally-administered municipality where a CIETAC sub-commission/arbitration center is located, the arbitration court of that sub-commission/arbitration center shall accept the arbitration application and administer the case unless otherwise agreed by the parties. The Arbitration Court may authorize and designate a sub-commission/arbitration center to administer relevant cases having regard to the circumstances of such cases. Where the sub-commission/arbitration center agreed upon by the parties does not exist or its authorization has been terminated, or where the agreement is ambiguous, the Arbitration Court shall accept the arbitration application and administer the case. In the event of any dispute, a decision shall be made by CIETAC. Look up this case on Lawcite Noteup",
  "length": 41366,
  "headers_seen": [
    "1. Introduction",
    "2. Background",
    "3. Grounds advanced by Ps",
    "4. The applicable principles",
    "5. Ground (1): Whether valid arbitration agreement",
    "6. Ground (2): The Further Condition",
    "7. Ground (3): Whether current arbitration vexatious, oppressive and/or abusive",
    "8. Ground (4): Locus of P2"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2025/2004",
  "query": "arbitration",
  "ts": "2025-10-14T11:20:58",
  "ok": true
}