{
  "title": "HKSAR V. WONG SHU FUNG | [2024] HKDC 1963 | HKLII",
  "court": null,
  "year": 2024,
  "date": null,
  "content": "HKLII Databases District Court [2024] HKDC 1963 HKSAR V. WONG SHU FUNG Judgment Information Date 6 Nov, 2024 Action No. DCCC454/2024 Neutral Cit. [2024] HKDC 1963 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History DCCC454/2024 DCCC454/2024 HKSAR v. WONG SHU FUNG DCCC 454/2024 [2024] HKDC 1963 IN THE DISTRICT COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION CRIMINAL CASE NO 454 OF 2024 ________________________ HKSAR v WONG SHU FUNG ________________________ Before: Deputy District Judge Casewell in Court Date: 7 November 2024 Present: Ms Vivian M F Yeung, Counsel on Fiat, for HKSAR/‌Director of Public Prosecutions Mr Ng Kin Man Ken, instructed by Au & Associates, assigned by the Director of Legal Aid, for the Defendant Offences: [1] Trafficking in dangerous drugs (販運危險藥物) [2] Possession of a dangerous drug (管有危險藥物) [3] Driving a motor vehicle with any concentration of specified illicit drugs (在體內含有任何濃度的指明毒品時駕駛汽車) ________________________ REASONS FOR SENTENCE ________________________ 1. The defendant has pleaded guilty to a total of three charges. The 1 st charge is trafficking in a dangerous drug, contrary to the relevant sections of the Dangerous Drugs Ordinance , there is a 2 nd charge of possession of a dangerous drug, and finally a charge of driving a motor vehicle with concentration of specified illicit drugs, all the offences being committed on the same day. A brief summary of the offences shows the following background of facts. 2. The defendant was driving a light goods vehicle in Repulse Bay when he was stopped by a police roadblock at about 9:30 on 22 August 2023. A search was conducted upon the vehicle the defendant was driving and the dangerous drugs that constitute the 1 st charge were found in the vehicle in various places and in various forms of packaging. Those drugs represent 330.8 grammes of a solid which had 1.51 grammes of tetrahydrocannabinol or THC. Another 28.7 grammes of a liquid which contained 19.75 grammes of THC and a further 1,539.94 grammes of cannabis in a herbal form and the packaging of the relevant drugs was in such a way as to obviously suggest they were being trafficked in or would be trafficked. That constitutes the 1 st charge. 3. The 2 nd charge relates to some further drugs that were found in a storage compartment on the left side of the driver’s seat. A folded $50 banknote was found which contained a paper packet. Inside was a further 0.05 grammes of a solid which on analysis was found to contain ketamine. This appears to be the remains of some drugs that the defendant had consumed earlier. A rapid oral fluid test was conducted on the defendant showing a positive result for cocaine and ketamine. A subsequent blood test also revealed those drugs and we can see the quantities particularised in charge 3. It shows small quantities of cocaine, cannabis and ketamine. 4. As far as the drugs were concerned, the defendant admitted that the ketamine found was for his own consumption and the cannabis was for delivery, he was a courier of the cannabis. 5. As far as the 3 rd charge is concerned, the vehicle was stopped as a result of a roadblock, not as a result of anything indicated as bad driving by the defendant. 6. As far as the defendant’s background is concerned, he is now aged 31, educated up to Form 3 level, has worked at a Japanese restaurant as a lorry attendant for some years. Before his arrest he was working as a GoGo van driver using his own self-owned light goods vehicle. He had been living with his father and mother. 7. His conviction record shows he has two previous convictions, possession of dangerous drugs, convicted on 10 October 2008 and on 17 December 2013. He has been sentenced to both 12 months’ probation and Drug Addiction Treatment Centre. He was last discharged from Drug Addiction Treatment Centre on 11 June 2014. He has no previous convictions in respect of drunk driving. His driving record, as shown on the personal data from the Hong Kong Police Fixed Penalty Citations is unremarkable. 8. I will deal now with the approach to sentencing for these charges. The 1 st charge I am dealing with is charge 1, trafficking in a dangerous drug. It is common ground that in respect of this there is an operative guideline in respect of cannabis in herbal form which shows here that a total of 1,539.94 grammes. There is a further 21.26 grammes of THC. There is no operative guideline for THC. 9. I deal firstly with the question of the herbal cannabis. The guidelines originally formulated can be found in the case of R v Tuen Shui Ming CAAR 12/1994 and that was further interpreted or looked at in HKSAR v Nguyen Thang Loi CACC 145/2019. The relevant part of the guideline from both cases is the part which deals with the quantity under 2,000 grammes and following the more recent case of Nguyen Thang Loi the guideline for both cannabis resin and herbal cannabis is the same and under 2,000 grammes is a figure of up to 16 months’ imprisonment and given that the figure of herbal cannabis in this case is 1,539.94 that would mean that the starting point for sentence would be under that figure. In the charge there is also a further 21.26 grammes of what is known as THC. I understand that this is what could be described as the narcotic content of herbal cannabis in that all cannabis plants are capable of producing some quantity of THC and the particular concentration of that will differ in cannabis resin, cannabis oil and herbal cannabis. The existing guidelines deal with cannabis oil, cannabis resin and also herbal cannabis but not at this stage with THC. Reference to the case of HKSAR v Nguyen Thang Loi at page 40 in paragraph 95, the Court of Appeal says of this: “The current scientific evidence has shown a dramatic increase in the THC concentration in herbal cannabis and cannabis resin, both having an average of about 19%. It requires that they be treated similarly for sentencing purposes” and it said “we shall adapt the guidelines accordingly”. 10. The defence has submitted in this case, I think quite reasonably, that in respect of the THC I should treat that as if it were herbal cannabis and gross-up the quantity of THC to represent it as being a quantity of herbal cannabis. If I do that and take a figure of 20% for these calculations, this would lead to a grossed-up figure of around about 106 grammes which would lead to a figure for the herbal cannabis of around about 1,646 grammes which in terms of sentencing is perhaps a negligible increase. In any event, the Court of Appeal has most recently urged that the sentencing of trafficking cases is not a purely mathematical exercise. One is to apply these guidelines in light of the six step approach set out in the case of HKSAR v Herry Jane Yusuph [2021] 1 HKLRD 290 . I bear that in mind and adopt that approach. 11. Having taken that approach I determine that I will adopt a starting point of 12 months’ imprisonment on the 1 st charge. That of course will be reduced to 8 months’ imprisonment having regard to defendant’s plea of guilty. 12. As far as the 2 nd charge is concerned, the defendant has already been the recipient of a Probation Order and also a Drug Addiction Treatment Centre Order. It is unlikely that he would be suitable for either method of disposal. Sentence is possession of dangerous drugs simpliciter can range between 12 to 18 months’ imprisonment. On the 2 nd charge I will take again a starting point of 12 months’ imprisonment, reduce that to 8 months’ imprisonment for the defendant’s plea of guilty. 13. On the 3 rd charge, that of drug driving, one can take into account the matters raised by the Court of Appeal in the case of Secretary for Justice v Chan Hon Hoi CAAR 8/2010, on that charge the maximum sentence of imprisonment being one of 3 years’ imprisonment and in that case the starting point for sentence ranging up to 24 months’ imprisonment were adopted. That case has indicated that drug driving is a problem that is prevalent in Hong Kong and sentencing must have some element which reflects the seriousness of this offence. 14. I will take a starting point of 24 months’ imprisonment, reduced to 16 months’ imprisonment for the defendant’s plea of guilty. There is also a mandatory disqualification of 2 years for this offence. 15. I must deal with the question of overall totality of sentence. The offences were committed at the same time on the same occasion but they do represent distinct criminality. I find the 2 nd and 3 rd offences have a clear connection between them and the sentences for those offences should be served concurrently. However, the 1 st offence is also an additional level of criminality. I shall order that 6 months of that sentence be served consecutively to the 2 nd and 3 rd charges leading to a final sentence of 22 months’ imprisonment. (Casewell) Deputy District Judge Look up this case on Lawcite Noteup",
  "length": 8922,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkdc/2024/1963",
  "query": "drunk driving",
  "ts": "2025-10-17T10:42:18",
  "ok": true
}