{
  "title": "Z V. A AND OTHERS | [2015] HKCFI 228 | HKLII",
  "court": null,
  "year": 2015,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2015] HKCFI 228 Z V. A AND OTHERS Judgment Information Date 29 Jan, 2015 Action No. HCCT8/2013 Neutral Cit. [2015] HKCFI 228 Parallel Cit. [2015] 2 HKC 272 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCCT8/2013 HCCT8/2013 Z v. A AND OTHERS HCCT 8/2013 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO 8 OF 2013 ____________ IN THE MATTER of an Arbitration Partial Award dated 19 February 2013 in ICC Arbitration Case No 18228/CYK made by the International Court of Arbitration, International Chamber of Commerce and IN THE MATTER of Order 73 of the Rules of the High Court ( Cap 4A ) and IN THE MATTER of section 34 of the Arbitration Ordinance , Cap 609 and Article 16 of UNCITRAL Model Law on International Commercial Arbitration _____________ BETWEEN Z Applicant and A 1 st Respondent and 3 others 2 nd Respondent 3 rd Respondent 4 th Respondent ____________ Before: Hon Mimmie Chan J in Chambers Date of Hearing: 6 January 2015 Date of Decision: 30 January 2015 _____________ D E C I S I O N _____________ Background 1. This is an application made by Z (“ Applicant ”) to this Court under s 34 of the Arbitration Ordinance (“ Ordinance ”) and Article 16 of the Model Law, for a declaration that Mr Gavin Denton (“ Arbitrator ”) has no jurisdiction to hear and deal with the issues in dispute in ICC Arbitration Case No 18228/C YK (“ Arbitration ”), and on that basis to set aside the Arbitrator’s Partial Award dated 19 February 2013 (“ Award ”). 2. The history of the matter is that the Applicant entered into 2 separate contracts (“collectively “ Agreements ”) with A (“ 1 st Respondent ”) and AGEMA, respectively dated 20 April 2007 and 2 June 2007. The 1 st contract is referred to as the CKD and Agency Agreement (“ CKD Agreement ”), and the parties therein are described as the Applicant on the one part, and the 1 st Respondent “and/or any of its affiliated companies or subsidiaries and/or AGE (under formation)” of the other part. The 2 nd contract is referred to as the Technical Cooperation Agreement (“ TC Agreement ”), and the parties are described as the Applicant on the one part, and “AGEMA (a company under formation) ... and also with its affiliated company A” on the other part. 3. The CKD Agreement contains an arbitration clause, which provides as follows: “In case of breach of any of the Articles of this agreement by either of the parties, both Parties agree to put best efforts to remedy by negotiations. Otherwise, those Parties agree to arbitration as per the International Chamber of Commerce and held in CHINA? ..(sic)” (emphasis added) 4. The TC Agreement also provides for arbitration, in the following terms: “Any dispute, controversy or difference which may arise between the parties out of or in relation to this Agreement or for the breach thereof shall be settled amicably by the parties, but in case of failure, it shall be finally settled in CHINA by arbitration pursuant to the Rules of the International Chamber of Commerce whose award shall bind the parties hereto.” (Emphasis added) 5. Clause 2.3 of the CKD Agreement further provides as follows: “Both parties reached the agreement in accordance with Chinese laws...” 6. Clause 19 of the CKD Agreement provides: “The Agreement shall be governed and construed under and in accordance with the Laws of the People’s Republic of China.” 7. The TC Agreement is silent on the governing law of the contract, but the parties do not dispute that its governing law is the law of the People’s Republic of China (“ PRC ”). 8. Dispute arose between the parties under the Agreements, and on 11 October 2011, the 1 st Respondent and companies associated or affiliated with the 1 st Respondent (together referred to hereinafter as “ Respondents ”) commenced the Arbitration. A Request for Arbitration (“ Request ”) was filed by the Respondents with the International Court of Arbitration (“ ICC Court ”) of the International Chamber of Commerce (“ ICC ”), pursuant to the arbitration clause in the CKD Agreement, and seeking relief in respect of the Applicant’s breach of the CKD Agreement and the TC Agreement. The Applicant was named as the respondent in the Arbitration. 9. In paragraph 28 of the Request, the Respondents submitted that the place of arbitration shall be Hong Kong SAR, on the basis that Hong Kong SAR is part of and within China, an arbitration award made in Hong Kong by the ICC Court can be enforced in Mainland China, and further, that the Arbitration should be governed by the laws of the PRC. 10. In response to the Request, the Applicant stated: “The main purpose of ‘Place of Arbitration’ is to determine the nationality of an arbitration award, and it had been determined that the arbitration shall be held in China and the nationality of this arbitration award shall also be China according to the CKD and Agency Agreement and Technical Cooperation Agreement, there is no need to fix another place of arbitration by ICC International Court of Arbitration.” 11. On 16 December 2011, the Secretariat of the ICC notified the parties that the ICC Court fixed Hong Kong SAR as the place of arbitration, pursuant to Article 14 (1) of the ICC Rules. 12. Article 14 (1) of the ICC Rules states: “The place of arbitration shall be fixed by (the ICC Court) unless agreed upon by the parties.” 13. On 30 December 2011, the Applicant stated in its letter to the ICC Secretariat that it was the intention of the parties that the place of arbitration should be Mainland China, and not Hong Kong. The ICC Secretariat responded in its letter to the parties of 10 January 2012, as follows: “We remind the parties that the Court’s decision to fix Hong Kong, PR China as the place of arbitration was done in accordance with Article 14 of the Rules, after the Court took into consideration of all comments received from the parties at the time. Unless otherwise advised, we understand that (the Applicant) has not provided any new information in this regard.” 14. On 12 January 2012, the ICC Court appointed the Arbitrator as the sole arbitrator, upon the recommendation of the Australia National Committee of the ICC. 15. In the Terms of Reference drawn up by the parties dated 26 June 2012, paragraph 24 states as follows: “Both the CKD Agreement and the TC Agreement, state the place of arbitration is China... As the parties could not agree, on 15 December 2011 (in accordance with Article 14 (1) of the ICC Rules), the ICC Court fixed the place of arbitration as Hong Kong, PR China.” 16. The issues framed for determination by the Arbitrator included the following (stated to be subject to Article 19 of the ICC Rules): “(a) Whether the Arbitral Tribunal has jurisdiction to deal with the issues in dispute in the present arbitration? ... (e) Whether the 2 nd , 3 rd and 4 th Claimants are parties to the applicable agreements and eligible to participate in these proceedings?” 17. On 11 July 2012, the Arbitrator issued his Procedural Order No 2, that the 1 st hearing was to take place on 12 September 2012, the place of any hearing held in relation to the matter was to be held in Hong Kong, and that the hearing would deal with all of the issues identified by the parties. The 1 st hearing took place on 12 and 13 September 2012, and on 19 February 2013, the Arbitrator handed down the Award, in which he stated: “In accordance with Article 14 (1) of the ICC Rules, the ICC Court fixed the place of arbitration as Hong Kong, PR China. Therefore, in accordance with the reasons set out below, the procedural laws applicable to this arbitration are the laws of Hong Kong SAR, PR China.” 18. The Arbitrator referred to the CKD Agreement and the TC Agreement which state the place of arbitration to be China. At paragraph 44 of the Award, the Arbitrator states: “As the Parties could not agree on a city in China as the place of arbitration, on 15 December 2011 (in accordance with Article 14 (1) of the ICC Rules), the ICC Court fixed the place of arbitration as Hong Kong, PR China.” 19. The Arbitrator went on to rule on the applicable law to determine the jurisdiction of the tribunal, at paragraph 69 of the Award: “Given that the ICC Court validly determined Hong Kong SAR, PR China as the seat of the arbitration, the applicable arbitration law to be applied in determining whether or not the tribunal has jurisdiction to hear this matter is Hong Kong law.” 20. At the hearing before this Court, the Applicant relies on s 34 of the Ordinance, in seeking the Court’s decision on the question of the Arbitrator’s jurisdiction. According to Mr Dawes, counsel for the Applicant, the merits of his application hinges upon the correctness of the decision of the ICC Court, upheld by the Arbitrator, to fix Hong Kong as the place of the Arbitration, as it goes to the crux of the matter of the Arbitrator’s jurisdiction. According to Mr Dawes, it is not open to the ICC Court to rule on Hong Kong as the place of the arbitration, when the place of arbitration had already been agreed upon by the parties as China, and “China” is a reference to Mainland China. Applicable legal principles 21. This being a jurisdiction challenge under s 34 of the Ordinance and Article 16 of the Model Law, it has been established that the Court has to decide on the correctness of the ruling by the arbitral tribunal of its own jurisdiction ( Dallah Real Estate and Tourism Holding Co v Ministry of Religious Affairs of the Government of Pakistan [2011] 1 AC 763 ). Notwithstanding the fact that the Court decides this on a de novo basis, it is important to bear in mind that the reviewing Court recognizes its limited and narrow role, of confining the scope of the review and its intervention to true questions of pure jurisdiction only. In the case of The United Mexican States v Cargill Incorporated 2011 ONCA 622 (Court of Appeal for Ontario), the Canadian court highlighted these matters: “44. It is important, however, to remember that the fact that the standard of review on jurisdictional questions is correctness does not give the courts a broad scope for intervention in the decisions of international arbitral tribunals. To the contrary, courts are expected to intervene only in rare circumstances where there is a true question of jurisdiction. 45. In the domestic law context, courts are warned to ensure that they take a narrow view of what constitutes a question of jurisdiction and to resist broadening the scope of the issue to effectively decide the merits of the case … 46. This latter approach is magnified in the international arbitration context. Courts are warned to limit themselves in the strictest terms to intervene only rarely in decisions made by consensual, expert, international arbitration tribunals, including on issues of jurisdiction. In my view, the principle underlying the concept of “powerful presumption” is that courts will intervene rarely because their intervention is limited to true jurisdictional areas. To the extent that the phrase “powerful presumption” may suggest that a reviewing court should presume that the tribunal was correct in determining the scope of its jurisdiction, the phrase is misleading. If courts were to defer to the decision of the tribunal on issues of true jurisdiction, that would effectively nullify the purpose and intent of the review authority of the court under art 34(2)(a) (iii). 47. Therefore, courts are to be circumspect in their approach to determining whether an error alleged under art 34(2)(a)(iii) properly falls within that provision and is a true question of jurisdiction. They are obliged to take a narrow view of the extent of any such question. And when they do identify such an issue, they are to carefully limit the issue they address to ensure that they do not, advertently or inadvertently, stray into the merits of the question that was decided by the tribunal. 48. One challenge for a reviewing court is to navigate the tension between the discouragement to courts to intervene on the one hand, and on the other, the court’s statutory mandate to review for jurisdictional excess, ensuring that the tribunal correctly identified the limits of its decision-making authority . Ultimately, when deciding its own jurisdiction, the tribunal has to be correct. … 50. The second challenge for the court is to limit its review to determining whether the award ‘contains decisions on matters beyond the scope of the submission’ and not to review the merits of the decision itself. … 53. The role of the reviewing court is to identify and narrowly define any true question of jurisdiction. The onus is on the party that challenges the award. Where the court is satisfied that there is an identified true question of jurisdiction, the tribunal had to be correct in its assumption of jurisdiction to decide the particular question is accepted and it is for the court to determine whether it was. In assessing whether the tribunal exceeded the scope of the terms of jurisdiction, the court is to avoid a review of the merits .” (Emphasis added) 22. Hence, it is necessary and important that the present challenge should be confined to the sole question of whether the Arbitrator has jurisdiction to deal with the dispute and the issues submitted to him in the Arbitration, and the Court should not review the Arbitrator’s decision which goes to the merits of the dispute. As Mr Manzoni, SC for the Respondents rightly pointed out, it is only at the stage where any party seeks (under s 81 of the Ordinance and Article 34 of the Model Law) to set aside or to resist enforcement of the final award, that issues such as whether the procedure in the Arbitration was not in accordance with the agreement of the parties, should be determined. The challenge as to the place of the Arbitration 23. The significance of the place or seat of the Arbitration is not, and cannot be, disputed. It has direct and indirect ramifications as to the procedural law and rules applicable to the Arbitration, the composition of the tribunal, the identity of the supervisory court and the enforcement of the final award. 24. It is well recognized that for contracts and arbitrations involving foreign elements, several legal systems may be involved. As Mustill J observed in Black Clawson International Limited v Papierworke Waldhof-Aschaffenburg SA [1981] 2 Lloyd’s Rep 446, 453: “In the great majority of cases, [the lex causae, the law applicable to the arbitration agreement and the lex fori] will be the same. But this will not always be so. It is by no means uncommon for the proper law of the substantive contract to be different from the lex fori; and it does happen, although much more rarely, that the law governing the arbitration agreement is also different from the lex fori”. 25. There is also the law applicable to the agreement between the parties to the reference and the members of the tribunal, which is not identical to the law applicable to the arbitration agreement. Neither the law of the reference nor the law of the arbitration agreement needs be the same as the law applicable to the contract containing the arbitration clause (the lex causae). Equally, they need not be the same as the curial law which governs the conduct of the reference (sometimes called the lex fori) which is often determined by the choice of the seat of the arbitration. 26. Where the parties did not make express provision for the governing law of the arbitration agreement, there is usually debate as to whether the governing law of the arbitration agreement should, by implication or by its closest and real connection, be the law of the underlying matrix contract, or the law of the place where the parties have chosen to arbitrate. In the present case, there is no real conflict in the parties’ express choice of the law of the underlying contract, and their express choice of the place where the arbitration is to be held. Both are expressed to be “Chinese” law and “China”. The issue between the parties (when it arises and becomes relevant) is whether “Chinese law” refers to the law of the Mainland or Hong Kong law, and whether China means Mainland China or Hong Kong. 27. In the evidence filed in support of the Article 16 challenge by Originating Summons issued on 21 March 2013, the Applicant initially raised issues as to the validity of the arbitration agreement comprised in clause 14.1 of the CKD Agreement and clause 10 (4) of the TC Agreement, and whether all the Respondents were parties to the CKD Agreement and TC Agreement which contained the arbitration clauses. Elaborate expert evidence on Chinese law, Egyptian law and French law affecting these issues was filed. It was only at the commencement of the hearing before this Court, that Mr Dawes confirmed that the Applicant would no longer pursue these issues. Such concessions rendered much of the evidence filed and arguments raised on the challenge to jurisdiction irrelevant and immaterial. 28. Questions as to the validity of the arbitration clauses, and whether the Respondents are parties to the CKD Agreement and TC Agreement may well affect whether the Arbitrator has jurisdiction. Without being a party to an agreement whereby a party submits itself to arbitration, it is of course doubtful whether the arbitral tribunal has jurisdiction over the party. However, with these issues cast aside, the only remaining question for determination is whether the tribunal in this case, constituted by the Arbitrator appointed by the ICC Court, has jurisdiction over the dispute as to the alleged breach of the CKD Agreement and the TC Agreement. Mr Dawes submits that the place of the Arbitration being determined to be Hong Kong is erroneous, and that this takes the Arbitration outside the jurisdiction of the Arbitrator. 29. As the starting point, and to state the obvious, arbitration is consensual and the power of the arbitrator derives from the parties’ agreement to submit their dispute to arbitration. Parties are free to choose the precise manner of resolving their disputes, and if they agree to dispute resolution by arbitration, they are free to choose the law governing their arbitration agreement, the institution to resolve the dispute, the location of the arbitration hearing and the procedure for the arbitration. Having agreed upon these matters, they should be bound by their choice and the Courts would hold them to their agreement. 30. In this case, the Applicant, the 1 st Respondent and the other entities named as parties to the CKD Agreement and the TC Agreement agreed, and are bound, to have their dispute under the CKD Agreement and the TC Agreement to be arbitrated in China, “as per the ICC”, and “pursuant to the ICC Rules”. By agreeing to refer their disputes to a specified institutional arbitral body, the parties must be deemed to have agreed to abide by the rules and procedures of that body. So much is clear, and cannot be disputed. 31. Whatever “China” means, the Applicant has not disputed that it had agreed that the Arbitration was to be governed by and be held pursuant to the ICC Rules (in this case, the 1998 ICC Rules in force at the time arbitration was commenced). The Respondents submitted the dispute to the ICC Court on 11 October 2011. In response to the Request, the ICC Court appointed the Arbitrator pursuant to Article 9 (3) of the ICC Rules, as the ICC Court was entitled so to do. Articles 7 to 9 of the ICC Rules govern the appointment and constitution of the arbitral tribunal, and it has not been suggested by the Applicant that the ICC Court did not follow these provisions, or that the appointment of the Arbitrator was not in accordance with any of the provisions of the ICC Rules affecting, for example, the independence or nationality of the Arbitrator. Counsel has not referred me to any provision in the ICC Rules which expressly restricts the appointment of an arbitrator by reference to the location of the arbitration (other than his availability), or the governing law of either the arbitration agreement or the underlying contract. 32. The constitution of the tribunal is governed by the proper law of the arbitration agreement ( Mustill & Boyd: Commercial Arbitration , 2 nd edition, p 62). Whether the law of the arbitration agreement is Mainland Chinese law, or Hong Kong law, or French law (being the place of the location or establishment of the ICC Court), there is no evidence that the appointment of the Arbitrator and the constitution of the tribunal in this case is invalid or defective in any way under any of the relevant law. 33. Article 14 (1) of the ICC Rules provides for the place of the arbitration to be “fixed by the (ICC Court) unless agreed upon by the parties”. Mr Dawes argued that the parties already agreed upon “China” and the ICC Court and the Arbitrator should not have fixed Hong Kong as the place of the Arbitration. 34. The arbitration clauses in the CKD Agreement and the TC Agreement state that the arbitration is to be “in China”. The parties agreed upon this when the CKD Agreement and the TC Agreement were made. However, there is and has been dispute between the parties as to whether the clauses mean that the Arbitration should take place in Mainland China only (as the Applicant contends), or if the Arbitration should take place in Hong Kong (as the Respondents contend). 35. In view of this very dispute as to the meaning of “China” as used in Clauses 14.1 and 10 (4), it cannot be said that the parties agree upon the place of the Arbitration as provided for in the Agreements. (A dispute exists between parties unless there has been a clear and unequivocal admission of liability and quantum: see Louis Dreyfuss v Bonarich International (Group) Limited [1997] 3 HKC 597 ; Tai Hing Cotton Mil Limited v Glencore Grain Rotterdam BV [1996] 1 HKC 363 , at 375A-B.) 36. Since China’s resumption of sovereignty over Hong Kong in 1997, Hong Kong has retained its own legal system but it is part of China. It was argued that for arbitration, Hong Kong and Mainland China are separate in their procedural law and that awards made in Hong Kong and in Mainland China are enforced and supervised by different courts. To that extent, the arbitration clauses in the Agreements are not clear in their expression of where the Arbitration is to be held. 37. In either of the circumstances described in paragraphs 35 and 36 above, the ICC Court is in my view entitled and indeed bound to determine the place of the Arbitration under Article 14 of the ICC Rules - which the parties have expressly agreed to submit to and be bound by for the purpose of the Arbitration. The construction of the arbitration clauses and the Agreements 38. The Applicant argued that the Arbitrator, in confirming and following the ICC Court’s determination of Hong Kong as the place of the Arbitration under Article 14, had erred in failing to take into account the parties’ designation of “China” as the place of the Arbitration, or had mistakenly construed the arbitration clauses and the meaning of “China” as used in the clauses. The Applicant argued that, properly construed, the arbitration clauses provided for, and were intended to provide for, the seat of the Arbitration to be in Mainland China. 39. On the question of the construction of contracts, the courts have made it clear that the judge should put himself in the place of the reasonable man, or as Lord Hoffman made it clear in Fiona Trust & Holding Corporation v Privalov [2007] 4 All ER 951 HL in the context of construction of arbitration clauses, of rational businessmen. In construction, what the Court attempts to ascertain is not the subjective, and at times non-existent, intention of the parties themselves, but to consider what would have been the intention of ordinary, reasonable and sensible businessmen in the position of the actual parties to the contract, as ascertained from the language they have used, and considered in the light of the surrounding circumstances and the object of the contract. This, again, is trite. 40. In the much cited passage of Lord Hoffman’s judgment in Investors Compensation Scheme v West Bromwich Building Society [1998]1 WLR 896 , he explained that “interpretation is the ascertainment of the meaning which the document would convey to a reasonable person having all the background knowledge which would reasonably have been available to the parties in the situation in which they were at the time of the contract”. He clarified the meaning of the background factual matrix in BCCI v Ali [2001] 1 AC 251 : as anything which a reasonable person would have regarded as relevant, and that it is not confined to the factual background “but can include the state of the law (as in cases which one takes into account that the parties are unlikely to have intended to agree to something unlawful or legally ineffective) or proved common assumptions which were in fact quite mistaken.” The learned author of The Interpretation of Contracts by Lewison (3 rd edition) also highlighted at p10 that although the admissible background may include the law, the English Court of Appeal in Zoan v Rouamba [2000] 2 All ER 620 had refused to attribute to a hirer of a motor car a detailed knowledge of consumer credit legislation. 41. Although the ascertainment of the meaning of a written contract is a question of law, it has to be borne in mind, as pointed out by the learned author of The Interpretation of Contracts by Lewison (3 rd edition) (at para 4.01 on p 96), that many steps in the process of ascertaining that meaning are classified as questions of fact. In particular, Lord Reid explained (in the case of Brutus v Cozens [1973] AC 854 cited by the author of The Interpretation of Contracts ) that “the meaning of an ordinary word of the English language is not a question of law”, and in Chatney v Brazilian Submarine Telegraph Co Ltd [1892] 1 QB 79 , Lindley LJ explained the process succinctly, as follows: “The expression ‘construction’, as applied to a document, at all events as used by English lawyers, includes two things: first the meaning of the words; and secondly their legal effect, or the effect to be given to them. The meaning of the words I take to be a question of fact in all cases, whether we are dealing with a poem or a legal document. The effect of the words is a question of law.” 42. The legal background against which a contract was made is of course a relevant consideration in the construction of the meaning and effect of the Agreements and the language used. In construing a contract, it may be proper to take into account the substantive law which may form part of the surrounding circumstances. It is in this context, that the courts often conclude, when considering the parties’ intentions, that the parties intended to produce a result that is legal, rather than illegal, and if a contract admits of 2 interpretations, one of which is legal and the other illegal, the courts will prefer that which leads to a legal result. 43. Construed as a whole, it is admittedly relevant that the CKD Agreement is stated to be governed by “Chinese laws”, and refers to obligations with regard to “Chinese government institutions”, and to the Applicant (a Mainland company) as a party being a “Chinese registered company” with registered office “in China”. The Applicant contends that the parties must have objectively intended to choose Mainland China as the place of arbitration, and Mainland Chinese procedural law to apply to the Arbitration. 44. In this case, the Agreements are made between Egyptian companies and Mainland Chinese companies for the manufacture, sale and purchase of goods in Mainland China. The parties claim that they were not represented by lawyers when the Agreements were negotiated and prepared. As reasonable, rational businessmen, I would accept that they must have been aware at the time the Agreements were made that China had resumed sovereignty over Hong Kong, and that legally as well as geographically, Hong Kong is a part of China. It would be artificial in my view to hold that the parties had intended the relevant provision, with reference to the location where the Arbitration is to be held, to mean either “China excluding Hong Kong”, or “China including Hong Kong”. Where the parties in this case had chosen to use “China” as the place where the Arbitration is to be held, it must, on a plain and ordinary reading of the expression used and of the Agreements, mean just that. It cannot, in my view, be incorrect for the ICC Court to decide, on a plain reading of the arbitration clauses, that the Arbitration should be held in Hong Kong, which is geographically and legally a part of China. 45. By the time of the hearing before this Court under Article 16 of the Model Law and s 34 of the Ordinance, the parties have filed expert evidence on PRC law. The expert for the Applicant (Professor Zhang) takes the view that an arbitration held on the Mainland and administered by ICC is not a domestic award and may not be enforced by the courts on the Mainland, since ICC is not an arbitration institution which is registered with the authorities on the Mainland under the Mainland Civil Procedure Law. In fact, the Applicant’s expert takes the view that the arbitration clause, in the TC Agreement at least, is not even valid and enforceable under PRC law: since the clause does not specify the arbitration institution, but only the application of the ICC Rules. 46. The Respondents’ expert on PRC law (Professor Gao) does not agree with the expert evidence of the Applicant. Professor Gao has referred to the Longlide case decided by the Supreme People’s Court, in which the Supreme People’s Court ruled that an arbitration clause providing for ICC arbitration on the Mainland is valid. Professor Gao also referred to a Ningbo case in which a Mainland court enforced an ICC award made on the Mainland under the New York Convention, although such an award was not considered by the court as a domestic award on the Mainland. Professor Zhang maintains the view that enforcement of such an ICC award made in Beijing under the New York Convention (in the Ningbo case) goes against the reciprocity reservation made by China when signing the New York Convention: as the award in Ningbo was not made by another signatory nation. The Arrangement on Mutual Enforcement of Arbitration Awards between the Mainland and HKSAR was made precisely because Hong Kong and China are not different contracting nations under the New York Convention. In any event, Professor Zhang pointed out that there is no system of binding precedents under Mainland law, and that the Ningbo case is not only problematic, but has no binding effect on the Mainland courts. 47. The Courts have emphasized (see Lord Hoffman’s observations in BCCI v Ali, supra ) that parties to a contract are unlikely to have intended to agree to do something legally ineffective, and in the construction of a contract or a clause, the Courts will lean in favor of and prefer a construction which renders the contract enforceable, and legal. Rational and reasonable businessmen would not have intended by their agreement to refer their dispute to arbitration by an institution, or in a place, which would render the arbitral award unenforceable, or otherwise than binding and effective. 48. On the face of the expert evidence, there is a risk that an ICC award made in Mainland China may not be enforceable in Mainland China, and that the ICC Arbitration and award might not be supervised by the Mainland court under the Civil Procedure Law or the Arbitration Law. The experts are, on the other hand, in agreement that an ICC award made in arbitration proceedings conducted in Hong Kong would be enforceable in Hong Kong, and on the Mainland, as well as in other countries which are parties to the New York Convention. On such basis, and bearing in mind that the object of an arbitration agreement must be to have the dispute resolved by a process which would result in a final, binding and enforceable award, I would agree with the Arbitrator that the Arbitration between the parties in this case should be conducted in Hong Kong. Conclusion on jurisdiction 49. This decision covers only the issue of whether the Arbitrator has jurisdiction over the Arbitration. It does not affect the parties’ position as to whether the Arbitrator applies the proper law in the determination of the dispute submitted to the Arbitration or, in the event that the procedure to be adopted in the Arbitration is not in accordance with the parties’ agreement, such that it results in prejudice, whether there are grounds for a party to apply to set aside the final award under s 81 of the Ordinance and Article 34 of the Model Law. 50. It is regrettable that the arbitration clauses in the Agreements were not drafted in more precise terms, but on the facts and evidence in the present case, I prefer the construction that the Arbitration is to take place in Hong Kong, instead of Mainland China. My conclusion is that the tribunal is properly constituted, and the Arbitrator has jurisdiction over the dispute submitted by the parties. The Sales Contracts issue 51. In answer to the claims made by the Respondents in respect of the supply and delivery of parts and after-sale services under the CKD Agreement, the Applicant alleges that whereas the CKD Agreement requires the Applicant to replace any supplies that were defective pursuant to a “CKD Parts Service Agreement”, that agreement was never signed. Instead, the Applicant entered into 4 sales contracts with “AGE” (“ Sales Contracts ”), and the Sales Contracts provide for resolution of disputes by CIETAC arbitration. The issues framed by the parties for submission to the Arbitration include the question of “whether the claims against supply and delivery of CKD Parts and After-sale Services ... shall be submitted to the China International Economic and Trade Arbitration Commission for arbitration”. Having determined that the Arbitrator has jurisdiction to deal with the Arbitration and the issues submitted to him for determination in the Arbitration, questions as to whether the Respondents can have remedies under the CKD Agreement in respect of the Applicant’s alleged breach, and whether some of these claims should be referred to CIETAC arbitration in accordance with the parties’ agreement, all go to the merits of the claims made in the Arbitration, and should be determined by the Arbitrator. Orders made 52. The application to set aside the Award is dismissed, with the order nisi that the Applicant is to pay to the Respondents the costs of the application, on an indemnity basis. (Mimmie Chan) Judge of the Court of First Instance High Court Mr Victor Dawes, instructed by Squire Patton Boggs, for the applicant Mr Charles Manzoni SC, instructed by Boughton Peterson Yang Anderson, for 1 st to 4 th Respondents Look up this case on Lawcite Noteup",
  "length": 35083,
  "headers_seen": [
    "Background",
    "Applicable legal principles",
    "The challenge as to the place of the Arbitration",
    "The construction of the arbitration clauses and the Agreements",
    "Conclusion on jurisdiction",
    "The Sales Contracts issue",
    "Orders made"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2015/228",
  "query": "Model Law",
  "ts": "2025-10-16T10:53:36",
  "ok": true
}