{
  "title": "PLAIN SAIL HOLDINGS LTD AND ANOTHER V. LAU WING YAN | [2020] HKCFI 653 | HKLII",
  "court": null,
  "year": 2020,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2020] HKCFI 653 PLAIN SAIL HOLDINGS LTD AND ANOTHER V. LAU WING YAN Judgment Information Date 28 Apr, 2020 Action No. HCMP1008/2019 Neutral Cit. [2020] HKCFI 653 Parallel Cit. [2020] HKCLC 569 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCMP1008/2019 HCMP1008/2019 PLAIN SAIL HOLDINGS LTD AND ANOTHER v. LAU WING YAN HCMP 1008/2019 [2020] HKCFI 653 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE MISCELLANEOUS PROCEEDINGS NO 1008 OF 2019 ________________________ IN THE MATTER of Section 21L of the High Court Ordinance , Cap.4 BETWEEN PLAIN SAIL HOLDINGS LIMITED 1 st Plaintiff VICTORY SAIL INVESTMENTS LIMITED 2 nd Plaintiff and LAU WING YAN Defendant ________________________ Before: Madam Recorder Yvonne Cheng SC in Chambers Date of Hearing: 17 March 2020 Date of Judgment: 29 April 2020 ________________________ J U D G M E N T ________________________ A. INTRODUCTION A1. The application before the court 1. By an Originating Summons of 11 July 2019 (“the Originating Summons”), the Plaintiffs seek a number of orders to restrain the Defendant from pursuing proceedings against the Plaintiffs in relation to two vessels formerly known as MV BBG Hope and MV BBG Glory (“the Vessels”), and in particular, certain such proceedings commenced in the Second Maritime Court of Panama on 29 September 2017 against the Plaintiffs (“the Panama Proceedings”). [1] 2. By a summons of 12 March 2020, the Plaintiffs sought to amend the Originating Summons such that the Defendant is not restrained from pursuing such proceedings in Hong Kong. At the hearing, counsel for the Defendant, Mr Douglas Lam SC, submitted that even if the amendment were allowed, it would not make any difference to the outcome of the Plaintiffs’ substantive application under the Originating Summons, and was content to proceed on this basis. I will therefore allow the amendment to the Originating Summons. A2. The background 3. Unless otherwise indicated, the following background is common ground. 4. The Plaintiffs are the current registered owners of the Vessels. 5. The Defendant and one Mr Chu Kong (“Mr Chu”), both Hong Kong residents, each own 50% of the shares in Ocean Sino Limited, a BVI company (“Ocean Sino”). Ocean Sino in turn owns PBM Asset Management Limited, a Hong Kong company (“PBM”), which owns 49% of the shares in BGA Holdings Limited, a Hong Kong company (“BGAH”). BGAH wholly owns (1) The Palace Limited, which owns Hope BBG Shipping Limited (“Hope Ltd”), the former owner of the MV BBG Hope, and (2) Shining Centre Limited, which owns Glory BBG Shipping Limited (“Glory Ltd”), the former owner of the MV BBG Glory. These four (direct and indirect) subsidiaries of BGAH will be referred to as the “ BGAH Subsidiaries ”. A2.1 The BVI Winding Up Proceedings 6. The Defendant and Mr Chu were business partners. As a result of various disputes, the Defendant commenced proceedings in May 2015 to wind up Ocean Sino in the BVI Commercial Court. On 29 June 2017, the BVI Commercial Court ordered Ocean Sino to be wound up. The order was subsequently overturned on appeal on 17 January 2020 (“the BVI Appeal Judgment”). A2.2 Events leading up to the sale of the Vessels 7. On 28 December 2015, the BGAH Subsidiaries entered into a loan agreement with Premier Bright Holdings Limited (“Premier”), agreeing to borrow up to US$35m (“the Premier Agreement”). 8. On 23 May 2016, the BGAH Subsidiaries entered into an addendum to loan agreement with Premier, agreeing inter alia to the grant of ship mortgages by Hope Ltd and Glory Ltd over the Vessels in favour of Lohas (“the Premier Agreement Addendum”). 9. Also on 23 May 2016, Premier appointed Lohas Finance Limited (“Lohas”) under a nomination agreement (“the Lohas Nomination”) as its nominee and trustee of certain securities for the loan facility under the Premier Agreement. 10. On 24 May 2016, mortgages were created over the Vessels. 11. On 24 August 2016, Premier and Lohas claimed that Hope Ltd and Glory Ltd were in breach of the Premier Agreement for failure to repay. 12. The Defendant says that the aforesaid agreements and events took place without his knowledge, and he only learned of them on around 18 April 2017. He further says that on 28 June 2017, he learned that the Vessels were being marketed for sale. He says that this was done under suspicious circumstances, and that he has grounds to believe that the repayment defaults under the Premier Agreement were deliberately engineered by Mr Chu for his own benefit. He challenges the validity of the agreements. A2.3 The Hong Kong Writ Actions and the sale of the Vessels to the Plaintiffs 13. In about early July 2017, Wilmar International Limited (“Wilmar”) intended to purchase the Vessels. 14. On 12 and 13 July 2017, the Defendant commenced four actions in rem against the owners and/or demise charterers of the Vessels (“the Hong Kong Writ Actions”). 14.1 In HCAJ 77/2017 (relating to the MV BBG Glory) and HCAJ 78/2017 (relating to the MV BBG Hope), the Defendant issued a writ with a general indorsement claiming “a declaration that he has legal or equitable ownership of the Vessel or the ownership of any share therein and/or an order to rectify the register of the Vessel at the Shipping Registry of the Marine Department of Hong Kong, China”. 14.2 In HCAJ 79/2017 (relating to the MV BBG Hope) and HCAJ 80/2017 (relating to the MV BBG Glory), the Defendant, suing on behalf of himself and shareholders in Ocean Sino Limited, PBM and BGAH, issued a writ with a general indorsement stating that “The Plaintiff’s claim against the Defendant arises out of and/or in connection with the Mortgage executed on 24 May 2016 registered against the vessel … at the Shipping Registry of the Marine Department and the Plaintiff seeks an order to rectify the register of the Vessel at the Shipping Registry of the Marine Department of Hong Kong, China.” 15. The Defendant’s solicitors informed Wilmar of the dispute relating to the Vessels, and the sale later fell through. 16. On 21 July 2017, Hope Ltd, Glory Ltd and Lohas issued summonses to strike out the writs in the Hong Kong Writ Actions. The summonses were fixed to be heard on 10 October 2017. 17. Meanwhile, the Plaintiffs acquired the Vessels. 17.1 The Plaintiffs were incorporated in the BVI on 28 July 2017. 17.2 On 11 August 2017, the 1st Plaintiff entered into a Memorandum of Agreement with Glory Ltd for the purchase of the MV BBG Glory, and the 2nd Plaintiff entered into a Memorandum of Agreement with Hope Ltd for the purchase of the MV BBG Hope (“MOAs”). On 15 August 2017, two Bills of Sale for the Vessels were signed (“Bills of Sale”); on 18 August 2017, payment was made for the Vessels. 17.3 On 21 August 2017, delivery of the MV Glory BBG was made to the 1st Plaintiff in Jiangsu, China, and delivery of the MV Hope BBG was made to the 2nd Plaintiff in Singapore. 17.4 On 21 August 2017, the Plaintiffs deleted the Vessels’ registration in Hong Kong, and registered them in Panama. The names of the Vessels were also changed around this time. 18. The Defendant says that he found out about the Plaintiffs’ acquisition in late August 2017. His belief is that the Vessels were sold at an undervalue to the Plaintiffs, as part of a scheme devised by Mr Chu to put the Vessels out of reach of the liquidation of Ocean Sino. 19. By a letter of 13 September 2017, Messrs Fairbairn Catley Low & Kong, solicitors for Hope Ltd and Glory Ltd, indicated that they had instructions to withdraw all four striking out applications. 20. By a decision of 10 October 2017, Anthony Chan J awarded Hope Ltd and Glory Ltd their costs of the striking-out summonses (“ HK Strike-Out Costs Judgment ”). 21. On 13 December 2019, the Plaintiffs filed an acknowledgment of issue of writ in all four actions, notwithstanding that the Defendant had not in fact served the writs on the Plaintiffs. A2.4 The Singapore Proceedings 22. On 12 July 2017, at the time when the Hong Kong Writ Actions were commenced, the Defendant also commenced two actions in rem against the owners and/or demise charterers of the Vessels in Singapore (a place where the Defendant understood that delivery of the Vessels might take place) (“the Singapore Proceedings”). The writs were not served and their validity expired on 12 July 2018. A2.5 The Panama Proceedings 23. On 29 September 2017, the Defendant commenced the Panama Proceedings, issuing a writ against the Plaintiffs, BGAH, the BGAH Subsidiaries, Premier, Lohas and others. The Defendant claimed that the Premier Agreement, Premier Agreement Addendum, Lohas Nomination and mortgages over the Vessels were entered into without his knowledge, that any sums due under the Premier Agreement were deliberately not paid, and that this resulted in the Vessels being illegally sold to the Plaintiffs at an undervalue. The Defendant claimed that this had caused him damage as the final beneficiary of the Vessels, stripping him of the beneficial property, beneficial interest and “economic interest” in the Vessels. The Defendant sought, inter alia, a declaration that the Premier Agreement, the Premier Agreement Addendum and the Lohas Nomination were invalid, and a declaration that the sale of the Vessels to the Plaintiffs was invalid. 24. On 4 October 2017, in support of this claim, the Defendant sought and obtained an injunction from the Second Maritime Court of Panama, prohibiting the transfer, sale, disposal, cancellation from the Panamanian Registry, or recording of encumbrances or mortgages on the Vessels (“the Panama Injunction”). Apart from injuncting the Plaintiffs and other private parties, the Panamanian Injunction also ordered various directorates of the Panamanian Maritime Authority to abstain from, and ban, the recording of any act that implied the sale, transfer, disposal or cancellation (from the registry) of the Vessels, and to abstain from recording any mortgages or encumbrances recordable in the registry. 25. On 16 March 2018, the Plaintiffs commenced a challenge to the jurisdiction of the Panamanian courts, which was scheduled to be heard on 13 September 2018. 26. On 5 May 2018, the Plaintiffs appealed against the grant of the Panama Injunction. 27. On 11 September 2018, the Defendant filed an Amended Claim Form in the Panama Proceedings. His complaint that he was the final beneficiary of the Vessels and that he had been stripped of the beneficial property in the same was amended to a complaint that he had suffered damage as he had an “economic interest” in the Vessels. 28. The Plaintiffs say that the hearing of the jurisdictional challenge had to be postponed because of the Defendant’s application to amend his claim form. 29. The Second Maritime Court of Panama admitted the Defendant’s Amended Claim Form on 1 November 2018. The Plaintiffs appealed against this on 26 November 2018. 30. The Plaintiffs subsequently amended their jurisdictional challenge in response to the Amended Claim Form, and filed Special Motions on 14 December 2018 raising their jurisdictional challenge and preliminary defences, including lack of jurisdiction and competence, lack of locus standi, limitation, and lis alibi pendens. 31. On 28 February 2019, the Plaintiffs’ appeal against the grant of the Panama Injunction was heard by the Maritime Court of Appeals of Panama. On 13 March 2019, the Plaintiffs’ jurisdictional challenge was re-fixed to be heard on 1 August 2019 (and was duly heard). 32. On 10 December 2019, the Maritime Court of Appeals of Panama handed down its judgment, dismissing the Plaintiffs’ appeal against the grant of the Panama Injunction (“the Panama Injunction Appeal Judgment”). 33. On 16 January 2020, the Second Maritime Court of Panama handed down its judgment, dismissing the Plaintiffs’ jurisdictional challenge and preliminary defences (“the Panama Jurisdiction Judgment”). On the same day, it also dismissed the Plaintiffs’ appeal against the admission of the Defendant’s Amended Claim Form. 34. On 18 February 2020, the Plaintiffs lodged an appeal against the Panama Jurisdiction Judgment. A2.6 The Hong Kong Winding Up Proceedings 35. On 23 August 2019, the liquidators of Ocean Sino caused PBM to present a petition in Hong Kong for the winding up of BGAH (“the HK BGAH Petition”). The petition was based on the grounds that (1) BGAH was insolvent, and (2) BGAH should be wound up on the just and equitable ground. 36. The HK BGAH Petition claimed that the Petitioner had advanced some US$36m by way of shareholders’ loans to BGAH, which had not been repaid. 37. The HK BGAH Petition also alleged that the Premier Agreement, the Premier Agreement Addendum, the Lohas Nomination, and the sale of the Vessels were all part of a scheme devised to divest the Vessels away from BGAH’s subsidiaries and/or rendering them unavailable to its creditors and shareholders on winding up. B. THE PLAINTIFFS’ GROUNDS FOR SEEKING AN ANTI-SUIT INJUNCTION 38. The Plaintiffs put their application on two bases. First, they say that the multiplicity of proceedings commenced by the Defendant is unconscionable, vexatious and oppressive. Second, they say that the injunction should be granted in order to protect the Hong Kong court’s insolvency jurisdiction over the liquidation of BGAH. C. THE APPLICABLE PRINCIPLES 39. The fundamental principle applicable to all anti-suit injunctions is that whilst the court does not purport to interfere with any foreign court, it may act personally on a defendant by restraining him from commencing or continuing proceedings in a foreign court, where the ends of justice so require. See Stichting Shell Pensioenfonds v Krys and another [2015] AC 616 at [17]. C1. Foreign proceedings unconscionable, vexatious or oppressive 40. Such an injunction may be granted where the conduct of the party to be restrained is unconscionable, vexatious or oppressive. See Turner v Grovit [2002] 1 WLR 107 at [24], [25]. 41. In Liaoyang Shunfeng Iron & Steel Co Ltd v Yeung Tsz Wang (unreported, CACV 234/2011, 14 June 2012), Hartmann JA summarised the relevant principles in relation to this category of cases as follows. “84. The underlying principle is that under our law a person “has no right not to be sued in a particular forum, domestic or foreign, unless there is some specific factor which gives him that right: Turner v Grovit [2002] 1 WLR 107 (HL) at 118 per Lord Hobhouse. 85. That the being the case, the jurisdiction to grant an anti-suit injunction must be exercised with caution and only when the ends of justice require it: see Airbus Industries GIE v Patel [1999] 1 AC 119 (HL) at 133 per Lord Goff – “The broad principle underlying the jurisdiction is that it may be exercised when the ends of justice require it. Generally speaking, this may occur when the foreign proceedings are vexatious or oppressive… But, as was stressed in the Aerospatiale case [ Societe Nationale Industrielle Aerospatiale v Lee Kui Jak [1987] AC 871 ], in exercising the jurisdiction regard must be had to comity, and so the jurisdiction is one which must be exercised with caution…” 86. Before us, Ms Wong, for the defendants, emphasised that caution must be exercised because the granting of an anti-suit injunction more often than not has the consequence of being final not merely temporary in its effect. 87. Ms Wong further emphasized that, as the authorities themselves make clear, as the court is concerned with the ends of justice, account must be taken not only of injustice to the applicant if the respondent to the application is permitted to pursue foreign proceedings which are vexatious or oppressive, but also of injustice to the respondent if, by granting the injunction, he is deprived of any advantage in the foreign forum of which it would be unjust to deprive him. 88. A distinction is to be drawn between cases where the application for an anti-suit injunction is founded upon a contractual right and other cases, that is, cases (such as the present case) in which it is asserted that the foreign proceedings have been commenced in bad faith for the purpose of frustrating proceedings in Hong Kong. In this regard, see Turner v Grovit (supra) per Lord Hobhouse (paras 27 and 28): “The applicant for a restraining order must have a legitimate interest in making his application and the protection of that interest must make it necessary to make the order. Where the applicant is relying upon a contractual right not to be sued in the foreign country (say because of an exclusive jurisdiction clause or an arbitration clause), then, absent some special circumstances, he has by reason of his contract a legitimate interest in enforcing that right against the other party to the contract. But where he is relying upon conduct of the other person which is unconscionable for some non-contractual reason, English law requires that the legitimate interest must be the existence of proceedings in this country which need to be protected by the grant of a restraining order… It is recognised that to make an order against a person who is a party to proceedings before a foreign court may be treated as an interference (albeit indirect) in the foreign proceedings. Thus English law requires the applicant to show a clear need to protect existing English proceedings. The protection of English proceedings is, understandably, regarded as a legitimate subject matter for an English court. It is not the concern of any other court. The order made operates in personam and relies for its enforcement solely upon the English court. In the present case, the Court of Appeal [2000] QB 345 , 364, were at pains to stress that their orders were directed to the defendants and not the Spanish court.” 89. Lord Hobhouse (para 29) summarised the essential features which made it proper, under English law, for a court to exercise its power to grant an anti-suit injunction. These are – “… (a) the applicant is a party to existing legal proceedings in this country; (b) the defendants have in bad faith commenced and propose to prosecute proceedings against the applicant in another jurisdiction for the purpose of frustrating or obstructing the proceedings in this country; (c) the court considers that it is necessary in order to protect the legitimate interest of the applicant in the English proceedings to grant the applicant restraining order against the defendants.” ” 42. See also Deutsche Bank AG and another v Highland Crusade Offshore Partners LP and others [2010] 1 WLR 1023 at [50] to [65], where Toulson J summarised the principles as follows. “50. … I would summarise the relevant key principles as follows. (1) Under English law the court may restrain a defendant over whom it has personal jurisdiction from instituting or continuing proceedings in a foreign court when it is necessary in the interests of justice to do. (2) It is too narrow to say that such an injunction may be granted only on grounds of vexation or oppression, but, where a matter is justiciable in an English and a foreign court, the party seeking an anti-suit injunction must generally show that proceeding before the foreign court is or would be vexatious or oppressive. (3) The courts have refrained from attempting a comprehensive definition of vexation or oppression, but in order to establish that proceeding in a foreign court is or would be vexatious or oppressive on grounds of forum non conveniens, it is generally necessary to show that (a) England is clearly the more appropriate forum (“the natural forum”), and (b) justice requires that the claimant in the foreign court should be restrained from proceeding there. (4) If the English court considers England to be the natural forum and can see no legitimate personal or juridical advantage in the claimant in the foreign proceedings being allowed to pursue them, it does not automatically follow that an anti-suit injunction should be granted. For that would be to overlook the important restraining influence of considerations of comity. (5) An anti-suit injunction always requires caution because by definition it involves interference with the process or potential process of a foreign court. An injunction to enforce an exclusive jurisdiction clause governed by English law is not regarded as a breach of comity, because it merely requires a party to honour his contract. In other cases, the principle of comity requires the court to recognise that, in deciding questions of weight to be attached to different factors, different judges operating under different legal systems with different legal policies may legitimately arrive at different answers, without occasioning a breach of customary international law or manifest injustice, and that in such circumstances it is not for an English court to arrogate to itself the decision how a foreign court should determine the matter. The stronger the connection of the foreign court with the parties and the subject matter of the dispute, the stronger the argument against intervention. (6) The prosecution of parallel proceedings in different jurisdictions is undesirable but not necessarily vexatious or oppressive. (7) A non-exclusive jurisdiction agreement precludes either party from later arguing that the forum identified is not an appropriate forum on grounds foreseeable at the time of the agreement, for the parties must be taken to have been aware of such matters at the time of the agreement. For that reason an application to stay on forum non conveniens grounds an action brought in England pursuant to an English non-exclusive jurisdiction clause will ordinarily fail unless the factors relied upon were unforeseeable at the time of the agreement. It does not follow that an alternative forum is necessarily inappropriate or inferior. (I will come to the question whether there is a presumption that parallel proceedings in an alternative jurisdiction are vexatious or oppressive). (8) The decision whether or not to grant an anti-suit injunction involves an exercise of discretion and the principles governing it contain an element of flexibility. … 54. In the Aerospatiale case [1987] AC 871 , 895, Lord Goff said that where parties are in dispute whether an action should proceed in an English or foreign court, and the English court concludes that England is the natural forum, it would be wrong for the English court to restrain a party from proceeding in the foreign court “ on that ground alone ” (Lord Goff’s emphasis). For that would be to conclude that where there is simply a difference of view between the English court and the foreign court as to which is the natural forum, the English court can arrogate to itself, by the grant of an injunction, the power to resolve that dispute. Such a conclusion would be inconsistent with comity. … 56. … But where the court is not enforcing a contractual right under English law, the normal assumption is that an English court has no superiority over a foreign court in deciding what justice between the parties requires and, in particular, that both comity and common sense suggest that the foreign judge is usually the best person to decide whether in his own court he should accept or decline jurisdiction, stay proceedings or allow them to continue. In other words, there must be a good reason why the decision to stop the foreign proceedings should be made by an English judge rather than a foreign judge, and cases where justice requires the English court to intervene will be exceptional. Hoffmann J recognised that exceptional cases cannot be categorised, but he instanced cases where a foreign court has by its own jurisprudence a long arm jurisdiction so extensive that to English notions it appears contrary to accepted principles of international law, and where the English court may feel it necessary to intervene by injunction to protect a party from the injustice of having to litigate in a jurisdiction with which he or the subject matter had little connection. There may also be cases in which the judicial or legislative policies of England and the foreign court are so at variance that comity is overridden by a need to protect British interests or to prevent what the English court regards as a violation of the principles of customary international law. 57. In Airbus Industrie GIE v Patel [1999] 1 AC 119 Lord Goff noted that since, as between common law jurisdictions, there was no international treaty governing jurisdiction issues, the basic principle was that each jurisdiction is independent and there is no embargo on concurrent proceedings in the same matter in more than one jurisdiction. … 59. Lord Goff also discussed in some detail the requirements of comity. He expressed the following general principle [1999] 1 AC 119 , 138: “As a general rule, before an anti-suit injunction can properly be granted by an English court to restrain a person from pursing proceedings in a foreign jurisdiction in cases of the kind under consideration in the present case,” – an alternative forum case – “comity requires that the English forum should have a sufficient interest in, or connection with, the matter in question to justify the indirect interference with the foreign court which an anti-suit injunction entails. In an alternative forum case, this will involve consideration of the question whether the English court is the natural forum for the resolution of the dispute.” 60. As to the proper approach in such cases, Lord Goff, at pp 138-139, cited the judgment of Sopinka J in Amchem Products Inc v British Columbia (Workers’ Compensation Board) [1993] 1 SCR 897 , 932, including the following passage: “‘If, applying the principles relating to forum non conveniens…the foreign court could reasonably have concluded that there was no alternative forum that was clearly more appropriate, the domestic court should respect that decision and the application should be dismissed. When there is a genuine disagreement between the courts of our country and another, the courts of this country should not arrogate to themselves the decision for both jurisdictions…In a case in which the domestic court concludes that the foreign court assumed jurisdiction on a basis that is inconsistent with principles relating to forum non conveniens and that the foreign court’s conclusion could not reasonably have been reached had it applied those principles, it must then go on to the second step of the [ Aerospatiale ] test’ – ie, whether to grant an injunction on the ground that the ends of justice require it.” … 63. This [6th] proposition is supported by the Airbus case [1999] 1 AC 119 , 132-133 (“parallel proceedings in different jurisdictions are not of themselves regarded as unacceptable”, per Lord Goff) …. It is perfectly possible to envisage a scenario in which there are parallel proceedings and each court considers itself to be clearly the more appropriate forum, the difference of opinion arising from the courts taking different views of the weight of the relevant connecting factors. This scenario was envisaged by Hoffmann J in Barclays Bank plc v Homan [1993] BCLC 680. It is unfortunate if this should arise, but the possibility is inevitable. If in that situation the English court were to decide to impose its view on the foreign court by granting an anti-suit injunction, and the foreign court for the same reason decided to impose its view on the English court by an anti-suit injunction, the parties would then find themselves subject to mutual anti-suit injunctions. This would not solve the problem; it would add a further dimension, and it would run counter to the principle of comity. Hence the reason for an English court not ordinarily granting an anti-suit injunction in such circumstances, although there may be exceptions in circumstances such as those considered by Hoffmann J and by Sopinka J and Judge Wilkey in the judgments referred to by Lord Goff in the Airbus case.” 43. As to the part which the concept of forum non conveniens plays on an application for an anti-suit injunction, in a case where it is said the foreign proceedings are oppressive: 43.1 Even if the applicant shows that the local forum is the natural forum (that is, clearly more appropriate than any other forum) for resolution of the parties’ disputes, this is not sufficient ground in itself for the grant of an anti-suit injunction: see Deutsche Bank AG at [54] to [55]; Asha Harkishin Premisingh v Harkishin Isarsingh Premsingh Kishinani , unreported, CACV 845/2000, 30 November 2001 at [24] per Le Pichon JA. It is, however, a necessary minimum requirement: Glencore at [42]. 43.2 A fortiori it does not suffice to show that the local forum is (merely) a natural forum, that is, one that is not inappropriate: see Deutsche Bank AG at [54] to [55]. 44. Mr Ambrose Ho SC, counsel for the Plaintiffs, submitted that if the local forum is shown to be the natural forum, then prima facie, it is oppressive to proceed in a foreign jurisdiction. However, the cases show that the issue of forum (which goes to comity) and the issue of oppression (which goes to broader considerations of justice) are treated as two distinct considerations, even though there may well be cases where the facts which make the local forum the natural one are the very facts which also make it oppressive to proceed in the foreign jurisdiction. See Deutsche Bank at [50] (Toulson J’s third principle), [54], and Glencore International AG at [42]. 45. A vexatious claim would include the situation where the foreign proceedings are so utterly absurd that they cannot possibly succeed: Societe Nationale Industrielle Aerospatiale v Lee Kui Jak [1987] 871 at 893H; or where they can be plainly shown to be bound to fail: Shell International Petroleum Co Ltd v Coral Oil Co Ltd [1999] 2 Lloyd’s Rep 606 at 609. However, the Hong Kong court should not set itself up as examining magistrates to decide whether a foreign court has a case fit for trial: Star Reefers Pool Inc v JFC Group Co Ltd [2012] 1 CLC 294 at [31]. C2. Protection of court’s insolvency jurisdiction 46. Apart from the above, the court also has the jurisdiction to grant an anti-suit injunction to restrain foreign proceedings against an insolvent company which has been wound up, so as to uphold the integrity of the statutory trust imposed under the insolvency regime, and the maintenance of fair and equal distribution of the insolvent estate. See Ding Yi v Shum Ting, unreported, CAMP 231/2019, 5 November 2019, at [15] to [17]. 47. The principle is that where a company has been ordered to be wound up for insolvency, the court will not allow a creditor to institute proceedings for himself, as this would disturb the general principle of equal distribution of the company’s assets. However, proceedings prior to the date of the winding up order would not be objectionable. See Stichting Shell Pensioenfonds at [16] to [18]. 48. In such cases, it is not necessary to show that there has been vexation or oppression. The injunction seeks to protect the court’s jurisdiction to do equity between claimants to an insolvent estate, rather than to protect a litigant against vexation or oppression. See Ding Yi at [16]; Stichting Shell Pensioenfonds at [23], [24]. D. WHETHER ANTI-SUIT INJUNCTION SHOULD BE GRANTED BY REASON OF UNCONSCIONABILITY D1. Whether Hong Kong forum conveniens 49. There is no dispute that I should have regard to the test in The Adhiguna Meranti [1987] HKLR 904 at 907-908, albeit in “reverse” in that what the Plaintiffs are seeking to show is that Hong Kong is the forum conveniens for the determination of the dispute between the parties: Chen Hongqing v. The persons whose names are set out in the second column of the Schedule hereto [2018] HKCFI 1170 at [25]. I therefore need to consider: 49.1 whether Hong Kong is the natural forum for the trial whereas Panama is not; 49.2 whether a trial in Hong Kong would deprive the Defendant of any legitimate personal or juridical advantage of a trial in Panama; 49.3 if the answer to both is yes, where justice lies after balancing the advantages of the first with the disadvantages of the latter. 50. In the Panama Proceedings, the Defendant claims against not only the Plaintiffs (incorporated in the BVI) but also various other entities, including Premier, Lohas, BGAH and the BGAH Subsidiaries. The Defendant complains of the matters set out in section A2.2 above (the execution of various agreements without his knowledge and the engineering of repayment defaults under the Premier Agreement) and says that the subsequent sale of the Vessels to the Plaintiffs was unlawful. 51. The Defendant’s claim against the Plaintiffs is linked to his claim against the other parties. Factually, it is not clear where the Premier Agreement or Premier Agreement Addendum were signed, but the Lohas Nomination bears the witnessing chop of a Hong Kong solicitor. The Plaintiffs say that the MOAs and Bills of Sale were executed and delivered in Hong Kong and that the Bills of Sale were certified in Hong Kong by a Hong Kong notary public, and the purchase price was paid in Hong Kong. Delivery of the Vessels took place outside Hong Kong. The Plaintiffs then deleted the Vessels’ registration in Hong Kong, and registered them in Panama, changing their names. 52. If one has regard to the Defendant’s claims generally, including those against parties other than the Plaintiffs, it can be seen that a number of issues of Hong Kong law will arise, such as whether the directors of certain Hong Kong companies (BGAH, Hope Ltd and Glory Ltd) were in breach of their fiduciary duties when signing or procuring the signing of the Premier Agreement and the MOAs. Hong Kong law will also apply in determining the validity or otherwise of the Premier Agreement, Agreement Addendum and Lohas Nomination, being the putative proper law of those contracts: Johnston & Harris, The Conflict of Laws in Hong Kong , 3rd ed, paragraph 5.010. 53. As to the dispute between the Plaintiffs and Defendant themselves, however, I am not satisfied that the Plaintiffs have shown that Hong Kong law applies. 53.1 The Defendant says that his claim against the Plaintiffs is maritime in nature and that Panamanian law applies. However, his claim in the Panama Proceedings is based on an “economic interest” in the Vessels, rather than a claim to ownership or possession of the Vessels. 53.2 If the Defendant were to proceed in Hong Kong with a claim along such lines, it would not come within the admiralty jurisdiction as a matter of Hong Kong law, [2] and would simply be a claim in personam against the Plaintiffs. If the claim were framed as one in tort, the Defendant would have to show that the complaint was actionable both under the lex fori and the lex loci delicti ( Red Sea Insurance Co v Bouygues [1995] 1 AC 190 ), although the Plaintiffs say that since the tort in substance arose in Hong Kong, only Hong Kong law applies ( Shanghai Reeferco Container Ltd v Waggonbau Elze GmbH & Co Besitz KG [2005] 2 HKLRD 711 at [41]). However, the Defendant has not currently pleaded any statement of claim in the Hong Kong Writ Actions (and has undertaken not to proceed with those actions) so it is not possible to say certainty that only Hong Kong law could apply to such a claim. 53.3 In any event, none of this means that Hong Kong law applies to the Defendant’s claim in the Panama Proceedings, which is based on the Defendant’s “economic interest” in the Vessels. The Defendant says that the concept is recognised under Panamanian law; the Plaintiffs disagree. In this regard, the Panama Injunction Appeal Judgment records that in the appeal against the Panama Injunction, the Plaintiffs had argued that the Defendant was not, and had never been, the owner of the Vessels and that he therefore had no right which required protection by way of an injunction; the appellate court dismissed the appeal on the grounds that a prima facie case had been made out for a right which justified protection by way of the Panama Injunction. 54. As to the parties, the Plaintiffs, whilst incorporated in the BVI, registered themselves as non-Hong Kong companies with the Companies Registry in October 2019, but only after commencing these proceedings, so there is a degree of artificiality in the connection with Hong Kong. The Defendant is a Hong Kong resident. Some of the other parties to the Panama Proceedings are Hong Kong companies. The Plaintiffs say that the others have submitted to the Hong Kong courts’ jurisdiction by virtue of the choice of law clauses in the various agreements, but it is by no means established that the current dispute (between the Plaintiffs and the Defendant) would come within the scope of those clauses. It is said that most of the witnesses would be Hong Kong residents, although this perhaps is not a particularly weighty factor nowadays. Thus whilst there is some personal connection of the parties to Hong Kong, this is not a particularly strong factor. Furthermore, it is only the Plaintiffs who are seeking an anti-suit injunction; the other parties to the Panama Proceedings have not sought to say that Panama would be an inconvenient jurisdiction. 55. It is also relevant to bear in mind that the Plaintiffs deleted the registration of the Vessels in Hong Kong and re-registered them in Panama. The Defendant does not claim ownership of the Vessels, but it is implicit in his claim that the Vessels should not be registered as the Plaintiffs’, and one of the complaints of unlawful conduct against the Plaintiffs is this very act of registration. Thus Panama cannot be said to be a jurisdiction which has no connection to the Defendant’s claim. 56. The Plaintiffs say that there would be costs savings if the litigation were conducted in Hong Kong, as there are already two sets of proceedings on foot in Hong Kong. However, the Defendant has already indicated that it does not intend to pursue the Hong Kong Writ Actions. As for the HK BGAH Petition, there would be some overlap of issues, although the Plaintiffs are not party to the winding up proceedings and would not be bound by findings made in them. This is therefore not a very significant consideration. 57. The Plaintiffs also say that third party creditors and members of BGAH may become parties to, or be affected by, the litigation between it and the Defendant. I do not agree that it is relevant to take into account unknown possible future litigation. 58. As to juridical advantage, I accept the Defendant’s submission that a trial in Hong Kong would deprive him of a legitimate juridical advantage which he has in Panama, namely the security afforded by the Panama Injunction. This not only prohibited the Plaintiffs from selling or mortgaging the Vessels pending determination of the Panama Proceedings, but also ordered various directorates of the Panamanian Maritime Authority not to record such sales or mortgages. Whilst the Plaintiffs have offered to provide an undertaking to the Hong Kong court not to sell or mortgage the Vessels in Hong Kong pending further order, judgment or agreement of the parties, the remedy which the Defendant would have in the event of a breach of such an undertaking would only be to move for contempt against the Plaintiffs, which are insubstantial companies incorporated in the BVI, and perhaps their directors. It is noteworthy that the Plaintiffs did not offer such an undertaking to the Panama court to secure a release of the Panama Injunction (notification of which could presumably have been given to the Panamanian Maritime Authority), and that they appealed against the grant of the injunction instead. 59. A trial in Hong Kong would also deprive the Defendant of the juridical advantage of the ease of enforcement of any Panamanian judgment obtained in his favour against the Plaintiffs’ known assets, that is, the Vessels which are registered in Panama: cf. Choi Sai Yiu v Widepower Ltd [1994] 3 HKC 274 at 281B-F. There is no arrangement for the reciprocal enforcement of judgments between Hong Kong and Panama: see s.3 and Schedule 2 to the Foreign Judgments (Reciprocal Enforcement) Order , Cap.319A . 60. Having regard to the above factors, I am not persuaded that Hong Kong is clearly the more appropriate forum for the trial of the dispute between the Plaintiffs and the Defendant. D2. Whether foreign proceedings unconscionable 61. In any event, I do not agree that the foreign proceedings are unconscionable. The Plaintiffs rely on five matters in this regard, and rely particularly on the Panama Proceedings. D2.1 Plaintiffs’ first ground: multiplicity of proceedings 62. First, the Plaintiffs say that there is a substantial overlap of issues in four sets of proceedings (the Hong Kong Writ Actions, the HK BGAH Petition, the Panamanian Proceedings, and the Singapore Proceedings), in that they were based on the same facts. Furthermore, no legitimate reason was given for the multiplicity. 63. However, it is necessary to bear in mind the chronology of events. 63.1 The Defendant says that he received information in late June 2017 from a broker that the Vessels were apparently being offered for sale, and the Defendant took the view that this was part of a scheme to strip BGAH of its assets and to frustrate any eventual winding up of Ocean Sino. He wrote to BGAH, Lohas and Mr Chu asking them to desist from selling the Vessels without PBM’s consent, and to ask for financial information about BGAH and the Vessels, but they refused to comply with the requests. At the time, the vessels flew the Hong Kong flag and were registered in Hong Kong. It was against this background that the Defendant says that he commenced the Hong Kong Writ Actions on 12 and 13 July 2017. 63.2 The Defendant says that he learnt from the same source that the intention was to deliver the MV BBG Hope to the buyer in Singapore, and the MV BBG Glory to the buyer between Singapore to Japan. At the time, he understood Wilmar, a Singaporean company, to be the intended buyer of the Vessels. Thus on 12 July 2017, the Defendant also commenced two actions in rem in Singapore against the owners and/or demise charterers of the Vessels in Singapore. 63.3 After the Plaintiffs took delivery of the Vessels in August 2017, the Plaintiffs deleted the Vessels’ registration in Hong Kong on 21 August 2017, and registered them in Panama. The names of the Vessels were also changed. The Defendant’s belief is that this was part of the scheme to keep the Vessels out of the reach of the liquidators of Ocean Sino. Given the change of the Vessels’ registration to Panama, the Defendant commenced proceedings in Panama on 29 September 2017, and obtained the Panama Injunction on 4 October 2017. 63.4 The Defendant did not thereafter pursue the Hong Kong Writ Actions or the Singapore Proceedings. 64. The Plaintiffs say that the Panama Proceedings were in fact instituted eleven days prior to the scheduled hearing of the application to strike out the writs in the Hong Kong Writ Actions, so as to pre-empt an unfavourable outcome. I do not agree. Before the Defendant commenced the Panama Proceedings on 29 September 2017, he had already been informed (on 13 September 2017) by Hope Ltd, Glory Ltd and Lohas that they would withdraw their striking-out summonses. 65. The Plaintiffs further say that the HK BGAH Petition was issued (on 23 August 2019) less than one month after the hearing of the Plaintiffs’ challenge to the jurisdiction of the Panamanian courts, again to pre-empt an unfavourable outcome. I do not agree. The HK BGAH Petition was issued not by the Defendant, but by PBM under the control of four liquidators of Ocean Sino, jointly appointed by the Defendant and Mr Chu, with two of them nominated by the Defendant and the other two by Mr Chu. No relief is sought against the Plaintiffs in the HK BGAH Petition. The relief sought in the HK BGAH Petition is different from that sought in the Panama Proceedings. 66. The Plaintiffs say that the need to obtain security cannot justify the maintenance of the Panama Proceedings, given that they have offered an undertaking not to sell or mortgage the Vessels. In the light of the difference between this and the Panama Injunction (which I have earlier addressed), I do not agree that adequate alternative security was offered (or that it was offered in the natural forum). 67. In any event, I do not agree that the Defendant is using a multiplicity of proceedings to vex the Plaintiffs. 67.1 The writs in the Singapore Proceedings were never served, and their validity expired on 12 July 2018. I do not agree that there is any analogy with Glencore International AG where the shipowners discontinued active proceedings in Singapore so as to pave the way for commencement of fresh proceedings in Georgia. 67.2 The writs in the Hong Kong Writ Actions were served on Hope Ltd and Glory Ltd, the then owners of the Vessels, but were not served on the Plaintiffs. After the striking-out summonses were withdrawn in July 2017, the Defendant took no further action in the proceedings. Instead, it was the Plaintiffs who voluntarily filed an acknowledgment of issue of writ on 13 December 2019, after they had launched their application for an anti-suit injunction. [3] 67.3 Prior to the hearing, the Defendant’s solicitors, Messrs DLA Piper, had indicated in a letter of 16 March 2020 that it did not agree with the complaint of multiplicity of proceedings, but in any event the Defendant was prepared to undertake not to proceed with the Singapore Proceedings and the Hong Kong Writ Actions. 67.4 The HK BGAH Petition was not commenced by the Defendant and does not seek relief against the Plaintiffs. 67.5 It is therefore only in the Panamanian Proceedings that the Defendant is actively pursuing relief against the Plaintiffs. 68. Given that the Defendant has all along not proceeded with the Hong Kong Writ Actions against the Plaintiffs, and now agrees to undertake not to proceed with them, it cannot be said that the Singaporean Proceedings or Panama Proceedings were commenced in bad faith for the purpose of frustrating Hong Kong proceedings, or that there are proceedings in Hong Kong which need to be protected by the grant of a restraining order: cf. Liaoyang Shunfeng Iron & Steel Co Ltd at [88], citing Turner v Grovit . D2.2 Plaintiffs’ second ground: hopeless claims in foreign proceedings 69. The Plaintiffs say that the claim in the Panama Proceedings is hopeless, in that the Defendant has no locus standi to seek a declaration that the MOAs are of no legal value or invalid in the Panama Proceedings, and the Defendant’s claim for damages by reference to an economic interest in unsustainable as a matter of Hong Kong law, any damage being mere reflective loss. 70. I agree with the Defendant that in the light of the Panama Injunction Appeal Judgment and the Panama Jurisdiction Judgment, the Plaintiffs are unable to show that the Defendant’s claim in the Panama Proceedings is “so utterly absurd that it cannot possibly succeed” or “plainly bound to fail”. 70.1 The Panama Injunction Appeal Judgment noted that in appealing against the Panama Injunction, the Plaintiffs had argued, inter alia, that whilst the Defendant had claimed to be the beneficial owner of certain companies, Panamanian law did not recognise the concept of beneficial ownership and the Defendant therefore had no apparent valid right to an injunction; and that the Defendant’s claim for a declaration of invalidity of various acts and contracts [4] did not meet the requirement of proving the appearance of a valid right. The Panamanian Maritime Court of Appeals was of the view that on the evidence provided, “there is an indication of the probability of the claimed right”. In other words, the Panama Court considered that the Defendant had demonstrated a prima facie claim sufficient to support the grant of the Panama Injunction. Both of the parties’ experts on Panama law have said that the Panama Injunction Appeal Judgment is, in effect, final and conclusive and not subject to further appeal. 70.2 In the Plaintiffs’ Special Motions to annul the Panama Proceedings, the Plaintiffs had argued that the Defendant lacked legal standing to bring an action to challenge the transfer of the Vessels, given that he never owned them, and that he lacked any economic interest in the Vessels. In the Panama Jurisdiction Judgment, the Second Maritime Court of Panama rejected the Plaintiffs’ complaint that the Defendant lacked standing. 71. In other words, two different courts in Panama have already rejected the Plaintiffs’ argument that the Defendant’s claim in the Panama Proceedings is bound to fail, on grounds similar to those advanced before me. It is not for the Hong Kong court to brush aside the decisions of these courts, and decide instead that the Panama Proceedings are hopeless and not fit to proceed. 72. As to the Singapore Proceedings, the Plaintiffs say that the Defendant’s claim to beneficial ownership of the Vessels would have plainly been liable to be struck out. In the light of the fact that the Singapore Proceedings are not “live” (the writs having expired) and were never pursued against the Plaintiffs, it is simply artificial to say that the claim is vexatious and that this should justify the issue of an anti-suit injunction. D2.3 Plaintiffs’ third ground: Defendant knew claims in foreign proceedings hopeless 73. The Plaintiffs say that the Defendant knew that his claims in the foreign proceedings were hopeless, given that the claims in the Singapore Proceedings and the Panama Proceedings were analogous to HCAJ 77/2019 and HCAJ 78/2019, and given that A Chan J in the HK Strike-Out Costs Judgment had held that these two actions were plainly unsustainable, the Defendant being merely a shareholder in Ocean Sino and not the registered owner of the Vessels. 74. However, A Chan J was not expressing any views regarding the merits of the Defendant’s claim in the Panama Proceedings as a matter of Panamanian law. In any event, in the light of the Panama Injunction Appeal Judgment and the Panama Jurisdiction Judgment, it can no longer be said that the claim in the Panama Proceedings is hopeless. It would not be right to grant an anti-suit injunction at this point in time by reference to an earlier view which, it is said, the Defendant ought to have taken of the hopelessness of his claim. 75. As to the Singapore Proceedings, again, since they were never pursued against the Plaintiffs and the writs have already expired, whatever view the Defendant ought to have taken about them by reason of A Chan J’s judgment in October 2017 would not justify the grant of an anti-suit injunction now. D2.4 Plaintiffs’ fourth ground: collateral attack on BVI Appeal Judgment 76. The Plaintiffs say that the Defendant’s claims in the foreign proceedings constitute a collateral attack on the BVI Appeal Judgment, which set aside the order of the BVI Commercial Court to wind up Ocean Sino. It is said that the factual premise of the Defendant’s case (that the Premier Agreement, the Premier Agreement Addendum, the Lohas Nomination and MOAs were a scheme to strip BGAH, Hope Ltd and Glory Ltd of their assets) is contradicted by the BVI Appeal Judgment, which held, inter alia, that Mr Chu could not by himself have influenced the direction of BGAH. 77. It is not necessary to delve into the details of what the BVI Appeal Judgment did or did not decide. Where an applicant seeks an anti-suit injunction not on the grounds of a contractual right, but on the grounds of the respondent’s unconscionable conduct, the rationale for the grant of an injunction lies in the necessity for the court to protect existing proceedings in the local jurisdiction. [5] See Liaoyang Shunfeng Iron & Steel Co Ltd at [88], citing Turner v Grovit . The BVI Appeal Judgment is a judgment of an appellate court in the BVI, not Hong Kong. 78. The Plaintiffs cited Michael Wilson & Partners Ltd v Emmott [2018] 1 CLC 77 at [55]. However, the court was not seeking to protect proceedings in a foreign jurisdiction, but arbitration proceedings (in which an award had been made) in the local jurisdiction. At [55], Sir Terence Etherton MR said: “The issue is rather whether the court in this jurisdiction, as the judicial guardian of the integrity of an arbitral process in London pursuant to an arbitration agreement subject to the laws of England and Wales, ought to exercise its discretion in favour of an anti-suit injunction because NSW2 is vexatious and oppressive in undermining that arbitration agreement and arbitration process.” (Emphasis added.) 79. The Plaintiffs also relied on China North Industries Investment Ltd v Chum [2010] 5 HKLRD 1 at [51] to say that it would be a scandal to the administration of justice to allow the Defendant to effectively re-open what was already decided in the BVI Appeal Judgment. However, what Stock JA (as he then was) was addressing was the court’s jurisdiction to prevent the relitigation of issues (determined by a court in another jurisdiction) in a case before it, not the jurisdiction to grant an anti-suit injunction to prevent a party from bringing proceedings in one foreign jurisdiction which allegedly relitigated issues determined by a court in another foreign jurisdiction. D2.5 Plaintiffs’ fifth ground: blatant disregard of choice of jurisdiction / law clauses 80. The Plaintiffs say that it is unconscionable for the Defendant to “blatantly disregard” the choice of jurisdiction or law clauses in the Premier Agreement, the Premier Agreement Addendum, the Lohas Agreement, and the MOAs. They say that an associate of a person who is party to an agreement regarding the choice of jurisdiction or law may be held to be acting vexatiously in undermining the agreement, citing Briggs, Civil Jurisdiction and Judgments. However, if one looks at the authority cited, Horn Linie GmbH & Co v Panamericana Formas E Impresos SA, The Hornbay [2006] 2 Lloyds Rep 44, the proposition would appear to go no further than that where a contracting party, or a person claiming through him, makes a claim on a contract, it would be vexatious for him to avoid the choice of jurisdiction clause in that very same contract. Mr Ho also cited Dickson Valora Group (Holdings) Co Ltd v Fan Ji Qian [2019] 2 HKLRD 173 at [45], but again, the party being restrained from avoiding the arbitration clause in an agreement was seeking, at the same time, to claim rights under the very same agreement. 81. It is the Defendant’s case that the various agreements were entered into without his knowledge or consent, and he is not seeking to sue on them, but rather, to have them declared invalid. It is difficult to see why it should be said to be vexatious for him not to abide by the choice of jurisdiction clauses in those agreements. D2.6 No unconscionable conduct 82. I therefore do not agree that the Panama Proceedings (or indeed the Singapore Proceedings) constitute vexatious or oppressive conduct on the part of the Defendant which ought to be restrained by an anti-suit injunction. E. WHETHER ANTI-SUIT INJUNCTION SHOULD BE GRANTED TO PROTECT INSOLVENCY JURISDICTION 83. This ground was at the forefront of the Plaintiffs’ skeleton submissions, but was barely touched upon at the hearing. 84. The Plaintiffs say that: 84.1 the Defendant has claimed against BGAH (and others) for damages in the sum of US$19m in the Panama Proceedings, and also made a claim as the owner of the Vessels in the Singapore Proceedings; 84.2 if BGAH were to be wound up, the winding up will be deemed to have commenced on 23 August 2019, being the date on which the HK BGAH Petition was presented; 84.3 if the Hong Kong court were to make an order for the winding up of BGAH, the continuation of these two sets of proceedings in Panama and Singapore could interfere with the insolvent liquidation of BGAH in Hong Kong; 84.4 an anti-suit injunction should therefore be issued in order to protect the integrity of the Hong Kong court’s insolvency jurisdiction, as well as the interests of the general body of BGAH’s creditors and members. 85. The Defendant objected to the Plaintiffs’ reliance on the HK BGAH Petition. They say that: 85.1 the HK BGAH Petition was only issued after the Originating Summons was filed on 11 July 2019, and was therefore a “cause of action arising post-writ”; 85.2 the Plaintiffs never mentioned their reliance in the HK BGAH Petition in their affirmation evidence, and raised it for the first time in their skeleton argument; 85.3 the Plaintiffs do not have the locus standi to rely on the HK BGAH Petition when they have no interest in any potential liquidation of BGAH; 85.4 the Hong Kong court has not made any order for the winding up of BGAH. 86. I agree with Mr Lam that the Plaintiffs do not have the locus standi to rely on the HK BGAH Petition to seek an anti-suit injunction under the Stichting Shell Pensioenfonds principle. The Plaintiffs are not members, creditors, nor liquidators of BGAH. That being the case, it is difficult to see why the HK BGAH Petition should confer on the Plaintiffs a right not to be sued in the Panama Proceedings or the Singapore Proceedings. 87. I also agree that an anti-suit injunction granted under the Stichting Shell Pensioenfonds principle is for the purpose of restraining proceedings against an insolvent company which is already in liquidation: see Stichting Shell Pensioenfonds at [16], [18]. The rationale is to uphold the integrity of the statutory trust imposed under the insolvency regime, and the maintenance of a fair and equal distribution of the insolvent estate. In the present case, no order has yet been made for the winding up of BGAH. 88. The Plaintiffs’ application falls outside the Stichting Shell Pensioenfonds principle for the further reason that they are not seeking to restrain the Defendant from pursuing the Panama Proceedings against BGAH, but only from pursuing them against the Plaintiffs: see paragraphs 1 to 3 of the Originating Summons. As for the Singapore Proceedings, they are not even brought against BGAH. 89. In any event, even if the Stichting Shell Pensioenfonds principle extended to the restraint of proceedings against a company which is the subject of a winding up petition (but which has not yet been wound up), I would have declined to grant the injunction sought, given that the winding up of Ocean Sino and appointment of liquidators over Ocean Sino (at whose instigation PBM presented the HK BGAH Petition) have been set aside in the BVI Appeal Judgment of 17 January 2020. There is no evidence as to whether and how the HK BGAH Petition will proceed. 90. It is therefore strictly speaking not necessary for me to decide Mr Lam’s objections to the Plaintiffs’ reliance on the HK BGAH Petition on the grounds it arises “post-writ” and was raised late. I will deal with these points briefly. 90.1 Mr Lam relied on Lark International Finance Limited v Lam Kim Marisa and anor [2000] 4 HKC 699 and Wing Siu Co Ltd v. Goldquest International Ltd [2003] 2 HKC 64 for the proposition that post-writ causes of action are invalid. 90.1.1 However, these authorities were concerned with the issue of whether a writ could be amended to include a cause of action which arose after the date of the writ, [6] and not with the validity of the cause of action itself. The analogy with the present situation is questionable, given that there is no suggestion that the Plaintiff’s reliance on the Stichting Shell Pensioenfonds jurisdiction needs to be “pleaded” in the Originating Summons (so that no objection of “relation back” arises). Furthermore, it is debatable whether there is a “cause of action” in the traditional sense and within the meaning of those authorities. [7] 90.1.2 In any event, the rule in Eshelby is one of practice, and is subject to exceptions: Re Hin-Pro International Logistics Ltd [2016] 5 HKLRD 282 at [32]. In that case, the Court of Appeal held that the court had jurisdiction to allow amendments to include post-petition debts in the case of a creditors’ winding-up petition, having regard to the public interest element of such a petition. The Court of Appeal drew a distinction between such winding-up petitions and petitions for unfair prejudice which were essentially private disputes between shareholders. Mr Lam sought to equate the Plaintiffs’ application with the latter. However, it would seem to me that the more appropriate parallel is with the former, given that the rationale of the Stichting Shell Pensioenfonds jurisdiction to restrain foreign proceedings is to uphold the principle of equal distribution of assets upon the winding up of an insolvent company. 90.1.3. In the circumstances, I am not persuaded that the rule in Eshelby would apply to prevent the Plaintiffs from relying on the HK BGAH Petition. 90.2 Mr Lam submitted that it was in any event unfair for the Plaintiffs to raise a new ground for seeking the anti-suit injunction only in their skeleton, and not to raise it even in their evidence. It was the Defendant who referred to the HK BGAH Petition in his evidence. However, given that the argument was essentially one of law, arising of matters that the Defendant had himself disclosed, and that the Defendant was not able identify any specific additional piece of evidence he would have adduced to deal with the argument, the Plaintiffs’ failure to give notice of the point earlier should not in itself bar the Plaintiffs from raising it. F. OTHER CONSIDERATIONS GOING TO DISCRETION 91. In the light of my conclusions above, I will only deal briefly with a number of other matters raised by the parties. F1. Delay 92. The Defendant says that the Plaintiffs’ delay is a further reason not to grant an anti-suit injunction. The Originating Summons was filed in July 2019, almost two years after the Panama Proceedings were commenced in September 2017. 93. The Plaintiffs’ explanation for the delay is that it was the Defendant who engaged in litigation gamesmanship, filing an Amended Claim Form in the Panama Action on 11 September 2018, just two days before the scheduled hearing of the Plaintiffs’ jurisdictional challenge, which necessitated the Plaintiffs’ amendment to their Special Motions (regarding their jurisdictional challenges and preliminary defences) and an adjournment of the hearing of the jurisdictional challenge. It was only on 13 March 2019 that the jurisdictional challenge was re-fixed to be heard on 1 August 2019. The Plaintiffs were “driven” to apply for the anti-suit injunction given the delay to their jurisdictional challenge in the Panamanian courts. 94. I do not consider that the delay has been adequately explained. 94.1 No explanation has been given as to why, if the Plaintiffs were concerned by the delay caused by the Defendant’s Amended Claim Form filed on 11 September 2018, the Originating Summons was not filed till July 2019. 94.2 One of the reasons why the Plaintiffs opposed the Defendant’s application for a stay or adjournment of the Originating Summons pending the determination of the Plaintiffs’ jurisdictional challenge in Panama was that the decision of the Panamanian court would not automatically dispose of the application for the anti-suit injunction, [8] (so that there was no real benefit in waiting for the Panama court to rule on the jurisdictional challenge). Given such a stance, there is no explanation as to why the Plaintiffs did not seek an anti-suit injunction earlier, after the Panama Proceedings were first taken out in September 2017. 94.3 Instead, the Plaintiffs took part in the Panama Proceedings (albeit on the basis that they challenged the jurisdiction of the Panama courts) in that they appealed against the grant of the Panama Injunction, challenged the jurisdiction of the Panamanian courts and raised preliminary defences including lack of locus standi, limitation and lis alibi pendens, and appealed against the admission of the Defendant’s Amended Claim Form. 95. I note that on the other hand, the Panama Proceedings have not yet proceeded to the stage of consideration of the merits of the Defendant’s claim. Pending the determination of the Plaintiffs’ jurisdictional challenge, which would presumably include determination of the Plaintiffs’ appeal against the Panama Jurisdiction Judgment, the parties do not need to take any further substantive step in the Panama Proceedings. [9] Mr Ho submitted that delay in such circumstances is not a good reason to refuse an anti-suit injunction, citing Nagara Maritime SA v Tianjin Iron & Steel Group Company Limited [2011] EWHC 3035 at [23]. However, in that case, there were other factors (such as the relatively short period of delay, which was explained), which led the court to the conclusion that delay was not a good reason to refuse the injunction. 96. The Defendant says that he suffered prejudice from the delay in having to spend time and resources on resisting the application. However, he would have had to spend such time and resources even if the application had been launched earlier. 97. More importantly, the need to avoid delay arises not just to protect a respondent to an application for an anti-suit injunction from prejudice or detriment. There are other considerations, including that of comity: Sea Powerful II Special Maritime Enterprises (ENE) v Bank of China Ltd [2016] 3 HKLRD 352 at [17], [18], [20], [21] (a decision in the context of an anti-suit injunction based on a contractual arbitration clause). The longer an applicant allows foreign proceedings to continue without injunctive relief, the greater the detriment not only to the respondent, but also to the foreign court which may have held hearings and produced judgments. Furthermore, delay would allow an applicant to have two bites at the cherry, challenging the foreign court’s jurisdiction first and then, if unsuccessful, seeking an anti-suit inunction. 98. In the present case, there were hearings in the Panamanian courts to deal with the Plaintiffs’ appeal against the Panama Injunction, and their jurisdictional challenges and preliminary defences. They have handed down a number of judgments, including the Panama Jurisdiction Judgment by the Second Maritime Court of Panama of 16 January 2020 which holds that the Panamanian courts have jurisdiction over the dispute (and against which the Plaintiffs have appealed). To grant an anti-suit injunction would be tantamount to overturning this judgment: cf. Sea Powerful II Special Maritime Enterprises (ENE) at [23]. 99. The lengthy delay in applying for the anti-suit injunction, for which no good explanation has been given, and during which time various steps have been taken in the Panama Proceedings culminating in a decision confirming the jurisdiction of the Panamanian courts, further supports the dismissal of the Plaintiffs’ application for an anti-suit injunction. F2. Necessity of anti-suit injunction 100. The Plaintiffs say that they have become concerned about the difficulty of obtaining finance for their business and that they will have greater difficulty in obtaining finance if they are not allowed to mortgage the Vessels, in circumstances where the Panama Proceedings may take six to ten years at the first instance level. [10] They say that the grant of the anti-suit injunction would allow the Plaintiffs to discharge the Panama Injunction, which is currently preventing the Plaintiffs from raising finance. 101. However, the Plaintiffs at the same time have offered an undertaking not to sell or mortgage the Vessels pending resolution of the Hong Kong Writ Actions, if the Plaintiffs discontinue proceedings outside Hong Kong. It is therefore difficult to see how the grant of an anti-suit injunction would enable the Plaintiffs to raise finance. F3. Juridical advantages in Panama 102. The conditions for the grant of an anti-suit injunction fall to be considered also at the secondary stage of the exercise of discretion: Glencore International AG v Exeter Shipping Ltd & others [2002] CLC 1090 at [43], per Rix LJ. 103. I have earlier referred to the legitimate juridical advantages which the Defendant would lose if he were restrained from proceeding in Panama. These add weight against the grant of an anti-suit injunction. F4. Abuse of process? 104. The Defendant complains that the Plaintiffs failed to apply for a stay of the Panama Proceedings on the grounds of forum non conveniens in Panama, despite their filing of a jurisdictional challenge and preliminary defences. 105. In that part of his skeleton addressing factors going to the court’s discretion as to whether or not an anti-suit injunction should be granted, the Defendant appeared to suggest that an application for a stay of proceedings in the foreign jurisdiction is a pre-requisite to the seeking of an anti-suit injunction in the local forum. I do not, however, understand the Defendant to actually be advancing the argument that applying for a stay on the grounds of forum non conveniens in the foreign forum is necessary before the court’s jurisdiction to grant an anti-suit injunction may be invoked, given that the Defendant did not make any submissions that the court’s jurisdiction was not engaged at all. 106. Instead, it appears that the nub of the Defendant’s complaint on this issue was that it was an abuse of process in the Henderson v Henderson [11] sense for the Plaintiffs not to have raised the issue of forum non conveniens in Panama, when they could have done so when filing their Special Motions and preliminary defences. 107. However, on the evidence, it is not clear that the Plaintiffs could have raised the issue of forum non conveniens in the Panama Proceedings. The Plaintiffs’ expert on Panamanian law says that Panama does not follow the doctrine of forum non conveniens, at least not in the same way that the doctrine is understood in the United States or England. The Defendant’s own expert says that “the provision [of the Maritime Procedure Code of the Republic of Panama] that is understood as containing such a doctrine [of forum non conveniens] does not order or allow the Judge to refrain from continuing to decide a case and to transfer it to another jurisdiction based on a multifactor analysis test of connecting points, or that the Panamanian jurisdiction might be vexatious or oppressive to the defendant and that there is another available and more adequate jurisdiction to decide the merits of the claim. This would be the concept of forum non conveniens as developed in the US law or in other common law jurisdictions.” G. DISPOSITION 108. For the foregoing reasons, I dismiss the Originating Summons. 109. I further make a costs order nisi that the Plaintiffs do pay the Defendant the costs of and occasioned by the Originating Summons, with a certificate for two counsel, to be taxed if not agreed. (Yvonne Cheng SC) Recorder of the High Court Mr Ambrose Ho, SC and Mr Michael Ng, instructed by Holman Fenwick Willan, for the 1 st and 2 nd Plaintiffs Mr Douglas Lam, SC and Ms Jacqueline Law, instructed by DLA Piper Hong Kong, for the Defendant [1] The Panama Proceedings are brought against other parties as well, but the scope of the injunction sought by the Plaintiffs in the present action relates to proceedings against themselves. [2] Which applies when considering the classification of the cause of action. [3] Mr Ho cited MV Popi (Owners) v SS Gniezno (Owners) [1968] P 418 for the proposition that a defendant can enter a voluntary appearance to a writ even if it has not been served on him. However, that decision was based on the wording of rules of court which have since been amended. Under the current O.10 r.1(5), if it is shown that a writ has not been served, a defendant’s acknowledgment does not operate to deem due service: see Abu Dhabi Helicopters v Aeradio plc [1986] 1 WLR 312 at 315F to 316H. In any event, the Plaintiffs do not come within O.10 r.1(5) since they filed an acknowledgment of issue of writ, rather than an acknowledgment of service. Mr Ho also relied on O.75 r.3(6), which provides that a defendant to an action in rem in which the writ has not been served may acknowledge the issue of the writ. However, the Plaintiffs did not address the issue of the effect of such an acknowledgment in the light of matters such as the expiry of the writ as against the Plaintiffs, or A Chan J’s order that the actions be removed from the Admiralty List and transferred to the General List (HK Strike-Out Costs Judgment paragraph 15). Ultimately, it is not necessary for me to go into these issues, given that the Defendant simply has not at any stage sought to pursue the Hong Kong Writ Actions against the Plaintiffs. [4] In the Defendant’s Amended Claim Form in the Panama Proceedings, the Defendant had sought a declaration that the Premier Agreement, the Premier Agreement Addendum and Lohas Nomination were invalid, and that the sale of the Vessels to the Plaintiffs were invalid. [5] Including arbitration proceedings or awards in the local jurisdiction: Michael Wilson & Partners Ltd v Emmott [2018] 1 CLC 77 at 55. [6] That is, the rule in Eshelby v Federated European Bank Ltd [1932] 1 KB 254 . [7] Gee, Commercial Injunctions, 6th ed, p.460: “The anti-suit jurisdiction is not constrained by a need for a legal or equitable “right”, an “equity”, or a “cause of action”. [8] 2nd Affirmation of Wong Kim Lung dated 25 October 2019, paragraph 20. [9] 2nd Affirmation of Lau Wing Yan dated 3 January 2020, paragraph 123(1) (addressing the situation pending the decision of the Second Maritime Court of Panama as the Panama Jurisdiction Judgment had not yet been handed down at that time). [10] 1st Affirmation of Wong Kim Lung dated 11 July 2019, paragraph 61; 2 nd Affirmation of Wong Kim Lung dated 25 October 2019, paragraph 22(1). [11] (1843) 3 Hare 100. Look up this case on Lawcite Noteup",
  "length": 73989,
  "headers_seen": [
    "A. INTRODUCTION",
    "A1. The application before the court",
    "A2. The background",
    "A2.1 The BVI Winding Up Proceedings",
    "A2.2 Events leading up to the sale of the Vessels",
    "A2.3 The Hong Kong Writ Actions and the sale of the Vessels to the Plaintiffs",
    "A2.4 The Singapore Proceedings",
    "A2.5 The Panama Proceedings"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2020/653",
  "query": "anti-suit injunction",
  "ts": "2025-10-16T10:46:54",
  "ok": true
}