{
  "title": "UDL HOLDINGS LTD AND ANOTHER V. LEUNG YUET KEUNG AND ANOTHER | [2004] HKCA 110 | HKLII",
  "court": null,
  "year": 2004,
  "date": null,
  "content": "HKLII Databases Court of Appeal [2004] HKCA 110 UDL HOLDINGS LTD AND ANOTHER V. LEUNG YUET KEUNG AND ANOTHER Judgment Information Date 19 Jan, 2004 Action No. CACV271/2003 Neutral Cit. [2004] HKCA 110 Parallel Cit. [2004] 1 HKC 548 Download MS Word Judgment Reading Options Translation Toggle Highlight Appeal History CACV271/2003 CACV000271/2003 UDL HOLDINGS LTD AND ANOTHER v. LEUNG YUET KEUNG AND ANOTHER CACV000271/2003 CACV 271/2003 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF APPEAL CIVIL APPEAL NO. 271 OF 2003 (ON APPEAL FROM HCA NO. 4409 OF 2002) ____________________ BETWEEN UDL HOLDINGS LIMITED 1st Plaintiff WELL RAISE INVESTMENT LIMITED 2nd Plaintiff AND LEUNG YUET KEUNG 1st Defendant WONG SUM YUEN 2nd Defendant ____________________ Coram: Hon Rogers VP and Le Pichon JA in Court Date of Hearing: 8 January 2004 Date of Handing Down Judgment: 20 January 2004 ____________________ J U D G M E N T ____________________ Hon Rogers VP: 1. This is an appeal from a judgment of Deputy High Court Judge Poon given on 16 July 2003 whereby he ordered that the 1st and 2nd plaintiffs should give security for costs in this action in the sum of HK$450,000. At the conclusion of the hearing of this appeal this court reserved its judgment which we now give. The judgment and order below 2. The judge made the order under the provisions of Order 23 rule 1 (1)(b) of the Rules of the High Court . The basis upon which such an order was made was that the plaintiff was a nominal plaintiff who was suing for the benefit of some other person and that there was reason to believe that the plaintiff would be unable to pay the costs of the defendant if ordered to do so. 3. For the purposes of these proceedings, there is no dispute that the plaintiff is, effectively, impecunious and would be unable to pay the costs. The question which arose below was whether the plaintiff was merely a nominal plaintiff suing for the benefit of some other person. The judge reached the conclusion that the 1st plaintiff was suing in a nominal capacity and that any proceeds resulting from success in the litigation would have to be passed on for the benefit of others and not retained by the plaintiff. The basis for that holding was that there was a scheme of arrangement (\"the Scheme\") in existence in respect of the 1st plaintiff, as well as a number of other similar schemes in place in respect of some of the subsidiaries of the 1st plaintiff, and that any proceeds of the present litigation would constitute \"Accounts Receivables\" within the terms of the Scheme and would have to be remitted to the \"Scheme Account\". It is that conclusion which is challenged on behalf of the plaintiffs on this appeal. 4. The 1st plaintiff's claim in this action is for the sum of US$1.5 million and in the alternative for damages to be assessed and for an enquiry as to damages for breach of confidence and a further claim for loss of profits of US$1.2 million. The claims are made against the two defendants, who are former directors of the 1st plaintiff, for breach of their duties as directors and for breach of confidence. The issue which thus arises is whether any proceeds which may be recovered by the plaintiffs in this litigation would constitute \"Accounts Receivables\" within the terms of the Scheme. The scheme of arrangement 5. The Scheme document deals with the question of the sale of encumbered assets, the sale of unencumbered assets, recoveries of accounts receivables and costs of arbitration claims and inter-company debts separately. No question arises in relation to encumbered assets. Unencumbered assets under the Scheme are dealt with specifically in clauses 12-18. The most important provisions for the purposes of this case are in clause 13 which deals separately in relation to the 1st plaintiff and those of its subsidiaries which were Scheme Participating Subsidiaries. The latter companies were required to transfer, or procure the transfer, of all their unencumbered assets (excluding the Accounts Receivables) so that they could be realised for the benefit of the creditors. The 1st plaintiff was only required to transfer its interest in a land use right and a right to operate a quarry both of which were in the Mainland. Its other unencumbered assets were not required to be transferred. It might be mentioned that, as a practical matter, it seems the 1st plaintiff might not have had any unencumbered assets of any significance. It is evident from clause 13 that in general terms accounts receivables could fall within the category of unencumbered assets but Accounts Receivables are dealt with separately in the Scheme document. 6. Clause (B) of the Scheme document specifies that unless the context otherwise requires \"Accounts Receivable(s)\" means all accounts receivable(s) other than receivables in respect of \"inter-company debts\" and \"receivables charged to certain Financial Creditors as security\". The clause goes on to provide that Accounts Receivable(s) also include \"all claims or counterclaims (after setting off the claims of the opposing parties) claimed by the Company ... in any arbitration proceedings which have commenced and are continuing as at the Effective Date and the excess of the proceeds and cost awards over the Secured Debts payable to the Financial Creditors as referred to in Clause 21(c) of this Scheme which is to be remitted and transferred to the Scheme Account pursuant to Clause 21(c).\" 7. When the Scheme document refers to recoveries of \"Accounts Receivables\" it commences, at clause 19, by providing that as soon as the 1st plaintiff should \"receive any recoveries of their Accounts Receivables ... they shall remit and transfer such recoveries (after deduction of all expenses incurred including all legal expenses and the reimbursement to be made to the Company for its provision of finance for the cost of such recoveries pursuant to Clause 21(c) of this Scheme of Arrangement) to the Scheme Account.\" The part which is omitted in the quotation above excludes inter-company debts which are referred to otherwise in the Scheme document and accounts receivables which are referred to in clause 20 of the Scheme. Before proceeding to clause 20 it can be noted that the reference to legal expenses in clause 19 makes it implicit that there could be legal costs arising out of the recovery of the Accounts Receivables; it does not stretch the imagination that those legal costs could well include litigation expenses. 8. Clause 20 deals with (accounts) receivables which have arisen from contracts for services provided by the company and which have been charged to Financial Creditors as security. Clause 20(a) provides that the Financial Creditor may in those circumstances agree with the 1st plaintiff as to how any litigation would be financed and managed if there were not sufficient money in the Revolving Fund which had been set up to finance recoveries. Clause 20(b) makes provision for the Financial Creditors to provide information to the Scheme Administrator in relation to their security. Clause 20(c) is in my view significant and I set it out \"(c) (i) If the net proceeds from the recovery of such receivables (aggregated, where appropriate, with the estimated recovery value of any other account receivable falling to be valued under Clause 20(c)(ii) are insufficient to satisfy and discharge the Secured Debt due to these Financial Creditors, such Financial Creditors shall be entitled in respect of the balance of the Secured Debt as Scheme Creditors as if they had been admitted to proof as Unsecured Creditors under the Scheme for the amount of that balance. (ii) Subject to Clause 20(e), if any of the recovery of such receivables is not completed prior to the expiry of two years after the Effective Date, the Scheme Administrator shall appoint an independent professional quantity surveyor to assess (as an expert and not as an arbitrator) the estimated recovery value of such receivables as at the date of assessment. The amount as so assessed by the independent professional quantity surveyor (aggregated, where appropriate, with the net amount realised by the Financial Creditor in respect of any realisations made pursuant to Clause 20(c)(i)) shall be treated as having extinguished or as the case may be pro tanto reduced the Secured Debt and the Financial Creditor shall be entitled in respect of the balance (if any) of the Secured Debt as a Scheme Creditor after deduction of the estimated recovery value of such receivables as so assessed as if he had been admitted to proof as an Unsecured Creditor under the Scheme for the amount of that balance provided however that this shall not affect the right of the relevant Financial Creditor to require his Scheme Debts to be established upon the conclusion of relevant arbitration proceedings as prescribed in Clause 20(e).\" Clause 20(d) provides for a situation where the actual recovery of any receivable is smaller than the estimated recovery under Clause 20(c)(ii) and Clause 20(e) provides for a situation where there is an arbitration which has been commenced and is continuing at the Effective Date. The appellant's argument on this appeal 9. Ms Lam, who appeared on behalf of the 1st plaintiff on this appeal, argued that Accounts Receivables should be interpreted as constituting debts which have been crystallised or are otherwise of liquidated amounts. In support of that there were two limbs of the argument. In the first place Ms Lam relied upon the general meaning of accounts receivables as found, for example, in the dictionary definition. In this respect reliance was placed upon Black's Law Dictionary where it is said with reference to account receivable \"An account reflecting a balance owed by a debtor; a debt owed by a customer to an enterprise for goods or services. - Often shortened to receivable. - Also termed note receivable .\" Reference was also made to the decision of Thackray J in Metropolitan Trust Co. of Canada v Novastar Development Corp., British Columbia Supreme Court, 22 March 1993, wherein the judge held that rent constituted an account receivable since it was a debt in the ordinary meaning. 10. The last authority is not conclusive as to whether an account receivable had to be debt, albeit a debt would be an account receivable. Nevertheless, I would agree that in general parlance the term account receivable would usually be used in relation to a debt. However, in my view, the term of Accounts Receivable(s) must be interpreted according to the way it is to be used in the Scheme document. It appears to be quite clear that the Scheme document has used that expression to include unliquidated amounts as well as liquidated amounts or debts. The definition section (B) is not conclusive on the matter but it can be seen that the word \"debts\" is used in relation to inter-company debts whereas \"receivables\" is used in relation to items which had been charged to Financial Creditors. 11. More importantly, however, although clause 20 obviously refers to (accounts) receivables which have been charged to Financial Creditors it is quite clear both in clause 20(c)(i) and (ii) that reference is made to receivables which include items which might be unquantified. This is particularly clear not only from the use of the words \"estimated recovery\" but also from the provision that an independent quantity surveyor may be engaged to assess the estimated recovery value of a receivable. 12. In so holding I have not lost sight of Ms Lam's three points. The first is that the costs of this litigation were not to be borne out of the Revolving Fund. The second is that neither the Scheme Administrator nor any of the Scheme Creditors had any control over the litigation or the costs thereof. The third is that not all the assets of the 1st plaintiff were to be transferred as part of the Scheme. These points may be correct in relation to this particular litigation and insofar as they go. In this respect, it may be that the costs of litigation could be financed out of the Revolving Fund set up under clause 21. Indeed, Ms Lam told the court, in answer to a question, that the Scheme Administrator has not committed himself, one way or the other, as to whether he considered that the fruits of this litigation would fall within the category of assets to which the creditors would be entitled. 13. What, however, I consider is most important, and where the third point does not cover the position, is that the overall effect of the Scheme may be considered to be that, apart from the specific assets in the Mainland referred to in clause 13, the 1st plaintiff was to retain all the unencumbered real estate and physical assets in its own name as well as those assets which were held by companies which were not part of the Scheme. The unencumbered assets which were to be sold would be those which were held in the names of companies which were \"Scheme\" companies. In contrast, the cash flow arising as a result of anything that had happened before the Effective Date would go into the Scheme and the cash flow arising after the Effective Date would not. That in itself was subject to the overall requirements of clause 27 which provided for minimum amounts that the Scheme would generate for benefit of the unsecured creditors but that is a different matter. 14. The distinction, therefore, was between fixed or physical assets which were owned by the 1st plaintiff and items which could really be regarded as cash or the entitlement thereto. Some further support for this can be seen in Appendix 3 to the Explanatory Statement which sets out, on page 47 of the document, an analysis of the liquidation value of the 1st plaintiff. Under the heading \"Unencumbered Assets\" were listed categories \"Land and Buildings, Furniture and Fixtures, Motor Vehicles, Vessels & Plant & Machinery and Workshops\". Under the heading \"External Receivable\" were listed the categories \"Uncontested, Contested, Unsettled and To be set off\". Whatever the last category might refer to is not altogether certain. Nevertheless, the fact that there was a category \"Unsettled\" under the heading \"Receivable\", implies to me that the document was drafted on the basis that \"Receivables\" included claims for unliquidated amounts. 15. In those circumstances insofar as the 1st plaintiff has a claim which existed at the Effective Date which can be quantified, albeit after action, I see no reason, at present, why that should not come within the meaning of account receivable as used in the Scheme document. 16. I would add that this conclusion has been reached at an interlocutory stage. Furthermore, it can be in no way binding on any party, whether it be the Scheme Administrator or any other party, who has not been involved in this litigation. Nevertheless, for the reasons which I have sought to outline I consider that the judge below was correct in his conclusion in paragraph 17 of his judgment where he said: \"When properly understood in the entire context, the term 'Accounts Receivables', in my view, includes monetary claims in legal or arbitral proceedings so long as the cause of action accrued at or before the effective date.\" 17. I would therefore dismiss this appeal and make an order nisi of costs in favour of the defendants. Hon Le Pichon JA: 18. I agree. (Anthony Rogers) (Doreen Le Pichon) Vice-President Justice of Appeal Representation: Ms Catrina Lam, instructed by Messrs Tsang & Lee,for the 1st Plaintiff/Appellant Mr Anthony Ismail, instructed by Messrs Ho & Ip,for the 1st & 2nd Defendants/Respondents Look up this case on Lawcite Noteup",
  "length": 15636,
  "headers_seen": [
    "The judgment and order below",
    "The scheme of arrangement",
    "The appellant's argument on this appeal"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkca/2004/110",
  "query": "costs of arbitration",
  "ts": "2025-10-16T10:45:16",
  "ok": true
}