{
  "title": "ASTRO NUSANTARA INTERNATIONAL B.V. AND OTHERS V. PT AYUNDA PRIMA MITRA AND OTHERS | [2012] HKCA 351 | HKLII",
  "court": null,
  "year": 2012,
  "date": null,
  "content": "HKLII Databases Court of Appeal [2012] HKCA 351 ASTRO NUSANTARA INTERNATIONAL B.V. AND OTHERS V. PT AYUNDA PRIMA MITRA AND OTHERS Judgment Information Date 9 Aug, 2012 Action No. CACV71/2012 Neutral Cit. [2012] HKCA 351 Parallel Cit. [2012] 4 HKLRD 855 [2012] 5 HKC 400 Download MS Word Judgment Reading Options Translation Toggle Highlight Appeal History CACV71/2012 CACV71/2012 ASTRO NUSANTARA INTERNATIONAL B.V. AND OTHERS v. PT AYUNDA PRIMA MITRA AND OTHERS CACV71/2012 ASTRO NUSANTARA INTERNATIONAL B.V. AND OTHERS v. PT AYUNDA PRIMA MITRA AND OTHERS CACV71/2012 ASTRO NUSANTARA INTERNATIONAL B.V. AND OTHERS v. PT AYUNDA PRIMA MITRA AND OTHERS CACV71/2012 ASTRO NUSANTARA INTERNATIONAL B.V. AND OTHERS v. PT AYUNDA PRIMA MITRA AND OTHERS CACV71/2012 ASTRO NUSANTARA INTERNATIONAL B.V. AND OTHERS v. PT AYUNDA PRIMA MITRA AND OTHERS CACV71/2012 ASTRO NUSANTARA INTERNATIONAL B.V. AND OTHERS v. PT AYUNDA PRIMA MITRA AND OTHERS CACV71/2012 ASTRO NUSANTARA INTERNATIONAL B.V. AND OTHERS v. PT AYUNDA PRIMA MITRA AND OTHERS CACV71/2012 ASTRO NUSANTARA INTERNATIONAL B.V. AND OTHERS v. PT AYUNDA PRIMA MITRA AND OTHERS CACV71/2012 ASTRO NUSANTARA INTERNATIONAL B.V. AND OTHERS v. PT AYUNDA PRIMA MITRA AND OTHERS CACV71/2012 ASTRO NUSANTARA INTERNATIONAL B.V. AND OTHERS v. PT AYUNDA PRIMA MITRA AND OTHERS CACV71/2012 ASTRO NUSANTARA INTERNATIONAL B.V. AND OTHERS v. PT AYUNDA PRIMA MITRA AND OTHERS CACV71/2012 ASTRO NUSANTARA INTERNATIONAL B.V. AND OTHERS v. PT AYUNDA PRIMA MITRA AND OTHERS CACV71/2012 ASTRO NUSANTARA INTERNATIONAL B.V. AND OTHERS v. PT AYUNDA PRIMA MITRA AND OTHERS CACV71/2012 ASTRO NUSANTARA INTERNATIONAL B.V. AND OTHERS v. PT AYUNDA PRIMA MITRA AND OTHERS CACV71/2012 ASTRO NUSANTARA INTERNATIONAL B.V. AND OTHERS v. PT AYUNDA PRIMA MITRA AND OTHERS CACV71/2012 ASTRO NUSANTARA INTERNATIONAL B.V. AND OTHERS v. PT AYUNDA PRIMA MITRA AND OTHERS CACV71/2012 ASTRO NUSANTARA INTERNATIONAL B.V. AND OTHERS v. PT AYUNDA PRIMA MITRA AND OTHERS CACV 71/2012 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF APPEAL CIVIL APPEAL NO 71 OF 2012 (ON APPEAL FROM HCCT NO 45 OF 2010) ____________ BETWEEN (1) ASTRO NUSANTARA INTERNATIONAL B.V. Applicants/ Claimants (2) ASTRO NUSANTARA HOLDINGS B.V. in the (3) ASTRO MULTIMEDIA CORPORATION N.V. Arbitration/ Judgment (4) ASTRO MULTIMEDIA N.V. Creditors (5) ASTRO OVERSEAS LIMITED (formerly known as AAAN (Bermuda) Limited) (6) ASTRO ALL ASIA NETWORKS PLC (7) MEASAT BROADCAST NETWORK SYSTEMS SDN BHD (8) ALL ASIA MULTIMEDIA NETWORK FZ-LLC and (1) PT AYUNDA PRIMA MITRA Defendants/ (2) PT FIRST MEDIA TBK (formerly known as PT BROADBAND MULTIMEDIA TBK) Respondents in the Arbitration/ Judgment Debtors (3) PT DIRECT VISION and ACROSSASIA LIMITED Garnishee ______________ Before: Hon Kwan and Fok JJA in Court Date of Hearing: 3 August 2012 Date of Judgment: 10 August 2012 ______________ JUDGMENT ______________ Hon Kwan JA: 1. The order that is the subject of this appeal was made by Deputy Judge Lok on 21 March 2012. By this order, he required the garnishee, AcrossAsia Limited (“AAL”), to pay into court all sums due and payable, or as they become due and payable, to PT First Media TBK (“First Media”), one of the three judgment debtors, pending the final determination of proceedings in Singapore issued by First Media to set aside orders made by the High Court of Singapore for the enforcement of five arbitration awards in favour of the eight claimants in the arbitration (collectively referred to as “Astro”). This is the appeal of AAL with the leave of the judge. First Media appeared by counsel but did not make any submission in this appeal. The background 2. The relevant background matters, taken largely from the judge’s decision, may first be stated as follows. 3. Astro are related companies within a group with the headquarters in Malaysia. First Media is an Indonesian company with its shares listed in the Indonesian Stock Exchange. AAL was incorporated in the Cayman Islands and is registered as a non-Hong Kong company under Part XI of the Companies Ordinance , Cap 32 . The shares of AAL are listed in the Growth Enterprise Market board of the Hong Kong Stock Exchange. AAL holds 55.1% of the issued shares in First Media. 4. Between 7 May 2009 and 3 August 2010, five awards were made by the tribunal at the Singapore International Arbitration Centre (“SIAC”) in an arbitration brought by Astro against First Media and two other entities. By the award on 7 May 2009, the tribunal allowed the joinder of certain Astro parties to the arbitration. By the four subsequent awards, the awards of money made in favour of Astro are in excess of US$130 million. 5. On 3 August 2010 and 9 September 2010, Saunders J granted leave to Astro to enforce the awards in Hong Kong. Judgment was entered in terms of the awards on 9 December 2010 (“the Hong Kong Orders and Judgment”). 6. On 5 August 2010 and 3 September 2010, Astro obtained similar orders for the enforcement of the awards in Singapore and judgment was entered in terms of the awards on 24 March 2011 (“the Singapore Orders and Judgment”). On 3 May 2011, First Media applied to set aside the Singapore Judgment on the basis there was no valid service of the Singapore Orders on it. The Singapore court granted the application on 22 August 2011, set aside the Singapore Judgment and gave leave to First Media to apply to set aside the Singapore Orders. 7. On 30 June 2011, a facility agreement was entered into between First Media and AAL by which First Media granted a loan facility of US$44 million to AAL. According to the agreement, the loan facility was to be rolled over every three months, for up to one year, subject to extension and the overriding right of First Media to call for payment on demand. There is no dispute that AAL owes a debt of US$44 million with interest to First Media with the due date on 30 June 2012. 8. On 14 July 2011, Astro made an ex parte application in Hong Kong for a garnishee order against AAL in respect of the debt due from AAL to First Media under the facility agreement. On 22 July 2011, a garnishee order to show cause was granted by a master. The garnishee order nisi was served on First Media on 5 August 2011. On 16 August 2011, AAL filed evidence to oppose the grant of a garnishee order absolute, stating that steps “will also be taken by [First Media] to challenge the applications in Hong Kong to enforce the SIAC arbitration awards”. 9. Pursuant to leave granted on 22 August, on 12 September 2011, First Media applied to set aside the Singapore Orders (“the Singapore Setting Aside Application”). No hearing date had yet been fixed for this application when Deputy Judge Lok made the subject order in the present appeal on 21 March 2012. 10. In the meantime, further affidavits were filed by AAL and Astro in the garnishee proceedings in Hong Kong. The substantive hearing for a garnishee order absolute was scheduled to be heard by a master on 3 February 2012. No steps to challenge the awards in Hong Kong were taken by First Media until 18 January 2012, when it applied for an extension of time to set aside the Hong Kong Orders and Judgment (by then it was 14 months out of time), an order to set aside the Hong Kong Orders and Judgment, and an order to discharge the garnishee order to show cause (“the Hong Kong Setting Aside Application”). The ground for the Hong Kong Setting Aside Application was the same as the Singapore Setting Aside Application, namely, that the tribunal at the SIAC had wrongly joined certain Astro parties to the arbitration because it had misunderstood the effect of rule 24(b) of the SIAC Rules, an argument which was raised before and was rejected by the tribunal. 11. On 27 January 2012, the substantive hearing for a garnishee order absolute was adjourned as a result of further evidence filed by AAL. 12. On 20 February 2012, Astro issued the summons which was heard by the judge on 15 March 2012 and resulted in the subject order under appeal. By this summons, Astro sought (1) an order that all further proceedings in this action, including the Hong Kong Setting Aside Application, be stayed pending the determination by the Singapore High Court of the Singapore Setting Aside Application; and (2) pending the final determination of the Singapore Setting Aside Application, AAL shall pay all sums due and payable, or as they become due and payable, to First Media into court. The judge granted the orders sought in (1) and (2). As a result of this, the Hong Kong Setting Aside Application and the garnishee order absolute application have been stayed pending the final determination of the Singapore Setting Aside Application. There is no appeal from the order in (1). Only the order in (2) is the subject of AAL’s appeal. The judgment below 13. Before the judge, the solicitor appearing for AAL argued that the court should not garnishee the debt because although AAL is within the jurisdiction, there is a risk that it may have to pay the debt twice as the debt is recoverable outside the jurisdiction [1] . AAL opposed an order of paying the debt into court on the ground that a Hong Kong garnishee order will not extinguish the underlying debt, which is governed by Indonesian law, and as the garnishee order will not be recognised by the Indonesian courts, there is a danger that AAL may have to pay the debt twice, citing Deutsche Schachtbau-und Tiefbohrgesellschaft mbH v Shell International Petroleum Co Ltd [1990] 1 AC 295 [2] . 14. The judge did raise the issue of jurisdiction at the hearing. He took the initiative of referring the parties to Hong Kong Civil Procedure 2012 Vol 1 para 49/1/8, which is under the heading of “Garnishee “within the jurisdiction”” [3] . Regrettably, that paragraph made no reference to the decision of the House of Lords in Société Eram Ltd v Cie Internationale de Navigation [2004] 1 AC 260 . Not only that, the penultimate sentence in that paragraph reads: “In so far as Richardson v Richardson [1927] P 228 goes further, and decides that there is no power to garnish a debt situate outside the jurisdiction, it must be taken to be wrongly decided in the light of the Court of Appeal’s reasoning in S.C.F. Finance Co Ltd v Masri (No. 3) [1987] QB 1028 ; [1987] 1 All E R 194, CA, and Interpool Ltd v Galani [1988] QB 738 ; [1987] 2 All E R 981 CA).” This sentence is incorrect in the light of the Eram case [4] , in which all the Law Lords said the criticism of Richardson v Richardson was mistaken. 15. No argument was put forward by AAL’s solicitor as to why the court might not have jurisdiction to make the order sought by Astro [5] . 16. The judge held that notwithstanding the facility agreement was signed in Indonesia and its governing law is Indonesian law, so long as the debtor AAL is within the jurisdiction and the debt is properly recoverable within the jurisdiction, the debt is attachable under Hong Kong law. He then dealt with the application on the basis of the exercise of his discretion [6] . 17. He held that as the Hong Kong Setting Aside Application is pending, the court should not order AAL to pay the debt directly to Astro. In ordering AAL to pay the debt into court when it is due for payment, AAL would not suffer prejudice because the debt is due for payment in any event. There is also no risk of double payment because the money is paid into court, and, if necessary, it can be paid out to satisfy any possible claim by First Media against AAL on further application to the court. Further, Astro had legitimate concern that AAL would be unable to pay pursuant to the garnishee order when it is made absolute after the determination of the Hong Kong Setting Aside Application, as doubts had been raised in the 2010 annual report of AAL as to its viability as a going concern, and that is a strong reason why AAL should be asked to pay the debt into court in the interim. Any inconvenience to First Media in that it may be deprived of the use of the funds for a short period of time is justified, as there is an existing judgment for the enforcement of the awards and there has been delay on its part in taking out the Hong Kong Setting Aside Application. In case of any change in the circumstances, the parties are at liberty to make application to deal with the funds in court [7] . 18. AAL sought leave from the judge to appeal against his decision. Notwithstanding the appeal would be against the exercise of his discretion, the judge granted leave as Mr Sussex, SC for AAL advanced arguments for the first time that the court has no jurisdiction to make the order sought, relying on the Eram case. AAL’s arguments on appeal 19. Mr Sussex argued in this appeal that the order of paying into court the debt subject to the garnishee order nisi was wrong as a matter of law and principle for these reasons: (1) The court has no jurisdiction to make the order sought as the debt is a foreign debt. (2) Even if the court did have jurisdiction, it should have exercised its discretion against making the order. (3) The order amounted to a mandatory Mareva injunction requiring AAL to bring assets from overseas to Hong Kong which cannot be justified in the circumstances. 20. As the judge was not properly assisted by the parties and did not have regard to the possibility of the lack of jurisdiction in making a garnishee order absolute when he exercised his discretion in ordering a payment into court, it is necessary for this court to consider the matter afresh. The issue of jurisdiction 21. In the Eram case, the House of Lords held that a garnishee or third party debt order [8] is a proprietary remedy which operates by way of attachment against the property of the judgment debtor, the property so attached being the chose in action which represented the garnishee’s debt to the judgment debtor; that it is an integral feature of the procedure, established by legislation and rules of court, that where an order absolute is made the garnishee, in making payment in compliance with the order, is discharged from his liability in respect of the debt to the extent of his payment; that it is not open to the court to make a garnishee order where it appeared that such discharge would not be available under the law which governed the debt. In the Eram case, the debt was situated in Hong Kong. The undisputed evidence was that under the law and procedure of Hong Kong, which reflects general international practice, a garnishee order made in England did not have the effect of extinguishing the garnishee’s Hong Kong debt to a judgment debtor in Hong Kong, nor would the Hong Kong court give effect to an English garnishee order by reciprocal enforcement or action. As the garnishee was at risk of having to pay the debt twice, once in compliance with an English garnishee order and again in Hong Kong at the suit of the judgment debtors, it was held that the judge was correct in dismissing the application that the third party debt order was to be made final. 22. Lord Bingham said it does not matter in practical terms whether the court rules that it has no jurisdiction to make an order in such a case or that the court has a discretion which should always be exercised against the making of an order in such a case, but he preferred the analysis of there being no jurisdiction [9] . Lord Millett avoided using the word “jurisdiction” as it is a word “used in a variety of senses and takes its colour from its context” [10] . In the case in question, he would use “jurisdiction” to connote the territorial reach of the legislative powers of Parliament and the adjudicative powers of the court, in which jurisdictional limits are self-imposed as a matter of principle and in order to conform to the norms of international law. But it must be appreciated that whether the court disclaims jurisdiction or declines to exercise it, it does so as a matter of principle and not of discretion. He would regard the issue in that case as not turning on the distinction between “jurisdiction” and “discretion”, but as turning on the distinction between the court’s duty to disclaim or decline jurisdiction as a matter of principle and its power to do so as a matter of discretion [11] . Lord Hoffmann decided there are strong reasons of principle for not making a garnishee order in respect of a debt payable in a foreign country and governed by foreign law. He agreed with Lord Millett that the application of such principles is not the same as the exercise of a discretion [12] . The other two Law Lords did not discuss this issue specifically and expressed agreement with the speeches of Lord Bingham and Lord Hoffmann [13] . 23. Mr Sussex submitted firstly that the order of payment into court is contradictory to the very nature of garnishee proceedings. He prayed in aid the statements of Lord Denning MR in Choice Investments Ltd v Jeromnimon [1981] QB 149 at 155 that “[service of the order nisi ] prevents the [garnishee] from paying the money to [the judgment debtor] until the garnishee order is made absolute, or is discharged … The money [with the garnishee] is then said to be ‘attached’ … But the ‘attachment’ is not an order to pay. It only freezes the sum in the hands of [the garnishee] until the order is made absolute or is discharged. It is only when the order is made absolute that [the garnishee] is liable to pay.” [14] 24. I agree with Mr Shieh, SC for Astro that the order of payment into court simply preserved the situation pending the determination of the application for a garnishee order absolute without crossing any point of no return. The judge fully appreciated that the merits of the garnishee proceedings would be argued at some future date and until the garnishee order is made absolute, he would not order AAL to pay Astro. Mr Shieh also drew our attention to the words of Lord Watson in Rogers v Whiteley [1892] AC at 122 in which he described the effect of an order nisi as being “to make the garnishee custodier for the court of the whole funds attached” [15] . There is nothing in the order of payment into court that is contradictory to the very nature of garnishee proceedings. 25. Mr Sussex submitted that the judge was wrong to assume that the debt of AAL is attachable under Hong Kong law [16] . He argued that the clear or at least prima facie conclusion is that the debt is not situated in Hong Kong but is situated in Indonesia having regard to these matters: (1) Although AAL is listed in Hong Kong and registered under Part XI of Cap 32 , it has more than one place of residence as it was incorporated in the Cayman Islands and carried on business outside Hong Kong. (2) Having regard to the necessary course of business between AAL and First Media, it should be implied that repayment of the loan under the facility agreement was to be made in a place other than Hong Kong: (i) First Media is an Indonesian company, listed on the Indonesian Stock Exchange, with no connection in Hong Kong. (ii) The facility agreement was signed in Indonesia and its governing law is Indonesian law. (iii) All disputes, controversies and claims in relation to the facility agreement shall be submitted to the Indonesia National Board of Arbitration by three arbitrators appointed under its rules for arbitration. (iv) The seat of the arbitration shall be in Jakarta. (v) The loan was drawn twice and remitted directly to AAL in Singapore and its Indonesian affiliate, PT AsiaNet Multimedia, in Indonesia respectively, but never in Hong Kong. (vi) The loan was expressed in US dollar currency and the interest was based on London Interbank Offered Rate, rather than any rate in Hong Kong. 26. He argued that the above matters are of relevance in the situs of a debt having regard to Rossano v Manufacturers’ Life Insurance Co [1963] 2 QB 352 at 378, per McNair J. 27. Mr Sussex further submitted that on the expert evidence filed by AAL, Indonesian law denies recognition to a Hong Kong garnishee order. If First Media should bring proceedings on the debt in Indonesia, payment pursuant to the garnishee order in Hong Kong would not extinguish the debt to First Media and discharge the garnishee, contrary to Order 49 rule 8 of the Rules of the High Court . On the authority of the Eram case, the Hong Kong court would not have jurisdiction or would decline jurisdiction as a matter of principle to make absolute the garnishee order for this foreign debt, and this is not a question of discretion. So a fortiori , it is wrong for the court to order AAL to make payment into court pending the determination of the application for a garnishee order absolute. 28. In his oral submissions, Mr Sussex advanced further arguments for his contention that the order of payment into court is wrong in law and in principle. He reasoned that the order of payment into court is an in personam order against AAL, whereas a garnishee order, when made absolute, takes effect as an order in rem against the property of the judgment debtor, it is to enable the judgment creditor to take the property of the judgment debtor and the property of the garnishee is in no way involved [17] . He argued that it would be wrong to make an interim in personam order in a situation where the final order operates in rem . And as the subject matter jurisdiction would appear to be lacking here in that the debt is not properly recoverable in Hong Kong, it would be extreme and exorbitant to make an order in personam to fortify the garnishee order nisi . 29. Further, in ordering AAL to pay money into court, if the money were to be regarded as the judgment debtor’s money, this would lead to a bypass of the garnishee procedure in that a charging order or a writ of fi fa could be imposed on the funds. If the money paid into court were AAL’s money, he submitted there is no justification requiring AAL to pay its funds into court. 30. It is pertinent to bear in mind that the judge was not hearing an application whether the garnishee order should be made absolute, nor is it possible to rule at this stage whether that application should be granted or refused. It is Astro’s position that the situs of the debt is situated in Hong Kong. Mr Shieh’s arguments on this ran as follows: (1) The situs of a chose in action is generally where it is properly recoverable and can be enforced. In the case of a debt, this is generally where the debtor resides. And a corporation resides where it carries on business (Dicey, Morris & Collins on The Conflict of Laws , 14 th ed, Vol 2, paras 22R-023, 22-026, 22-027). (2) It is strongly arguable that AAL only has one place of residence and that place is Hong Kong. (3) AAL is a company listed in the Growth Enterprise Market board in Hong Kong. According to its 2010 annual report, it has a head office and principal place of business in Lippo Centre, Queensway, Hong Kong, and it also has a principal banker in Hong Kong. (4) That Hong Kong address was stated as the address of AAL on the facility agreement. The facility agreement was part of the business of AAL conducted in Hong Kong. (5) AAL has not produced any evidence as to where else it had a place of residence. (6) The fact that the facility agreement provided for arbitration in Indonesia does not alter the above analysis. Arbitration is only a dispute resolution mechanism and the seat of arbitration can have no bearing on where a debt is properly payable by the debtor. 31. I do not think one can draw a clear or prima facie conclusion at this stage that the debt owed by AAL to First Media is a foreign debt. 32. As for the expert evidence on Indonesian law filed by AAL, the affirmations of AAL’s expert filed in opposition of the application for a garnishee order absolute were not placed before the judge, although AAL’s chief accountant had deposed in his affirmations before the judge the conclusion reached by the expert that Indonesian law would not recognise AAL’s compliance with a Hong Kong garnishee order absolute, without stating the basis for that opinion. Astro has filed its own expert evidence to contrary effect. I am given to understand by Mr Shieh that the evidence filed by the parties in the application for a garnishee order absolute has taken up 18 lever arch files and that the entirety of that substantial and highly contentious evidence was not before the judge. 33. It would not be right to have regard to the expert evidence of AAL in this appeal. No special grounds are made out under Order 59 rule 10(2) for this court to receive further evidence. Mr Sussex has not pressed for this. As with the dispute on the situs of the debt, the dispute on the question whether Indonesian law would regard payment under a Hong Kong garnishee order as amounting to a valid discharge cannot be determined by this court summarily. 34. Mr Shieh further submitted that if, contrary to Mr Sussex’s contention, the debt is situated in Hong Kong, it is for the garnishee to show there is a real or substantial risk that a foreign court will, contrary to accepted principles of international law, compel the garnishee by the legal process of the foreign court to pay the attached debt twice over. If such real risk is established by the garnishee, the court in the exercise of its discretion could decline to make a garnishee order absolute, as it would be inequitable to expose the garnishee to that risk ( Deutsche Schachtbau, supra , at 353F to 354C; Swiss Bank Corporation v Boehmische Industrial Bank [1923] 1 KB 673 ). 35. In contrast, in the case of a foreign debt, it was held in the Eram case that a garnishee order absolute should not be made unless it could be shown that the foreign court would regard the debt as automatically discharged by the garnishee order of the English court and since this would be most unusual, the burden is on the judgment creditor to establish this [18] . 36. Mr Sussex does not dispute the above propositions. 37. On the existing evidence, there is a serious dispute on the situs of the debt. Who would bear the burden of establishing the relevant position under Indonesian law would depend on how the issue on situs is resolved. There is conflicting evidence of the legal experts on Indonesian law. There are also factual disputes on other matters, such as whether the loan of First Media to AAL in June 2011 was designed to delay and frustrate Astro’s enforcement of the awards, and whether there is any risk that First Media would attempt to compel AAL (which holds 55.1% of the shares in First Media) to pay twice over if the garnishee order should be made absolute. On this state of the evidence, it cannot be said at this stage that the Hong Kong court would not have jurisdiction or would have declined jurisdiction as a matter of principle to make a garnishee order absolute. 38. As for the dichotomy of orders in personam and in rem drawn by Mr Sussex, I do not think it is apposite to draw a sharp distinction between the two. As pointed out by Mr Shieh, a garnishee order nisi already has an in personam element. The words of Lord Watson in Rogers v Whiteley , supra at 122 neatly described the position: “The effect of an order attaching ‘all debts’ owing or accruing due by him to the judgment debtor is to make the garnishee custodier for the Court of the whole funds attached; and he cannot, except at his own peril, part with any of those funds without the sanction of the Court.” 39. By the order of payment into court, the judge is simply ordering the garnishee, as the custodier of the funds attached, to pay the funds being the subject of a dispute into court pending the resolution of the dispute. In so doing, the judge has not made any determination whether the funds are regarded as belonging to the judgment debtor or the garnishee. And I cannot see how an order like this would lead to bypassing of the garnishee procedure as Mr Sussex has submitted, as it does not appear to me that a charging order or writ of fi fa could be imposed on these funds in court which are subject to dispute. 40. For the above reasons, the objection on the basis of lack of jurisdiction is not made out. The issue of discretion 41. Mr Sussex relied on arguments similar to the above to contend that even if the absence of jurisdiction is not made out, the judge should still refuse to make the order in the exercise of his discretion, repeating his submission that the order is extreme and unwarranted. And even if the debt owed by AAL were not a foreign debt, the double jeopardy argument – that the garnishee may be exposed to the risk of having to pay the debt twice over – can still arise. It is just that in this situation the onus will be on the garnishee to establish a substantial or real risk that the foreign court would compel the garnishee to pay the debt twice over. He also pointed out there has been no reported case for this kind of order of payment into court in the garnishee procedure, and this is something the court should bear in mind whether it is appropriate to make such an unprecedented and unprincipled order. 42. I do not agree with Mr Sussex that the impugned order would have the effect of circumventing, prejudicing or pre-judging the Singapore Setting Aside Application, the Hong Kong Setting Aside Application or the garnishee order absolute application. The effect of the order of payment into court is merely to require the garnishee to bring into court a sum which is indisputably due, where the court is satisfied that the judgment creditor has legitimate concerns as to the ability of the garnishee to pay if and when the garnishee order is made absolute, pending the determination of the three applications aforesaid. 43. It is unnecessary to repeat the matters that the judge had taken into account in exercising his discretion, which I have mentioned in the earlier part of this judgment. Mr Shieh characterised the order as a case management decision, so that the appeal court should not interfere with the decision unless in wholly exceptional circumstances. I doubt whether this is a case management decision dealing with a procedural aspect relevant to the conduct of proceedings before the court. Even if this is not a case management decision, the order was made by the judge in the exercise of his discretion. According to established principles, the appeal court will not interfere unless it can be shown that the discretion was made under an error of law or in disregard of principle, or that the judge had failed to exercise his discretion, or that the conclusion reached in the exercise of discretion was outside the generous ambit within which a reasonable disagreement is possible. I do not think the matters raised by Mr Sussex have met the threshold for intervention on appeal. 44. I am mindful of the fact that there is no reported case in which such an order of payment into court has been made in the garnishee procedure. In the great majority of cases, the judgment creditor should have adequate protection in the garnishee order nisi , on the making of which “that chose in action is (as it has been variously put) bound, frozen, attached or charged in the hands of the third party or garnishee” [19] , without the need for any additional fortification pending the determination of the application for an order absolute. The circumstances of the present case are exceptional, having regard to the relevant background matters set out in the earlier part of this judgment, the history of the proceedings taken out by Astro in Singapore and Hong Kong to enforce the awards, the delay of First Media in taking action in Singapore and Hong Kong to resist the enforcement, the apparent connection between First Media and AAL, the very substantial credit facility extended to AAL by First Media not long after First Media applied to set aside the Singapore Judgment, the allegation of Astro that the facility agreement was an attempt to thwart the enforcement of the awards, and the legitimate concern of Astro of AAL’s ability to pay the debt in the event the garnishee order is made absolute. 45. So this judgment should not be understood as an encouragement to parties in future to seek an order of payment into court pending the determination of an application for a garnishee order absolute. It is only in an exceptional case that the court would exercise its discretion to make this kind of order. The order is not to be lightly or routinely made. 46. I see no basis to interfere with the proper exercise of discretion by the judge on the established principles. The analogy with a mandatory Mareva injunction 47. The submission here is that the impugned order is in effect a mandatory Mareva injunction requiring AAL, an innocent party, to bring assets within the jurisdiction pending the determination of the Singapore Setting Aside Application, the Hong Kong Setting Aside Application and the garnishee order absolute application. Although the court may exercise its jurisdiction in personam against any party properly joined as a party before the court, Mr Sussex submitted that the court should give this kind of drastic relief only in exceptional circumstances. 48. I do not think the analogy with a mandatory Mareva injunction is apposite. The cases cited by Mr Sussex concern Mareva injunctions against defendants whose liability to pay is yet to be determined, see for instance Derby & Co Ltd v Weldon (No. 6) [1990] 1 WLR 1139 at 1153G. In the present case, AAL’s liability to pay the debt is not in dispute. The only question is whether the debt should be paid to First Media or Astro. I would agree with Mr Shieh as a matter of principle, there is nothing unusual for a party to have to pay a sum into court where the sum is indisputably due, pending a resolution as to whom is entitled to payment. Besides, I am of the view that the circumstances of this case are exceptional. Conclusion and costs 49. For the above reasons, I would dismiss the appeal of AAL. Costs of this appeal and of the application for leave to appeal and stay of execution pending appeal should follow the event. AAL should pay these costs of Astro. I would grant a certificate for two counsel in the appeal. 50. The judge had laid down a timetable for AAL to make payment into court pending the final determination of the Singapore Setting Aside Application in his order dated 21 March 2012 as amended on 19 April 2012. Due to this appeal, that timetable would appear to have been overtaken by events. If the parties are unable to agree on a new timetable for the payment into court of the principal and interest, the matter would be referred to the judge for determination. Hon Fok JA: 51. For the reasons given by Kwan JA, I too would dismiss this appeal with costs but not without emphasising, as Kwan JA has (at §§44 and 45 above), the exceptional circumstances in which the Judge came to exercise his discretion in this matter and the caveat that this judgment is not an indication that an order of the nature of that under appeal will be made as a matter of course in garnishee proceedings. (Susan Kwan) Justice of Appeal (Joseph Fok) Justice of Appeal Mr Paul Shieh, SC and Mr Bernard Man, instructed by Clifford Chance for the claimants in the arbitration/judgment creditors (respondents) Mr Charles Sussex, SC and Ms Frances Lok, instructed by Reed Smith Richards Butler, for the garnishee (appellant) Ms Queenie Lau, instructed by Sidley Austin, for the 2nd respondent in the arbitration/judgment debtor [1] Para 28 of the Decision on 21 March 2012 [2] Para 6 of the Reasons for Decision on 20 April 2012, given on AAL’s application for leave to appeal against the Decision on 21 March 2012 [3] Para 29 of the Decision on 21 March 2012; paras 18 and 19 of the Reasons for Decision on 20 April 2012 [4] Paras 20, 26 (per Lord Bingham of Cornhill); para 31 (per Lord Nicholls of Birkenhead); paras 48 to 50 and 59 (per Lord Hoffmann); para 75 (per Lord Hobhouse of Woodborough); paras 101, 104 (per Lord Millett) [5] Para 8 of the Reasons for Decision on 20 April 2012 [6] Para 29 of the Decision on 21 March 2012 [7] Paras 30 to 32 of the Decision on 21 March 2012 [8] Part 72 of the Civil Procedure Rules entitled “Third Party Debt Orders” replaced Order 49 of the Rules of the Supreme Court in 2002, although the terminology was changed, the nature of the procedure was not. There is no material difference between Order 49 of the Rules of the High Court in Hong Kong and the English rules of court. [9] Paras 26 and 30 [10] Para 77, citing Anisminic Ltd v Foreign Compensation Commission [1968] 2 QB 862 at 889 [11] Paras78, 80 and 81 [12] Para 50 [13] Paras 31 and 70 [14] Cited with approval by Lord Bingham at para 14 in the Eram case [15] Also cited with approval by Lord Bingham at para 14 [16] Para 29 of the Decision on 21 March 2012 [17] Para 28 in the Eram case, per Lord Bingham [18] Para 111 in the Eram case, per Lord Millett; see also para 26, per Lord Bingham [19] Para 24 in the Eram case, per Lord Bingham Look up this case on Lawcite Noteup",
  "length": 37016,
  "headers_seen": [
    "The background",
    "The judgment below",
    "AAL’s arguments on appeal",
    "The issue of jurisdiction",
    "The issue of discretion",
    "The analogy with a mandatory Mareva injunction",
    "Conclusion and costs"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkca/2012/351",
  "query": "seat of arbitration",
  "ts": "2025-10-16T10:50:00",
  "ok": true
}