{
  "title": "厦門新景地集團有限公司 FORMERLY KNOWN AS 厦門市鑫新景地房地產有限公司 V. ETON PROPERTIES LTD AND ANOTHER | [2008] HKCFI 540 | HKLII",
  "court": null,
  "year": 2008,
  "date": "2025-10-01",
  "content": "HKLII Databases Court of First Instance [2008] HKCFI 540 厦門新景地集團有限公司 FORMERLY KNOWN AS 厦門市鑫新景地房地產有限公司 V. ETON PROPERTIES LTD AND ANOTHER Judgment Information Date 23 Jun, 2008 Action No. HCCT54/2007 Neutral Cit. [2008] HKCFI 540 Parallel Cit. [2008] 4 HKLRD 972 [2008] 6 HKC 287 Download MS Word Judgment Corrigendum Reading Options Translation Toggle Highlight Appeal History HCCT54/2007 HCCT 54/2007 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO. 54 OF 2007 _____________ IN THE MATTER of Section 2GG and 40B of the Arbitration Ordinance (Cap. 341) and IN THE MATTER of the Arbitration Award dated 27 October 2006 awarded by China International Economic and Trade Arbitration Commission _____________ BETWEEN 厦門新景地集團有限公司 formerly known as 厦門市鑫新景地房地產有限公司 Applicant and Eton Properties Limited (裕景興業有限公司) 1 st Respondent Eton Properties (Holdings) Limited (裕景興業(集團)有限公司) 2 nd Respondent _____________ Before: Hon Reyes J in Chambers (Not open to public) Date of Hearing: 19 June 2008 Date of Judgment: 24 June 2008 _______________ CORRIGENDA _______________ Kindly note the following correction in the Judgment of the above case handed down by the Honourable Mr. Justice Reyes on 24 th June, 2008:- Page 22, paragraph 90, line N, the word “principle” should read as“principles that”. Page 27, paragraph 103 , line between B & C, the word “Land” should read as “Legend”. Page 31, paragraph 115, line E, the word “ha” should read as “has”. Page 31, paragraph 115, line G, the word “ha” should read as “has”. Page 31, paragraph 115, line I, the quotation paragraph number “35.” should read as “36.”. Page 31, paragraph 115, line between I & J, the word “th” should read as “the”. Dated this 15 th August, 2008. (S.C. Cheung)(Miss) Clerk to Hon Reyes, J HCCT54/2007 厦門新景地集團有限公司 formerly known as 厦門市鑫新景地房地產有限公司 v. ETON PROPERTIES LTD AND ANOTHER HCCT 54/2007 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO. 54 OF 2007 ------------------------------------- IN THE MATTER of Section 2GG and 40B of the Arbitration Ordinance ( Cap. 341 ) and IN THE MATTER of the Arbitration Award dated 27 October 2006 awarded by China International Economic and Trade Arbitration Commission ------------------------------------- BETWEEN 厦門新景地集團有限公司 formerly known as 厦門市鑫新景地房地產有限公司 Applicant and Eton Properties Limited (裕景興業有限公司) 1 st Respondent Eton Properties (Holdings) Limited (裕景興業(集團)有限公司) 2 nd Respondent ------------------------------------ Before: Hon Reyes J in Chambers (Not open to public) Date of Hearing: 19 June 2008 Date of Judgment: 24 June 2008 ---------------------- J U D G M E N T ---------------------- I. INTRODUCTION 1. The Applicant seeks to enforce a Mainland Arbitration Award against the Respondents (EPL and EPHL) as a judgment of this Court. The Applicant obtained an ex parte Order from Andrew Cheung J to that effect on 31 October 2007. 2. The Respondents have applied to set aside that Order. The Respondents say that, insofar as the Award required money sums to be paid, those have already been paid to the Applicant. But, insofar as the Award went beyond that and ordered the Respondents to perform non-monetary obligations to the Applicant under an Agreement dated 4 July 2003, the Respondents say that those obligations can no longer be performed. 3. Arbitration Ordinance ( Cap.341 ) (AO) s.40E(3) provides that the Court may refuse enforcement of a Mainland Arbitration Award:- “in respect of a matter which is not capable of settlement by arbitration under the law of Hong Kong, or if it would be contrary to public policy to enforce the award”. 4. It is the Respondents’ case (Major Issue I) that impossibility of performance now renders it contrary to public policy to enforce the outstanding part of the Arbitration Award. 5. By way of further argument (Major Issue II), the Respondents say that it is “fundamentally offensive to the Court’s notion of justice” to order performance of the outstanding parts of the Award where the Applicant is not ready, willing or able to perform the balance of its obligations under the July 2003 Agreement. 6. There are other issues before the Court. 7. Minor Issue I is the Respondents’ contention that, when obtaining the ex parte Order, the Applicant failed to make full and frank disclosure. The Respondents say that at the ex parte stage the Applicant should have (but did not) tell the Court that the Respondents had not made use of an initial deposit (RMB 5 million) paid by the Applicant under the July 2003 Agreement. The Respondents simply lodged the sum with the Xiamen Municipal Notary Public Office (the Notary) to hold to the Applicant’s order. 8. Minor Issue II is the Respondents’ suggestion that the outstanding part of the Award should not be enforced since that part relates to the delivery of land outside Hong Kong. By reason of AO s.17, such matter (the Respondents say) is “not capable of settlement by arbitration under the law of Hong Kong”. It should accordingly not be enforced by reason of AO s.40E(3). 9. Minor Issue III is the Respondents’ contention that AO s.40C precludes enforcement since the Applicant has applied in Xiamen for enforcement of the Award. II. BACKGROUND 10. The Applicant is a PRC company. The Respondents are Hong Kong companies. EPHL owns 99.99% of EPL. 11. Legend Properties (Hong Kong) Company Ltd. (Hong Kong Legend) is a Hong Kong company. Until November 2005, the Respondents were the sole shareholders of Hong Kong Legend, each holding 1 share of the latter. 12. Legend Properties (Xiamen) Company Ltd. (Xiamen Legend) is a Mainland company which is wholly owned by Hong Kong Legend. Xiamen Legend is the registered owner of land (the Property) in Xiamen. 13. By the July 2003 Agreement the Applicant agreed to pay the Respondents the sum of RMB 120 million:- 13.1 to obtain the right to develop the Property in the name of Xiamen Legend; and, 13.2 to acquire the right to receive the profits from the Property. 14. The Respondents in return agreed upon receipt of the RMB 120 million to transfer their shareholding in Hong Kong Legend to the Applicant for the nominal amount of $2. For this purpose, the Respondents represented and warranted that they had “absolute control over Hong Kong Legend and Xiamen Legend” and could “cause the relevant parts in this agreement to have binding effect on Hong Kong Legend and Xiamen Legend”. 15. The Respondents further agreed to deliver the Property to the Applicant within 6 months from the execution of the Agreement. 16. The Agreement provided that disputes among the parties would be arbitrated through CIETAC in Beijing. The Agreement was expressly stated to be governed by Mainland law. But, exceptionally, questions of procedure or validity in relation to the transfer of Hong Kong Legend shares were to be governed by Hong Kong law. 17. Upon execution of the Agreement, the Applicant paid the initial deposit of RMB 5 million stipulated in the contract. 18. However, the Respondents never delivered the Property to the Applicant. Instead on 14 November 2003 they notified the Applicant that they would not go through with the Agreement because (it was alleged) performance would be contrary to Mainland law. The Respondents returned the initial deposit to the Applicant. 19. The Applicant did not accept the Respondent’s termination notice. The Applicant therefore remitted the returned deposit back to Xiamen Legend’s bank account. From that account, the Respondents caused the deposit to be paid to the Notary where it remains. 20. In August 2005 the Applicant commenced arbitration proceedings in Beijing. It sought specific performance of the Agreement. 21. The Respondents argued in opposition that (among other things) the Agreement was essentially a disguised transfer of land contrary to Mainland law and in any event performance of the Agreement had become impossible as a result of the commencement of construction work on the Property. 22. On 27 October 2006 the Arbitrators published their Award in favour of the Applicant. The Arbitration Award ordered that:- 22.1 the Respondents pay RMB 1,275,000 (representing interest of 0.05% per day on the initial deposit from the time when the Property ought to have been delivered up to 1 June 2005); 22.2 the Respondents “shall continue to perform the Agreement”; 22.3 the Respondents reimburse the Applicant for the Arbitrators’ fees of RMB 101,875. 23. The Award dismissed the Applicant’s other claims and the Respondents counterclaim. 24. At some point after the Arbitration proceedings had commenced, the Respondents’ Group executed a corporate restructuring. 25. On 16 November 2005 Hong Kong Legend issued 9,998 new shares to Eton Properties Group Ltd. (EPGL) (the ultimate holding company of the Respondents’ Group). 26. On 6 April 2006 EPL transferred its 1 share in Hong Kong Legend to EPGL. At the same time EPHL executed a declaration of trust to the effect that it held its 1 share in Hong Kong Legend on trust for EPGL. 27. Over the course of the Arbitration proceedings, the Respondents did not mention anything to the Applicant or the Arbitrators about their Group restructuring. 28. On 30 March 2007 the Applicant sought to enforce the Award before the Intermediate People’s Court of Xiamen. 29. On 16 April 2007 the Respondents applied to the Second Intermediate People’s Court in Beijing to set aside the Award. They also filed an application to enforce the Applicant’s proceedings in Xiamen. 30. On 19 June 2007 the Respondents withdrew their setting-aside application in Beijing. 31. On 30 July 2007 the Court in Xiamen dismissed the Applicant’s proceedings on the basis that the Respondents and their assets were not within Xiamen. Thus, as far as execution against the Respondents was concerned, the proceedings were outside the Xiamen Court’s jurisdiction. III. DISCUSSION A. Some preliminary observations 32. I will make a few preliminary observations about the nature of the present proceedings, focusing in particular on the Court’s role. 33. These proceedings concern the enforcement of a Mainland Arbitration Award. I shall focus my attention on the provisions in the AO which specifically apply to such awards. But I appreciate that my remarks should be generally applicable (possibly with some minor modification) to the enforcement of most arbitration awards. 34. AO s.40B(1) provides that a Mainland Award “shall, subject to this Part, be enforceable in Hong Kong either by action in the Court or in the same manner as the award of an arbitrator is enforceable by virtue of section 2GG”. 35. AO s.2GG provides as follows:- “(1) An award, order or direction made or given in or in relation to arbitration proceedings by an arbitral tribunal is enforceable in the same way as a judgment, order or direction of the Court that has the same effect, but only with the leave of the Court or a judge of the Court. If that leave is given, the Court or judge may enter judgment in terms of the award, order or direction. (2) Notwithstanding anything in this Ordinance, this section applies to an award, order and direction made or given whether in or outside Hong Kong.” 36. Mr. Benjamin Yu SC (appearing for the Respondents) draws a distinction between what he describes as the “summary process of enforcement” allowed by AO ss.40B(1) and 2GG and the enforcement of an award by action under s.40B(1). 37. Where the summary process is involved, Mr. Yu (referring to AO s.2AA(2)(b)) says that the Court may only enter judgment in terms of the award. AO s.2AA provides:- “(1) The object of this Ordinance is to facilitate the fair and speedy resolution of disputes by arbitration without unnecessary expense. (2) This Ordinance is based on the principles that:- (a) subject to the observance of such safeguards as are necessary in the public interest, the parties to a dispute should be free to agree how the dispute should be resolved; and, (b) the Court should interfere in the arbitration of a dispute only as expressly provided in the Ordinance.” 38. The summary process is starkly described by Mr. Yu as being in consequence “all or nothing”. I can (Mr. Yu contends) summarily order that all of an award be enforceable as a judgment of this Court. But (Mr. Yu stresses) I cannot order that only some of the award be so enforceable. 39. Mr. Yu supports this characterisation of the Court’s jurisdiction in relation to the “summary enforcement” of an award with a variety of citations. 40. Mr. Yu first draws my attention to Walker v. Rome [1999] 2 All ER (Comm) 961. There Aikens J held that the Court had no jurisdiction under the Supreme Court Act 1981 to order post-award interest on a sum determined by an arbitral tribunal. This would apparently be the case even where the award had been converted into a judgment of the Court. Thus, if a party failed to ask the arbitral tribunal for post-award interest or the tribunal had omitted to award the same, the Court could not interfere by awarding interest once the award had been made enforceable as a judgment of the Court. 41. Mr. Yu further cites Norsk Hydro ASA v. State Property Fund of Ukraine [2002] EWHC 2120 (Comm). There the arbitral tribunal had made an award against “The Republic of Ukraine, through the State Property Fund of Ukraine”, a single respondent. Morison J ordered ex parte that the award be made an order of the Court. But Morison J’s order purported to enforce the award against The Republic of Ukraine and The State Property Fund of Ukraine, 2 separate respondents. 42. Gross J, in accepting that Morison J’s order could not stand, said this:- “17. Section 100 and following of the Arbitration Act 1996 (‘the 1996 Act’) provide for the recognition and enforcement of the New York Convention Awards. There is an important policy interest, reflected in the country’s treaty obligations, in ensuring the effective and speedy enforcement of such international arbitration awards; the corollary, however, is that the task of the enforcing court should be as ‘mechanistic’ as possible. Save in connection with the threshold requirements for enforcement and the exhaustive grounds on which enforcement of a New York Convention award may be refused (ss. 102-103 of the 1996 Act), the enforcing court is neither entitled nor bound to go behind the award in question, explore the reasoning of the arbitration tribunal or second-guess its intentions. Additionally, the enforcing court seeks to ensure that an award is carried out by making available its own domestic law sanctions. It is against this background that Issue (I) falls to be considered. 18. Viewed in this light, as a matter of principle and instinct, an order providing for enforcement of an award must follow the award. No doubt, true ‘slips’ and changes of name can be accommodated; suffice to say, that is not this case. Here it is sought to enforce an award made against a single party, against two separate and distinct parties. To proceed in such a fashion, necessarily requires the enforcing court to stray into the arena of the substantive reasoning and intentions of the arbitration tribunal. Further, enforcement backed by sanctions, is sought in terms other than those of the award. Still further, though I do not rest my decision on it, such an approach raises the spectre of unintended consequences should a false step be taken -- for example, English domestic law rules as to election and the enforcement of judgments against principal and agents would need to be considered... In my judgment, this is all inappropriate territory for the enforcing court. The right approach is to seek enforcement of an award in the terms of that award.” 43. Finally, Mr. Yu refers me to a dictum of Beatson J in Gater Assets Ltd. v. Nak Naftogaz Ukrainiy [2008] EWHC 1108 (Comm). There Beatson J refused to follow Aikens J in Walker at least as far as New York Convention awards were concerned. With Convention awards, Beatson J thought that the Court could order interest to be made once the award had been made a judgment of the Court. 44. Beatson J’s dictum states:- “20. Mr. Higham’s submissions rely on three assumptions. The first is that the need in sections 66(2) and 101(3) for the judgment to be entered ‘in terms of the award’ means that, where the arbitrators did not award interest, to do so would amount to an alteration by the court of the arbitrator’s award. The second is that the change as to the interest position in domestic arbitrations effected by section 49 of the 1996 Act affected New York Convention awards. The third is that the fact that judgment is entered n the terms of the award does not change the position. .... 23. With regard to the third assumption, an award may either be enforced ‘in the same manner as a judgment’ (see sections 66(1) and 101(2) of the 1996 Act) or ‘judgment may be entered in terms of the award’ (sections 66(2) and 101(3)). The leave of the court to enforce ‘in the same manner as a judgment’ is a prerequisite of the power to enter judgment in the terms of the award, but the two are separate. The essential difference is that the obligation to honour an award arises by virtue of the agreement of the parties, whereas in the case of a judgment it follows from the power of the court. This difference is reflected in the approach of Aikens J in two cases. He proceeded on the basis that the entering of a judgment changes the position. Walker v. Rowe ... at [13] - [14], relied on by Mr. Higham, in fact concerned the post award but pre-judgment phase and it appears (see [14]) that Aikens J considered that the position would be different once judgment was entered. In Pirtek v. Deanswood [2005] 2 Lloyds R 728 his Lordship stated (at [47]) that the difficulty that arose in that case, where the award had not included interest and the arbitrator sought to do so by a retrospective order, ‘could have been avoided by a much earlier application to make the award a judgment. Judgment Act interest would then have run on the sum awarded.’” 45. In my view, Mr. Yu’s “all or nothing” position is too extreme. I do not think that it is supported by the dicta cited by him. In this respect, I would make 4 observations. A.1 Observation I: Mechanistic principle 46. First, no one would deny that a Court must guard against deciding disputes which the parties have agreed ought to be determined by an arbitrator. The Court’s role is essentially that of an overseer. This “overseeing” essentially consists in ensuring that an arbitration is conducted fairly and in lending the means at the Court’s disposal (for example, interlocutory injunctions, orders for security for costs, orders for the enforcement of an award as a Court judgment) to make an award effective. 47. To that extent, I would wholly accept Gross J’s observation that the Court should not second guess an arbitration award. Its role should be, although by no means entirely “mechanistic,” as “mechanistic as possible”. 48. By way of footnote, I stress that in endorsing what might be called the “mechanistic principle,” I should not be taken to be accepting the correctness of the particular results in either Walker or Gater . It will be noticed that, on the specific question of post-judgment interest, the latter 2 cases are somewhat at odds with each other. The extent to which a Hong Kong Court will follow one or either or (possibly) neither on the question of interest is something which must be left to the future. A.2 Observation II: Real nature of impossibility objection 49. Second, in reality, it is the Respondents who are inviting me to approach the matter otherwise than “mechanistically”. On the face of the award, there is (as Ms. Teresa Cheng SC points out) nothing objectionable. Hong Kong Courts routinely order that a party “shall continue to perform an agreement”. 50. It is the Respondents who are asking me to consider the circumstances of this case in detail; to divine (“second guess”) what the arbitrators meant or did not mean by their Award; and to hold that for whatever reason that Award is now impossible so that enforcement by this Court would be repugnant to public policy. 51. The Respondents are essentially seeking to go behind the Award and re-argue matters which were either argued before the arbitrators or (if not) ought to have been argued before them. The Court must be vigilant against such attempts to go behind an award, in the guise of dealing with questions of public policy. 52. I would go further. Take the argument of impossibility with which this case is concerned. Unless an award is plainly incapable of performance such that it would be obviously oppressive to order a party to comply with it, the Court cannot consistently with the “mechanistic principle” hold that the award is contrary to public policy and refuse to convert the award into a judgment of the Court. 53. This is because otherwise the Court would have to go behind the award. The Respondents would in effect be allowed to re-open that which the arbitrators had decided. The Court would be doing that which it ought not to do, namely, encroach upon the jurisdiction of an arbitration tribunal. 54. Consider more closely the question of a public policy objection to enforcement of a foreign award. In Hebei Import & Export Corp. v. Polytek Engineering Co. ltd. [1999] 1 HKLRD 665 (CFA), Bokhary PJ emphasised (at 674I) that:- “there must be compelling reasons before enforcement of a convention award can be refused on public policy grounds. That is not to say that the reasons must be so extreme that the award falls to be cursed by bell, book and candle. But the reasons must go beyond the minimum which would justify setting aside a domestic judgment or award.” 55. Although the dictum specifically refers to awards to which the New York Convention applies, similar considerations must apply to any foreign arbitration award. 56. The rationale for the Court’s stringent approach is that, as a matter of comity, the Courts must lean in favour of recognising foreign arbitral awards. The parties having agreed to submit to arbitration and having actually gone through an arbitration process, it would be wrong and unjust in principle if a successful party were denied the Court’s assistance in enforcing an award otherwise than for “compelling reason”. 57. As Litton PJ observed in Hebei Import (at 670G), it is itself a matter of public policy that:- “the courts should recognise the validity of decisions of foreign arbitral tribunals ..., and give effect to them, unless to do so would violate the most basic notions of morality and justice. It would take a very strong case before such a conclusion can be properly reached, when the facts giving rise to the allegation have been made the subject of challenge in proceedings in the supervisory jurisdiction and such challenge has failed.” 58. The Court, therefore, has to scrutinise each particular case to see the extent to which (if at all) domestic public policy truly militates against (and is outraged by) the enforcement of a foreign arbitral award. 59. The life of the law and lawyers is argument. Where the best that can be said is that an award is “arguably” (as opposed to plainly) impossible, I do not think that “compelling reason” to which Bokhary PJ refers can have been made out. A.3 Observation III: Role of Court of seat of arbitration 60. Third, this does not mean the Respondents are without remedy where they genuinely feel that the Award is now rendered impossible or somehow invalid. 61. I referred the parties to the recent decisions of the English Court in A v. B [2007] 1 Lloyds Rep 237 (Colman J) and C v. D [2008] 1 Lloyds Rep 239 (CA). Those cases are authority for the following principle (see Colman J at §111 and the CA at §17):- “[A]n agreement as to the seat of an arbitration is analogous to an exclusive jurisdiction clause. Any claim for a remedy going to the existence or scope of the arbitrator’s jurisdiction or as to the validity of an existing interim or final award is agreed to be made only in the courts of the place designated as to the seat of the arbitration.” 62. The consequence of such principle is that, if the Respondents genuinely believed that there was something impossible or somehow invalid about the award, it is incumbent upon them to challenge the award in the court of the seat of arbitration. In this case, it is the Beijing Court (not the Hong Kong Court) which by the parties’ agreement impliedly has exclusive jurisdiction and in the ordinary course of events the parties should be held to such an agreement. 63. Save in the plain and obvious case where an award is so incapable of performance so that to make it an order of the Court would offend against a sense of justice, I do not see why this Court (which by the parties’ own agreement does not have jurisdiction over the substance of the dispute) should concern itself about whether it is arguable or not arguable that a contract is wholly or partly incapable of performance. That would seem to me to usurp not just the arbitrators’ jurisdiction, but also the exclusive jurisdiction of the court of the arbitration seat. If something is arguably impossible about the Award here, it is to the Beijing Court as supervisory court (or perhaps a CIETAC Beijing arbitration tribunal) that the argument should properly be advanced. 64. When I expressed the foregoing worry to Mr. Yu in the course of oral submissions, Mr. Yu referred to a dictum of Mason NPJ in Hebei Import . That states (at 136J-137C):- “It follows also that a failure to raise the public policy ground in proceedings to set aside an award cannot operate to preclude a party from resisting on that ground the enforcement of the award in the enforcing court in another jurisdiction. That is because each jurisdiction has its own public policy. What I have said does not exclude the possibility that a party may be precluded by his failure to raise a point before the court of supervisory jurisdiction from raising that point before the court of enforcement. Failure to raise such a point may amount to an estoppel or a want of bona fides such as to ... justify the court of enforcement in enforcing an award (see Chrome Resources SA v. Léopold Lazarus (Yearbook Commercial Arbitration XI (1986) 538). Obviously an injustice may arise if an award remains on foot but cannot be enforced on a ground which, if taken, would have resulted in the award being set aside.” 65. My worry (Mr. Yu submitted) was inconsistent with Mason NPJ’s view that it was unnecessary to raise a public policy ground in the arbitration home forum. A party may bide his time and riase the point for the first time in Hong Kong. This is because (Mr. Yu notes) what is involved are notions of Hong Kong domestic public policy. A foreign arbitration tribunal or a foreign court would not be able to pronounce meaningfully on Hong Kong domestic policy concerns. 66. Thus, Mr. Yu reasoned, assuming impossibility was simply “arguable” at this stage, I must nonetheless take a view whether performance of the Award is or is not impossible and then on the basis of that view decide whether it would be contrary to Hong Kong policy to enforce the Award. Assume (Mr. Yu posited) the Respondents went to Beijing with their impossibility argument and Beijing decided against them. That would still not preclude me (Mr. Yu submitted) from coming to a different view and as a matter of Hong Kong public policy from refusing to enforce the Award. 67. I do not accept Mr. Yu’s reasoning. 68. I see nothing inconsistent between Mason NPJ’s dictum and my previous comment about role of the Beijing Court. 69. It cannot be contrary to public policy for the court of enforcement to enforce an award where the alleged impossibility is not plain and obvious but only arguable (perhaps even strongly arguable). In such circumstances, it cannot be for the court of enforcement to second-guess how the arbitration tribunal or the court of supervision (here the Beijing Court) might assess the relevant facts and law in determining whether the alleged impossibility is substantive or fanciful. For me to second-guess, would mean abandoning the mechanistic principle, going behind the award and exceeding the jurisdiction of the court of enforcement. 70. Mr. Yu suggests in effect that, because I have to decide whether Hong Kong public policy is affronted by the ordering of the impossible, I can ignore the Beijing Court’s conclusion on impossibility of performance. I should (Mr. Yu says) come to my own view on the facts and circumstances said arguably to constitute impossibility. But that conclusion does not follow from the premises. 71. This is because the parties have agreed that a particular Court is to have the carriage of deciding substantive questions of fact or law arising out of the relevant contract. I should certainly defer to the parties’ express wishes. For reasons of comity, I am not entitled to pre-suppose that the foreign Court will get it wrong such that I can ignore its assessment of circumstances and substitute my own summary determination. As a matter of principle, I should not simply pay lip-service to the supervisory role or jurisdiction of the Court of the seat of arbitration. 72. Indeed, it seems from the second paragraph of Mason NPJ’s dictum cited above that he contemplated the court of enforcement enforcing an award even if there may be injustice in the sense that a point, if taken in the arbitration or before the court of supervision, might have led to the award being set aside. 73. By way of footnote to this observation, I note Mr. Yu’s suggestion that the Respondents attempted to set aside the Award by arguing against enforcement in Xiamen (as opposed to Beijing). In my view, the arbitration being expressly a CIETAC Beijing arbitration, the court of the seat of arbitration must have been the Beijing (not Xiamen) Court. In any event, the Respondents sought in Xiamen to resist enforcement of the Award against the Property. They were not seeking (and certainly did not) set aside the Award. A.4 Observation IV: “All or nothing”? 74. Fourth, I am unable with respect to understand the point of the distinction drawn by Beatson J between “enforcing an award in the same manner as a judgment” and “entering judgment on an award”. Both in effect need leave of the Court. 75. As far as Hong Kong is concerned, for example, an application under AO s.2GG requires leave. Where in contrast it is sought to enforce an award through proceedings by writ, the leave of the Court will be required in the sense that the Court must decide whether or not to give judgment. In such case, the Court will not necessarily function as a rubber stamp. 76. An application under s.2GG is heard summarily. An application to enforce an award through proceedings by writ may, of course, in the same manner as any other action involve a trial. But typically the person in whose favour the award has been made will seek summary judgment. This is because there will usually be no defence. The parties having agreed to abide by the award as a result of their agreement to go to arbitration, it is difficult to see what reason a losing party can have for refusing to perform an award adverse to him. Thus, in practice, I do not think that the mere fact that s.2GG applications are usually heard summarily and writs actions to enforce an award may on a rare occasion give rise to a trial can be any real distinction between the 2 types of proceeding. 77. I do not therefore read Beatson J as drawing such a distinction of summary and non-summary procedure as Mr. Yu suggests, because it does not seem to me a sensible distinction to make. 78. Nor do I fully understand what Beatson J means by distinguishing between the process of obtaining leave and entering judgment on an award. The processes are self-evidently distinct. But I am unsure how the distinction leads to any particular conclusion about the Court’s approach in a given situation. 79. Thus, I do not accept Mr. Yu’s distinction between the invocation of a summary process under AO s.2GG and the enforcement of an award by writ action. I do not understand why the Court’s general approach towards either means of enforcement should be radically different. To posit differences in general approach would be to allow technicality as to the form of an application to get in the way of the Court’s consideration. 80. More pertinently, I see nothing in the authorities cited by Mr. Yu that justifies an “all or nothing approach” where it is sought to convert an award into a judgment of the Court. The mechanistic principle does not logically have the consequence that I should not allow an award in any circumstances to be enforced in part. 81. Let me give a simple example. AO s. 40C(2) provides that, where a Mainland award has not been fully satisfied by way of enforcement in the Mainland, then “to the extent that the award has not been so satisfied, the award may be enforceable under this Part [of the AO]”. I read this to mean that I have a discretion whether to allow an award to be enforced in whole or in part. 82. Take another situation. Suppose an award requires a respondent to do X and Y. It seems to me that an applicant should be able to waive performance of X and ask this Court only to order that Y be enforced as a judgment. 83. As far as I see, nothing in the AO ties the Court’s hand as to enforcing only part of an award where appropriate. Nor do I think that partial enforcement necessarily requires the Court to look behind an award. Obviously, if (say) a respondent argues that an applicant’s award should only be partially enforced for some reason or other, the Court may have to decide whether or not the reason advanced requires the Court to look behind the award in a way that is not permissible. But that is far cry from saying that in every single case the Court can only order the whole or nothing of an award to be enforceable as a judgment of the Court. 84. The Court has a degree of flexibility in the deployment of the means of enforcement available to it. I do not see why this flexibility should be constrained by the form (for example, an application under AO s.2GG) by which enforcement is sought. 85. Let me now approach the issues in this case within the context of my preliminary observations. B. Main Issue I: Impossibility of further performance 86. Since around 2003 Xiamen Legend has developed the Property. Some 99% of the residential units built by Xiamen Legend on the Property have now been sold. 87. Accordingly, Mr. Yu says that it is no longer possible for the Respondents (or indeed Xiamen Legend) to deliver possession of the Property to the Applicant as stipulated in the Agreement. 88. Further, Mr. Yu notes the change in share ownership of Hong Kong Legend. There are no longer 2 Hong Kong Legend shares held by the Respondents. There are 10,000 shares of which EPHL holds 1 in trust for EPGL and EPGL holds the remainder. 89. In those premises, it would be wrong (Mr. Yu argues) for the Court to order specific performance of the impossible. It would be “fundamentally offensive” to common law notions of justice and contrary to public policy for the Court to direct a person to engage in such activity. That person would simply face being charged with contempt and imprisoned for failing to do that which cannot be done. 90. Mr. Yu stresses that it does not matter if the impossibility was induced by a person’s own breach. For this, he cites Spry on Equitable Remedies (7th ed.) (at pp.131-2):- “It has sometimes been suggested that a defendant will not be permitted to rely upon impossibility of performance, as providing a defence to proceedings for specific performance, wherever that impossibility has been brought upon by his own breach of contract or wrong. These suggestions are not, however, sound. For if an act cannot be performed the defendant will not be required to do what cannot be done, even though it is through his own acts or omissions that the obstacle in question has arisen. So it was said by Kindersley VC in a case where after entry into a contract the rights of the plaintiff had been restricted by the operation of an award, ‘Assuming the defendants to be entirely in the wrong, doing everything in contravention of the agreement, still, when the court is asked to restrain them from acting under the award, it is impossible for me to do so, since the defendants have not the power of doing that which it is said they ought to do. Put the extreme case of a vendor burning a title-deed: the court could not make a decree that he should deliver it up, and be imprisoned if he does not.’ In circumstances of this kind the plaintiff is commonly found to have acquired a remedy in damages, and, moreover, it may even be, on the principle have been discussed, that he is entitled to specific performance of the material contract save the obligation that cannot be performed. Further, in circumstances where a vendor is shown to be unable to convey the precise interest in land that he has agreed to convey, specific performance may nonetheless be ordered, subject to the payment of compensation.” 91. I am not persuaded by Mr. Yu’s argument. 92. First, where performance of a contract is obviously wholly impossible, the Court may perhaps not order specific performance, no matter who has brought about the impossibility. That is because there would likely be no point to such an order. 93. But equitable remedies are flexible and can be tailored to the exigencies of a given situation. As the passage from Spry just quoted recognises, where performance of some (but not all) obligations is possible, the Court can grant specific performance (possibly subject to compensation or abatement). 94. Such flexibility in the Court’s equitable jurisdiction is supported by Goodhart and Jones, Specific Performance (2nd ed.) (at pp.60-61):- “Finally, there are some cases which do not fit clearly into any of the recognised exceptions to the general principle that contracts will not be enforced in part. These cases may be taken as authority for the proposition that the general principle, if it exists, will not be applied where it would lead to injustice. For example, in Peacock v. Penson [(1848) 11 Beav 355] a vendor had undertaken in the contract for the sale of a plot of land to construct a new road (which was not of much benefit to the plot) over adjacent leasehold land retained by him, and it was then discovered that he could not do so without incurring a forfeiture for breach of a covenant in the lease. Lord Langdale MR refused to order the vendor to make the road but ordered specific performance of the rest of the contract with compensation for the non-construction of the road. In Soames v. Edge [(1860) John 669] the defendant had agreed to demolish a building, erect a new one in its place and take a lease of the new buildings. Upon his failure to rebuild, he was ordered to take a lease of the site and pay damages under Lord Cairns’ Act for non-construction of the building. Again in Elmore v. Pirrie [ (1887) 57 LT 333 ], it was held that the court had jurisdiction to order specific performance of an agreement to purchase patent rights for a lump sum even though the contract also included unenforceable agreements by the purchasers to form a company to work the patents and pay royalties to the vendors. ‘Why should not the plaintiffs have damages for that part of the agreement of which the court does not grant specific performance? The court has power to order specific performance of the whole of the agreement, or of part of it, with damages for the rest.’ [ (1887) 57 LT 333 at 336, per Kay J]. Finally, in Lytton v. Great Northern Rly Co [(1856) 2 K & J 394] the court ordered specific performance of a contract by the defendants to construct a siding on their land though specific performance of a term requiring them to maintain it was refused. It is suggested, therefore, that there is no longer any general rule that the courts will not enforce some of the defendant’s obligation by specific performance if it cannot enforce them all. The plaintiff seeking specific performance is clearly content to accept partial performance, and the defendant can hardly complain if he is required to perform only some of his contractual obligations. Naturally, the courts will not order specific performance of ancillary provisions if the principal provisions are incapable of being specifically performed, nor will they artificially sever what is in substance a single obligation into separate obligations so that part may be enforced.” 95. Given the passages cited, there is nothing contrary to public policy in the partial enforcement of an agreement. There is nothing repugnant in Equity decreeing specific performance of that part of a contract which is possible. I am not persuaded that the Agreement here is obviously substantially incapable of performance. Let me further articulate why. 96. The Arbitration Tribunal held that the Agreement was essentially the performance of certain specific obligations (such as the payment of RMB 120 million) in order to cause the transfer by the Respondents of their controlling shares in Hong Kong Legend to the Applicant. 97. Mr. Yu says that it is now impossible to transfer the Hong Kong Legend shares to the Applicant (even if it were ready, willing and able to pay the balance of the RMB 120 million consideration and nominal transfer fee of $2) because of the restructuring within the Respondents’ Group. EPL no longer holds any shares, while EPHL’s 1 share is held on trust for EPGL. 98. But I am far from satisfied of the correctness of such analysis. 99. It seems to me that there might be merit in Ms. Cheng’s suggestion of that the true analysis is as follows:- 99.1 Under the Agreement, insofar as the transfer of Hong Kong Legend shares is concerned, Hong Kong law governs. 99.2 The Agreement being essentially one for the sale of shares in a private company the execution of the Agreement and the payment of the initial deposit gave rise to an equitable interest in the Hong Kong Legend shares in favour of the Applicant. 99.3 In consequence of that equitable interest, the Respondents came under a minimal fiduciary duty not to exercise their shareholders’ rights in a way that undermined such equitable interest. 99.4 In allowing or sanctioning the creation of 9,998 new shares in Hong Kong Legend, the Respondents acted contrary to their fiduciary duty. The new shares effectively diluted the value of the Applicant’s equitable interest. 99.5 EPL further breached its minimal fiduciary duty by purporting to transfer its 1 share in Hong Kong Legend absolutely to EPGL. 99.6 EPHL further breached its minimal fiduciary duty by purporting to declare that it held its 1 share in Hong Kong Legend on trust for EPGL absolutely. 99.7 It is inconceivable that EPGL would not have known of the Agreement at the time of the various transfers of Hong Kong Legend shares to it. This must be especially so, given that the Arbitration between the Applicant and the Respondents was taking place at the time of the transfers. In those circumstances, EPGL must have received its shares in Hong Kong Legend with actual or constructive notice of the Applicants’ equitable rights in respect of the shares. 99.8 In the premises, EPGL received its Hong Kong Legend shares subject to a constructive trust on behalf of the Applicant. 99.9 Further, as a matter of Hong Kong law, the Applicant may be in a position to require the Respondents, as the Applicant’s fiduciaries, to recover the Hong Kong Legend shares from EPGL with a view to transferring them to the Applicant upon payment of the total consideration stipulated in the Agreement. 100. There is in fact a recently-initiated and still ongoing proceeding in the Hong Kong Court (HCA 961 of 2008) where the Applicant is pursuing a claim along the lines which Ms. Cheng has sketched out against the Respondents, EPGL, Hong Kong Legend and Xiamen Legend. 101. I have no intention of deciding here whether the Applicant’s contentions in HCA 961 of 2008 are right. I do not have to go that far. In light of my preliminary observations, it is sufficient if I indicate that to my mind the claim is at least arguable. Given that is so, I am unable to say that it is impossible for the Hong Kong Legend shares eventually to be transferred to the Applicant. 102. Mr. Yu has helpfully analysed the parties’ obligations under the Agreement in the course of his submissions. He stresses that the Applicant was not just under an obligation to make staged payments totalling RMB 120 million. The Applicant was also to bear the cost of constructing a development on the Property. 103. In the event, the cost of developing the Property was undertaken by Xiamen Legend (acting (Mr. Yu says) under the belief that it had validly terminated the Agreement) and the residential units so constructed on the Property have largely been sold. In those circumstances, one simply cannot push the clock back (Mr. Yu submits) and treat the Agreement as continuing to subsist. In particular, most of the Property no longer belongs to Xiamen Land. It is no longer possible (Mr. Yu points out) to give possession of the Property to the Applicant. 104. But, as Ms. Cheng points out, the Agreement concerned not just the right to obtain possession of and develop the land. The Agreement also encompassed the right to receive profits from its development. 105. The Applicant being a commercial entity, its ultimate objective in entering into the Agreement would not have been obtaining possession of the Property for the mere sake of development. Presumably, the Applicant’s overriding purpose was eventually to enjoy income or profits from the whole deal. At some point in the whole process, there would be an accounting of the gross profits or income derived from the development of the Property against the construction costs of developing the Property and the consideration for acquiring the shares of Hong Kong Legend. 106. Obviously, there can no longer be the staged payments of the RMB 120 million consideration as envisaged within the Agreement. But that was due to the Respondents wrongly treating the Agreement as terminated. Arguably, that self-induced limitation cannot be a basis for the Respondents to suggest that, since the consideration for the shares can no longer be paid in keeping with the timetable outlined in the Agreement, the Agreement cannot be performed at all. The essence of the Applicant’s obligation might be said to be the payment of the agreed consideration. Provided it is willing and able make the payment, it is at least arguable that there is no real obstacle here to substantive specific performance. 107. What about construction cost? Here the Applicant’s obligation was to bear the same. It was originally to have a role in vetting or controlling such costs. But that is clearly no longer possible. 108. Nonetheless, there would seem to be no obstacle to the Applicant bearing such (say) properly audited construction costs as have actually been incurred in developing the Property. The essence of the Applicant’s obligation was apparently the bearing of construction cost. I therefore doubt that it is a self-evident objection to specific performance that the construction work has already been done and cost has been incurred. 109. Consequently, at the end of the day, there is at least some arguable prospect of the Hong Kong Legend shares becoming available for transfer to the Applicant upon payment of the agreed consideration and an accounting of construction cost. Obtaining control of Hong Kong Legend would give control of Xiamen Legend and conceivably lead to an enjoyment of the profits derived by Xiamen Legend from the development of the Property. In other words, to a substantial extent the apparent ultimate objectives of the Agreement might yet be realised. 110. It is true that the process may be a messy one. But that strikes me as merely a natural consequence of the peculiar facts of this case. I do not think that the absence of a neat solution can of itself be a ground for equity refusing to grant specific performance. Nor do I see any public policy ground arising out of this messiness compelling me from ordering specific performance subject to compensation. 111. I stress that, in explaining why I find Mr. Yu’s impossibility submission far from established, it is not my intention to go behind the award or second-guess what the tribunal may have in mind. In pointing out what I find to be weaknesses in Mr. Yu’s position, I am only explaining why I am not persuaded that there is any plain and obvious impossibility here such that to enforce the award as a judgment would offend against this Court’s sense of justice. It appears that units in the Property were sold after the arbitration was heard but before the Award was made. Whether such sales have or have not rendered the Agreement or the Award impossible has never been substantively raised by the Respondents before an arbitration tribunal or the Beijing Court. It is enough for me to indicate that on a possible reading of the Agreement or Award it is arguable that performance is still possible in substance. A definitive reading of the effects of the Agreement or the Award is (as I have mentioned) within the province of the arbitration tribunal or the Beijing Court. 112. I have not lost track of the fact that in his submissions Mr. Yu advances a number of reasons why (according to the Respondents) the Applicant’s recent action for the return of Hong Kong Legend shares may be susceptible to a stay or strike-out application. 113. For instance, Mr. Yu suggests the following:- 114.1 Mr. Yu suggests that the Agreement was not specifically enforceable because it required certain things to be done to the Property which would have required constant supervision from the Court. If the Agreement was not specifically enforceable for this reason the Applicant would hold no equitable interest in the Hong Kong Legend shares. Then the Respondents could not have held the Hong Kong Legend shares on constructive trust for the Applicant upon its payment of the initial deposit. 114.2 Even if somehow there were a constructive trust, the Respondents duties would not have been the same as a conventional trustee. The Respondents’ duties would have been narrow and at best would be confined to those with the purchaser holding an equitable lien over the Property commensurate with the amount of the initial deposit. 114.3 Insofar as Hong Kong Legend shares were transferred to EPGL, the Applicant would have to establish unconscionable conduct on the part of EPGL in order to establish a constructive trust of such shares in EPGL’s hands. That requires proof of actual or constructive knowledge. 114.4 In any event, it is hard to see what asset of the Applicant was disposed of to EPGL in breach of trust. 114. Mr. Yu may be right or wrong in his submissions on the defects of the Applicant’s new action. The point is, despite Mr. Yu asserting that his arguments are all “plainly” correct, I do not see anything obvious or self-evident in the matter. Mr. Yu’s propositions are at best arguable. If so, there could be nothing contrary to public policy (I think) in my allowing the award to be enforced as a judgment of this Court. 115. Ms. Cheng has referred me to Gill v. Tsang [2003] All ER (D) 175. There Deputy High Court Judge Vos QC, in referring to the flexibility of specific performance as an equitable remedy, said:- “33. Specific performance is an equitable remedy. Once granted, the contract remains in force and is not merged in the judgment. But, that said, the equitable nature of the remedy does not stop with the grant of the order. The court controls the working out, variation or cancellation of the order. Equitable principles apply to these processes. .... 35. Nothing in these passages deprives the court of its equitable jurisdiction to make the order for specific performance work. There is not, as Mr. Mark Warwick, counsel for Pamigold, suggested, a stark choice between enforcing or dissolving the order. The court may, in my judgment, make such orders as are just and equitable in the circumstances then existing, to give practical effect to the order it ha made. In making its order work in the circumstances then arising, the court is not re-writing or even varying the contract between the parties. It is providing a mechanism to give the claimant what he bargained for, namely the sale or purchase of land. Such relief may be granted in a whole range of circumstances in which a defendant ha failed to perform both his original contract and the court’s subsequent order. If Mr. Warwick were right, an inappropriate and unnecessary rigidity would be introduced into the equitable remedy of specific performance. 35. If for some reason, a vendor cannot perform every aspect of the contract, the purchaser is in general terms still entitled to seek specific performance with an abatement of th purchase price to reflect the deficiency. Likewise a vendor can generally seek specific performance subject to an abatement, if he can comply substantially with the agreement. This illustrates the flexibility of the remedy (see Megarry & Wade on the Law of Real Property 6th edition at paragraphs 12-115 to 12-120).” 116. It would follow from this observation that the making of an order for specific performance need not be the end of a matter. If it later appears that some of the Agreement can no longer be performed in substance, the parties can approach the Court for such directions (including the grant of an abatement) so as “to make the order for specific performance work”. 117. Mr. Yu, however, says that Gill is not apposite. This is because there specific performance had already been granted by the Court and what was being sought from the Court was a variation of the original order. Here (Mr. Yu says) the arbitral tribunal and not the Court was originally seised of the matter. 118. I do not accept Mr. Yu’s objection. 119. I do not see the logic in distinguishing between:- 120.1 on the one hand, the Court becoming seised of a matter because it makes an order converting an arbitral award into a judgment; and, 120.2 on the other hand, the Court being originally seised of a matter and making an order. 120. In either case, where the Court’s order involves specific performance, the parties should be able to come back to the Court for further directions to make such order work. 121. Mr. Yu submits that any variation of an order for specific performance may usurp the jurisdiction of the arbitrator’s tribunal. He suggests that it would also be contrary to the summary nature of the AO s.2GG procedure. 122. I do not think that it is possible to be so categorical. The Court’s response may depend on the nature of the variation for which subsequent application is made. Again it is not all or nothing. 123. The Court, of course, may or may not grant any variation of the specific performance order simply in the exercise of its discretion. 124. Moreover, on one reading, the effect of the Award here is to treat the Agreement as subsisting. That may well possibly include the agreement to arbitrate. Assume that is the case. This would then have the consequence that any future disputes over the substance of the parties’ obligations may have to be referred to CIETAC Beijing arbitration. In such situation, the Court may be reluctant to vary an order or grant an abatement in a particular way in the absence of a further reference to arbitration by the parties. 125. But the simple point is that, contrary to what Mr. Yu submits, there is nothing inherently inconsistent between the Court’s ability to tailor an order of specific performance in a given situation and the fact that the order for specific performance results from the conversion of an arbitral award into a judgment of the Court. In considering whether to grant relief, the Court will always be aware that as much as possible it should not second-guess what an arbitral tribunal has decided or might determine in the future. 126. Mr. Yu suggests that the Applicant is not genuinely seeking specific performance. He says that:- “It is clear from the Award that the arbitral tribunal did not make any ruling as to whether as a matter of PRC law the agreement is capable of being performed or not. It only decided that the parties should cooperate with each other and work out how they should continue to perform their parts under the agreement so as to achieve the ultimate objective. This should not be taken as equivalent to the grant of relief of specific performance in a common law jurisdiction.” 127. Mr. Yu argues that “all the Applicant wants to get from the agreement is the profits made during the course of the development but not the ultimate shareholdings of the HK company”. Damages (Mr. Yu submits) should be an adequate remedy and specific performance should not be awarded. 128. But (Mr. Yu concludes) any claim for damages should be made in the arbitration. The Court should not “allow the Applicant to pursue an order for specific performance for the purpose of seeking an award of damages through the backdoor”. 129. I am puzzled by this submission. All the Applicant seeks at present is for its Award to be converted into a judgment of the Court. That means essentially an order by this Court that “the Respondents shall continue to perform the Agreement”. 130. As I have been at pains to suggest above, precise directions for working out the order to make it work can be given at a later stage to the extent necessary. Equity is flexible. Such directions can (if appropriate) be made pursuant to further determinations by an arbitral tribunal (or the Beijing Court as supervisory court) or as interim measures in aid of further arbitration. 131. I do not have to consider at this stage whether damages are an adequate remedy, whether I should grant an abatement, or what parts of the Agreement may or may not definitively be performed. Those are not questions currently before me. C. Main Issue II: Not ready, willing or able 132. Mr. Yu submits that the Applicant only wishes to obtain the fruits of the development on the Property without having to pay for the same. 133. Ms. Cheng, however, has confirmed that the Applicant is fully prepared to pay the RMB 120 million consideration and the $2 nominal fee and to bear the properly audited construction costs of the development. There is no question (Ms. Cheng stresses) of the Applicant shying away from its obligations under the Agreement. 134. The mutual fulfilment by the Applicant of the substance of its obligations under the Agreement is implicit from the stricture that the Respondents continue to perform their obligations under the Agreement. I do not think that this issue gives rise to any basis for refusing enforcement of the Arbitration Award on public policy grounds. Further, where the Respondents have by their actions made it difficult or impossible for the Applicant to perform certain obligations, the Court must be wary of too readily holding that on public policy grounds the Respondents should be excused from fulfilling their obligations because the Applicant cannot fulfil all its obligations. D. Minor Issue I: Material non-disclosure 135. I do not think that there was any material non-disclosure. I doubt that the fact of the deposit being available for collection by the Applicant from the Notary would have made any difference to the grant of the ex parte Order. E. Minor Issue II: Lack of mutuality 136. Let me assume (without necessarily accepting) that the delivery of land situate outside Hong Kong is somehow incapable of settlement by an arbitration under Hong Kong law. 137. The proposed Order does not actually involve a transfer (in the sense of a conveyance) of the Property (which is situate outside Hong Kong) from one entity to another. 138. The proposed Order is in personam addressed to the Respondents which are both domiciled and resident in Hong Kong to perform their parts of the Agreement. They are (among other things) obliged to transfer the Hong Kong Legend shares to the Applicant subject to the payment of the consideration due and a proper accounting of construction cost. 139. The effect of the share transfer may be that the Applicant gains control of Xiamen Land which formerly owned the entire Property. But that does not make the Hong Kong Legend share transfer a “delivery of land outside Hong Kong”. 140. Therefore, even on the assumption made, I see no matter that is incapable of settlement by arbitration under Hong Kong law such as to trigger the restriction in AO s.40E(3). Indeed, I do not see how AO s.17 is relevant. That simply provides that, in the absence of contrary intention, every arbitration agreement is deemed to have a provision enabling an arbitrator to order specific performance of any contract “other than a contract relating to land or any interest in land”. F. Minor Issue III: Effect of AO s.40C 141. It is correct that the Applicant applied to enforce the Award in Xiamen. But that was rejected on the basis that the Respondents were in Hong Kong and had no assets in Xiamen. 142. The rejection was thus purely on jurisdictional grounds. There is nothing as far as I can see in AO s.40C to prevent the Applicant from now seeking to enforce here where the Respondents are to be found and where presumably the Respondents have assets. The Applicant attempted to enforce in Xiamen and solely on jurisdictional grounds the Award was not fully satisfied by way of that attempted enforcement. 143. Mr. Yu suggests that an application to the Court to enforce an award is not an “enforcement” within the terms of AO s.40(2)(b). But I do not think that is right. It seems to me instead that the expression “by way of that enforcement” in s.40(2)(b) refers to “an application … the Mainland for enforcement of a Mainland award” in s.40(2)(a). Accordingly, the application in Xiamen to enforce was an “enforcement” with s.40(2)(b). IV. CONCLUSION 144. The Respondents’ application to set aside Andrew Cheung J’s Judgment Order dated 31 October 2007 fails. The Respondents’ application is dismissed. There will be an Order Nisi that the Respondents pay the Applicant’s costs with certificate for 2 counsel. Costs are to be taxed if not agreed. (A. T. Reyes) Judge of the Court of First Instance High Court Ms. Teresa Cheng, SC and Mr. David Tsang, instructed by Messrs Li & Partners, for the Applicant Mr. Benjamin Yu, SC, Mr. Anthony Chan, SC and Mr. Richard Khaw, instructed by Messrs JSM, for the Respondent Appeal by the 1st and 2nd Respondents to Court of Appeal dismissed. Please refer to CACV106/2008 and CACV197/2008 dated 11 June 2009 Look up this case on Lawcite Noteup",
  "length": 63092,
  "headers_seen": [
    "I. INTRODUCTION",
    "II. BACKGROUND",
    "III. DISCUSSION",
    "A. Some preliminary observations",
    "A.1 Observation I: Mechanistic principle",
    "A.2 Observation II: Real nature of impossibility objection",
    "A.3 Observation III: Role of Court of seat of arbitration",
    "A.4 Observation IV: “All or nothing”?"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2008/540",
  "query": "seat of arbitration",
  "ts": "2025-10-16T10:49:26",
  "ok": true
}