{
  "title": "BEYOND THE NETWORK, LTD V. VECTONE LTD | [2005] HKCFI 1187 | HKLII",
  "court": null,
  "year": 2005,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2005] HKCFI 1187 BEYOND THE NETWORK, LTD V. VECTONE LTD Judgment Information Date 13 Dec, 2005 Action No. HCA2826/2004 Neutral Cit. [2005] HKCFI 1187 Download MS Word Judgment Reading Options Translation Toggle Highlight Appeal History HCA2826/2004 HCA002826/2004 BEYOND THE NETWORK, LTD v. VECTONE LTD HCA 2826/2004 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE ACTION NO. 2826 OF 2004 ____________ BETWEEN BEYOND THE NETWORK, LIMITED Plaintiff and VECTONE LIMITED Defendant as Indenture Trustee ____________ Before: Hon. Reyes J in Chambers Date of Hearing: 13 December 2005 Date of Judgment: 13 December 2005 ________________ J U D G M E N T ________________ I. Introduction 1. By a contract dated 4 April 2003 Beyond and Vectone agreed to buy and sell international telephone services from each other. 2. By letter to Beyond dated 24 September 2004 Vectone stated that it was disputing certain invoices on account of alleged billing discrepancies. 3. On 14 December 2004 Beyond started these proceedings against Vectone for a net balance of US$718,999.26 said to be due on unpaid invoices. On 31 March 2005, after obtaining several extensions of time for the filing of its defence, Vectone applied to stay the proceedings to arbitration. 4. Vectone does not admit liability. Vectone’s case is essentially that it has not been properly billed by Beyond. Further, Vectone claims to set-off certain amounts alleged to be due from Beyond. 5. The issue which I have to decide today is whether the contract incorporates an arbitration agreement. If it does, then I must stay this dispute to arbitration. Otherwise, Vectone’s stay application should be dismissed. II. Background 6. Relevant provisions of the contract are as follows:- “4. SETTLEMENT AND PAYMENT 4.3 Each party will be responsible for payment of all undisputed charges as reflected on any billing statement.... Neither party shall have an obligation to pay any amount which has been disputed in good faith until such time that the dispute is satisfactorily resolved by the Parties.... In the event the Parties are unable to resolve the dispute amicably with[in] a reasonable period of time and havin[g] exchanged their respective call detail records, not to exceed 14 days, then, the parties will submit the difference to the Hong Kong Courts. 5. REGULATIONS. This Agreement is made expressly subject to all present and future valid orders, regulations of any regulatory body having jurisdiction over the subject matter of this Agreement, and to the laws of the Hong Kong, SAR. The Parties hereby submit to the exclusive jurisdiction of the courts of Hong Kong, SAR. 11. GENERAL PROVISIONS .... 11.2 GOVERNING LAW. This Agreement will be interpreted in accordance with the laws of the State of New York, USA, notwithstanding the principles of conflicts of laws thereof, and any dispute shall be submitted to the courts in the State of New York. The Parties agree that the United Nations Convention on Contracts for the International Sale of Goods will not apply to this Agreement. 11.3 ARBITRATION. Either Party may require that any dispute arising hereunder be settled by binding arbitration in accordance with the commercial arbitration rules of the American Arbitration Association provided that alleged breaches of Section 7 (Confidentiality) may be settled by injunctive relief in a court as provided in Section 11.2. The arbitral tribunal shall be composed of a sole arbitrator. The English language shall be used throughout the arbitral proceeding. The arbitration shall take place in New York, NY, USA. The cost of the arbitration, including the fees and expenses of the arbitrator(s), shall be shared equally by the Parties unless that award provides otherwise. .... 11.8 CAPTIONS. Captions of the sections and subsections of this Agreement are for reference purposes only and do not constitute terms or conditions of this Agreement, and shall not limit or affect the terms and conditions hereof. 11.9 WAIVER. No provision of, right, power or privilege under this Agreement shall be deemed to have been waived by any act, delay, omission or acquiescence on the part of either Party, its agents, or employees, but only by an instrument in writing signed by an authorized officer of each Party. No waiver by either Party of any breach or default of any provision of this Agreement by the other Party shall be effective as to any other breach or default, whether of the same or any other provision and whether occurring prior to, concurrent with, or subsequent to the date of such waiver. ....” 7. The contract was the result of extensive negotiation between Beyond and Vectone. Unfortunately, the resulting agreement is badly drafted. Several terms (in particular, clauses 4.3 (last sentence), 5, 11.2 and 11.3) concerning jurisdiction appear on their face to contradict each other. 8. There is evidence that Beyond’s standard agreement for international telephone services functioned as an early draft for the contract. 9. That standard agreement provided by its clauses 4.3 and 11.3 for arbitration in the UK under the rules of the American Arbitration Association. But that standard agreement already had the germ of contradiction within it, since its clause 5 was similar in terms to clause 5 of the final version of the contract. 10. It appears that in negotiations leading to the present contract Vectone’s stance was that clause 4.3 of the standard agreement was unacceptable. Vectone suggested in relation to clause 4.3 that “if we do not agree, we will submit our difference to the Hong Kong Courts as per Art.5”. Vectone’s position (Beyond contends) led to the insertion of the last sentence of clause 4.3 of the present contract. But Vectone disputes this, saying that Beyond’s evidence on the negotiations preceding the current clause 4.3 is inadmissible. 11. Mr. Manzoni (appearing for Vectone) relies on the present clause 11.3 as the basis for stay. If clause 11.3 of the contract is an arbitration agreement as Mr. Manzoni contends, it would be an international one. By Article 8 of the UNCITRAL Model Law applicable in such circumstance, I am bound to stay the proceedings unless I find that the agreement to arbitrate is “null and void, inoperative or incapable of being performed”. 12. Mr. Manzoni submits that I need not concern myself with the proper construction of clauses 4.3, 5 and 11.2. Whatever they might mean, it is obvious (Mr. Manzoni says) that there is an arbitration agreement in clause 11.3 which should be enforced. An arbitrator can then decide (to the extent necessary to an arbitration) how clauses 4.3, 5 and 11.2 should be read. 13. Mr. Beresford (appearing for Beyond) contends that clause 11.3 is inapplicable or inoperative because of clauses 4.3 and 5. 14. Mr. Beresford further suggests that Vectone waived any right under clause 11.3 by failing to refer any disputed invoices to arbitration within 14 days or so of Vectone’s letter of 24 September 2004. III. Discussion 15. In my view, clause 11.3 is inoperative as an arbitration agreement. 16. Clause 4.3 is categorical in its terms. Beyond’s claim plainly concerns billing. By the last sentence of clause 4.3, the parties unequivocally agree to submit to the Hong Kong Court any differences on billing which are not amicably resolved within a reasonable period of time. 17. The parties’ submission to the Hong Kong Court is made crystal clear by clause 5. The Hong Kong’s Court’s jurisdiction is described as “exclusive” and the parties by clause 5 expressly confirm that they submit to the same. 18. Mr. Manzoni suggests that clause 5 should be read as restricted to “regulatory matters”. But it is hard to see how that can be. It is true that clause 5 is captioned “Regulations”. However, reading clause 5 as a whole, one sees that the word “Regulations” is used as a general term which at least encompasses orders, regulations and the entire laws of the Hong Kong SAR (whether statutory or common law). 19. Clause 11.2 does 3 things. First, it stipulates that New York law is to govern the interpretation of the contract, “notwithstanding the principles of conflicts of laws thereof”. Second, it states that “any dispute shall be submitted to the courts in the State of New York”. Third, it provides that the United Nations Convention on Contracts for the International Sale of Goods (ULIS) is not to apply to the agreement. 20. The 1st and 3rd strictures are consistent with the reading of clauses 4.3 and 5 just sketched out. 21. On the 1st stricture, a contract can provide that certain matters are to be governed by foreign law. Under Hong Kong conflicts of law principles, the Court will normally give effect to such a choice of law provision. Thus, applying Hong Kong law in the sense of Hong Kong private international law rules, a Hong Kong Court would be prepared to apply New York law canons of construing contracts here. 22. On the 3rd stricture, Hong Kong law would not apply ULIS to an international sale absent the parties’ express or implied agreement that ULIS is to apply. Accordingly, the 3rd stricture may have been inserted out of an abundance of caution to make it plain that, in keeping with the usual tenets of Hong Kong law, ULIS is not to apply. 23. That leaves the 2nd stricture in clause 11.2. Mr. Manzoni argues that, if the word “exclusive” in clause 5 is given its ordinary meaning, then the 2nd stricture would be pointless and have to be ignored. That (Mr. Manzoni says) offends against a canon of construction under New York or Hong Kong law that, as much as possible, a Court is to make sense of a contract as a whole. 24. But in English the word “shall” can have a permissive (as opposed to mandatory) sense. Given the description of the Hong Kong Court’s jurisdiction as “exclusive” in clause 5, it follows that the word “shall” in clause 11.2 cannot be mandatory. The 2nd stricture might instead be read as saying that, despite clause 5, the parties (if they agree) may bring their dispute to the New York Court. Obviously, if the parties do not agree to a relaxation of clause 5, the Hong Kong Court will retain its “exclusive jurisdiction”. In my view, to read “shall” in clause 11.2 in some other way, as (say) incorporating some mandatory flavour, would be inconsistent with the plain and obvious meaning of the expression “exclusive jurisdiction” in clause 5. 25. I have considered the possibility that the 2nd stricture relates to disputes on matters of interpretation. For example, it might be suggested that, where there is a dispute about (say) the construction of the contract or the principles applicable to the contract’s construction, the parties have agreed by clause 11.2 to submit that limited issue to the New York Court. 26. I do not think that the parties could have had such a bi-furcated approach to jurisdiction in mind. That would mean that the parties entertained the possibility of part of the dispute going before the Hong Kong Court and other parts (relating to interpretation) going to the New York Court. Such result would not only go against the use of the word “exclusive” in clause 5. It would also be impractical. In my view, if that was what the parties genuinely intended, they would have had to use much more explicit language than they have done. 27. That brings one to clause 11.3. If the Hong Kong Court has “exclusive jurisdiction,” what could the 1st sentence of clause 11.3 mean? How can an arbitrator also have jurisdiction? I think that there are only 2 ways of construing clause 11.3 consistently with clause 5. Neither possibility would assist Vectone’s case. 28. First, the apparent arbitration agreement in clause 11.3 is permissive, not mandatory. A party “may require” a dispute to be arbitrated, despite the express submission to the Hong Court’s jurisdiction in clause 5. But there is no obligation on the other party to accede to the invitation to arbitrate. If the other party agrees to arbitrate, the acquiescence will override clause 5 and arbitration can then follow the procedure in clause 11.3. Otherwise, clause 5 governs. 29. Second, I refer to the “reasonable time” frame allowed by clause 4.3 for the amicable resolution of billing disputes. Clause 11.3 may allow a party to require arbitration, but he must do so within the “reasonable time” stipulated by clause 4.3. On this reading, the parties would have treated arbitration under clause 11.3 as a possible route to resolving a dispute amicably, before the right to go to Court is triggered. 30. On the 1st construction, Vectone’s case is not helped. Beyond does not agree to arbitrate. 31. On the 2nd construction, it is too late for Vectone to seek arbitration. This is because it failed to call for arbitration within any reasonable time following its 24 September 2004 letter disputing certain invoices. 32. Vectone did not give formal notice that it wished to go to arbitration under clause 11.3 until 16 February 2005. That is a period of nearly 5 months after querying Beyond’s invoices on 24 September 2004. Whatever a reasonable time for invoking arbitration may be (whether 14 days as Mr. Beresford says or something else), by any objective yardstick 5 months must be an unreasonable period in the circumstances. This must especially be the case where the contract expressly provides for settlement of accounts within 7 days. In this limited sense, I accept Mr. Beresford’s submission that Vectone has “waived” any right under clause 11.3 to arbitrate. 33. I add that I am not persuaded by Mr. Manzoni’s argument that a term requiring arbitration to be brought within a “reasonable time” would be unworkable for uncertainty. 34. I also cannot accept Mr. Manzoni’s submission that any right to arbitrate conferred by clause 11.3 “transcends” whatever the parties may have meant by clauses 4.3, 5 and 11.2. I do not think that one can assess whether clause 11.3 is operative, unless one takes a view on the scope of clauses 4.3 and 5. 35. If the Hong Kong Court has “exclusive jurisdiction,” I do not see how a party can unilaterally undercut that jurisdiction by invoking an alleged right to New York arbitration conferred by clause 11.3. If Mr. Manzoni’s construction of clause 11.3 is right, the parties’ submission to the Hong Kong Court’s exclusive jurisdiction in clause 5 would be of no effect. 36. I am fortified in my conclusions by 2 independent considerations. 37. First, there is the evidence that Vectone itself suggested the inclusion of the last sentence of clause 4.3. If there is any ambiguity on the extent of the Court’s jurisdiction arising from that sentence, that ambiguity should be construed against Vectone. 38. Mr. Manzoni argues that evidence of the parties’ negotiations is inadmissible. I disagree. In my view, Vectone’s communication to Beyond that Vectone was not prepared to enter into an agreement in the absence of a provision enabling billing disputes to be brought before the Hong Kong Court, forms part of the factual matrix against which I am entitled to construe the present contract. 39. The factual matrix “includes absolutely anything which would have affected the way in which the language of the document would have been understood by a reasonable man” ( ICS Ltd. v. West Bromwich Building Society [1998] 1 WLR 897 (HL), at 913A (Lord Hoffmann)). It is true that English or Hong Kong law “excludes from the admissible background the previous negotiations of the parties and their declarations of subjective intent”. But “[t]he boundaries of this exception are in some respects unclear”. See ICS Ltd. at 913B (Lord Hoffmann). I do not think that I can ignore, as inadmissible, evidence about Vectone’s stance on jurisdiction which actually led to a change in the language of the original version of clause 4.3. 40. Second, in a letter dated 14 March 2005 to Vectone, Mr. Berenthal (Vectone’s lawyer) states:- “In the instant situation, due to the conflicting provisions of Paragraphs ‘5’ and ‘11.2’, it is unclear as to which Court would have proper jurisdiction over the parties to compel arbitration. Under New York law, when faced with two irreconcilable provisions in a contract, a Court will retain the provision which appear first in the Contract, and discard the second one. Jacobson v. Sassower, 66 NY 2d 991, 499 NYSD 2d 381 (NY, 1985). It is our belief that under this rule of construction, a New York Court would find that it lacks the jurisdiction to compel the parties to arbitrate, that only a Hong Kong Court could compel the parties to arbitrate. Notwithstanding the foregoing, it is our considered opinion that once one party demands arbitration, both parties are obliged under the contract to arbitrate the dispute in Hong Kong.” I observe that, before me, Vectone relies on an affidavit of Mr. Berenthal on canons of construction under New York law. 41. Apply New York law as the putative law of interpretation under clause 11.2. A conclusion to be drawn from the principle espoused in Mr. Berenthal’s letter, is that clause 5 (being the earlier provision) overrides a subsequent irreconcilable stipulation. I have not found clauses 4.3, 5, 11.2 and 11.3 to be contradictory on closer examination. But if I am wrong and they are inconsistent, the exclusive jurisdiction conferred by clause 5 on the Hong Kong Court, must trump any contrary stricture in clause 11. Under New York law, clause 11 cannot be read as whittling down the ambit of clause 5. 42. Mr. Manzoni finally submits that Vectone’s position must at least be arguable. He suggests that, in consequence, I should at least stay these proceedings to an arbitrator who can then determine whether or not he has jurisdiction. 43. While I accept that is a possible course, it does not strike me as appropriate here. A decision by an arbitrator on his jurisdiction would still be open to challenge before this Court. The matter would simply return to me. Where (as here) a question of construction is involved and little (if any) extrinsic evidence is sought to be adduced in aid of construction, it would be conducive to saving time and cost to determine the question of jurisdiction now. 44. The writ was issued in December 2004. It is presently December 2005 and a Defence has yet to be filed. Given my views on clauses 4.3, 5, 11.2 and 11.3, it would be wrong to refrain from deciding the jurisdictional issue now. To remit the question to an arbitrator would only lead to unjustifiable delay and expense. IV. Conclusion 45. There is no effective arbitration agreement. Vectone’s application is dismissed. I will hear the parties on costs and consequential orders. (A T Reyes) Judge of the Court of First Instance High Court Mr Roger Beresford instructed by Messrs Richards Butler, for the Plaintiff Ms Charles Manzoni instructed by Messrs Holman, Fenwick & Willan, for the Defendant Appeal dismissed: see CACV18/2006 dated: 16 November 2006 Look up this case on Lawcite Noteup",
  "length": 19018,
  "headers_seen": [
    "I. Introduction",
    "II. Background",
    "III. Discussion",
    "IV. Conclusion"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2005/1187",
  "query": "compel arbitration",
  "ts": "2025-10-11T21:05:06",
  "ok": true
}