{
  "title": "THE INCORPORATED OWNERS OF HAMDEN COURT V. MEGA MILES CONSTRUCTION CO LTD | [2015] HKCFI 928 | HKLII",
  "court": null,
  "year": 2015,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2015] HKCFI 928 THE INCORPORATED OWNERS OF HAMDEN COURT V. MEGA MILES CONSTRUCTION CO LTD Judgment Information Date 1 Jun, 2015 Action No. HCCT32/2014 Neutral Cit. [2015] HKCFI 928 Parallel Cit. [2015] 5 HKC 179 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCCT32/2014 HCCT32/2014 THE INCORPORATED OWNERS OF HAMDEN COURT v. MEGA MILES CONSTRUCTION CO LTD HCCT 32/2014 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO 32 OF 2014 ______________ IN THE MATTER OF THE ARBITRATION ORDINANCE , CAP 609 and IN THE MATTER OF AN ARBITRATION and IN THE MATTER OF ORDER 73 OF RULES OF HIGH COURT ______________ BETWEEN THE INCORPORATED OWNERS OF HAMDEN COURT Plaintiff (Respondent in the Arbitration) and MEGA MILES CONSTRUCTION COMPANY LIMITED Defendant (Claimant in the Arbitration) ______________ Before : Hon Mimmie Chan J in Chambers Dates of Hearing : 13 January 2015 & 30 March 2015 Date of Decision : 2 June 2015 ____________ DECISION ____________ Background 1. This is an application made by the Incorporated Owners of Hamden Court (“ IO ”) to set aside an interim award (“ Award ”) made by the arbitrator, Mr Cheung Kwok Kit (“ Arbitrator ”), on 26 May 2014, that he has jurisdiction to deal with the arbitration initiated by the notice of arbitration dated 28 January 2013 (“ Arbitration ”) served by Mega Miles Construction Company Limited (“ Claimant ”), against the IO as respondent. The application is made under s 34 (1) (3) of the Arbitration Ordinance ( Cap 609 ) (“ Ordinance ”) (and Article 16 (3) of the Model Law), for the Court to decide on the IO’s plea that the Arbitrator does not have jurisdiction, after the preliminary ruling of the Arbitrator in his Award. 2. The IO claim that the Arbitrator does not have jurisdiction, since the contract dated 8 December 2011 (“ Contract ”), purportedly made by the Claimant with the IO and signed by members of the Management Committee of the IO, and which contained the arbitration clause relied upon by the Claimant, was signed by the members of the Management Committee without any actual or extensible authority of the IO, and further, that the scope of the arbitration clause does not cover a dispute relating to whether the Contract existed. 3. The Contract related to the engagement of the Claimant to carry out renovation, repair and maintenance works (“ Project Works ”) in respect of Hamden Court (“ Building ”), at 149‑151 Hong Ning Road, Kwun Tong, Kowloon. It was signed by the Claimant on 8 November 2011, and by the Chairman, Vice‑Chairman, Treasurer and Secretary of the Management Committee of the IO one month later, on 8 December 2011. 4. It is not in dispute that after a tendering exercise in September 2011, the IO at its general meeting held on 23 October 2011 (“ 23 October Meeting ”) resolved to select the Claimant as the contractor to carry out the Project Works, at the cost of $36,943,858.75 (“ Project Cost ”), and further resolved to authorize the Chairman, Vice‑Chairman, Treasurer and Secretary (“ Office Bearers ”) of the Management Committee to sign the Contract with the selected contractor for the Project Works (“ IO Resolution ”). Further, it is not disputed that at a meeting of the Management Committee held on 8 November 2011 (as evidenced by the Minutes of the meeting), the Management Committee resolved and agreed to “temporarily suspend” the signing of the Contract with the Claimant. This was as a result of more than 5% of the owners of the Building having signed a request (“ Objecting Owners ”), on 8 November 2011, to convene a further meeting of the owners to discuss the cost of the Project Works, whether the Project Works could be partly funded by the reserves of the IO, and the impact of the Project Works on the existing air‑conditioning and windows of the Building. The 2 representatives of the Claimant were present at the meeting on 8 November 2011, which meeting had originally been scheduled to discuss and to have the Contract signed by the parties, but which ended with the Contract being signed by the Claimant only. 5. As a result of the Objecting Owners’ request for further discussion on the Project Works, a general meeting of the owners of the Building was held on 30 November 2011. The consultant of the IO for the Project Works (Joyance Building Consultant Company Limited (“ Consultant ”)) agreed to submit revised details of the Project for the owners’ further consideration. The owners of the Building signed a further request on that day, demanding for a general meeting of the owners to be held on 18 December 2011, to terminate the Project, to revoke the authority granted to the Office Bearers to sign the Contract, and to remove all members of the Management Committee. No resolution was passed at the 30 November 2011 meeting, but the Chairman of the Management Committee is recorded to have assured the owners at the end of the meeting that he would not do anything by force (“唔會夾硬嚟”), which the owners claim they understood to mean that he would not sign any contract with the Claimant in respect of the Project Works. 6. It is common ground that after the Claimant signed the Contract on 8 November 2011, it did not hear from the IO or any of its representatives further until about 10 December 2011, when it received a copy of the Contract signed by the Office Bearers. There was also correspondence between the Claimant, the IO and the Consultant in December 2011, with the Claimant being informed by the Consultant on 15 December 2011 that the commencement date for the Project Works would be 19 December 2011. 7. When the Claimant attended at the Building on 28 December 2011 to commence the Project Works, they were prohibited from entering the Building. On 21 August 2012, the IO finally wrote to inform the Claimant that the owners had resolved at a general meeting held on 22 July 2012 to terminate the Contract. 8. On 28 January 2013, the Claimant gave notice of arbitration to seek damages for the IO’s repudiation of the Contract. On 10 June 2013, the IO instituted proceedings against the Claimant and the Office Bearers in the High Court, under HCA 1019 of 2013, to seek a declaration that the IO is not a party to the Contract, and other relief against the Office Bearers for having signed the Contract without the IO’s authority. The Claimant applied to stay the High Court proceedings, and in turn, the IO claimed that the Arbitrator does not have jurisdiction in the Arbitration commenced by the Claimant. The Arbitrator decided to determine the question of his jurisdiction by way of a preliminary issue. The parties filed evidence pursuant to the directions issued by the Arbitrator, and after hearing submissions from the parties, the Arbitrator issued the Award, ruling that he has jurisdiction in the Arbitration. Notice was given by the Arbitrator on 26 May 2014, that the Award was ready for collection subject to the settlement of his invoices. The parties collected the Award or 9 June 2014, and the IO applied on 7 July 2014 to challenge the Arbitrator’s Award on jurisdiction. 9. The issues for determination by this Court are: (1) whether the IO’s application made on 7 July 2014 is out of time, and if yes, whether the Court has jurisdiction to grant an extension of time for the application; (2) whether the Arbitrator has jurisdiction in the Arbitration, when it is claimed that the Contract containing the arbitration clause was signed by the Office Bearers without any actual or ostensible authority from the IO; (3) whether the arbitration clause in the Contract extends to the disputes as to whether the Contract existed. Whether the application is out of time 10. The application of the IO is made under s 34 of the Ordinance, which adopts Article 16 of the Model Law. Article 16 (1) provides that the arbitral tribunal may rule on its own jurisdiction, including any objections with respect to the existence or validity of the arbitration agreement. Article 16 (2) provides that a plea that the arbitral tribunal does not have jurisdiction shall be raised not later than the submission of the statement of defence. 11. Article 16 (3) then provides as follows: “The arbitral tribunal may rule on a plea referred to in paragraph (2) of this article either as a preliminary question or in an award on the merits. If the arbitral tribunal rules as a preliminary question that it has jurisdiction, any party may request, within 30 days after having received notice of that ruling , the court specified in article 6 to decide the matter, which decision shall be subject to no appeal; while such a request is pending the arbitral tribunal may continue the arbitral proceedings and make an award.” (Emphasis added) 12. The language used in Article 16 (3) and adopted by s 34 of the Ordinance is different to the language used in Order 73 rule 5 (1) and (2) (and to the applications to which rule 5 (1) and (2) apply). The latter refer to “ 30 days after the award is delivered ”. The language is also different, but perhaps more akin, to that used in Article 33, which deals with the correction and interpretation of awards and refers to “ 30 days of receipt of the award ”. 13. In any event, Order 73 rule 5 (1) and (2) do not apply to the present application made under s 34 and Article 16, and what I have to decide is the meaning of “within 30 days after having received notice of (the Arbitrator’s) ruling” on jurisdiction as a preliminary question. In this regard, a party cannot be said to have “received notice of a ruling”, until it has actually received the ruling and has notice of the ruling made, or until the party has actually been notified of the nature and effect of the ruling, despite not having been given or received the ruling itself. The purpose of Article 16 and the time limit imposed is for a party to challenge the ruling made by the Arbitrator on his jurisdiction, and I bear in mind the submissions made by the parties as to the intention behind the provisions in Article 16, to facilitate and ensure the expeditious progress of the arbitral process and to avoid and prevent unnecessary delay which may be caused by a party’s challenges to jurisdiction and the consequent delay and possible disruption to the arbitral hearing. 14. By contrast, an award, like a court judgment, may be “delivered”, or handed down or pronounced, in the sense of their being made available for collection, or published, without the parties’ actual receipt of the copy of the award or judgment, or having actual notice of its contents. In any event, “delivery” is not used in Article 16 and s 34 of the Ordinance. 15. Hence, my ruling is that the IO have 30 days from their receipt of notice of the ruling made by the Arbitrator in the Award to apply to this Court under Article 16 (3). Since the IO received the Award on 9 June 2014, when they had notice of the Award, they had up to 9 July 2014 to make its application. The Originating Summons issued on 7 July 2014 is within time. 16. If I should be wrong on the question of when the 30 day period commences to run, and the necessity for extension of time arises, I would rule that I have no power to extend time for the application to be made under s 34 of their Ordinance. Under Article 5 of the Model Law, applied by s 12 of the Ordinance, no court shall intervene in matters governed by the Model Law, except where so provided in the Model Law. There is no provision in the Model Law for the supervisory court to extend the time set out in Article 16 (3) for the court to decide on the jurisdiction of the arbitral tribunal, when it has been determined by the arbitrator as a preliminary question. As s 3 of the Ordinance expressly states, the Ordinance is based on the principles that, subject to the observance of the safeguards that are necessary in the public interest, the parties to a dispute should be free to agree on how their dispute should be resolved, and that the court should interfere in the arbitration of the dispute only as expressly provided for in the Ordinance. I see no basis for the Court to grant an extension of time if and when the 30 day period specified in Article 16 (3) has expired. Did the Office Bearers have actual authority to sign the Contract and the arbitration clause? 17. The Arbitrator ruled that the Office Bearers had actual authority to sign the Contract on 8 December 2011, since the IO had resolved at its owners’ meeting on 23 October 2011 to accept the Claimant’s tender, and had authorized the Office Bearers to sign the Contract. He considered that the Management Committee had the power and duty under s 29 of the Building Management Ordinance , Cap 344 (“ BM Ordinance ”) to carry the IO Resolution into effect, and this included making arrangements for signing the Contract with the Claimant. The Arbitrator considered that the IO Resolution did not prescribe the time for the Office Bearers to sign the Contract, and that the decision of the Management Committee (to temporarily suspend the signing of the Contract on the November 2011) was not inconsistent with the IO Resolution. He considered that it was within the Management Committee’s power under s 29 of the BM Ordinance to temporarily suspend the signing of the Contract, as well as to uplift the suspension at any time, unless the authority to sign the Contract has been revoked by the IO. The IO had not resolved on 30 November 2011 to revoke the IO Resolution, and only did so on 22 July 2012. 18. The Arbitrator further ruled that even if the Office Bearers did not have actual authority to sign the Contract, they had the ostensible authority to do so. Essentially, the Arbitrator found that when the Claimant signed the Contract on 8 November 2011, it had been induced to do so by the representation of the Chairman that the IO had decided to elect the Claimant as the contractor for the Project Works. The Arbitrator found that even as late as 21 August 2012, the IO still represented to the Claimant that it was only on 22 July 2012 that the IO resolved to terminate the Contract. As such, the Arbitrator considered that the Claimant was neither dishonest nor irrational in failing to make further inquiry as to the authority of the Office Bearers to sign the Contract. 19. When the Court is called upon to decide the question of the Arbitrator’s jurisdiction under s 34 of the Ordinance and Article 16 of the Model Law, the Court has to be satisfied as to the correctness of the Arbitrator’s decision, on a de novo basis ( S Co v B Co [2014] 4 HKC 421 ; Dallah Real Estate and Tourism Holding Co v The Ministry of Religious Affairs of the Government of Pakistan [2011] 1 AC 763 ). 20. The parties do not dispute that the IO had resolved, by the IO Resolution, to select the Claimant as the contractor for the Project Works, at the Project Cost, and that the Office Bearers were authorized to sign the Contract with the Claimant. What the IO contend is that the selection of the Claimant as the contractor for the Project Works does not immediately result in a contract with the Claimant. The IO further contend that the IO Resolution merely authorized the Office Bearers to mechanically sign the Contract, and did not confer on the Office Bearers any discretion to decide whether to enter into the Contract. On the IO’s argument, there were still negotiations with the Claimant, and the Office Bearers would need to revert to the IO to seek the IO’s decision whether to enter into the Contract with the Claimant. The IO claim that there is no evidence that the IO had knowledge of, or had consented to, all the terms of the Contract with the Claimant. 21. The IO accept that under s 18 of the BM Ordinance, various duties and powers are conferred on the IO and that, under s 29 of the BM Ordinance, the powers and duties conferred or imposed by the Ordinance on the IO shall be exercised and performed on behalf of the IO by the Management Committee. However, Mr Chan SC on behalf of the IO argued that s 18 does not include the power to delegate the power and function of the IO to any particular individual, on the Management Committee or otherwise. Although the IO Resolution conferred authority on the Management Committee to sign the Contract, Mr Chan highlighted that the Management Committee had itself resolved on 8 November 2011 to suspend its own authority to sign the Contract (and the arbitration clause therein) with the Claimant, and there is no evidence that the Management Committee had resolved to uplift this suspension. 22. When referring to the powers and authority of the Management Committee and individual members of the Management Committee including the Chairman, Mr Chan referred to the decision of HH Judge Li in Equal Property Management Limited v The Incorporated Owners of San Po Kong Mansions , DCCJ 14835/2000 (unreported, 17 September 2001), where His Honour observed (in paragraphs 9‑11 of his judgment): “The Second and the Third Schedules to the Building Management Ordinance , when read together, expressly provide that the powers and duties of the chairman of an incorporated owners are the convening and chairing of meetings, exercising a casting vote when necessary and signing minutes of meetings. In other words, the powers and duties of the chairman of an incorporated owners are limited to matters concerning meetings. When all the above provisions are read together, I believe the highest authority of decision-making of an incorporated owners is vested in the general meeting of the owners, and next in the management committee. Individuals including the chairman of an incorporated owners do not have any authority to make decisions. Section 29 of the Building Management Ordinance provides that the powers and duties of an incorporated owners “shall be” exercised and performed on behalf of the incorporated owners by the management committee. The meaning could not be clearer. It means that an incorporated owners is under collective leadership, and the chairman is merely the chairman of meetings and not the leader or chief executive of a corporation. Any person who enters into dealings with an incorporated owners has the legal obligation to acquaint himself with all the provisions in the Building Management Ordinance . Any person with good knowledge of the Building Management Ordinance must therefore be fully aware that the chairman of an incorporated owners in his individual capacity as chairman does not have the power of decision and execution. Decision‑making and execution follow resolutions passed by the management committee or the general meeting of the incorporated owners. Therefore, nobody, including Equal, can say that the chairman of the Corporation had usual authority to decide to enter into contracts for the Corporation.” 23. Mr Chan accepts that the decision in Equal is not binding on this Court, but submits that it provides a very good reference point. 24. I agree with the learned judge in Equal that the incorporated owners and the management committee of the owners incorporation are under collective leadership, in the sense that decisions are to be made by the owners collectively in general meeting, and by the management committee collectively at meetings of the management committee, and not by any individual member or members on the management committee. In the context of the management committee, Schedule 2 of the BM Ordinance sets out the “composition and procedure of the management committee”. Paragraph 9 of Schedule 2 provides that the quorum at a meeting of a management committee shall be 50% of the members of the management committee or 3 such members, whichever is the greater. Paragraph 10 (2) of Schedule 2 provides that all acts, matters or things authorized or required to be done by the management committee may be decided by a resolution passed by a majority of the votes of members of the management committee present at a meeting of the management committee. Paragraph 12 of Schedule 2 provides that the Schedule shall prevail in the event of any inconsistency between the Schedule and the terms of a deed of mutual carbonate or any other agreement. 25. The minutes of the meeting of the IO held on 23 October 2011 record the tendering process in July 2011, and the fact that details of the tenders received for the Project and the prices tendered had all been sent to the owners. The minutes also record details of the items of repair works to be undertaken in the Project, and the works voted upon and resolved by the owners at the 23 October Meeting to be undertaken. Further, the minutes record that the owners voted upon the 9 tenders received, the prices tendered, and the votes and resolution of the owners on the contractor for the Project Works, at the Project Cost. Finally, the minutes record the vote taken and the resolution passed to authorize the Office Bearers to sign the Contract with the contractor selected for the Project Works. 26. On the evidence, the tender documents included the form and terms of the Contract, as well as the specifications of the works to be carried out. 27. In the light of all the evidence available, I accept that the IO Resolution constitutes the IO’s decision to enter into the Contract with the Claimant on the terms of the Contract, subject to the total cost of the Project Works being the Project Cost of $36,943,838.75 ‑ as voted upon and approved by the IO at the 23 October Meeting. I also accept that the IO Resolution constitutes the IO’s authority to the Management Committee, acting by the Office Bearers, to sign the Contract on that basis. There is no evidence that the IO Resolution was revoked on 8 December 2011, when the Contract was signed on behalf of the IO. 28. It cannot be disputed that, notwithstanding the IO Resolution, the Management Committee resolved collectively, at its meeting on 8 November 2011, to suspend the signing of the Contract with the Claimant. This is recorded in the Minutes of the meeting of the Management Committee of 8 November 2011, and acknowledged in the notice dated 16 November 2011 issued by the IO to the owners of the Building. The minutes record (in paragraph 6.1) that after discussion by the members of the Management Committee, the temporary suspension was decided upon by the Management Committee. 29. There is no evidence of any meeting having been held by the Management Committee after 6 November 2011, and before the Contract was signed by the Office Bearers on 8 December 2011, when it was resolved by the Management Committee collectively, that the “suspension” collectively decided upon by the Management Committee on 6 November 2011 would be lifted, or in any way varied or revoked by the Management Committee. There are copies of notices or agendas, dated 6 December 2011 and 7 December 2011, and a fax dated 7 December 2011 from the IO to the Consultant regarding a meeting of the Management Committee to be held on 8 December 2011, for the discussion of (amongst other things) the Project. These are disputed by the IO, and a member of the Management Committee denied having attended or received any notice of any meeting to be held on 8 December 2011. The IO highlight the fact that, unlike the format of the other notices of meetings of the Management Committee, the one purportedly dated 6 December 2011 and 7 December 2011, relating to the purported meeting to be held on 8 December 2011, were not stated to have been issued or copied to the District Office, the District Board Councillor or the legal adviser. There are no minutes of the purported meeting, and a notice of a meeting of the Management Committee was in fact issued on 7 December 2011, to be held on 15 December 2011, which notice was in fact stated to have been sent to the District Office and the other relevant parties. Minutes were produced of a meeting of the Management Committee held on 15 December 2011, in which no reference was made to the Contract having been signed on 8 December 2011, or of the lifting of the suspension of the signing of the Contract. 30. On behalf of the Claimant, Mr Anthony Chan argued that as the Contract was signed by the 4 Office Bearers and witnessed by another member of the Management Committee on 8 December 2011, that is evidence of the Management Committee having resolved, by at least 5 of its members, to lift the “temporary suspension” of the authority of the Management Committee (resolved on 8 November 2011) to sign the Contract. Mr Chan sought to rely on the provisions of Schedule 2, but paragraph 10 (2) of Schedule 2 reads as follows: “All acts, matters or things authorized or required to be done by the management committee may be decided by a resolution passed by a majority of the votes of members of the management committee present at the meeting of the management committee.” (Emphasis added) 31. Paragraph 10 (2) refers to resolutions being passed by members present at meetings of the management committee held. It is not the equivalent of a provision in the articles of association of a company which provides for resolutions signed by all (or a majority in number of the) members or directors of the company, and for such resolutions to have effect as if duly passed at a meeting duly held. In the absence of any evidence of a meeting of the Management Committee having been held, and in the absence in any event of a resolution having been signed by all, or the majority, of the members of the Management Committee, I cannot agree that Schedule 2 can assist the Claimant’s argument, that there had been a valid resolution passed by the Management Committee collectively, to uplift the temporary suspension resolved on 8 November 2011 and to sign the Contract resolved upon by the IO on 23 October 2011. None of the Office Bearers, individually, have the power to revoke, or vary the resolution of 8 November 2011 passed and decided by the Management Committee collectively. 32. Nor do I accept the argument advanced by the Claimant that in view of the IO Resolution, which was binding on the Management Committee, the latter had no power to suspend the authority given by the IO to the Management Committee to sign the Contract. Under s 29 of the BM Ordinance, the powers and duties conferred or imposed by the Ordinance on the IO “shall be exercised and performed on behalf of the corporation by the management committee”. The IO have powers and duties under the BM Ordinance to ( inter alia ) procure supplies, goods and services required by the IO in the exercise of their powers and performance of their duties under the DMC relating to the Building, and to maintain the common parts of the Building. It is not disputed that the IO have the power to enter into and to sign the Contract with the Claimant in respect of the Project Works. Under s 29 of the BM Ordinance, the IO exercise their powers and duties through the Management Committee, and the Management Committee exercises the powers and duties imposed on the IO. This includes the power to sign the Contract as resolved by the IO on 23 October 2011, the power to suspend the signing of the Contract as the Management Committee collectively resolved on 8 November 2011, and the power to lift the suspension of such signing if and when the Management Committee collectively so resolves to do. There is evidence of the 1 st and 2 nd instances, but no evidence of the last. 33. My conclusion therefore is that the Office Bearers did not have actual authority to sign the Contract on 8 December 2011. Did the Office Bearers have ostensible authority to sign the Contract and the arbitration clause? 34. The applicable legal principles are not in dispute. For a third party to bind a principal on the basis of an agent’s apparent authority, there must be a representation made by the principal by word or by conduct, which may be express or implied from the surrounding circumstances. The representation must be made by the principal, or a person who had actual authority to act on behalf of the principal. A representation by the agent will not be sufficient to bind the principal. The third party must be induced by the representation to enter into the contract. Reliance will normally be presumed where the principal has held out the alleged agent as having authority and the third party entered into the contract through the alleged agent. However, the principal will not be liable if the third party chose not to investigate the agent’s authority if the opportunity arose, or if the agent was put on notice, or in fact knew that the agent was acting outside its powers. ( Chitty on Contracts, Hong Kong Specific Contracts , 4 th edition, paragraph 1‑ 052) 35. The Claimant relies on the fact that their representatives who attended the meeting of the Management Committee on 8 November 2011 were informed at the meeting (by unspecified individual or individuals) that the IO had resolved on 23 October 2011 to sign the Contract with the Claimant. It was in reliance on such representation and on the IO Resolution, that the Claimant signed the Contract on that day. 36. Any representation by the Management Committee as to its own authority would not be sufficient to bind the IO. The IO’s case is that the Claimant cannot rely on the IO Resolution as representation of the authority of the Office Bearers or the Management Committee to sign the Contract, since the Claimant’s 2 representatives were present at the 8 November 2011 meeting, and they knew that the Management Committee had resolved to suspend the signing of the Contract (as authorised under the IO Resolution). It was hence irrational or dishonest (adopting the test in Akai Holdings Limited (in liquidation) v Thanakharn Kasikorn Thai Chamkat (Mahachon) (2010) 13 HKCFAR 479 ) for the state of mind required to establish apparent authority) for the Claimant to accept the Contract as having been signed with the IO’s authority, when they later received the signed Contract on 10 December 2011. 37. The IO further argued that there is no implied representation of the authority of the Office Bearers to sign the Contract by virtue only of the fact of the IO putting or allowing the Office Bearers to remain in their position as the Chairman, Vice‑Chairman, Secretary and Treasurer of the Management Committee. Mr Chan SC relies again on the decision in Equal Property Management Limited v The Incorporated Owners of San Po Kong Mansions , DCCJ 14835/2000, unreported 17 September 2001. In that case, the learned judge drew a distinction between a director of a limited company and the chairman of an incorporated owners, and considered that Turquand’s Rule has no application to incorporated owners: “I consider it that the Turquand Rule does not apply to incorporated owners on 2 grounds. First, the Turquand Rule was laid down by the courts in the context of limited companies. Generally, limited companies are commercial or business organizations with frequent daily dealings with the external world, and on top of that, the directors of a limited company, some of whom being majority shareholders, often have a close personal interest in the profit and loss of the company. An incorporated owners is a collective organization to carry out management of its own property with little external dealings and hence it is rarely pressed for time. Individual members in the management committee of an incorporated owners, and even all members of the committee together, do not own majority interest in the building. It is well‑known that the articles of association of a limited company usually provide that the board of directors may delegate authority to individual directors to act for the company. Such provision is in Table A of the Companies Ordinance . That individual directors have ostensible authority is a system of operation recognized by law. On the other hand, there is no provision for such delegation of authority in the Building Management Ordinance and the Schedules thereto. The stipulation that the duties of the incorporated owners “shall be” exercised by the management committee on its behalf means a system of collective decision-making shall be adopted by the incorporated owners and no individual is permitted to make decision or act on its behalf. The Fourth Schedule to the Building Management Ordinance permits the granting of allowances to members of the management committee. Such allowances are, however, of little value and not intended to be a salary to the members of the committee for daily administration and management work. According to the Second Schedule to the Ordinance, a meeting may be held by the management committee once every 3 months. These provisions point to the fact that a management committee is an organ for collective deliberation and decision‑making, not necessarily an organ for daily administration and management. In summary, a limited company and an incorporated owners are different in nature, purpose of establishment and mode of operation. The function of a director in a limited company is not equivalent to that of a management committee member either. In the premises, it is not appropriate to apply to an incorporated owners the Turquand Rule which was laid down for the purposes of limited companies. As a matter of fact, no judge has ever suggested that the Rule may be applied to other incorporated bodies. I do not hastily set a precedent now.” 38. As indicated in the preceding paragraphs of this judgment, I agree that the Management Committee can only act collectively. However, that does not mean that the Management Committee, or members thereof, do not or cannot have the usual or apparent authority to enter into dealings or contracts on behalf of the IO, so as to bind the IO. 39. It is not true to say that the IO and the Management Committee have little “external dealings”. In the course of carrying out its powers and duties under the BM Ordinance, the IO, and the Management Committee acting on behalf of the IO in the exercise of its powers and duties pursuant to s 29 of the BM Ordinance, inevitably and frequently deal with third parties, such as managers of the Building, other suppliers of goods and services for the management and maintenance of the Building, and owners and occupiers of adjacent or neighboring properties. These third parties will deal with the Management Committee of the IO, and must rely on the power of the Management Committee to represent and bind the IO and the owners of the Building. 40. Whilst it may be true to say that as the Management Committee only has power to act collectively, and no individual member of the Management Committee has the usual or apparent authority to make decisions and to act on his/her own, third parties and the public are entitled to expect the Management Committee to have the power to act for, and to bind, the IO and the owners of the Building. As the learned judge emphasized in Equal , any person who enters into dealings with the incorporated owners has the legal obligation to acquaint himself with all the provisions in the BM Ordinance. S 29 of the BM Ordinance states that the powers and duties of the IO under the BM Ordinance are to be exercised and performed by the Management Committee on behalf of the IO. A person such as the Claimant and its representatives are therefore entitled to rely on the BM Ordinance, and to enter into contracts and dealings with the Management Committee on the basis that the Management Committee has powers to act for and bind the IO. It is normal practice, and certainly not unusual, for contracts relating to the property to be signed by the chairman, with the secretary and other members of the management committee of the corporation of owners of a building. 41. There is some support for my conclusion, from the decision of the Court of Appeal in Chow Sin Yee Theresa v Tang Chi Tak and Others , unreported, CACV 145/2009. There, Hon Tang VP (as he then was) stated (in paragraphs 50 to 52 of the judgment) his view that owners at a general meeting may delegate to a management committee the power to decide on the selection of a tenderer, and further, that “there is much to be said in favor of a positive answer” to the question of whether a management committee has the ostensible or apparent authority to bind the incorporated owners. Tang VP referred to s 29 of the BM Ordinance, and observed that a third party should be entitled to rely on the section, since such third party would not be in a position to know whether the necessary resolution has been passed, or properly passed. Tang VP was, of course, referring generally to the management committee when it acts collectively. 42. The Courts have held that a management committee of the owners’ incorporation is not a legal entity distinct from the owners’ incorporation. In that context, in The Incorporated Owners of Kwai Wan Industrial Building v Kwai Fung Industrial Ltd LDBM 208/2002, [2005] HKEC 374, Hon Chu J (as she then was) made the following observations on the powers, duties and capacity of a management committee and members thereof: “For my part, I am unable to agree that in law, a management committee of an incorporated owners is a legal entity distinct from the incorporated owners. The legal position of a management committee has been substantively summarized by His Honour Judge L Chan in the recent decision of The 1 st Management Committee of the Incorporated Owners of Hanley Villas v The 2 nd Management Committee of the Incorporated Owners of Hanley Villas (unrep) LDBM 73 of 2004 at para 6 as follows: ‘A management committee of an incorporated owners of a multi‑storey building or a housing estate is just like the board of directors of a limited company. The company is a legal person but the board of directors is not. The fact that s 45 of the Building Management Ordinance , Cap 344 has included a management committee as one of the persons who is competent to commence proceedings in the Tribunal under that section is, without more, insufficient to make the management committee a legal person. When the interest of the company is an issue, it is the company that can sue or be sued in its own name, not the board of directors. The board of directors is not a legal person independent of the company. The same applies to an incorporated owners and its management committee.’ I will additionally point out that a management committee is in essence a body of natural persons who are the office bearers of the incorporated owners. Their appointments are regulated by the Building Management Ordinance . They are appointed for the purpose of carrying out the powers and duties of, and to make collective decisions for the incorporated owners, through and under the name of the management committee. In so far as they are intra vires, decisions and acts taken by the members of a management committee are not only the decisions and acts of the management committee, but also those of the incorporated owners ...” (Emphasis added) 43. When the Claimant in this case dealt with the Office Bearers, it dealt with them as members of the Management Committee acting collectively, and not with any of them individually. The Office Bearers, as members of the Management Committee, are the agents of the Management Committee and the IO, and had the usual and apparent authority of the Management Committee, to collectively sign contracts in the name and on behalf of the IO. This included the signing of the Contract with the Claimant for the Project Works. The Contract in this case was signed not by the Chairman, or any one of the Office Bearers, individually. They signed together, as a Management Committee normally would. The Claimant, like any other third party, would not know if there had been a resolution validly passed or decision made collectively at a meeting of the Management Committee. 44. Even if (as the IO claim) the Claimant was informed on 8 November 2011 that the Management Committee was temporarily suspending the signing of the Contract in view of the request of the Objecting Owners to have another owners’ meeting to discuss again the Project Works, I do not consider that, on the evidence, it was either unreasonable, irrational or dishonest on the Claimant’s part not to make further inquiries when they were presented on 10 December 2011 with the Contract which was signed by the Office Bearers. According to the minutes of 8 November 2011, the decision of the Management Committee was to “suspend” the signing of the Contract “temporarily”, in view of the Objecting Owners’ proposal to convene a further general meeting of the owners. It is not alleged that the Claimant had been informed, either on 8 November 2011 or any time before late December 2011, that the IO had decided to cancel the signing of the Contract, or to revoke the IO Resolution of 23 October 2011. It is common ground that the Claimant had no further dealings with the IO or the Management Committee between 8 November 2011 and 10 December 2011. Even if the Claimant had been informed that the signing of the Contract was suspended for the time being, it was not unreasonable for the Claimant’s representatives to believe or to assume, on 10 December 2011, that a further owners’ meeting had been held after 8 November 2011, or that the IO or the Management Committee had eventually (and collectively) resolved to proceed with the signing, or that the Objecting Owners had been persuaded either to proceed with the Contract or to withdraw their earlier objections, and that the issues raised at the 8 November 2011 meeting had been resolved. I do not agree that it was a question of the Claimant turning a blind eye to the question of the Office Bearers’ authority. In my view, it made no business sense for the Claimant to dispute or question the authority of the Office Bearers in all the circumstances of this case, including the events which transpired at the meeting on 8 November 2011, the reason given for the suspension of the signing of the Contract, and the lapse of time from 8 November 2011 to 11 December 2011, as well as the correspondence between the Claimant and the Consultant shortly after 11 December 2011. 45. I would accordingly agree with the Arbitrator that the Office Bearers had the ostensible authority to sign the Contract on behalf of, and to bind, the IO. Whether the arbitration clause in the Contract extends to the disputes as to whether the Contract existed 46. Clause 35 (1) of the Contract contains the arbitration agreement relied upon by the Claimant (“ Arbitration Clause ”). This provides: “無論是在本工程施工期間或工程完成或被放棄之後,僱主和承建商之間,對合同的解釋或與對合同有關的任何問題,若有任何爭議或歧見(包括所有在本合同由僱主自行決定的事宜,或僱主扣押該等承建商認為應發出的證書或按條件30(5)(a)所述有關工程量量度及價款計算事宜,或按合同條件25,26,32及33所述有關雙方的權利和責任的事宜),則有關爭議或歧見須提交香港國際仲裁中心按其仲裁規則進行仲裁解決。” (Whether in the course of execution of these project works or upon completion or abandonment of the project, as between the employer and the contractor, any question concerning the interpretation of the contract or relating to the contract, any dispute or difference (including...) shall be referred to the Hong Kong International Arbitration Centre for arbitration in accordance with its arbitration rules.) 47. On behalf of the IO, it was argued that the Arbitration Clause does not cover disputes as to whether there was a contract between the parties in the first place. Mr Chan SC relies on authorities which show that the phrases “any dispute arising out of” or “arising under” a contract, and “all disputes in relation to or in connection with the contract”, do not include disputes as to whether there was ever a contract ( Fiona Trust and Holding Corp & Others v Privalov & Ors [2007] EWCA Civ 20 , para 18; Chitty on Contracts Hong Kong Specific Contracts (4 th edition) at para 2‑036). 48. On the construction of arbitration clauses, recent authorities (such as Ashville Investments Ltd v Elmer Contractors Ltd [1989] 1 QB 488 ) support the view that the courts will make the prima facie assumption that parties intended that all disputes relating to a particular transaction would be resolved by the same tribunal, and that by agreeing to arbitrate they have prima facie chosen arbitration as the appropriate tribunal. Words of broad import, such as “in connection with this contract” are to be given their natural meaning in the context in which they are found, and are not to be cut down by reference to earlier decisions giving a narrower meaning to the same or similar expressions in other contexts ( Mustill & Boyd’s Commercial Arbitration , 2 nd edition, p 118). 49. The nature of an arbitration agreement should particularly be borne in mind, and in the words of Lord Hoffman in Fili Shipping Co Ltd and Others v Premium Nafta Products Ltd and others [2007] UKHL 40 : “5. … Arbitration is consensual. It depends upon the intention of the parties as expressed in their agreement. Only the agreement can tell you what kind of disputes they intended to submit to arbitration. But the meaning which parties intended to express by the words which they used will be affected by the commercial background and the reader’s understanding of the purpose for which the agreement was made. Businessmen in particular are assumed to have entered into agreements to achieve some rational commercial purpose and an understanding of this purpose will influence the way in which one interprets their language. 6. In approaching the question of construction, it is therefore necessary to inquire into the purpose of the arbitration clause. … The parties have entered into a relationship, an agreement or what is alleged to be an agreement or what appears on its face to be an agreement, which may give rise to disputes. They want those disputes decided by a tribunal which they have chosen, commonly on the grounds of such matters as its neutrality, expertise and privacy, the availability of legal services at the seat of the arbitration and the unobtrusive efficiency of its supervisory law. Particularly in the case of international contracts, they want a quick and efficient adjudication and do not want to take the risks of delay and, in too many cases, partiality, in proceedings before a national jurisdiction. … 13. In my opinion the construction of an arbitration clause should start from the assumption that the parties, as rational businessmen, are likely to have intended any dispute arising out of the relationship into which they have entered or purported to enter to be decided by the same tribunal. The clause should be construed in accordance with this presumption unless the language makes it clear that certain questions were intended to be excluded from the arbitrator’s jurisdiction. ” (Emphasis added) 50. In Born’s International Commercial Arbitration, Vol 1 International Arbitration Agreements , 2 nd edition, paragraph 9.02 [A] at p 1319, the learned author also refers to the presumption favoring centralized “one‑stop” dispute resolution as a liberal rule of interpretation of the scope of an arbitration agreement, on the basis that “rational businesspersons, acting in good faith, do not desire their disputes to be resolved in multiplicitous proceedings that impose costs, delays and the risks of inconsistent results, but instead desire a single, centralized forum for resolving their disputes”. 51. To the extent that the earlier decisions of the Courts are based on the premise that an arbitrator cannot make a binding award as to the initial existence of the agreement from which his jurisdiction is said to derive, it is relevant and important to bear in mind the doctrines of Kompetenz-Kompetenz and separability, given effect by Article 16 (1) of the Model Law and s 34 of the Ordinance. Article 16 (1) provides that the arbitral tribunal may rule on its own jurisdiction, “including any objections with respect to the existence or validity of the arbitration agreement”. For that purpose, the arbitration clause which forms part of a contract “shall be treated as an agreement independent of the other terms of the contract”, such that a decision that the contract is null and void “shall not entail ipso jure the invalidity of the arbitration clause”. 52. In relation to the authorities relied upon by Mr Chan SC in support of the construction he seeks this Court to adopt of the Arbitration Clause, I do not agree that the Arbitration Clause should be interpreted to refer to disputes “arising out of” or disputes “arising under” the Contract. On my construction, the language used in clause 35 (1) is of considerable width. The expressions “differences (歧見)”, “disputes (爭議)”, any question “in connection with” or “relating to” the Contract (“對合同有關的任何問題”) should all be given a wide meaning. Further, the clause starts with “無論” (“whether” or “irrespective of”). Hence, the questions or disputes identified within the Arbitration Clause itself: ie disputes or differences arising in the course of the execution of the Contract works or upon completion or abandonment of the Project, are neither exclusive nor exhaustive of the disputes which should be referred to arbitration. In essence, any dispute or difference concerning the interpretation of the Contract and any question relating to or in connection with the Contract are to be referred to arbitration. A dispute or difference as to whether the Contract has binding effect on the IO, or is in existence, relates to the Contract and is within the scope of the Arbitration Clause. 53. As Lord Hoffman rationalized in Fili Shipping Co Ltd and Others v Premium Nafta Products Ltd and others , it cannot have been the intention of the IO and the Claimant, as reasonable commercial men and contracting parties in the modern world, to have intended to have one tribunal to deal with the question of the existence and binding effect of the Contract, and another tribunal to deal with any further or other dispute as to the execution of the Project Works. If they had so intended, it would have been simple for them to expressly so provide in the Arbitration Clause, by stating that all disputes are to be arbitrated, save for any dispute as to whether the Contract was valid or in existence, or had binding effect. 54. Even in the case of the Fiona Trust cited by Mr Chan SC, the Court held that a dispute whether the contract could be set aside or rescinded for alleged bribery did fall within the arbitration clause on its true construction. Having referred to earlier authorities concerning the meaning of clauses such as “dispute arising out of” and “dispute arising under”, Longmore LJ stated in paragraph 17 of his judgment: “Not all these authorities are readily reconcilable but they are well known in this field and some or all are invariably cited by counsel in cases such as this. Hearings and judgments get longer as new authorities have to be considered. For our part we consider that the time has now come for a line of some sort to be drawn and a fresh start made at any rate for cases arising in an international commercial context. Ordinary businessmen would be surprised at the nice distinctions drawn in the cases and the time taken up by argument in debating whether a particular case falls within one set of words or another very similar set of words. If business men go to the trouble of agreeing that their disputes be heard in the courts of a particular country or by a tribunal of their choice they do not expect (at any rate when they are making the contract in the first place) that time and expense will be taken in lengthy argument about the nature of particular causes of action and whether any particular cause of action comes within the meaning of the particular phrasing have chosen in their arbitration clause. If any businessman did want to exclude disputes about the validity of a contract, it would be comparatively simple to say so.” 55. I see no justification for making a distinction between businessmen dealing in an international commercial context, and reasonable persons dealing in a local business context, or owners of properties dealing with contractors for a large scale renovation and maintenance project as in this case. 56. Mr Chan SC cited paragraph 18 of Longmore LJ's judgment in Fiona Trust , in which reference was made to cases on the words “arising out of” and to Mustill & Boyd, Commercial Arbitration (2 nd edition) p 120. These should be read subject to the passages on p 118 of Mustill & Boyd, Commercial Arbitration , to the broad principles of construction emerging from the more recent decisions, summarized above, and to the Lord Justice’s own observations set out in paragraph 17 of his judgment. 57. I conclude, therefore, that the Arbitration Clause extends to the dispute between the parties as to whether or not the Contract existed, or was properly made to bind the IO. Orders made 58. For all the above reasons, I dismiss the application to set aside the Award, that the Arbitrator has jurisdiction in the Arbitration. I make an order nisi that the costs of the application to set aside be paid by the IO to the Claimant, on an indemnity basis, with certificate for counsel ( A v R (Arbitration: Enforcement) [2009] 3 HKLRD 389 ). (Mimmie Chan) Judge of the Court of First Instance High Court Mr Edward Chan, SC and Ms Prisca Cheung, instructed by SH Chan & Co, for the plaintiff Mr Anthony Chan and Mr Solomon Lam, instructed by Cheung & Liu, for the defendant Look up this case on Lawcite Noteup",
  "length": 53586,
  "headers_seen": [
    "Background",
    "Whether the application is out of time",
    "Did the Office Bearers have actual authority to sign the Contract and the arbitration clause?",
    "Did the Office Bearers have ostensible authority to sign the Contract and the arbitration clause?",
    "Whether the arbitration clause in the Contract extends to the disputes as to whether the Contract existed",
    "Orders made"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2015/928",
  "query": "kompetenz-kompetenz",
  "ts": "2025-10-16T10:51:33",
  "ok": true
}