{
  "title": "W V. AW | [2021] HKCFI 1707 | HKLII",
  "court": null,
  "year": 2021,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2021] HKCFI 1707 W V. AW Judgment Information Date 16 Jun, 2021 Action No. HCCT70/2020 Neutral Cit. [2021] HKCFI 1707 Parallel Cit. [2021] 5 HKC 476 Download MS Word Judgment Reading Options Translation Toggle Highlight Appeal History HCCT70/2020 HCCT70/2020 W v. AW HCCT 70/2020 [2021] HKCFI 1707 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO 70 OF 2020 ____________________ IN THE MATTER of the Share Redemption Agreement entered into between the Applicant and the Respondent on 15 December 2015 and IN THE MATTER of an Arbitration in respect of the Share Redemption Agreement and IN THE MATTER of an application to set aside the Final Award dated 13 July 2020 under section 81 of the Arbitration Ordinance ( Cap 609 ) and Order 73 of the Rules of the High Court ( Cap 4A ) ____________________ BETWEEN W Applicant and AW Respondent ____________________ Before: Hon Mimmie Chan J in Chambers Date of Hearing: 22 March 2021 Date of Decision: 17 June 2021 _____________ D E C I S I O N _____________ Introduction 1. This is a highly unusual case. 2. The Applicant (“ W ”) and the Respondent (“ AW ”) were parties to a Share Redemption Agreement made on 15 December 2015 (“ Share Redemption Agreement ”), for AW to redeem its shares held by W. W, AW, BJ AW (a company controlled by AW), Mr P (“ PY ”) who is the sole shareholder and director of W, and 3 other shareholders of AW and BJ AW were parties to a separate Framework Agreement made on 21 September 2015 (“ Framework Agreement ”). The Framework Agreement and the Share Redemption Agreement were both made in relation to the shareholding of PY/W in AW, and were part of a series of transactions leading up to an envisaged acquisition by a Mainland investor of 80% of the interests and shares in BJ AW. 3. Disputes arose between the parties under the two agreements, and such matters were referred to arbitration under and pursuant to the agreements: HKIAC xxxxx being the arbitration commenced by PY and W as Claimants, and AW, BJ AW and others as Respondents, under the Framework Agreement, on 25 January 2017 (“ Arbitration 1 ”); and HKIAC yyyyy being the arbitration commenced by AW as Claimant against W as Respondent, under the Share Redemption Agreement on 23 June 2017 (“ Arbitration 2 ”). W and AW were parties in both arbitrations. 4. The tribunal in Arbitration 1 consisted of Mr Anthony Neoh SC, Mr Tao Xiuming and Mr Philip Yang (“ Tribunal 1 ”). The tribunal in Arbitration 2 consisted of Ms Winnie Tam SC, Mr Tao Xiuming, and Mr Ing Loong Yang (“ Tribunal 2 ”). The common arbitrator was Mr Tao. 5. On 13 March 2020, the award in Arbitration 1 was handed down (“ Award 1 ”). On 13 July 2020, the award in Arbitration 2 was handed down (“ Award 2 ”). In Award 1, the tribunal found in favour of PY and W on their claims against the Respondents for breach of the Framework Agreement, and dismissed the Respondents’ Counterclaim, that the Framework Agreement had been induced by misrepresentations made by PY through W. In Award 2, the tribunal found in favour of AW’s claim of misrepresentation, and allowed AW to rescind the Share Redemption Agreement. Under Award 2, W is to repay a sum of US$3,792,558.70 to AW, with interest and costs. 6. On 12 October 2020, W applied in these proceedings to set aside the award in Arbitration 2, on the ground ( inter alia ) that Award 2 is in conflict with the public policy of Hong Kong, in that contrary to principles of fairness, due process and justice, the tribunal ignored findings on common issues which were already determined in Award 1, and instead made findings which were inconsistent with the findings made in Award 1 on the same issues between the same parties. It was highlighted that Mr Tao was a co-arbitrator in both arbitrations, and he had made findings in Award 2 which were inconsistent with the findings he had made in Award 1. The findings were essentially as to whether misrepresentations had been made by PY as to his shareholding (via his nominee W) in AW (“ Shareholding Representation ”), and/or that such ownership of shares was not subject to actual or potential disputes (“ Disputes Representation ”). 7. On 30 December 2020, AW applied by Summons for leave to enforce Award 2, for judgment to be entered in terms of Award 2, and for security to be provided by W in respect of the sums payable under Award 2, and for the costs of the proceedings (“ Summons ”). Background 8. The relationship between the parties and the disputes were summarized in the affirmation of PY filed in these proceedings, and set out in detail in the section headed “Brief Background” of Award 2, and in the section headed “Material Facts” in Award 1. 9. WG is a company registered in the British Virgin Islands, and at all material times was wholly owned and controlled by PY, a Mainland citizen. 10. BJ AW was a Mainland company which carried on a mobile advertising application business. Prior to September 2015, BJ AW was subject to a series of variable interest entity (“ VIE ”) contracts, through which the profits of BJ AW were channeled to AW, which is a company registered in the Cayman Islands. WG was one of the shareholders of AW. 11. In 2012, PY and W had entered into share transfer agreements with 3 individuals (“ L, Wg and F ”), whereby W agreed to sell part of its shareholding in AW to these individuals. On PY’s case, which was disputed by AW and the other Respondents in Arbitration 1, the share transfer and sale agreement with L were later terminated on 20 January 2013. 12. In around June 2015, a third party investor on the Mainland approached the management of BJ AW and negotiated for its acquisition of approximately 80% of the shareholding in BJ AW, referred to in the arbitrations as the “DGCM Transaction” (“ Acquisition ”). A Memorandum of Intent was signed for the Acquisition at a consideration of RMB 1.04 billion. BJ AW was valued at RMB 1.3 billion, and the proceeds of the sale of the shares were to be distributed to the shareholders based on the classes and percentage of their shareholding, pursuant to which PY was to receive a sum of RMB 152 million for the shares he held in the name of W. 13. A series of transactions were subsequently designed and entered into in order to pave way for the Acquisition. 14. On 11 and 12 September 2015, W repurchased from Wg and F the AW shares it had sold in 2012. 15. Also in September 2015, the VIE contracts for BJ AW were terminated by a VIE Termination Agreement (“ Termination Agreemen t”). 16. On 21 September 2015, the Framework Agreement was signed by the shareholders of AW, whereby the parties’ rights in relation to and under the Acquisition were set out. Under the Framework Agreement, the total consideration for the shares held in the name of W was increased from RMB 152 million to RMB 175 million. 17. On 15 December 2015, the Share Redemption Agreement was entered into between W and AW, as required under the Acquisition. Under the Share Redemption Agreement, AW agreed to redeem from W, and W agreed to sell to AW approximately 15.8 million shares at the purchase price of RMB 87.5 million. In Arbitration 2, AW claims (in paragraph 9 of the Statement of Claim) that prior to and/or at the time of the Share Redemption Agreement made in 2015, W had through PY made the Shareholding Representation (that PY owned through W 16.4% of the shareholding in AW prior to and at the time of the Termination Agreement) and the Disputes Representation (that the ownership and/or control of AW and/or BJ AW pertaining to the shares held by PY/his nominee were not subject to any actual or potential disputes). 18. The Acquisition was not completed. 19. PY and W claim in Arbitration 1 that the Respondents in the arbitration, which include AW, BJ AW and their shareholders, were in breach of the Framework Agreement and in particular clause 6 thereof, which provided that if the Acquisition was not completed by 30 June 2016, the parties to the Framework Agreement would cooperate to restore the shareholding of PY in BJ AW to 34%, and restore W’s shareholding in AW to 16.4% (“ Restoration Clause ”). The relief sought by PY and W in Arbitration 1 were for specific performance of the Framework Agreement, and in particular the Restoration Clause, and alternatively, damages for breach of the Framework Agreement. 20. By way of Counterclaim in Arbitration 1, AW, BJ AW and the shareholders made the claim (in paragraph 13 of the Statement of Defence and Counterclaim) that prior to and/or at the time of the Framework Agreement in September 2015, PY and/or W as PY’s nominee had made the Shareholding Representation and the Disputes Representation: that PY/W owned 16.4% of the shareholding in AW prior to and at the time of the Termination Agreement, and that such ownership was not subject to any actual or potential disputes. The pleading of representations made in Arbitration 1 and Arbitration 2 are identical. AW and BJ AW as Respondents in Arbitration 1 counterclaim for damages for misrepresentation, as well as for breach of the Framework Agreement and breach of fiduciary duties on the part of PY. 21. In Arbitration 2, AW’s claim against W was based on misrepresentations which had been made by WG prior to and/or at the time of the Share Redemption Agreement. It was claimed that the Shareholding Representation which had induced WG to enter into the Share Redemption Agreement was false, in that: PY had in 2012 assigned a part of his shareholding in AW to Wg, F and L; that proceedings were commenced by Wg and F against BJ AW and PY in August 2016; and PY did not in fact own 16.4% of the shareholding in AW prior to and at the time of the Termination Agreement on 10 September 2015. AW claimed in Arbitration 2 that the Share Redemption Agreement had been rescinded by W’s misrepresentations, and sought damages. 22. Despite the fact that the agreements which were the subject matter of Arbitration 1 and Arbitration 2 were different, it can be seen from the pleadings filed in the Arbitrations that the claims of misrepresentation made against W and PY were in fact identical, focusing on the shareholding of PY prior to and at the time of the Termination Agreement, and the absence of disputes affecting such shareholding at such time. 23. In its application for setting aside Award 2, W relies on various grounds. Firstly, it claims that it was unable to present its case in Arbitration 2 by virtue of the apparent bias of Ms Tam, the Presiding Arbitrator in Tribunal 2 (“ Presiding Arbitrator ”). Secondly, it claims that the arbitral procedure in Arbitration 2 was not in accordance with the agreement of the parties, when the Presiding Arbitrator failed to make full disclosure of her relationship with Counsel representing AW, at or before the hearing of Arbitration 2 and/or before the making of Award 2. Further, it claims that it is contrary to the principles of fairness, due process and justice which are part of Hong Kong’s public policy, when there was apparent bias on the part of the Presiding Arbitrator and where the full relationship between the Presiding Arbitrator and the legal team representing AW were not disclosed to W. 24. Finally, AW claims that Award 2 is in conflict with the public policy of Hong Kong, when Tribunal 2 was bound by the findings on common issues already determined in Award 1, but chose to ignore these findings without dealing with the matter of issue estoppel. AW claims that it is contrary to the principles of fairness, due process and justice for Tribunal 2 (which includes Mr Tao) to make findings on issues which are inconsistent with the earlier findings made by Tribunal 1 (also comprising Mr Tao) on the same issues decided between the same parties in Award 1. 25. The above grounds can be divided into the “Issue Estoppel Ground” and the “Apparent Bias Ground”. W’s claim of inability to present case is framed to be made on the basis of the Presiding Arbitrator’s apparent bias, and that it had been prevented from being able to present its case to an impartial tribunal. Application for security 26. The principles applicable to an application for security made under Order 73 rule 10A RHC are as set out in Soleh Boneh International Ltd v Government of the Republic of Uganda [1993] 2 Lloyd’s Rep 208, as applied in Hong Kong in Weili Su v Sheng Kang Fei [2019] 2 HKLRD 1214 and X v Jemmy Chien [2019] HKCFI 2172 , are undisputed by the parties, and will not be repeated here. 27. AW also seeks security under section 905 of the Companies Ordinance and Order 23 rule 1 RHC, on the basis that W is incorporated outside Hong Kong. AW relies on the fact that W was maintained as a corporate vehicle of PY to hold assets in offshore jurisdictions. It does not maintain any substantive business and had never claimed to have substantial assets in Hong Kong. AW recognizes however that the Court has a discretion whether or not to order security under these provisions, having regard to all the circumstances of the case, and that the Court will consider whether there is credible evidence to establish some reason to believe that a foreign plaintiff is unable to pay costs, and whether it would be just to order security. Merits of setting aside application 28. As held in Soleh Boneh , the first important factor to be considered on an application for security is the strength of the argument that the arbitral award is invalid. This is as perceived on a brief consideration by the Court which is asked to enforce the arbitral award. If the award is manifestly invalid, there should be no order for security. If it is manifestly valid, there should either be an order for immediate enforcement, or else an order for substantial security. 29. The merits of the application to set aside the arbitral award would of course be one of the circumstances to be considered by the Court, when considering whether to exercise its discretion to order security under Order 23, on the basis that it would be just so to do. Issue Estoppel Ground Applicable legal principles 30. Counsel for W relies on the principles of issue estoppel referred to by Toby Landau QC in “Arbitral Groundhog Day: The Reopening and Rearguing of Arbitral Determination” (2020) 2 SIArb J 1 at para 16: “ Issue estoppel may arise where a particular issue of fact and law forming a necessary ingredient in a cause of action has been litigated and decided by a competent forum . The concept includes the reopening of that particular issue in subsequent proceedings (a) between the same parties (or their privies) but (b) involving a different cause of action to which the same issue is relevant .” 31. The legal test for “issue estoppel” was helpfully summarized by Master Marlene Ng (as Her Ladyship then was) in Mohammed Amjad v John M Pickavant & Co [2013] 1 HKC 145 : “52. A decision will create an issue estoppel if it determines an issue in a cause of action as an essential step in its reasoning . Issue estoppel applies to fundamental issues determined in an earlier proceeding which formed the basis of the judgment (see Spencer, Bower and Handley, Res Judicata 4 th ed para.8/01 at p.103 and Hoystead & ors v Commissioner of Taxation [1926] AC 155 ). 53. In Thoday v Thoday [1964] P 181 , 198, Diplock LJ said as follows: ‘… … “issue estoppel,” is an extension of the same rule of public policy. There are many causes of action which can only be established that two or more different conditions are fulfilled. Such causes of action involve as many separate issues between the parties as there are conditions to be fulfilled by the plaintiff in order to establish his cause of action; and there may be causes where the fulfilment of an identical condition is a requirement common to two or more different causes of action. If in litigation upon one such cause of action any such separate issues as to whether a particular condition has been fulfilled is determined by a court of competent jurisdiction , either upon evidence or upon admission by a party to the litigation, neither party can, in subsequent litigation between one another upon any cause of action which depends upon the fulfilment of the identical condition , assert that the condition was fulfilled if the court has in the first litigation determined that it was not, or deny that it was fulfilled if the court in the first litigation determined that it was. But “issue estoppel” must not be confused with “fact estoppel,” which, although a species of “estoppel in pais,” is not a species of estoppel per rem judicatam. The determination by a court of competent jurisdiction of the existence or non-existence of a fact, the existence of which is not of itself a condition the fulfilment was necessary to the cause of action which is being litigated before that court, but which is only relevant to proving the fulfilment of such a condition, does not estop at any rate per rem judicatam either party in subsequent litigation from asserting the existence or non-existence of the same fact contrary to the determination of the first court. It may not always be easy to draw the line between facts which give rise to “issue estoppel” and those which do not … …’ 54. A fuller statement is set out in Dixon J’s judgment in Blair v Curran (1939) 62 CLR 464 , 531-533: ‘ A judicial determination directly involving an issue of fact or of law disposes once and for all of the issue, so that it cannot afterwards be raised between the same parties or their privies. The estoppel covers only those matters which the prior judgment, decree or order necessarily established as the legal foundation or justification of its conclusion, whether that conclusion is that a money sum be recovered or that the doing of an act be commanded or be restrained or that rights be declared. … … in [issue estoppel], for the purpose of some other claim or cause of action, a state of fact or law is alleged or denied the existence of which is a matter necessarily decided by the prior judgment, decree or order. Nothing but what is legally indispensable to the conclusion is thus finally closed or precluded. In matters of fact the issue-estoppel is confined to those ultimate facts which form the ingredients in the cause of action , that is, the title to the right established. Where the conclusion is against the existence of a right or claim which in point of law depends upon a number of ingredients or ultimate facts the absence of any one of which would be enough to defeat the claim, the estoppel covers only the actual ground upon which the existence of the right was negatived. But in neither case is the estoppel confined to the final legal conclusion expressed in the judgment, decree or order. … … the judicial determination concludes, not merely as to the point actually decided, but as to a matter which it was necessary to decide and which was actually decided as the groundwork of the decision itself , though not then directly the point at issue. Matters cardinal to the latter claim or contention cannot be raised if to raise them is necessarily to assert that the former decision is erroneous. In the phraseology of Lord Shaw, “a fact fundamental to the decision arrived at” in the former proceedings and “the legal quality of the fact” must be taken as finally and conclusively established … … But matters of law or fact which are subsidiary or collateral are not covered by the estoppel. Findings, however deliberate and formal, which concern only evidentiary matters and not ultimate facts forming the very title to rights give rise to no preclusion. Decisions upon matters of law which amount to no more than steps in a process of reasoning tending to establish or support the proposition upon which the rights depend do not estop the parties if the same matters of law arise in subsequent litigation. The difficulty in the actual application of these conceptions is to distinguish the matters fundamental or cardinal to the prior decision or judgment, decree or order or necessarily involved in it as its legal justification or foundation from matters which even though actually raised and decided as being in the determining considerations, yet are not in point of law the essential foundation or groundwork of the judgment, decree or order. … ...’ (my emphasis) 55. A more modern formulation is found in Lord Keith’s judgment in Arnold & ors v National Westminster Bank plc [1991] 2 AC 93 , 105 as follows: ‘ Issue estoppel may arise where a particular issue forming a necessary ingredient in a cause of action has been litigated and decided and in subsequent proceedings between the same parties involving a different cause of action to which the same issue is relevant and one of the parties seeks to re-open that issue.’” 32. The above principles are quite settled and have not been disputed by Counsel for AW. 33. At first blush, it may appear that as Arbitration 1 and Arbitration 2 deal with different causes of action on the basis of different agreements made on slightly different dates, the fact that the Awards produced different results may not be surprising, as findings may have been made on different facts, against different terms and conditions contained in the different agreements, involving different statements or representations claimed to have been made. However, a careful review of the pleadings served in the 2 Arbitrations, and of the findings of facts made in the 2 Awards, reveal that there were indeed inconsistencies and contradictions which cannot be reconciled on the basis of the same facts, the same terms or contents of the representations, and the dates when the representations were claimed and found to have been made. These inconsistencies in findings raise concerns as to whether it would be just to permit the 2 Awards to stand and bind the same parties in the 2 Arbitrations, namely AW and W/PY. That may turn on whether W and PY can be said to have been at fault, in failing to draw to the attention of Tribunal 2, before Award 2 was handed down, the fact that Award 1 had been made and that findings had been made on the issues between W and PY on misrepresentations. 34. What has to be borne in mind is that the claim made by AW in Arbitration 2, that the Share Redemption Agreement was induced by PY’s misrepresentations, and its claim in Arbitration 1 that the Framework Agreement contained representations which were false and further, that the Framework Agreement itself was induced by PY’s misrepresentations, focused and turned on the same alleged representations which were said to have been made, and which were false. The representations were that prior to and at the time of the Termination Agreement , PY/W held 16.4% of the shareholding in AW, and that such shares were not subject to any actual or potential disputes. 35. The Tribunal in Arbitration 1 found that there was no actionable misrepresentation. Various reasons were given. It found that the material time for consideration of whether there was any misrepresentation was 16 September 2015 , which was the date on which PY signed the Termination Agreement. Tribunal 1 found that the Termination Agreement does not refer to any potential or anticipated litigation or arbitration, and PY did not represent or warrant his shareholding or the existence of actual or potential litigation or arbitration, whether before the execution of the Framework Agreement (which was on 21 September 2015) or in its performance. According to Tribunal 1, PY only knew of the problems concerning Wg and F on 22 April 2016, which was after the date when PY bought back the shares from Wg and F, on 11 and 12 September 2015. The Undertaking signed by PY on 22 October 2015 only represented the position of BJ AW (and not AW) and PY was justified in believing that only his title in the AW shares were at risk. At the relevant time of the Termination Agreement , there was no potential or anticipated litigation or arbitration between PY and Wg and F, and accordingly there was no misrepresentation as to disputes over PY’s shareholding in AW. 36. Tribunal 1 considered that there was no duty on PY to make voluntary disclosure of the Acquisition to Wg and F when they negotiated the buying back of the AW shares. As Wg and F only sought damages in their litigation with PY on the Mainland, and did not seek rescission of their sale to PY, the validity of the chain of transactions required under the Acquisition would not be affected to constitute the Dispute Representation false. After PY had purchased back the AW shares from Wg and F, he was legally and factually the owner of the shares, and there was no falsity in the Shareholding Representation at the material time. 37. The relevant parts of the findings made by Tribunal 1 are set out in the following paragraphs of Award 1: “172. On reviewing the evidence, the Tribunal is not persuaded that there was an actionable misrepresentation in this case… … 175. As to the dates in dispute, it was mentioned in the footnote of Para.55 in that the 10 September 2015 was stated in the Agreement to be the effective date. But PY said he signed it on 16 September 2015, which is a date after the shares to Wg and F had been brought back. As was mentioned earlier, by then, PY should be considered as legally and factually owning the shares. Hence, PY maintained he did not misrepresent his shareholding. 176. The Tribunal accepts the Claimants’ or PY’s arguments, as his evidence was not contradicted. Furthermore, it is the date of PY putting his signature on the Agreement that matters when it comes to an alleged wrong-doing of misrepresentation or an erroneous warranty. 177. The Tribunal further holds that the buying back of shares from Wg and F must be apparent even before the dates on 11 & 12 September 2015 when the Shares Transfer Agreements were signed, which was a formality. Therefore even if the date of the VIE Termination Agreement of 10 September 2012 should be the date to measure whether PY had misrepresented or erroneously warranted the facts regarding shareholding, the Tribunal is not persuaded that the Respondents have proved that PY was in breach. … 180. To conclude, based on what was said earlier regarding the analysis of whether PY has had any wrong-doing, especially after the Share Transfer Agreements were entered into with Wg and F, the Tribunal finds and holds that PY had not been in breach of any duty of disclosure in entering into the VIE Termination Agreement on either 10 or 16 September 2015. … 185. … The Tribunal therefore accepts that PY had made no fraudulent or intentional misrepresentation or erroneous warranty in these two documents. 186. If the Tribunal has to go further and decide whether or not there was any misrepresentation at all, whether innocent or negligent, the Tribunal would still, on balance, say ‘No’ …” 38. It has to be highlighted, that both Award 1 and Award 2 were unanimous decisions. 39. Tribunal 2 reached different conclusions on various matters in the same sequence of events between the parties. 40. Tribunal 2 found that the Share Redemption Agreement was rescinded by misrepresentations made by PY via W prior to and/or at the time of the Share Redemption Agreement. In reaching such decision, Tribunal 2 made findings of fact on essential ingredients of the cause of action of misrepresentation which were decided by Tribunal 1 as an essential step in Tribunal 1’s reasoning. 41. Tribunal 2 found that the Termination Agreement took effect on the date of its signing on 10 September 2015. It rejected PY’s evidence that the Termination Agreement was signed on 16 September 2015. Tribunal 2 found that the Termination Agreement itself contained a Disputes Representation in clause 2 thereof (which included a “guarantee” or warranty that there was no litigation, arbitration, legal, administrative or other procedural or government investigation relating to the Termination Agreement). Tribunal 2 also found that the Shareholding Representation and the Disputes Representation were contained in the Framework Agreement itself. The Shareholding Representation and the Disputes Representation were also found to be contained in the Undertakings signed by PW on 22 October 2015. 42. According to Tribunal 2, the relevant shareholding of PY/W in AW and BJ AW was not free from actual or potential dispute. Tribunal 2 found that PY had not informed Wg and F of the Acquisition, nor the termination of the VIE structure, which had impact on their rights. Tribunal 2 concluded that the Disputes Representation was false at the time when the Termination Agreement took effect on 10 September 2015. According to Tribunal 2, the shareholding dispute as between W/PY and Wg over the AW shares constituted serious flaws or error of lack of clarity in the title of the shares under acquisition. 43. Tribunal 2 considered that the Shareholding Representation was false at the material time, and at least at the time of the Termination Agreement , by reason of the share transfers to Wg, F and L and the nominee shareholding arrangements. Materially, Tribunal 2 rejected PY’s assertion that it was only in April 2016 that he knew of the dispute over his repurchase of shares from Wg and F. 44. The decision of Tribunal 2, as summarized in Award 2, is set out below: “373. Having carefully considered the evidence and the arguments ably advanced by the Parties’ respective Counsel, the Tribunal finds that W/PY had made the Shareholding Representation and the Disputes Representation on multiple occasions prior to and at the time of the Share Redemption Agreement, including in the following documents- (1) at Clause 4.1.1 and 5.1 of the Share Redemption Agreement , (2) at Clause 2 of the VIE Termination Agreement , (3) at Clause 4.4 of the RMB 208 million Capital Increase Agreement, (4) at Clause 8.2 and 8.3 of the 1 st SIAACI Agreement, (5) by the AW Undertakings signed by PY, and (6) in the Framework Agreement . 374. Given the representations were made consistently, and in the same course of dealings in different steps of an integral transaction towards one investment goal, the Tribunal accepts the Claimant’s counsel’s submissions that they are of a continuing nature and should be read as a whole. … 380. The Tribunal accepts AW Cayman’s submission, that on the basis the VIE Termination Agreement took effect from 10 September 2015, the Respondent cannot honestly suggest that the relevant AW Cayman/AW BJ shareholding was free from dispute or potential dispute. PY did not inform Wg and F of the DGCM Transaction or the termination of the VIE structure, both of which clearly impacted on their rights. The termination would have immediately entitled F to be registered as a shareholder of AW BJ. … - The Disputes Representation … 394. The Tribunal finds that the Disputes Representation was false at all material times. … - The Shareholding Representation 399. The Tribunal is satisfied on the evidence put before it that the Shareholding Representation was false at the material times, and at least at the time of the VIE Termination Agreement, by reason of the share transfer to L and the Nominee Shareholding Arrangements. … 403. The Tribunal finds that the parties had agreed for the VIE Termination Agreement to take effect on the date stated to be the date of execution of the agreement, which is 10 September 2015 . The Tribunal does not accept as credible the evidence of PY on the date of signing of the agreement not being 10 September 2015, but 16 September 2015, a date later than the completion of his share repurchases. The assertion has the hallmark of a theory advanced as an afterthought by PY, assisted by Feng Zhaohui, and is unsupported by any contemporaneous documentary evidence. Rather, it contradicts the clearly agreed effective date on the face of the agreement. It also contradicts the Respondent’s own pleaded case, and contemporaneous evidence. 404. The Tribunal is therefore satisfied that the Shareholding Representation was also false at the material times, i.e. at least at the date of the VIE Termination Agreement, in view of the share transfers made to Wg and F.” 45. Although the issue for determination by Tribunal 1 was whether misrepresentations had been made prior to and/or at the time of the Framework Agreement (signed on 21 September 2015), and the issue for Tribunal 2 was whether misrepresentations had been made prior to and/or at the time of the Share Redemption Agreement (signed in December 2015), the representations which were found by Tribunal 2 to have been made were found to be contained in the Framework Agreement itself and in the Termination Agreement made in September 2015 (be it 10 or 16 September), which was within the timeframe examined by Tribunal 1, when it considered whether there were misrepresentations made prior to and/or at the time of the Framework Agreement. The Framework Agreement and the Termination Agreement had both been considered by Tribunal 1 when it found that there was no misrepresentation made by PY. 46. The fact that Tribunal 1 and Tribunal 2 made inconsistent findings, on the same issues of fact and law forming a necessary ingredient in the cause of action of misrepresentation, is in my judgment clear from the Awards. 47. On behalf of AW, it was contended that Tribunal 2 cannot be faulted when W had failed to inform Tribunal 2 that Award 1 had been handed down on 13 March 2020, and that the findings made in Award 1 were relevant to the decision of Tribunal 2 on the claims made and issues raised in Arbitration 2. Closing submissions in Arbitration 1 were made on 7 December 2019. Closing submissions in Arbitration 2 were made on 29 November 2019. Award 1 was handed down on 13 March 2020, and Counsel argued that it was open to W to refer Award 1 to Tribunal 2, before Award 2 was handed down on 13 July 2020. 48. Counsel for AW argued that arbitration proceedings are adversarial. The tribunal can only decide on the issues raised and pleaded, on submissions made by the parties to the arbitration. Tribunal 2 cannot be expected to deal with the issues decided in Award 1, when issue estoppel was not pleaded, and when the Tribunal was not informed of Award 1 and the potential problems raised. Counsel argued that it would have been wrong for Tribunal 2 to deal with an issue not submitted by the parties to the arbitration. It was also highlighted that W had not at any time applied to Tribunal 2 to stay Arbitration 2 pending the outcome of Arbitration 1. 49. W argued that it was only after Award 2 was handed down that it was made aware of the findings made by Tribunal 2 and that such findings were inconsistent with those made in Award 1. W cannot dispute that it had not drawn the attention of Tribunal 2 to Award 1. However, throughout the course of the hearing in Arbitration 2, W had advised Tribunal 2 that there were concurrent arbitration proceedings between the parties, and that there was a risk of inconsistent findings being made on the issues. Counsel for W highlighted the distinguishing feature in this case, that Mr Tao on Tribunal 2 was also a member of Tribunal 1, and that Mr Tao was obviously aware of the issues decided in Award 1. Mr Tao must be aware that Award 1 contained findings on the essential ingredients and conditions necessary for the findings on misrepresentations which were made in Award 2. Mr Tao did not issue any dissenting decision in Award 1, nor in Award 2. This meant that Mr Tao himself made inconsistent findings on the same facts which called for decision in the 2 Arbitrations. 50. It is of course trite that arbitral awards are final and binding between the parties to the arbitration. In an application to set aside or oppose enforcement of an arbitral award, the Court does not sit on appeal to review the correctness of the award on either facts or law. It may be said that Tribunal 2 was wrong in law to have ignored the principles of issue estoppel, but this is not a ground to set aside Award 2. 51. However, the Court is concerned with the structural integrity of the arbitral process and the arbitral award. If there is conduct which is serious, or egregious, such that due process is undermined (the conduct described in Grand Pacific Holdings Ltd v Pacific China Holdings Ltd (in liq) (No 1) [2012] 4 HKLRD 1 (CA) at paras 94 and 105), the Court may consider whether the award should be enforced, or set aside on the ground of public policy. 52. In this case, as Counsel for W highlighted, Mr Tao was a member on both Tribunal 1 and Tribunal 2. He did not issue any dissenting decision in either Arbitrations, meaning that he agreed with all the findings made in Award 1 and Award 2, despite their being inconsistent and/or leading to different results. Mr Tao did not explain in Award 2 why the findings on the same facts were different, or why he did not consider W and AW to be bound by the findings made in Award 1. Having submitted its dispute to Tribunal 2 for decision in Arbitration 2, W was entitled to expect Tribunal 2, including Mr Tao, to deal with the question of issue estoppel after Award 1 was handed down, when Mr Tao dealt with the same facts differently in resolving the disputes in Arbitration 2. His failure to deal with and explain the inconsistent findings constitutes injustice and grave unfairness to W ( A v B [2015] 3 HKLRD 586 ). 53. When Mr Tao became aware of the findings made in Award 1, fairness and the justice of the case required him to invite submissions to be made by W and AW in Arbitration 2, as to the effect of Award 1 on the issues to be decided in Arbitration 2. By doing so, Tribunal 2 would have the benefit of hearing submissions from the parties, as to whether the parties and Tribunal 2 were bound by the findings made by Tribunal 1, and how and the extent to which they were bound. The parties were entitled to be heard before any inconsistent findings were made against either of them. 54. I accept the submissions made for W, that confidentiality of Arbitration 1 and Award 1 does not prevent Mr Tao from disclosing Award 1 to the other members of Tribunal 2. As the Judicial Committee of the Privy Council explained in AEGIS Ltd v European Reinsurance Co of Zürich [2003] 1 WLR 104 1, the legitimate use of an earlier award in a later arbitration between the same parties would not raise the mischief against which confidentiality rules are directed. 55. I do not consider that W can be said to be at fault simply by having appointed different arbitrators to the Arbitrations, when it knew that AW had appointed the same arbitrator, namely Mr Tao, for both. It is the right of a party to appoint any arbitrator of its choice. It is entitled to expect that whoever it appoints, the candidate would discharge his/her duty to act fairly and impartially. 56. On the facts of this case, I accept that Award 2 is manifestly invalid. It would be contrary to our conceptions of justice to enforce Award 2, and there is substantial injustice arising out of Award 2, by virtue of the findings made in Award 2 which contradicted and were inconsistent with the findings which had already been made by Tribunal 1 on the same issues, and which findings were binding on AW and W, the same parties in the two Awards. This is considered in conjunction with the lack of explanation in Award 2 as to why there were such inconsistent findings, and the failure on the part of Tribunal 2 to give W and AW the opportunity to address Tribunal 2 on Award 1, before Tribunal 2 made its award in Arbitration 2. Material to my decision on the invalidity of Award 2 is the fact that there was a common arbitrator in Tribunal 1 and Tribunal 2. 57. Setting aside an award is an undesirable decision to make, but as emphasized in Sun Tian Gang v Hong Kong & China Gas (Jilin) Limited [2016] 5 HKLRD 221 , fairness and due process underpin the arbitral process and are the prerequisites for the recognition it is afforded by the courts. Absent these underpinning factors, Award 2 cannot be enforced. Apparent Bias Ground Applicable legal principles 58. Again, the principles are settled and are not disputed. The legal test for apparent bias was explained in Jung Science Information Technology Co, Ltd v ZTE Corporation [2008] 4 HKLRD 776 : “The same test applies in determining an issue of apparent bias on the part of arbitrators as it does to judges… The parties agree that the test is whether an objective fair-mind and informed observer, having considered the relevant facts, would conclude that there was a real possibility that the tribunal was biased… The test is not whether the particular litigant thinks or feels that the judge has been or may have been biased… What matters is the viewpoint of the hypothetical objective fair‑minded and informed observer. Such an observer was described as follows by Kirby, J in Johnson v Johnson (2000) 201 CLR 488 at pp 508-509, 53, which description was cited as being worth repeating in full by Burrell J in Pacific China Holdings Ltd v Grand Pacific holdings Ltd at p 749, 16: ‘ The attributes of the fictitious bystander to whom courts defer have therefore been variously stated. Such a person is not a lawyer. Yet neither is he or she a person wholly uninformed and uninstructed about the law in general or the issues to be decided . Being reasonable and fair‑minded, the bystander, before making a decision important to the parties and the community, would ordinarily be taken to have sought to be informed on at least the most basic considerations relevant to arriving at a conclusion founded on a fair understanding of all the relevant circumstances. The bystander would be taken also the to know commonplace things, such as the fact that adjudicators sometimes say, or do, things that they might later wish they had not, without necessarily disqualifying themselves from continuing to exercise their powers. The bystander must also now be taken to have, at least in a very general way, some knowledge of the fact that an adjudicator may properly adopt reasonable efforts to confine proceedings within appropriate limits and to ensure that time is not wasted. The fictitious bystander will also be aware of the strong professional pressures on adjudicators (reinforced by the facilities of appeal and review) to uphold traditions of integrity and impartiality. Acting reasonably, the fictitious bystander would not reach a hasty conclusion based on the appearance evoked by an isolated episode of temper or remarks to the parties or their representatives, which was taken out of context. Finally, a reasonable member of the public is neither complacent nor unduly sensitive or suspicious.’ And what the objective onlooker has to decide, after having been informed of all the relevant circumstances, is not whether it would be better for another adjudicator to hear the matter but whether the adjudicator sitting to hear the matter might not bring an impartial and unprejudiced mind to the resolution of the dispute…” 59. Applying these principles, there is no merit in W’s complaint of apparent bias on the part of the Presiding Arbitrator. That claim appears to be a desperate manoeuvre on W’s part. 60. It was argued for W that under section 25 of the Arbitration Ordinance , an arbitrator has a continuous duty to disclose “any circumstances likely to give rise to justifiable doubts as to his impartiality or independence”. It was also argued that the Orange List of the IBA Guidelines requires disclosure of a close personal friendship between an arbitrator and the counsel of a party, and where the arbitrator and counsel for one of the parties currently act or have acted together within the past 3 years as co-counsel. The complaint was that although the Presiding Arbitrator had disclosed her relationship with Mr Kok, and later Mr Wong SC, as being members of her chambers, she failed to disclose the fact that she had acted as co-counsel with Mr Kok in at least 2 cases on 3 occasions within the past 3 years. W further complained that the Presiding Arbitrator had not disclosed the fact that she had a much closer and enduring association with Mr Wong as they had attended many marketing events together from 2016 to 2019, and that Mr Wong had attended a birthday party for the Presiding Arbitrator in 2015. 61. The claim of alleged close personal friendship or enduring association is tenuous, to say the least, but even leaving that aside, the reasonable and fair-minded bystander would be taken to know that barristers share chambers and that it is commonplace for professionals to associate, meet and participate jointly at conferences, and even promotional and marketing events, and that this would not influence their professional decision making in a case. There is no cogent and rational link between the association complained of between the Presiding Arbitrator and Counsel for AW, and any possible capacity to influence the impartial decision making process of the Presiding Arbitrator in Arbitration 2. As Counsel for AW pointed out, even on the IBA Guidelines, non-disclosure cannot by itself make an arbitrator partial or lacking in independence. 62. The fact that there are passages in Award 2 which were taken from the Closing Submissions of Counsel for AW cannot assist the unsubstantiated claim of bias. I reject the suggestion that the objective, fair-minded and informed observer can conclude, on the facts alleged in this case, that there was any “real possibility” that the Presiding Arbitrator was biased. Whether enforcement would be rendered more difficult? 63. The view I have taken on the manifest invalidity of Award 2 makes the second part of the test for security for the award less significant in consideration. If Award 2 is set aside for the reasons set out in this Decision, the ease or difficulty of enforcement of Award 2 and whether enforcement will be rendered more difficult may be academic and based on a wrong premise, of Award 2 being enforceable. 64. No date has apparently been fixed yet for the hearing of the Originating Summons to set aside Award 2. There are no enforcement proceedings taken elsewhere by AW. 65. In any event, W has no assets in Hong Kong and there is no evidence that it ever had assets here. According to PY, and this is not disputed by AW, Hong Kong was chosen as a neutral venue for arbitration, and neither party has assets here. Hence, there is no additional difficulty in enforcement of the award in Hong Kong. Nor is there any solid evidence (apart from the inferences which AW urged the Court to make on the basis of PY’s low commercial morality) that W had moved any assets out of Hong Kong to evade enforcement, or that there is any real risk that W would take steps in any attempt to defeat AW’s enforcement of Award 2 here in Hong Kong. Justice of the case for security 66. In my judgment, when W has a strong case on the merits to set aside Award 2 which I have held to be manifestly invalid, it would not be just to order security against W, under Order 23 RHC, in the interim of the hearing of the application to set aside the Award. Based on this Decision, a different outcome of that hearing to set aside is highly unlikely. Further conduct 67. Since this Decision on the inconsistent findings in the 2 Awards has been made, primarily from review of the 2 Awards, it may be that no further hearing is required for the Originating Summons. Parties should sensibly confer on whether orders can be made by consent on the Originating Summons and on paragraph 1 of AW’s Summons: for the setting aside of Award 2, and refusing leave to enforce Award 2 as sought by AW. Disposition of the Summons 68. The application for security made in paragraph 2 of the Summons is dismissed. 69. The order nisi is that AW is to pay W’s costs on indemnity basis, with certificate for one counsel. (Mimmie Chan) Judge of the Court of First Instance High Court Mr Robert Whitehead SC and Mr David Fong, instructed by Gallant, for the applicant Mr Adrian Lai, instructed by Wilkinson & Grist, for the respondent Look up this case on Lawcite Noteup",
  "length": 48231,
  "headers_seen": [
    "Introduction",
    "Background",
    "Application for security",
    "Merits of setting aside application",
    "Issue Estoppel Ground",
    "Applicable legal principles",
    "Apparent Bias Ground",
    "Applicable legal principles"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2021/1707",
  "query": "enforcement of award",
  "ts": "2025-10-17T10:41:56",
  "ok": true
}