{
  "title": "RE MAK KAM MUN | [2004] HKCFI 485 | HKLII",
  "court": null,
  "year": 2004,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2004] HKCFI 485 RE MAK KAM MUN Judgment Information Date 27 Jul, 2004 Action No. HCB8607/2001 Neutral Cit. [2004] HKCFI 485 Parallel Cit. [2004] 4 HKC 202 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCB8607/2001 HCB008607/2001 RE MAK KAM MUN HCB008607/2001 HCB 8606/2001 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE BANKRUPTCY PROCEEDINGS NO. 8606 OF 2001 ____________ Re: MAK KAM LING Ex Parte: NELSON JEWELLERY ARTS CO. LTD ____________ AND BETWEEN HCB 8607/2001 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE BANKRUPTCY PROCEEDINGS NO. 8607 OF 2001 ____________ Re: MAK KAM MUN Ex Parte: NELSON JEWELLERY ARTS CO. LTD ____________ (Heard together) Coram: Hon A Cheung J in Court Date of hearing: 17 June 2004 Date of judgment: 28 July 2004 _______________ J U D G M E N T _______________ 1. The two debtors in these two petitions are sisters. They used to work for the Petitioner. By a document in Chinese dated 28 August 2001, they admitted that they were indebted to the Petitioner in the sum of $700,000.00, being the value of gold materials (allegedly) stolen by them in the course of their employment with the Petitioner. Subsequently statutory demands for the payment of the sum of $700,000.00 were served by the Petitioner on the debtors, who failed to repay the money. Bankruptcy petitions were thus filed on 9 October 2001. In the meantime, the matter had been reported to the police and the debtors were put on police bail and were under investigation. 2. On 21 January 2002, the two petitions were heard by Kwan J. They were opposed by the debtors, who denied the alleged misappropriation of property and claimed that the Chinese document was signed under duress. Exercising her jurisdiction under section 9 (5) of the Bankruptcy Ordinance ( Cap. 6 ), the judge ordered that further proceedings in the two petitions be stayed until after the conclusion of the criminal and civil proceedings that might be brought against the debtors. The judge also ordered that the sum of $785,860.00 that had been paid into court pursuant to an earlier order do remain in court pending the outcome of the criminal and civil proceedings or until further order of the court. There is no doubt that the money so retained in court was meant to be a security for payment to the Petitioner of the debt claimed by the Petitioner against the two debtors, and the money was ordered to remain in court as part of the order for stay made pursuant to section 9(5) of the Ordinance. 3. The police investigation took a long time to complete. But in the meantime on 26 September 2002, the police released the bail money to the two debtors. 4. On 15 March 2003, the Petitioner issued a writ of summons in HCA 959/2003 against the two debtors to recover the value of those materials that were said to have been misappropriated by the two debtors during their course of employment with the Petitioner. However, the writ was not served. 5. The explanation given by the Petitioner for the delay in commencement of the civil proceedings and not proceeding further with the civil proceedings after their commencement was basically that of awaiting the result of the police investigation. The Petitioner hoped that the government would eventually prosecute the two debtors and secure a conviction against them, in which event it could rely on the criminal convictions for the purposes of the civil proceedings. Hopefully that would save time and costs. 6. However, there was to be no criminal prosecution. By a letter dated 26 February 2004, the Department of Justice confirmed to the Petitioner that there was insufficient evidence to prosecute either of the two debtors. 7. On 2 March 2004, Mak Kam Ling (one of the sisters) took out an application for an order that the stay of proceedings be removed, the petition be dismissed and the sum of $785,860.00 that she had paid into court be released to her. 8. On 8 March 2004, the amended writ of summons and a statement of claim were eventually served on the two debtors. 9. On 28 April 2004, a similar application was made by Mak Kam Mun, the other debtor, asking for similar relief (except that no payment out was asked for as the money was paid into court by her sister). 10. On 24 May 2004, the two sisters filed a defence in HCA 959/2003, denying liability - save for a sum of $180,000.00 which Mak Kam Mun had throughout admitted as being due and owing to the Petitioner. They alleged that the Chinese document, in which they made admissions adverse to them, was the product of undue influence and duress exerted on them. 11. The two applications of the sisters were heard by me together. 12. Section 9(5) of the Ordinance reads as follows: \" (5) Where the debtor appears on the petition and denies that he is indebted to the petitioner, or that he is indebted to such an amount as would justify the petitioner in presenting a petition against him, the court, on such security (if any) being given as the court may require for payment to the petitioner of any debt which may be established against him in due course of law, and of the costs of establishing the debt, may, instead of dismissing the petition, stay all proceedings on the petition for such time as may be required for trial of the question relating to the debt.\" 13. Although the provisions do not specifically provide for a power on the part of the court to remove the stay, there can be no doubt that the court does have the jurisdiction to do so in an appropriate case. As a general rule, the effect of a stay is that it is not equivalent to a discontinuance, or to a judgment for one party or the other. It is a stay which can be and may be removed if proper grounds are shown: Cooper v Williams [1963] 2 QB 567 , 580 (per Lord Denning MR). 14. Furthermore, section 98(1) of the Ordinance specifically gives the court the power to review, rescind or vary any previous orders. It reads: \" (1) The court or the Registrar may review, rescind or vary any order made by it or him, as the case may be, under its or his bankruptcy jurisdiction.\" 15. Moreover, in the present case, so far as the security is concerned, Kwan J's order has a built-in provision for revisiting the question of keeping the money in court, as it specifically provides that the money is to remain in court pending the outcome of the criminal and civil proceedings \"or until further order of the court\". 16. As regards whether the court should revisit the matter, I am satisfied that there has been such a change of circumstances since the order was first made in January 2002 as to justify doing so. 17. On the change of circumstances, I agree that Kwan J's order did not necessarily premise on the commencement of criminal proceedings against the two debtors. It merely says: \"criminal ... proceedings ... that may [be] brought ...\". Yet it is plain to me that the order was premised on the presence of a real possibility of such criminal proceedings being brought against the debtors. It is now clear that such a possibility no longer exists. 18. At this juncture, I should add that following the confirmation from the Department of Justice that no prosecution would be brought, the Petitioner unsuccessfully sought leave from a magistrate to launch a private prosecution against the sisters. Whilst at least in theory the Petitioner may take the matter further, the development in relation to possible criminal proceedings against the sisters is such that the situation now is very much different from what had been facing the learned judge when she made the order in January 2002. 19. Moreover, apart from the possibility of criminal proceedings, there has been a substantial delay in relation to the commencement and prosecution of the civil proceedings. It must be remembered that section 9(5) presupposes that there have been or will be civil proceedings brought to determine the question relating to the alleged debt based on which the petitioner made his petition. Kwan J's order, in my judgment, must have been based on the due commencement and prosecution to its logical conclusion of the relevant civil proceedings against the sisters. 20. Yet the plain fact is that both the commencement and the prosecution of the civil proceedings have been substantially delayed. The Petitioner has through its solicitors given explanations to the Court regarding why there has been such delay. All I need say is that whilst I find the reasons understandable, the plain fact remains that there has been substantial delay. 21. I agree that it must have been within the reasonable contemplation of the judge when she made the order in January 2002 that, given the possibility of concurrent civil and criminal proceedings, progress of the civil proceedings might be delayed. However, a delay in the civil proceedings due to an application by the debtors for a stay pending the conclusion of the criminal proceedings would be one thing. Not commencing the civil proceedings duly and after its belated commencement, not prosecuting the same expeditiously when no such application for a stay was made by the debtors/defendants would be quite another matter. 22. In other words, if the prosecution of the civil proceedings had been delayed because of a stay of proceedings successfully applied for by the debtors/defendants, that could well be a relevant consideration to be taken into account, in deciding whether there had been a change of circumstances justifying the revisiting of the whole matter. But the objective fact is that there was no such application. The Petitioner simply, for reasons of its own, delayed in the commencement of the civil action and did not prosecute it expeditiously after commencement. 23. In my judgment, that development, as it has actually happened, cannot be said to have been within the reasonable contemplation of the judge when she first made the order. 24. The resulting prejudice to the debtors cannot be overstated. A substantial amount, which is equivalent to the full amount claimed for by the Petitioner under the statutory demands (plus costs), has been paid into and retained by the court for over two years. The debtors have been having the bankruptcy petitions hanging over their heads for the same period of time, thereby causing them embarrassment, inconvenience and actual difficulties in terms of credit and borrowing money from financial institutions and so forth. 25. As a matter of general bankruptcy principle, bankruptcy proceedings should be determined, one way or another, with reasonable dispatch. And I would add that generally speaking, a stay of bankruptcy proceedings, particularly a stay coupled with a payment into court, is only appropriate in a case where the petitioner's entitlement to the alleged debt can be, relatively speaking, readily and expeditiously determined by a civil court. 26. In other words, if the debt is subject to a bona fide dispute, the normal course is for the bankruptcy court to dismiss the petition, leaving the petitioner to first establish himself as a creditor by judgment to be obtained in the civil court. 27. In the present case, more than two years have lapsed since the order for stay and security was made, and the parties are still at a very early stage of the civil action. 28. Furthermore, I note that as a matter of fact, the two debtors have paid a total sum of over $700,000.00 into court, to cover the alleged indebtedness under the statutory demands together with costs, and the money has been sitting in court for over two years. Given that this bankruptcy court is ultimately concerned with whether the debtors are unable to pay their debts, the fact that they have made a payment in covering in full the indebtedness alleged in the statutory demands, based on which the petitions were taken out in the first place (for the purpose of the present bankruptcy proceedings, I should ignore the higher amount of indebtedness - over $1.4 million - now alleged in the statement of claim), there being no other supporting creditors, must be a highly relevant factor to bear in mind in deciding what to do with the two petitions. 29. In other words, the two debtors (together) clearly were and are able to pay the indebtedness in question (alleged to be in the sum of $700,000.00 according to the statutory demands). That by itself indicates that for the purposes of the present petitions (which are based on the statutory demands), the \"inability to pay\" ground has not been and cannot be established against the two debtors. 30. For all these reasons, as I said, I am fully satisfied that the Court must revisit the whole question of a stay, including the question of security. 31. In my judgment, plainly there are bona fide disputes regarding the Petitioner's claim. Sitting in its bankruptcy jurisdiction, this Court must not usurp the function of a civil court and decide the disputes between the parties, nor can this be done on paper in any event. The normal course for the bankruptcy court to take, like the companies court in a similar situation, is to dismiss the petition: See for instance, Re Lympne Investments Ltd [1972] 1 WLR 523 ; Mann v Goldstein [1968] 1 WLR 1091 ; Re Bylamson & Associates (Enterprises) Ltd [1983] 1 HKC 510 ; Re Kim Young Soon HCB 1620/1999, Kwan DJ (20 April 2000). 32. In my judgment, in the present circumstances of the case, this is certainly not a case for the exercise of the court's jurisdiction under section 9(5) for a stay of proceedings, with or without security. For the reasons that I have already set out above, I am of the view that the underlying disputes between the parties must be decided by the civil court in the normal way. I can see no justification for ordering a stay. 33. Furthermore, in my judgment, any question of security should be dealt with in the civil action. By the same token, if circumstances so justify, a mareva injunction against the debtors may be applied for. Asking the bankruptcy court for an order for stay and security pursuant to section 9(5) of the Ordinance, in the circumstances of this case as they are presently known (as opposed to the circumstances back in January 2002), is, in my judgment, nothing but an attempt to obtain security via the backdoor. If the Petitioner can obtain its security or injunction via the front door i.e. the civil action, it should do so there; if it cannot do it there, it should not be allowed to do it here (in the bankruptcy court). 34. Having thus revisited the situation, I am of the firm view that the stay should be removed, the security returned to Mak Kam Ling (subject to one matter to be mentioned below), and the two petitions dismissed. 35. As regards the return of the money to Mak Kam Ling, Ms Queenie Ng, counsel for the two sisters at the hearing, has on behalf of her clients offered an undertaking to the Court to pay forthwith, upon the payment out of the security to the debtors' solicitors, a sum of $180,000.00 (being the admitted amount of indebtedness of Mak Kam Mun to the Petitioner) to the Petitioner in repayment of the indebtedness, as per the admission made on her behalf by her lawyers by letter dated 3 January 2002, which payment shall be offered to the Petitioner on the express understanding that acceptance of the payment shall be without prejudice to the Petitioner's contention regarding the quantum of Mak Kam Mun's liability. 36. In my judgment, it is only right that the payment out should be made subject to such an undertaking. 37. In other words, upon the above undertaking given by counsel on behalf of Mak Kam Ling, I order, in relation to HCB 8606/2003 that: (1) The stay of proceedings be removed; (2) The sum of $785,860.00 paid into court by Mak Kam Ling, together with all accrued interest, be forthwith paid out to her solicitors; (3) The petition be dismissed. 38. In relation to HCB 8607/2003, I order that: (1) The stay of proceedings be removed; (2) The petition be dismissed. 39. I further make a costs order nisi under HCB 8606/2001 as follows: (1) The costs of the petition, including the costs of the present application for removal of the stay of proceedings, be paid by the Petitioner to the debtor, to be taxed if not agreed; (2) The Official Receiver's costs of and incidental to the application for removal of the stay of proceedings, assessed in the sum of $12,000.00, be paid by the Petitioner within 14 days from the date of the order; (3) The Official Receiver's costs of the petition, assessed in the sum of $7,700.00, be paid by the Petitioner and be deducted from the Petitioner's deposit. 40. In respect of HCB 8607/2001, I make the following costs order nisi : (1) The costs of the petition, including the costs of the present application for removal of the stay of proceedings, be paid by the Petitioner to the debtor, to be taxed if not agreed; (2) The Official Receiver's costs of and incidental to the application for removal of the stay of proceedings, assessed in the sum of $6,000.00, be paid by the Petitioner within 14 days from the date of the order; (3) The Official Receiver's costs of the petition, assessed in the sum of $7,700.00, be paid by the Petitioner and be deducted from the Petitioner's deposit. 41. The above costs orders nisi shall become absolute unless any party should apply to the Court to vary the same within 14 days after this judgment is handed down. 42. I thank counsel for their assistance. (Andrew Cheung) Judge of the Court of First Instance High Court Representation: Ms Jennifer Tsui, instructed by Messrs T H Koo & Associates, for the Petitioner in both cases Ms Queenie Ng, instructed by Messrs Yu Hung & Co., for the Debtors in both cases Official Receiver, absent (attendance dispensed with) Look up this case on Lawcite Noteup",
  "length": 17903,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2004/485",
  "query": "stay of proceedings",
  "ts": "2025-10-14T11:22:54",
  "ok": true
}