{
  "title": "CHAN WING KA V. DOWELL INTERNATIONAL TRADING AND FORWARDING LTD | [2020] HKDC 1061 | HKLII",
  "court": null,
  "year": 2020,
  "date": null,
  "content": "HKLII Databases District Court [2020] HKDC 1061 CHAN WING KA V. DOWELL INTERNATIONAL TRADING AND FORWARDING LTD Judgment Information Date 29 Nov, 2020 Action No. DCCJ3807/2020 Neutral Cit. [2020] HKDC 1061 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History DCCJ3807/2020 DCCJ3807/2020 CHAN WING KA v. DOWELL INTERNATIONAL TRADING AND FORWARDING LTD DCCJ 3807/2020 [2020] HKDC 1061 IN THE DISTRICT COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION CIVIL ACTION NO 3807 OF 2020 ------------------------------------ BETWEEN CHAN WING KA (陳詠嘉) Plaintiff and DOWELL INTERNATIONAL TRADING AND FORWARDING LIMITED (多維爾貿易有限公司) Defendant ------------------------------------ Before: Deputy District Judge George Lam in Chambers Date of Hearing: 19 October 2020 Date of Decision: 19 October 2020 Date of Reasons for Decision: 30 November 2020 ---------------------------------------- REASONS FOR DECISION ---------------------------------------- 1. This is the plaintiff’s application for default judgment by way of summons dated 26 August 2020 (“the Summons”) under O 13 r 6 and O 19 r 7 of the Rules of the District Court , Cap 336H (“RDC”). 2. The orders sought by the Summons are as follows:- (1) A default judgment against the defendant on the basis of the defendant’s default of Acknowledgement of Service and Defence for a sum of HK$393,250 (“the Sum”) together with interest and costs of this action; (2) There be a declaration to the effect that the defendant has been holding the Sum on trust for the plaintiff; (3) A vesting order will be made in respect of the Sum; (4) Leave to join DBS Bank (Hong Kong) Limited (“DBS”) as a respondent (“the Respondent”) of the current proceedings for the purpose of giving effect to the vesting order; (5) An order directing the Respondent to pay over the Sum to the plaintiff under the vesting order; (6) Costs of the Respondent, including any administrative costs, in compliance with the vesting order to be borne by the plaintiff, such costs to be paid on an indemnity basis, and to be summarily assessed, if not agreed; and (7) Costs of these proceedings (including this application and any costs incurred by the plaintiff in obtaining the vesting order) be to the plaintiff to be borne by the defendant, such costs to be taxed if not agreed. 3. I dismissed the Summons at the hearing and indicated I would give written reasoning, which I now do. BACKGROUND 4. According to the Statement of Claim indorsed in the Writ of Summons, the plaintiff started to have an internet relationship with a male person named Andy Li Xiang (true name unknown to the plaintiff) (“the Unknown Person”) on 2 June 2019 via the mobile app Meetup. After being “acquainted” with the Unknown Person for three months, the plaintiff lent him a sum of HK$393,250 (“the Sum”) (being equivalent to RMB355,295), without interest and on a short-term basis, by transferring the Sum into the defendant’s bank account at DBS on 16 September 2019 as directed by the Unknown Person. 5. The plaintiff alleged that she was induced by the Unknown Person via WeChat to lend him the Sum and was fraudulently misrepresented by him that he was in need of money for payment of shipment and customs fees. 6. The Unknown Person did not repay the Sum on or about 16 October 2019 as promised. The plaintiff then found out that it was a scam and reported the incident to the police on 29 October 2019. The Unknown Person could no longer be contacted since November 2019 . 7. The defendant is a company registered in Hong Kong with an issued capital of HK$10,000. It has been incorporated since 2014. The plaintiff said she did not know and had never had any business dealings with the defendant. 8. The plaintiff now claims against the defendant directly for the Sum owed by the Unknown Person in restitution on the ground of unjust enrichment and in trust (which was not proceeded with as discussed below). PRE-HEARING MATTERS 9. On 30 September 2020, the plaintiff filed into court an Affirmation of the plaintiff’s solicitors (made by Ms Ip who also attended this hearing before me) that the plaintiff would ask for leave to withdraw “the application for a vesting order, ie paragraphs (2)-(7) of the Summons” leaving only paragraph (1) of the Summons for default judgment. Instead of seeking a vesting order, the plaintiff would proceed to apply for a garnishee order (notice to show cause) under Order 49 of the RDC to be heard at the same hearing. 10. The plaintiff explained in the Affirmation that given the recent decision of 800 Columbia Project Co LLC v Chengfang Trade Ltd [2020] 3 HKLRD 674 (by Mr Recorder Eugene Fung SC), the plaintiff would withdraw in seeking any vesting order for the Sum. Instead, they have included in the Affirmation an application for a garnishee order nisi for the defendant to show cause, following the alternative route mentioned in the said decision. Application for leave to withdraw 11. The court has noted that there are two conflicting lines of authorities as to the question of whether vesting order shall be granted in email fraud type of cases. Not long after the decision of 800 Columbia , there was another decision Wismettac Asian Foods Inc v United Top Properties Ltd [2020] 3 HKLRD 732 (by Deputy High Court Judge Paul Lam SC) holding to the contrary. They can simply be referred to as the 800 Columbia line of cases and the Wismettac line of cases. 12. Both lines of cases are binding on this court. When the plaintiff in the present case has opted to follow 800 Columbia , this court made no objection to their choice. In fact, it is understandable for the plaintiff to do so. Nonetheless, the court, at the hearing, has drawn the plaintiff’s attention to the fact that 800 Columbia does not preclude the claimant from obtaining any declaration of trust, whereas the plaintiff is now also applying to withdraw paragraph (2) for declaration of trust. The plaintiff confirmed she would not ask for any declaration of trust. The plaintiff would only rely on unjust enrichment for the liquidated sum of HK$393,250. 13. In any event, an application for a vesting order should be initiated by a separate originating summons (see Wismettac ). 14. At the end of the hearing, I granted leave for the plaintiff to withdraw paragraphs (2)-(7) of the Summons. Application for garnishee order (notice to show cause) 15. Under RDC O 49 r 1, the plaintiff must first obtain a judgment or order for payment against the defendant before the court may order the garnishee to pay to the judgment creditor. 16. However, there is no rule to prohibit the plaintiff from taking out an application for garnishee order at the same time: see Enforcement of Judgments in Hong Kong (1998), Heilbronn, Booth, McCook at page 219, “A judgment creditor may apply for [a garnishee] order nisi as soon as judgment is pronounced or the order made. By contrast to the requirements governing the issue of writs of execution, it is strictly unnecessary, (although it is no doubt desirable), that the judgment or order should first have been drawn up and sealed.” 17. Therefore, as in our present case, the plaintiff is allowed to roll up the garnishee proceedings together with the application for default judgment. 18. I have informed the plaintiff that the application for a garnishee order would invariably be dismissed if the plaintiff should fail to obtain the default judgment. The plaintiff confirmed she would prefer to go for these rolling up applications. THE PLAINTIFF’S CLAIM 19. The Writ of this action was issued on 24 July 2020, which was almost nine months after the incident had happened. 20. Ms Ip, solicitor appearing for the plaintiff, submitted that it was a case of cybercrime based on the misrepresentation made by the Unknown Person, and the police had frozen the DBS Account. The court should grant relief in favor of the victimized plaintiff. 21. I do not agree. As revealed from the pleading, the plaintiff’s case falls far short of a case of cybercrime. Ms Ip had difficulties in persuading me how it could have been a cybercrime in the absence of any particulars of fraud being provided in the Statement of Claim. 22. According to the Statement of Claim, it was the plaintiff who, after having acquainted with the Unknown Person for three months, agreed to lend the Unknown Person the money which the Unknown Person claimed he was in need. That, as pleaded, was a simple money lent transaction. The mere fact that mobile applications were in use would not render the case to be a ‘cybercrime’. There was no stealing or interception of confidential information by the use of a computer or the internet. There was no hacking into the email or banking system, nor was there any impersonation of authorities in the transaction. 23. Fraud is a serious allegation and one should not plead it without careful consideration or any evidential basis. It is unacceptable (and far too easy) to make an allegation of fraud, but later evidence cannot support the same. If no particulars are being provided, as in the present case, such part of the allegation of fraud in the pleading would be struck out by the court or would inevitably have to be withdrawn at trial. In Wallingford v Mutual Society (1880) 5 App 685 Lord Watson said, “It is a well-known and very proper rule that a general allegation of fraud is not sufficient to infer liability on the part of those who are said to have committed it. … The rule must require not only a general and vague allegation but some actual fact or circumstance or circumstances which taken together imply, or at least very strongly suggest, that a fraud must have been committed, those facts being assuming to be true.” 24. On the face of the pleading, the plaintiff’s case is simply that she has made a bad decision in lending money to the Unknown Person, coupled with a bare allegation of fraud without particulars. I find that the plaintiff has failed to plead a case of fraud here. 25. Ms Ip drew the court’s attention to the exhibits filed in support of the application. Those were three pages of documents but they seem unsatisfactory for any purposes: (1) a transaction report dated 16 September 2019 (without any identification of the maker); (2) a bank statement of the defendant company at DBS dated 30 September 2019 (showing a different corresponding address of the defendant); (3) a transaction record with HSBC heading (showing only the plaintiff’s account number, without the plaintiff’s name thereon whilst the plaintiff was not able to provide a copy of her own bank statement). 26. As to documents (1) and (2), it is pertinent to note that those documents were not obtained by any order for disclosure. There was no Norwich Pharmacal order being made by the court. The source of the documents was unknown. Ms Ip submitted that those documents might have been obtained from the police by the plaintiff. However, there was no affirmation to support that assertion and there was no explanation why the document that obviously belonged to the Unknown Person would have gone into the hands of the plaintiff. There was no bank chop or police verification of those documents. 27. In any event, the plaintiff does not need to prove its case by evidence, and the court would only consider the Statement of Claim alone without relying on any of those documents ( Hong Kong Civil Procedure 2020 , para 19/2/1). ANALYSIS 28. I am satisfied that the Writ indorsed with the Statement of Claim, the Summons, and the Affirmation with the application for garnishee order have been duly served on the defendant and the intended garnishee (DBS), subject to the issue of irregularity discussed at the end of this Decision. I also granted the intended garnishee to be excused for attendance. The defendant is in default of filing a Notice of Intention to Defend and a Defence. 29. For a money loan (a personal claim), the plaintiff needs to join the borrower, namely the Unknown Person, as a party to the proceedings. There is no privity of contract between the plaintiff and the defendant. For a declaration that the defendant is holding the Sum on constructive trust for the plaintiff (a proprietary claim), the court needs to be persuaded that it should depart from the normal practice that the court would normally not make any declaratory relief without a trial, particularly where there is an allegation of fraud ( Hong Kong Civil Procedure 2020 , paras 15/16/2 and 19/7/20). 30. Since the plaintiff has aborted her claim for any declaration of trust, the only remaining issue for the court to decide is whether the plaintiff can claim against the defendant for restitution of the Sum on the basis of unjust enrichment (a personal claim). LEGAL PRINCIPLES 31. For the purposes of an application for default judgment, every allegation of fact in a pleading, if not denied, must be taken to be admitted ( Cribb v Freyberger [1919] W.N. 22). 32. In Lam Chi Fat v Liberty International Insurance [2003] 2 HKC 260 , Ma J (as he then was) provided further guidance for the above principle at para 27, “The basis for default judgments I have just referred to, give rise to the obvious consequence that as the facts on which the plaintiff’s claim is based are deemed to be admitted, judgment will only be given on the plaintiff’s claim provided the pleaded facts give rise to the relief sought. Where, however, the facts do not give rise to the relief sought, then unless the Writ or Statement of Claim is amended, no judgment will be given. ” (Emphasis added) 33. Accordingly, the court is obliged to consider whether the pleaded facts give rise to the relief sought before entering any judgment in default for the plaintiff’s claim. RESTITUTION 34. To establish a claim in restitution, the plaintiff needs to establish the followings:- (1) The defendant has been enriched; (2) The enrichment was at the plaintiff’s expense; and (3) The enrichment is unjust. (See Shanghai Tongji Science & Technology Industrial Co Ltd v Casil Clearing Ltd (2004) 7 HKCFAR 79 (CFA); Yew Sang Hong v Housing Authority [2008] 3 HKLRD 307 (CA)). 35. In our present case, the defendant has been enriched by the Sum. But whether it was enriched at the plaintiff’s expense? I have difficulties in finding that it was at the plaintiff’s expense. 36. According to the Statement of Claim, it is the Unknown Person who was the borrower of the Sum. And the only reason why the Sum was deposited into the defendant’s bank account is that it was under the Unknown Person’s direction. It is not clear whether there was any contract made between the Unknown Person and the defendant. But it is clear that the defendant received the Sum at the Unknown Person’s expense. The Unknown Person bears the obligation to repay the plaintiff as promised. 37. Although allegation of fraudulent misrepresentation is pleaded against the Unknown Person, the Unknown Person has not been joined as a party here. Further, the plaintiff has not pleaded any mistake in advancing the loan payment. More importantly, the plaintiff is not seeking any declaration of trust against the defendant that the Sum beneficially belongs to her. In such circumstances, the plaintiff simply cannot establish a case of unjust enrichment at the plaintiff’s expense. 38. In my view, the pleaded facts are not sufficient to give rise to the relief sought. 39. For the sake of completeness, I also find that the enrichment of the defendant is not unjust. The defendant was the intended recipient of the Sum under the loan agreement made between the plaintiff and the Unknown Person and upon the latter’s direction to deposit the Sum into the defendant’s bank account. That was good consideration for the defendant to have received the Sum and such enrichment would not be unjust. 40. In Costello v MacDonald [2012] 2 QB 244 (CA), despite the fact that after accepting the defendants had been enriched at the claimants’ expense, Etherton LJ held that the unjust enrichment claim against the defendants must fail because it would undermine the contractual arrangements between the parties, that is to say the contract between the claimants and the company and the absence of any contact between the claimants and the defendants. He stated the general rule as follows:- “The general rule should be to uphold contractual arrangements by which parties have defined and allocated and, to that extent, restricted their mutual obligations, and, in so doing, have similarly allocated and circumscribed the consequences of non-performance. That general rule reflects a sound legal policy, which acknowledges the parties’ autonomy to configure the legal relations between them and provides certainty, and so limits disputes and litigation.” 41. An illustration was given in Goff & Jones, The Law of Unjust Enrichment (9 th ed, 2016) at para 3-73, “In the absence of special facts, the courts are likely to say: (i) that C must look only to his counterparty, X, for repayment; (ii) that if X wrongfully fails to pay C, then C should not be entitled to sue D in unjust enrichment, so as to turn D into the de facto guarantor of the performance of X’s contractual obligations; (iii) that if C’s bargain with X turns out to be ‘bad’, then C should not be entitled to escape this risk by seeking greater remuneration from D in unjust enrichment; and (iv) that if X lawfully refuses to make payment to C in accordance with the terms of his contract with C, then C should not be entitled to circumvent this obstacle, by suing D in unjust enrichment.” 42. The next question is, what would be justified as special facts to displace the general rule as stated above? Goff & Jones, at para 3-74, suggested that it might be the ‘mistake’ made by the claimant or any ‘procurement’ made by the defendant. I found that, in our present case, there were no particulars of facts being provided which would justify the same, nor were there any other special facts which would justify a displacement of the general rule here. 43. In Yew Sang Hong Ltd (above), Reyes J gave a similar example:- “Where parties have expressly or impliedly allocated risks among themselves through a network of back-to-back or interlinking agreements, the law of restitution will not without compelling reason interfere with that allocation. It is unwise to tinker with the parties’ allocation because a revision of risks as between (say) A and B may bring about adverse consequences as between (say) B and C or others in the contractual network. Attempting to do justice between A and B alone may lead to injustice being done as between B and C.” 44. Again, I found that there was no compelling reason for the law of restitution to interfere with the loan agreement made between the plaintiff and the Unknown Person. 45. In my decision, I found that the plaintiff’s claim for unjust enrichment was bound to fail and the court would not enter judgment for the Sum to the plaintiff. 46. In the circumstances, paragraph (1) of the Summons was dismissed and I granted leave for the plaintiff to withdraw paragraphs (2)-(7) of the Summons. IRREGULARITY OF THE SUMMONS 47. At that juncture, Ms Ip said she wanted to have the hearing adjourned for the plaintiff to deal with paragraphs (2)-(7) and sought permission to withdraw the plaintiff’s application for leave to withdraw paragraphs (2)-(7). 48. I refused the plaintiff’s request. The hearing was proceeded on the basis that the plaintiff was seeking leave to withdraw other reliefs such as a declaration of trust and a vesting order, leaving only the monetary claim. The plaintiff had confirmed twice to the court upon the court’s enquiries during the hearing. The entire Summons had been disposed of. I refused to grant any adjournment as requested by the plaintiff. 49. If (contrary to the decision I had just made) the plaintiff should be allowed to withdraw its application to abandon paragraphs (2)-(7) of the Summons, I found that the Summons (originally with those paragraphs for other claims) would still have to be dismissed as it would have been taken out prematurely (if it was indeed taken out under O 13 r 6 & O 19 r 7). 50. The Writ of Summons indorsed with the Statement of Claim was issued on 24 July 2020 and served to the defendant on 29 July 2020. The Summons was taken out under O 13 r 6 & O 19 r 7 on 26 August 2020. The combined effect of those rules is that the action proceeded as if the defendant had given notice of intention to defend and there was a prescribed time (another 28 days) for the defendant to file and serve its Defence. 51. To do the calculations here, the defendant had 14 days after the service of the Writ (including the day of service) to file a Notice of Intention to Defend, ie up to and including 11 August 2020 (O 12 r 5; O 13 r 6). 52. Then the defendant had another 28 days thereafter to file a defence, ie until 8 September 2020 (O 18 r 2; O 19 r 7). 53. The plaintiff’s Summons was taken out on 26 August 2020; therefore, it was taken out prematurely. The defect is fundamental and cannot be cured: Yau Kar Kwai v Shan Jigesh Ranibhai (DCCJ 4752/2017, HH Judge Ko, 22 December 2017). 54. Ms Ip, in reply to my question as to whether the Summons would have been taken out prematurely, conceded that the Summons should only be treated as for liquidated sum (paragraph (1) only) and for no other relief. It was submitted that the plaintiff’s application for entering default judgment should rely on O 13 r 1 instead of O 13 r 6 & O 19 r 7 and there was only a clerical mistake on the margin note of the Summons. She withdrew her application to withdraw. Be that as it may, my order still stands. CONCLUSION 55. To conclude, I made an order that leave is granted to the plaintiff in withdrawing paragraphs (2)-(7) of the Summons, and paragraph (1) of the Summons is dismissed. Costs of the Summons be to the defendant to be taxed if not agreed. 56. Consequentially, the plaintiff’s application for garnishee order is also dismissed with no order as to costs. ( George Lam ) Deputy District Judge Ms Ip Hei Ho of Michelle Ip & Co, for the plaintiff The defendant was not represented and did not appear Look up this case on Lawcite Noteup",
  "length": 22216,
  "headers_seen": [
    "BACKGROUND",
    "PRE-HEARING MATTERS",
    "Application for leave to withdraw",
    "Application for garnishee order (notice to show cause)",
    "THE PLAINTIFF’S CLAIM",
    "ANALYSIS",
    "LEGAL PRINCIPLES",
    "RESTITUTION"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkdc/2020/1061",
  "query": "cybercrime",
  "ts": "2025-10-17T10:44:27",
  "ok": true
}