{
  "title": "INTERBULK (HK) LTD V. SAFE RICH INDUSTRIES LTD | [1992] HKCFI 318 | HKLII",
  "court": null,
  "year": 1992,
  "date": null,
  "content": "HKLII Databases Court of First Instance [1992] HKCFI 318 INTERBULK (HK) LTD V. SAFE RICH INDUSTRIES LTD Judgment Information Date 1 Mar, 1992 Action No. HCCL29/1992 Neutral Cit. [1992] HKCFI 318 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCCL29/1992 HCCL000029/1992 INTERBULK (HK) LTD v. SAFE RICH INDUSTRIES LTD HCCL000029/1992 1992. No. CL-29 IN THE SUPREME COURT OF HONG KONG HIGH COURT COMMERCIAL LIST _____________ IN THE MATTER OF ARBITRATION ORDINANCE ( CAP. 341 ) and IN THE MATTER OF AN INTENDED ARBITRATION BETWEEN INTERBULK (H.K.)''LIMITED (Claimants in the intended arbitration) Plaintiff and SAFE RICH INDUSTRIES LIMITED (Respondents in the intended arbitration) Defendant ________________ Coram: Hon. Barnett J. in Chambers Date of Hearing: 2 March 1992 Date of Decision: 2 March 1992 ________________________ REASONS FOR DECISION ________________________ 1. This is an application by the Defendant to set aside a Mareva Order obtained by the Plaintiff ex parte on 19th February 1992. At the hearing before me on 2nd March, I discharged the order. I said I would put my reasons in writing and, with the consent of the parties, cause those reasons to be circulated generally for the benefit of practitioners. 2. For the Defendant, Mr. Bleach was prepared to attack the order upon the more conventional grounds that there had been material non-disclosure or that the Plaintiff had failed to show a good arguable case. His primary submission, however, was that this court had no jurisdiction to make the order. It was agreed that I should deal with this submission first because, if decided in favour of the Defendant, it would have the effect of shortly resolving the whole matter. 3. The facts in so far as this submission was concerned were not in dispute. The Plaintiff is the owner of a vessel \"Samurai 1\". By tanker voyage charterparty dated 4th January 1992, the vessel was chartered to the Defendant. The charterparty contained special provision M6: \"General average and arbitration to be settled in London in accordance with English law. York/Antwerp Rules 1974, as amended in 1990 to apply.\" 4. Both parties accepted that there is a dispute between them which is to go to arbitration in London. Indeed on the date on which the order was obtained, there had been discussions about the arbitration and the Defendant had taken steps to appoint its arbitrator. 5. Mr. Bleach relied upon a recent decision of the English Court of Appeal in The Channel Tunnel Group Ltd. and France Manche SA v. Balfour Beatty Construction Ltd. and Others . The judgment was handed down on 22nd January 1992 and is as yet unreported. In that case the plaintiffs are the employers under a contract to build the Channel Tunnel. The defendants are the contractors. There was a dispute between them On 14th October last, the plaintiffs issued a writ against the defendants seeking an injunction restraining the defendants from suspending certain work so as to be in breach of their contractual obligations. 6. On 4th December a judge, upon an undertaking by the defendants that they would not suspend work, made no order against them. The defendants appealed against that order, their complaint being that the judge would have granted a mandatory injunction against them but for the undertaking they had offered. The arbitration clause between the parties provided for all disputes or differences to be settled by three arbitrators and \"The seat of such arbitration shall be Brussels\". 7. The judge held that there was power to grant an injunction under section 12 (6) of the Arbitration Act 1950 (it is agreed that section 14(6)(h) of the Arbitration Ordinance , Cap. 341 is identical) because the defendants were subject to the territorial jurisdiction of the English Court and not withstanding that the arbitration was to be held abroad. On appeal, the Court of Appeal determined that the correct way of dealing with the appeal was to consider first the question of a stay, and then the question of jurisdiction involving the specific power to grant relief under section 12 of the Arbitration Act and the more general power under section 37 of the Supreme Court Act 1981 (It was agreed that section 21L of the Supreme Court Ordinance , Cap. 4 is in similar terms). 8. The Court of Appeal concluded that the defendants were entitled to a stay and went on to consider the question of jurisdiction. The Court of Appeal accepted that under section 12(6) of the Arbitration Act an English Court would have power to grant even a mandatory interim injunction in an appropriate case where there was a dispute between two English parties who had agreed to arbitrate in England. However, the action with which the Court of Appeal was concerned did not relate to a domestic arbitration agreement within section 1(4) of the Act because the agreement between the parties provided for arbitration in a state other than England and because some of the parties were corporated in a state other than England. So at page 17 of the transcript, Staughton L.J. who delivered the leading judgment defined the crucial point on the issue as to jurisdiction: \"Does an English court have power to grant an injunction where the arbitration is to take place abroad, and if there is such a power should it be exercised? I consider this question first in relation to section 12(6)(h) and only thereafter under section 37 of the Supreme Court Act 1981.\" 9. Staughton L.J. held that it was necessary to ascertain the connecting factor prescribed by the rules of conflict of laws in order to find which country's laws are to be applied to a dispute of the kind which has arisen. After reviewing various authorities, at page 24 of the transcript he said \"I turn to Naviera Amazonica Peruana SA v. Compania Internacional de Seguros del Peru (1988) 1 Ll R 116. That concerned an application for the appointment of an arbitrator pursuant to.the Arbitration Act 1950, where there was an agreement to arbitrate \"bajo las Condiciones y Leyes de Londres\". Kerr LJ discussed in some detail the question whether the parties could choose a curial law which was different from the law of the place of arbitration - or more accurately the \"seat\" of the arbitration, since it may on occasion be convenient to hold hearings elsewhere. Kerr LJ said (at p.120) : There is equally no reason in theory which precludes parties to agree that an arbitration shall be held at a place or in country X but subject to the procedural laws of Y. The limits and implications of any such agreement have been much.discussed in the literature, but apart from the decision in the instant case there appears to be no reported case where this has happened. This is not surprising when one considers the complexities and inconveniences. which such an agreement would involve. Thus, at any rate under the principles of English law, which rest upon the territorially limited jurisdiction of our courts, an agreement to arbitrate in X subject to English procedural law would not empower our Courts to exercise jurisdiction over the arbitration in X.\" 10. After reviewing two further authorities he did not find helpful, at page 26 he said \"Like Kerr LJ, I do not believe that an English court has jurisdiction to exercise all the powers in the Arbitration Act 1950 in the case of an arbitration held abroad, even if the parties have agred to English curial law. It may exercise some of them, for example by staying court proceedings here, or by enforcing the award, as I have already mentioned. And in the converse case, where parties arbitrate here but agree on the procedural law of a foreign country, it seems to me that at least some of the powers conferred by the English Act could still be exercised.\" 11. After a reference to Mustill and Boyd , he said at page 27 : \"In my judgment the connecting factor for the application of section 12(6)(h) of the Arbitration Act 1950 to a case containing a foreign element is the place which the parties have chosen as the seat of the arbitration. If that is in England or Wales, our courts have jurisdiction; if not, they have none. It follows that the English court has no jurisdiction under section 12(6)(h) in the present case; since the seat of any arbitration is Brussels.\" 12. Staughton L.J. then went on to consider the more general power to grant an injunction conferred by section 37 of the Supreme Court Act. At page 28, he said: \"I consider that the non-availability of section 12(6)(h), because there is a dispute which ought to go to arbitration abroad, is the first of three reasons why an injunction should not be granted under section 37 of the Supreme Court Act. Where the specific power most appropriate to the grant of an injunction pending an arbitration is not available by the rules of private international law, it seems to me that, if only as a matter of judicial restraint, such an injunction should not be granted under the more general power. We are not here concerned with a body such as the International Tin Council, which was a creature of international law. But the Channel Tunnel contract involves a delicate balance of power between the municipal law of two sovereign states; we should be careful not to exercise jurisdiction except where to do so is within the spirit as well as the letter of our laws. The second reason lies in section 25 of the Civil Jurisdiction and Judgments Act 1982. Under that section the power of the High Court to grant interim relief may be extended by Order in Council to arbitration proceedings held abroad, and the order in Council may at the same time repeal any provision of section 12(6) of the Arbitration Act 1950 to the extent that it is superseded by the Order. No such Order in Council has yet been made.\" 13. For the third reason, he reviewed various authorities which support the view that an English Court has no jurisdiction to grant an interim injunction when a stay is mandatory under section 1 of the Arbitration Act (again it is not in dispute that the Arbitration Ordinance as amended to incorporate the UNCITRAL Model Law has similar provision) At page 30 he said: \"In the result I conclude that, whether or not there is jurisdiction, at least as a matter of judicial restraint an interim injunction should not be granted under section 37 of the supreme Court Act when the parties have agreed to arbitration in some place outside England and Wales and there is an arbitrable dispute. In my judgmet Evans J. would have been wrong to grant an injunction if the Contractors had not offered the undertaking which he accepted. It is to the courts of Brussels that application must be made, if it is their practice to grant an injunction in such a case.\" 14. Although I would not shrink from disagreeing with the English Court of Appeal (whose decisions are highly persuasive but not binding on me) Mr. Stone, who appeared for the Plaintiff, while not conceding the point was forced to admit that he could find no authority which enabled him to mount an argument to the contrary. Accordingly, having regarded to the similar statutory, provisions in Hong Kong, I can see no reason for disagreeing with the Court of Appeal with whose decision I respectfully concur. Am satisfied that, where there is a valid arbitration clause which provides for the seat of arbitration to be elsewhere than in Hong Kong, the Hong Kong courts do not have power to grant interim relief under section 14 (6)(h) of the Arbitration Ordinance . 15. In those circumstances, it was not necessary to deal with the Defendant's substantive points which may however be canvassed if the Defendant applies to have its costs on a more generous basis than the party and party costs which I provisionally awarded. 16. I think I should add that I was not addressed upon the UNCITRAL Model Law which has now been adopted in Hong Kong - Arbitration (Amendment) (NO. 2) Ordinance 1989 and which came into effect on 6th April 1990. To the Arbitration Ordinance , as thus amended, has been added s.34E by the Arbitration (Amendment) Ordinance 1991, which reads: \" Powers of Court in relation to evidence and interim relief Subject to article 5 of the UNCITRAL Model Law, section 14(4),(5) and (6) applies to arbitrations which are governed by the UNCITRAL Model Law.\" Article 1(2) of the Model Law provides: \"The provisions of this Law, except Articles 8, 9, 35 and 36, apply only if the place of arbitration is in the territory of this state.\" Article 9 of the Model Law reads: \" Arbitration agreement and interim measures by court It is not incompatible with an arbitration agreement for a party to request, before or during arbitral proceedings, from a court an interim measure of protection and for a court to grant such measure.\" 17. As I said, I was not addressed in detail on the Model Law other than indirectly in relation to Article 8 which replaced s.6A of the Arbitration Ordinance and provides for a mandatory stay where an international arbitration agreement exists. From the provisions which I have just cited, however, it is clear that a court is not precluded from granting interim relief. Such relief could include pre-award attachment to ensure that an award would be meaningful. See: A Guide to The UNCITRAL Model Law on International Commercial Arbitration, Holtzmann and Neuhaus; and Commentary on the UNCITRAL Model Law on International Commercial Arbitration, Broches. 18. A court to which a request for interim protection is made would undoubtedly apply its own domestic law. In England and, as I have held, Hong Kong, domestic law does not permit the granting of an injunction (under s.14 (6)(h) of the Arbitration ordinance in Hong Kong) where the seat of the arbitration is in another state. England, however, has not yet adopted the model Law. It seems to me, therefore, to be at least open to argument that, given the permission if not an invitation expressed in Article 9, a court of a state which has adopted the Model Law might be more ready to assist a party to an international arbitration agreement, notwithstanding that the arbitration has its seat elsewhere. Where the parties to, or the subject matter of such an agreement are in the state where the assistance of the court is sought, that court might be prepared to hold that it retains a discretion to grant protection. 19. For my part, I incline to the view that it is only to the courts of the state in which the arbitration has its seat that recourse may be had other than for purposes such as staying proceedings or enforcing an award. (N.J. Barnett) Judge of the High Court Representation: Mr. W. Stone inst'd by Holman Fenwick & Willan for Plaintiff. Mr. J. Bleach inst'd by Alsop Wilkinson for Defendant Look up this case on Lawcite Noteup",
  "length": 14784,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/1992/318",
  "query": "seat of arbitration",
  "ts": "2025-10-16T10:49:28",
  "ok": true
}