{
  "title": "THE QUEEN V. YEUNG KIT SUM | [1988] HKCFI 140 | HKLII",
  "court": null,
  "year": 1988,
  "date": null,
  "content": "HKLII Databases Court of First Instance [1988] HKCFI 140 THE QUEEN V. YEUNG KIT SUM Judgment Information Date 28 Sep, 1988 Action No. HCMA523/1988 Neutral Cit. [1988] HKCFI 140 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCMA523/1988 HCMA000523/1988 THE QUEEN v. YEUNG KIT SUM HCMA000523/1988 IN THE SUPREME COURT OF HONG KONG (Appellate Jurisdiction) MAGISTRACY CRIMINAL APPEAL No. 523 OF 1988 BETWEEN THE QUEEN and YEUNG Kit-sum _________ Coram: Hon. Mr. Justice Barnes In Court Date of Hearing: 29th September 1988 Date of delivery of Judgment: 29th September 1988 _______________ J U D G M E N T _______________ 1. The appellant was found guilty of two offences of assault occasioning actual bodily harm. He originally appealed against both conviction and sentence but has now abandoned his appeal against conviction. 2. The learned magistrate made a Training Centre Order in respect of each offence and the appellant now complains that that sentence was too severe. 3. He is 20 years of age and has no previous conviction. 4. In mitigation, his counsel at the trial referred to his family background which showed that his parents were hawkers with a small income and that the appellant was the youngest child in the family, that he was working since leaving school at Form 1 and was helping to support the family. 5. Before sentencing him, the learned magistrate obtained reports from a Probation Officer and from the Commisioner for Correctional Services as to his suitability for detention in a Training Centre or a Detention Centre. The Probation report discloses that the Appellant made a very poor impression on the Probation Officer. The Probation Officer found him to be insincere and evasive and showing a lack of a sense of responsbility for his misbehaviour and the Probation Officer said that probation supervision was not recommended in the appellant's case. The Commissioner for Correctional Services reported that he was not suitable for detention in a Detention Centre for medical reasons, whilst the report concerning his suitability for detention in the Training Centre recommended that such detention would be of benefit to the appellant. The Intake Officer in reporting on him said that the Appellant showed no insight into his problem and he was of the view that in the interests of his future reformation a period of disciplinary training in the Training Centre coupled with a period of aftercare supervision would give the Appellant a good chance of success in turning over a new leaf. 6. On this appeal and Mr. Ching Wong who appears for him has submitted that the Magistrate has imposed an excessive sentence possibly because he was influenced by certain matters at the trial. Mr. Wong points to a comment by the Magistrate in his Statement of Findings where he said \"Medical reports I find very perfunctory, and directed only at the negation of serious wounding.\" I think Mr. Wong reads too much into that and it seems to me to be a comment which the magistrate was making in the course of arriving at his decision on the question of the appellant's guilt. 7. In sentencing the appellant, the magistrate pointed out that this was not an ordinary assault occasioning actual bodily harm case that this had a greater degree of criminality in that it had a background of \"a big bully boy spoiling for the infliction of violence on strangers, and chasing one streets away to do him more harm.\" 8. Mr. Wong has pointed to two cases in support a contention at the appropriate sentence for an adult convicted of assault occasioning actual bodily harm would be imprisonment for 6 months and that therefore a training centre order on a young man with, for all practical purposes a good previous record, is far too severe. 9. The cases where imprisonment for 6 months was imposed for an offence of assault occasioning actual bodily harm appear to have been cases of that offence simpliciter. Here, the magistrate has pointed to a factor in this case which puts this offence on the more serious rung of the ladder of gravity of assault occasioning actual bodily harm offences. 10. An offender sentenced to detention in a training centre may be detained in that centre for a minimum of 6 months or a maximum of 3 years. A detainee who proves himself to be exemplary in conduct and conducive to the training methods of the institution has every prospect of being released after 6 months. 11. In this case the learned magistrate considered the various methods available to him for the purposes of sentencing him. I cannot see that he could have chosen any method of dealing with this offender appropriate to the circumstances of the offence and the circumstances of the appellant himself than a training centre order, I cannot therefore accede to the submission that this sentence was too severe or wrong in principle. Accordingly, I must dismiss the appeal. (E.C. Barnes) Judge of the High Court Representation: Mr. Bessell, Crown Counsel for the Crown Mr. Ching Y. Wong (Herman H.M. Hui & Co.) for the appellant Look up this case on Lawcite Noteup",
  "length": 5104,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/1988/140",
  "query": "assault occasioning actual bodily harm",
  "ts": "2025-10-17T10:41:17",
  "ok": true
}