{
  "title": "ASTRO NUSANTARA INTERNATIONAL B.V. AND OTHERS V. PT AYUNDA PRIMA MITRA AND OTHERS | [2017] HKCA 133 | HKLII",
  "court": null,
  "year": 2017,
  "date": "2003-01-02",
  "content": "HKLII Databases Court of Appeal [2017] HKCA 133 ASTRO NUSANTARA INTERNATIONAL B.V. AND OTHERS V. PT AYUNDA PRIMA MITRA AND OTHERS Judgment Information Date 28 Mar, 2017 Action No. CACV272/2015 Neutral Cit. [2017] HKCA 133 Parallel Cit. [2017] 3 HKJR 256 Download MS Word Judgment Reading Options Translation Toggle Highlight Appeal History CACV272/2015 CACV272A/2015 ASTRO NUSANTARA INTERNATIONAL B.V. AND OTHERS v. PT AYUNDA PRIMA MITRA AND OTHERS CACV 272/2015 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF APPEAL CIVIL APPEAL NO. 272 OF 2015 (ON APPEAL FROM HCCT NO. 45 OF 2010) ________________________ BETWEEN (1) ASTRO NUSANTARA INTERNATIONAL B.V. Applicants/ (2) ASTRO NUSANTARA HOLDINGS B.V. Claimants in the Arbitration/ (3) ASTRO MULTIMEDIA CORPORATION N.V. Judgment Creditors (4) ASTRO MULTIMEDIA N.V. (5) ASTRO OVERSEAS LIMITED (formerly known as AAAN (Bermuda) Limited) (6) ASTRO ALL ASIA NETWORKS PLC (7) MEASAT BROADCAST NETWORK SYSTEMS SDN BHD (8) ALL ASIA MULTIMEDIA NETWORK FZ-LLC and (1) PT AYUNDA PRIMA MITRA Defendants/ (2) PT FIRST MEDIA TBK (formerly known as PT BROADBAND MULTIMEDIA TBK) Respondents in the Arbitration/ Judgment Debtors (3) PT DIRECT VISION ________________________ Before: Hon Lam VP, Kwan JA and Lok J Dates of Written Submissions: 7 and 14 February 2017 Date of Judgment: 29 March 2017 ________________________ J U D G M E N T ________________________ Hon Kwan JA (giving the judgment of the court): 1. This is the application of the 2 nd defendant (“First Media”) for leave to appeal to the Court of Final Appeal from an interlocutory order made by this court (Kwan JA and Lok J) in our judgment on 5 December 2016 (“CA Judgment”). By our order, we dismissed First Media’s appeal and upheld Chow J’s judgment (“CFI Judgment”) in refusing to extend time for First Media to apply to set aside: (a) two orders made by Saunders J on 3 August 2010 and 9 September 2010 (“the Hong Kong Orders”), giving leave to the 1 st to 8 th applicants (“Astro”) to enforce five Singapore arbitration awards (“the Awards”); and (b) the judgment of Saunders J entered on 9 December 2010 (“the Hong Kong Judgment”) pursuant to the Hong Kong Orders. 2. First Media seeks leave to appeal to the Court of Final Appeal by a notice of motion issued on 3 January 2017. The notice of motion, apart from setting out in §1 the questions said to be of great general or public importance, makes detailed submissions in §§2 to 36. First Media relies on those submissions and did not serve a separate submission in support of the application. Pursuant to the directions of the Registrar of Civil Appeals, Astro has served submissions in opposition and First Media made submissions in reply. First Media seeks to have an oral hearing of the application. 3. Having considered the comprehensive submissions before us, we think it appropriate to determine the application on the basis of the written submissions only. 4. These are the three questions set out in the notice of motion: (1) What is the proper test for determining whether an extension of time should be granted for the purposes of an application to resist enforcement of an arbitral award under the 1958 New York Convention on the Enforcement of Foreign Arbitral Awards (“the New York Convention”)? (“Question 1”) (2) In determining whether to extend time for the purposes of an application to resist enforcement of an arbitral award under the New York Convention, is the fact that the award has not been set aside by the courts of the seat of arbitration a relevant factor? (“Question 2”) (3) What is the proper test for determining whether a party seeking to enforce an award under the New York Convention has produced the original arbitration agreement or a duly certified copy of it within the meaning of s 43 of the Arbitration Ordinance ( Cap 341 ) [1] (“the Ordinance”)? (“Question 3”) 5. Questions 1 and 2 relate to section E of the CA Judgment. Question 3 relates to section F. 6. Apart from contending there are questions of great general or public importance in the intended appeal, First Media also invokes the “or otherwise” ground to seek leave to appeal. Question 1 7. This relates to the guidance given in The Decurion [2012] 1 HKLRD 1063 and in Terna Bahrain Holding Company WLL v Al Shamsi & Ors [2013] 1 Lloyd’s Rep 86, discussed in §§74 to 83 of the CA Judgment. 8. Mr Mark Strachan, SC [2] contended on behalf of First Media that the proper test should be the general guidance given in The Decurion instead of that in Terna Bahrain which was developed by the English courts in the specific context regarding extension of time to challenge an arbitration award, thatthe CFI and CA Judgments have departed from established practice, and that a different test is not required to serve the needs of arbitration. Had the general principles in The Decurion been applied, the absence of prejudice to the award creditor if an extension of time were granted would have been given significant weight. And in respect of an extension of time, a distinction should be drawn between an application to resist enforcement of Convention awards (the exercise of a “passive” remedy) and an application to set aside awards in the seat of arbitration (the exercise of an “active” remedy). 9. We do not think the contentions are reasonably arguable. 10. In the first place, as pointed out in the CA Judgment [3] , Chow J did have regard to the general guidance in The Decurion [4] . There was no departure from the general principles therein. The judge did not take a rigid mechanistic approach but had weighed up all the relevant matters in the exercise of his discretion in refusing to extend time. 11. The real complaint made on appeal, and renewed in the present application for leave to appeal, was the weight or lack of weight given by the judge to the various factors he took into consideration. First Media had rightly acknowledged on appeal that the weighting of factors is not to be interfered with by the appeal court unless the result is perverse [5] . The argument that the general guidance in The Decurion should be adopted is nothing but a guise for the contention that significant weight should be given to the lack of prejudice of Astro and the merits of First Media’s application to set aside the enforcement of the Awards, whereas little weight or no weight should be given to speedy finality in the arbitration context. 12. There is no merit in the distinction drawn between “passive” remedy and “active” remedy for present purpose. Granted that actively applying to set aside an award has to be done within the prescribed time limit (because the outcome has potential erga omnes effect in that the award if set aside no longer exists and is no longer capable of enforcement anywhere else), whereas resisting enforcement of an award can only be done as, when and where enforcement proceedings are commenced, it does not mean that when the “passive” remedy comes to be exercised, the prescribed time limit (in this instance, 14 days as provided in Order 73 rule 10(6)) could and should be readily disregarded. In the exercise of both kinds of remedy, and in the arbitration context generally, speedy finality is of great importance. 13. We do not propose to repeat our reasoning why the guidance in Terna Bahrain is clearly of relevance in this context [6] . As rightly submitted by Mr Bernard Man, SC [7] for Astro, Terna Bahrain is perfectly consistent with The Decurion , albeit addressing extension of time in a specific context, and applications for extensions of time are always context specific. We do not think there is any point of law, let alone a point of law of great general or public importance, that requires clarification. 14. We refuse to give leave to appeal on this question. Question 2 15. This relates to the contention that the judge had taken an irrelevant factor into account, namely, that the Awards have not been set aside by the supervising court and that they are still valid and create legally binding obligations [8] . This is dealt with in the CA Judgment at §§84 to 87. 16. Mr Strachan repeated the submission made on appeal it is not relevant to take this factor into account as this would undermine the “choice of remedies” principle. For the reasons given in the CA Judgment, we fail to see how this factor could be said to be irrelevant, or that the “choice of remedies” principle would be undermined by taking this factor into account. 17. Mr Man asked us to test the matter in this way: if the Awards had been set aside by the supervisory court with a potential erga omnes effect after the Hong Kong Orders and the Hong Kong Judgment were rendered, the Hong Kong court in dealing with an application to extend time to set aside the Hong Kong Orders and Judgment might well approach the matter in a different light. Hence, the fact that the Awards have not been set aside by the supervising court must be relevant. We think that must be right. 18. The arguments raised by First Media are not reasonably arguable. Nor do we think there is a question of great general or public importance. We decline to give leave to appeal on this question. Question 3 19. This relates to the statutory pre-conditions for enforcement of the Awards and was dealt with briefly in the CA Judgment at §§105 to 109, as Mr Toby Landau, QC for First Media did not press his arguments on this point on appeal. The contention was that even if time is not extended, enforcement of the Awards should nevertheless be refused on the basis that Astro is unable to satisfy the statutory pre-conditions for enforcement of the Awards in section 43 of the Ordinance. In gist, the law as stated in the decision of Mance LJ (as he then was) in Dardana Ltd v Yukos Oil Company [2002] 2 Lloyd’s Rep 326 was followed [9] . Under section 43 (stage 1 of a two-stage approach), the court is concerned with the apparent compliance of the arbitration agreement with the requirements of Article II of the Convention, the challenge to the validity of the arbitration agreement is to be dealt with under section 44 (stage 2 of the approach). 20. First Media now seeks to argue at length that the contrary approach in the decision of the Court of Appeal in Victoria in IMC Aviation Solutions Pty Ltd v Altain Khuder LLC (2011) 253 FLR 9 should be followed, and submitted that at stage 1 the award creditor must satisfy the enforcement court that the award creditor and award debtor are parties to the arbitration agreement on a prima facie basis. 21. Dardana Ltd v Yukos Oil Company was applied by the English Court of Appeal in Rainstorm Pictures Inc v Lombard-Knight [2014] Bus L R 1196. The English Court in the latter decision at §§29 to 32 also noted and approved of the materially identical approach adopted by Burrell J in Medison Co Ltd v Victor (Far East) Ltd [2000] HKC 502 at 506. 22. Chow J followed Dardana Ltd v Yukos Oil Company because the relevant wording in relation to the two stages for enforcement of a Convention award in Part IV of the Ordinance and sections 100 to 104 of the English Arbitration Act 1996 is the same or materially the same [10] . This cannot be said for the decision of the Victorian Court of Appeal, which was concerned with the proper construction of sections 8 and 9 of the International Arbitration Act 1974 (Cth), see §§28, 36 to 43, 47 to 48 (per Warren CJ); §§125, 130, 134 to 138, 150 to 170, 184 (per Hansen JA and Kyrou AJA). The Australian court considered the relevant English authorities, including Dardana Ltd v Yukos Oil Company , but was “confined in the weight which it is able to accord to those decisions by the terms of the Australian Act” (at §42). 23. We do not think it reasonably arguable that the judge was wrong to apply the law in the English authorities. We refuse leave to appeal on this question. “Or otherwise” ground 24. Under the rubric of the “or otherwise” ground, First Media repeats its submissions made on appeal that the judge’s exercise of discretion was plainly wrong, having regard to the “exceptional” circumstances. They are also a re-hash of the arguments in respect of Questions 1 and 3. Most of the considerations raised by Mr Strachan were addressed in the CA Judgment at §§88 to 103. 25. We are not persuaded there are exceptional circumstances here to justify leave to be granted on the “or otherwise” ground ( Chao Keh Lung v Don Xia (2004) 7 HKCFAR 260 at §9). Whether discretion should be exercised to extend time for First Media to apply to set aside the Hong Kong Orders and Judgment had been considered at two court levels. The intended appeal is an attempt to persuade a third tribunal to exercise the discretion differently. 26. In any event, save in exceptional circumstances, which we do not think exist here, the practice of the appeal court is to leave the question of whether leave should be granted on the “or otherwise” ground to the Appeal Committee of the Court of Final Appeal ( Lau Cho Kun v Lau Siang Kok Lionel , CACV 212/2012, 16 October 2013, at §17). Order 27. We dismiss the application of First Media for leave to appeal with costs to Astro. We have considered the statement of costs of Astro for summary assessment. We consider the amounts claimed entirely reasonable and allow the costs in full at $109,686. (M H Lam) Vice President (Susan Kwan) Justice of Appeal (David Lok) Judge of the Court of First Instance Written submissions by Mr Bernard Man SC and Mr Justin Ho, instructed by Clifford Chance, for the 1 st to 8 th Applicants (1 st to 8 th Respondents) Written submissions by Mr Mark Strachan SC and Mr Jeffrey Chau, instructed by Stephenson Harwood, for the 2 nd Defendant (Appellant) [1] Cap 341 has since been repealed and replaced by the Arbitration Ordinance , Cap 609 . [2] With Mr Jeffrey Chau [3] CA Judgment, §82 [4] CFI Judgment, §§119 to 131 [5] CA Judgment, §93 [6] CA Judgment, §§78 to 83 [7] With Mr Justin Ho [8] CFI Judgment, §129(3) [9] CFI Judgment, §§109 to 118 [10] CFI Judgment, §116 Look up this case on Lawcite Noteup",
  "length": 14073,
  "headers_seen": [
    "Question 1",
    "Question 2",
    "Question 3",
    "Order"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkca/2017/133",
  "query": "seat of arbitration",
  "ts": "2025-10-16T10:49:13",
  "ok": true
}