{
  "title": "KEEN LLOYD HOLDINGS LTD AND OTHERS V. COMMISSIONER OF CUSTOMS AND EXCISE AND ANOTHER | [2018] HKCFI 2140 | HKLII",
  "court": null,
  "year": 2018,
  "date": "2025-01-02",
  "content": "HKLII Databases Court of First Instance [2018] HKCFI 2140 KEEN LLOYD HOLDINGS LTD AND OTHERS V. COMMISSIONER OF CUSTOMS AND EXCISE AND ANOTHER Judgment Information Date 19 Sep, 2018 Action No. HCA2140/2016 Neutral Cit. [2018] HKCFI 2140 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCA2140/2016 HCA2140/2016 KEEN LLOYD HOLDINGS LTD AND OTHERS v. COMMISSIONER OF CUSTOMS AND EXCISE AND ANOTHER HCA 2140/2016 [2018] HKCFI 2140 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE HIGH COURT ACTION NO 2140 OF 2016 ________________________ BETWEEN Keen LLoyd Holdings Limited 1 st Plaintiff Yinggao Shipping (H.K.) Limited 2 nd Plaintiff Shan Ao international Limited 3 rd Plaintiff Young Crystal Limited 4 th Plaintiff ECO Metal (Hong Kong) Limited 5 th Plaintiff Leung Ka Yip 6 th Plaintiff Chun Chor Shing 7 th Plaintiff Mak Pui Cheong 8 th Plaintiff Chun Yuet-Ming, Jessica 9 th Plaintiff Chin Kam Chiu 10 th Plaintiff And Commissioner of Customs and Excise 1 st Defendant Department of Justice 2 nd Defendant ________________________ Before: Hon Chow J in Chambers (Open to Public) Date of Hearing: 13 September 2018 Date of Decision: 20 September 2018 __________________ D E C I S I O N __________________ INTRODUCTION 1. There are before the court 2 interlocutory appeals:- (1) the 6 th , 9 th and 10 th Plaintiffs’ appeal by notice of appeal dated 24 April 2018 (“the 1 st Appeal”) against the order of Master K H Hui dated 13 April 2018 refusing the 10 th Plaintiff’s application by summons dated 27 March 2018 to “invalidate” the Defence filed by the Defendants on 14 March 2018; and (2) the 10 th Plaintiff’s appeal by notice of appeal dated 4 July 2018 (“the 2 nd Appeal”) against the order of Master J Wong dated 22 June 2018 dismissing the 10 th Plaintiff’s application by summons dated 31 May 2018 to replace two sealed orders of Master A Ho dated 15 February 2018 and 28 March 2018 respectively drawn up by the Defendants. THE 1 ST APPEAL 2. The background facts relating to the Plaintiffs’ challenge to the validity or effect of a number of search warrants issued against them are set out in the judgment of McWalters JA (sitting as an additional Judge of the Court of First Instance) in HCAL 113/2012 and HCAL 82/2013 dated 23 December 2014, and shall not be repeated here. By his judgment, McWalters JA held, inter alia , that some of the search warrants under challenge were issued without lawful authority, while others were not executed within a reasonable time from the date of their issue and thus had lapsed by the time of their execution. 3. On 12 November 2015, McWalters JA further ordered that the assessment of damages suffered by the Plaintiffs arising from the execution of the search warrants should continue as if the claim for damages had been begun by writ under Order 53, rule 9(5) of the Rules of the High Court , and gave directions for the filing of pleadings by the Plaintiffs and the Defendants. In particular, the Plaintiffs were required to file their Statement of Claim within 28 days from 12 November 2015, and the Defendants were required to file their Defence within 35 days thereafter. 4. The Plaintiffs’ Statement of Claim was eventually filed on 29 January 2016. 5. On 21 March 2016, McWalters JA made an order extending the time for the Defendants to file the Defence to 31 March 2016. 6. On 31 March 2016, the Plaintiffs and the Defendants filed a consent summons to stay the proceedings for the assessment of damages until the determination of the appeals in CACV 97 and 107/2015 (“the Appeal”) by the Court of Appeal. On 5 April 2016, Lok J made an order in terms of the said consent summons. 7. On 22 April 2016, the Court of Appeal gave judgment in the Appeal. The Defendants’ appeal was partially successful, but the Plaintiffs’ claim for damages continued notwithstanding the Defendants’ partial success in the Court of Appeal. 8. On 27 July 2016, the Plaintiffs and the Defendants filed a further consent summons to stay the proceedings for the assessment of damages for 3 months from the date of the order to be made thereunder. On 17 August 2016, Au J made an order staying the proceedings for the assessment of damages for 3 months. 9. On 5 December 2016, a further consent order was made staying the proceedings for 3 months. 10. On 6 March 2017, another consent order was made staying the proceedings for 3 months. 11. Lastly, on 15 September 2017, a consent order was made staying the proceedings for 6 months from the date of that order. Accordingly, the stay of proceedings expired on 15 March 2018. 12. Prior to the expiry of the stay of proceedings, the Defendants filed the Defence on 14 March 2018. 13. The 10 th Plaintiff considered that the Defendants were out of time in filing the Defence and applied by summons on 27 March 2018 to “invalidate” the Defence. The 10 th Plaintiff’s summons was heard by Master K H Hui on 13 April 2018. The Master held that the Defence was, or should be regarded as being, valid. The 6 th , 9 th and 10 th Plaintiffs now appeal against the order of Master K H Hui. 14. Two main arguments were advanced by the 10 th Plaintiff (representing himself and the 6 th and 9 th Plaintiffs) in support of the appeal at the hearing on 13 September 2018. First, the 10 th Plaintiff argued that the various orders staying the proceedings did not run continuously in that there were gaps between those orders, and thus the Defendants were required to file their Defence long before the expiry of the stay of proceedings imposed by the last consent order dated 15 September 2017. In my view, while the 10 th Plaintiff may be correct to say that the various orders staying the proceedings did not run continuously (for example, the stay of proceedings pursuant to the order of Lok J dated 5 April 2016 would expire upon the determination of the Appeal by the Court of Appeal on 22 April 2016 but the next stay of proceedings granted by Au J only commenced on 17 August 2016), it seems to me to be clear from the history of the matter that the parties intended the stay of proceedings to operate continuously until 15 March 2018. In any event, assuming for the sake of argument that the Defendants ought strictly to have filed the Defence upon the expiry of the stay of proceedings pursuant to Lok J’s order, the filing of the Defence by the Defendants on 14 March 2018 without leave was only an irregularity, and it was well within the discretion of Master K H Hui to treat the Defence as having been validly filed under Order 2, rule 1(2) of the Rules of the High Court . In the circumstances of this case, I consider that the irregularity, if any, in the filing of the Defence by the Defendants on 14 March 2018 ought to be excused and the Defence ought to be treated as having been validly filed. 15. Second, the 10 th Plaintiff relied upon Order 2, rules 4 and 5, of the Rules of the High Court and argued that in view of the Defendants’ failure to comply with the relevant time limit for the filing the Defence, “sanction” for such failure should be regarded as having taken effect. This argument is based on the misconceived view that some sanction was imposed by a rule or court order for the Defendants’ failure to file the Defence within a specified time limit. There is, however, no such rule or order made by the court. 16. In his written submissions, the 10 th Plaintiff also argues that the consent order procedure under Order 42, rule 5A, of the Rules of the High Court has no application in the present case because, upon the conversion of the assessment of damages as a writ action, the provisions of Order 28, rule 8 shall apply by virtue of Order 53, rule 9(5). I am unable to see why, upon the conversion of the assessment of damages as a writ action pursuant to the order of McWalters JA dated 12 November 2015, the provisions in Order 42, rule 5A are not applicable to the action. 17. In all, I reject the 10 th Plaintiff’s appeal against the order of Master K H Hui dated 13 April 2018. THE 2 ND APPEAL 18. On 5 February 2018, the 10 th Plaintiff issued a summons seeking to enter judgment against the Defendants in default of defence. That application came before Master A Ho on 15 February 2018, who dismissed the application for reasons which are not relevant to the present appeal. 19. On 15 March 2018, the 10 th Plaintiff issued a further summons seeking to enter judgment against the Defendants in default of defence (notwithstanding the fact that a defence had been filed by the Defendants on 14 March 2018). The 10 th Plaintiff’s application also came before Master A Ho on 28 March 2018. The Master dismissed the application, again for reasons which are not relevant to the present appeal. 20. On 26 April 2018, the Court issued two sealed orders of Master A Ho based on drafts submitted by the Defendants. 21. On 31 May 2018, the 10 th Plaintiff issued a summons seeking to set aside the two sealed orders of Master A Ho prepared by the Defendants and have two other orders prepared by him sealed by the court. The 10 th Plaintiff’s application was dismissed by Master J Wong on 22 June 2018. The 10 th Plaintiff now appeals against the order of Master J Wong. 22. Two points are raised by the 10 th Plaintiff in support of his appeal. First, the 10 th Plaintiff argues that because he was the applicant in the two applications before Master A Ho, he should be the one responsible for preparing the draft orders for the court’s approval. Under Order 42, rule 5(5), of the Rules of the High Court , “[e]very order made and required to be drawn up must be drawn up by the party initiating the application upon which the order was made and if that party fails to draw up the order within 7 days after it is made any other party affected by the order may draw it up”. The 10 th Plaintiff does not dispute that he did not properly draw up the relevant orders within 7 days after they were made (in that he did not sign on the draft orders prepared by him). Accordingly, the Defendants were, in my view, entitled to draw up the two orders of Master A Ho for the court’s approval. In any event, the important question, I consider, is whether the orders as drawn up accurately reflect the actual orders made by the Master, not whether they are drawn up by the 10 th Plaintiff or the Defendants. 23. Second, the 10 th Plaintiff complains that the orders drawn up by the Defendants did not include various comments or observations made by Master A Ho in the course of the hearings (which complaint the 10 th Plaintiff seeks to make good by reference to the transcript of the hearings before the Master). It is not suggested, however, that Master A Ho did not make the orders as stated on the sealed orders. The comments or observations made by Master A Ho did not form part of his orders and do not, in my view, have to be included in the sealed orders. 24. In all, the 10 th Plaintiff’s appeal has no merit and is rejected. DISPOSITION 25. For the foregoing reasons, the two Notices of Appeal dated 24 April 2018 and 4 July 2018 respectively are dismissed with costs to the Defendants. I further assess the Defendants’ costs summarily in the sum of HK$41,913.00. (Anderson Chow) Judge of the Court of First Instance High Court The 6 th , 9 th and 10 th Plaintiffs, acting in person and present Ms Evelyn Tsao, of Department of Justice, for the 1 st and 2 nd Defendants Look up this case on Lawcite Noteup",
  "length": 11491,
  "headers_seen": [
    "INTRODUCTION",
    "THE 1 ST APPEAL",
    "THE 2 ND APPEAL",
    "DISPOSITION"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2018/2140",
  "query": "stay of proceedings",
  "ts": "2025-10-14T11:23:00",
  "ok": true
}