{
  "title": "STANDARD CHARTERED BANK V. LUK SHIU WING AND ANOTHER | [2004] HKCFI 1014 | HKLII",
  "court": null,
  "year": 2004,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2004] HKCFI 1014 STANDARD CHARTERED BANK V. LUK SHIU WING AND ANOTHER Judgment Information Date 4 Nov, 2004 Action No. HCMP254/2004 Neutral Cit. [2004] HKCFI 1014 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCMP254/2004 HCMP000254/2004 STANDARD CHARTERED BANK v. LUK SHIU WING AND ANOTHER HCMP254/2004 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE MISCELLANEOUS PROCEEDINGS NO.254 OF 2004 ______________________ IN THE MATTER OF a property comprised in a Legal Charge dated 5 July 1996 and registered in the Sha Tin, New Territories Land Registry by Memorial No.ST885016, namely, Flat C on 25/F of Carmel Heights, Belair Gardens, No.52 Tai Chung Kiu Road, Shatin, New Territories and IN THE MATTER OF Order 88 rule 1 of the Rules of the High Court ______________________ BETWEEN STANDARD CHARTERED BANK Plaintiff and LUK SHIU WING 1 st Defendant CHAN WAI MAN ANNA 2 nd Defendant ______________________ Before : Hon Waung J in Chambers Date of Hearing : 5 November 2004 Date of Judgment : 5 November 2004 _______________ J U D G M E N T ________________ 1. This is an appeal by Mr Luk from an order of the master whereby the master, on 15 October 2004, dismissed the application of Mr Luk for the whole proceedings to be reheard and for dismissal of the possession order made by the court on 24 June 2004. 2. This matter is simple. The bank had granted a loan with the security of the property mortgage and it is admitted by Mr Luk today that some $2 odd million is owing to the bank. There was default and proceedings therefore was brought by the bank for money judgment and for possession of the premises which is still presently occupied by Mr Luk. 3. On 24 June, upon hearing the parties including Mr Luk, the master granted a money judgment in favour of the bank and also made an order for possession. Some six weeks later, on 6 August 2004, Mr Luk applied for stay of execution of Master Hui’s order of 24 June. Mr Luk, in the application, asked for two or three months’ stay of the execution so that he could find time to move out of the premises and also hopefully find money to repay the loan. Not a word was said in that application about his mental condition. The application for stay was dismissed by Master Wong on 13 August 2004. A fourteen days’ stay of the order was given by Master Wong. 4. Some two months later, on 13 October 2004, Mr Luk applied to have the whole proceedings reheard and to have the possession order dismissed. On 15 October, this application of Mr Luk for the whole proceedings to be reheard and for the possession order dismissed was heard by Master Lung. There was, at the hearing of that application, a reference by Mr Luk to his being mentally ill and, I believe, a medical certificate was produced to Master Lung. The master dismissed the application of Mr Luk for a rehearing of the proceedings and for a dismissal of the possession order. Appeal is then brought by Mr Luk from Master Lung’s order. 5. I start first with whether there is any ground of defence to the plaintiff’s claim for money judgment and for possession. There is simply no defence. So on that ground alone, there can be no point or even basis for the proceedings to be reopened or for possession to be denied to the plaintiff bank. Secondly, as a matter of procedure, once an order of possession and money judgment had been made by order on 24 June 2004, it can only be altered by either an appeal, which did not happen, or by an application to set it aside. But the application to set aside, which is extremely rare, can only be supported on proper basis, for example, on the basis that there had been fraud or some extraordinary event. 6. This simply is not the case. I can see no ground whatsoever for this court, or any court, to allow this matter to be reopened or for Mr Luk to be allowed further time to stay in the premises. The law must be obeyed and Mr Luk has gone through enough applications wasting everyone’s time and effort. The appeal of Mr Luk against the order of Master Lung must therefore be dismissed with costs. (William Waung) Judge of the Court of First Instance, High Court Mr Paul H.M. Leung, instructed by Messrs Gallant Y.T. Ho & Co., for the Plaintiff The 1 st Defendant, in person Look up this case on Lawcite Noteup",
  "length": 4383,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2004/1014",
  "query": "possession order",
  "ts": "2025-10-17T10:41:44",
  "ok": true
}