{
  "title": "GUAGUAS MUNICIPALES S.A V. BRIGHT MOON INTERNATIONAL TRADE CO. LTD | [2018] HKCFI 1716 | HKLII",
  "court": null,
  "year": 2018,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2018] HKCFI 1716 GUAGUAS MUNICIPALES S.A V. BRIGHT MOON INTERNATIONAL TRADE CO. LTD Judgment Information Date 9 Jul, 2018 Action No. HCA472/2018 Neutral Cit. [2018] HKCFI 1716 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCA472/2018 HCA472/2018 GUAGUAS MUNICIPALES S.A v. BRIGHT MOON INTERNATIONAL TRADE CO. LTD HCA 472/2018 [2018] HKCFI 1716 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE ACTION NO 472 OF 2018 ______________ BETWEEN GUAGUAS MUNICIPALES S.A Plaintiff and BRIGHT MOON INTERNATIONAL TRADE CO. LIMITED Defendant ______________ Before: Deputy High Court Judge Keith Yeung SC in Chambers Date of Hearing: 10 July 2018 Date of Decision: 10 July 2018 ______________ D E C I S I O N ______________ 1. This is the plaintiff’s application for discovery and inspection of entries in banker’s records kept by Industrial and Commercial Bank of China (Asia) Limited (“ ICBC ”) in respect of a specified account (the “ Account ”) which the defendant has maintained with it. The period of discovery is between 7 February 2018 and the date of disclosure. 2. The plaintiff is a company registered in Spain. The defendant is a limited company registered in Hong Kong. It has two directors, whose addresses appear to be in the Mainland. 3. The plaintiff is the victim of an internet and impersonation fraud. The amount of loss is EUR 982,765 (the “ Defrauded Sum ”). Details of how the fraud was perpetrated have been set out in the Affirmation of Manuel Angel Hernandez Damaso, which I have read. The Defrauded Sum was remitted into the Account on 7 February 2018. On 28 February 2018, the plaintiff sought and obtained an ex parte Mareva and proprietary injunction against the defendant (the “ Injunction ”). It was continued by me on 9 March 2018. On 20 March 2018, the plaintiff filed its Statement of Claim. On 7 May 2018, default judgment was obtained. All along, the defendant has ignored all the legal proceedings against it. 4. On 22 June 2018, the plaintiff took out the present application. I have read the affirmations of service of Fu Man Kit and Foo Tsang Tsang. The summons and the documents in support have been served upon the defendant and ICBC. The defendant has failed to appear. ICBC has also failed to respond. 5. I have considered Order 32 , rule 5 of the Rules of the High Court . I bear in mind the fact that the defendant has all alone ignored the legal proceedings against it. I also bear in mind the fraudulent conduct alleged (and now taken to have been substantiated in the light of the default judgment) against it. I deem it expedient to proceed with this application in the absence of the defendant. 6. I have considered the evidence filed before this Court. I have considered the submissions made by Ms Fiona Chong. I have considered the authorities cited in support. I have previously, echoing the warning made in previous authorities, observed that the powers which the Court is now being invited to invoke have to be exercised with great caution. It is important to maintain banker/customer confidence. I have on the other hand in Akbank TAS v Mainford Limited & Ors [2018] HKCFI 363 (unreported, HCA 3264/2016, 22 February 2018) observed that Hong Kong being an international city, the law should be facilitative but not obstructive when a victim of a cybercrime comes to our courts for lawful redresses against the true culprits. It is a balancing exercise which the Court has to undertake. In the present case, I note that the defendant has ignored all the legal proceedings that have been brought against it. In particular, it has failed to comply with the discovery order contained in the Injunction, which specifically requires it to make certain disclosure in respect of the Account. Such failure on the part of the defendant to do so is in my mind an important consideration. On the facts of this case, I am satisfied that an order in terms of the Summons as briefly amended should be made. I so order. (Keith Yeung SC) Deputy High Court Judge Ms Fiona Chong, instructed by JC Legal, for the plaintiff The defendant was not represented and did not appear Industrial and Commercial Bank of China (Asia) Limited, absent Look up this case on Lawcite Noteup",
  "length": 4318,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2018/1716",
  "query": "cybercrime",
  "ts": "2025-10-17T10:44:33",
  "ok": true
}