{
  "title": "SUN TIAN GANG V. HONG KONG & CHINA GAS (JILIN) LTD | [2016] HKCFI 1611 | HKLII",
  "court": null,
  "year": 2016,
  "date": "2025-01-02",
  "content": "HKLII Databases Court of First Instance [2016] HKCFI 1611 SUN TIAN GANG V. HONG KONG & CHINA GAS (JILIN) LTD Judgment Information Date 20 Sep, 2016 Action No. HCCT46/2015 Neutral Cit. [2016] HKCFI 1611 Parallel Cit. [2016] 5 HKLRD 221 [2017] 1 HKC 69 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCCT46/2015 HCCT46/2015 SUN TIAN GANG v. HONG KONG & CHINA GAS (JILIN) LTD HCCT 46/2015 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO 46 OF 2015 ______________ IN THE MATTER of Section 34C, Part IIA International Arbitration of the Arbitration Ordinance ( Cap 341 ) and IN THE MATTER of Article 34 of the UNCITRAL Model Law on International Commercial Arbitration and IN THE MATTER of an application made under (2)(a)(ii), (2)(b)(ii) and (3) of Article 34 of the UNCITRAL Model Law on International Commercial Arbitration for leave to set aside the arbitral award granted in Hong Kong & China Gas (Jilin) Limited v Sun Tian Gang dated 15 March 2007 ______________ BETWEEN SUN TIAN GANG (孫天罡) Plaintiff and HONG KONG & CHINA GAS (JILIN) LIMITED Defendant (香港中華煤氣（吉林）有限公司) ______________ Before : Hon Mimmie Chan J in Chambers Date of Hearing : 25 July 2016 Date of Further Written Skeleton Submissions : 16 & 25 August 2016 & 1 September 2016 Date of Decision : 21 September 2016 _____________ D E C I S I O N _____________ Introduction 1. It has been emphasized by the Hong Kong courts that the object of the Arbitration Ordinance is to facilitate the effective and speedy resolution of disputes by arbitration, and the primary aim of the court is to facilitate the arbitral process and to assist with enforcement of arbitration agreements and awards, as mechanistically as possible. This, however, should not in any way be seen to undermine the importance of due and fair process, and the fundamental safeguards which must be observed, to ensure that no injustice arises out of the arbitral process or the award. The failure to observe these standards are recognized as grounds on which an award can be set aside, or refused enforcement. This is also demonstrated by s 3 (2) of the Arbitration Ordinance (“ Ordinance ”) Cap 609 (and s 2AA of Cap 341 if applicable) itself, which refers to the court’s interference in the arbitration of a dispute only as expressly provided by the Ordinance, but subject to “the observance of such safeguards as are necessary in the public interest”. 2. The Ordinance itself adopts and applies Article 18 of the Model Law, which provides that parties shall be treated equally and each party shall be given a full opportunity of presenting his case. In Hebei Import & Export Corp v Polytech Engineering Co Ltd (1999) 2 HKCFAR 111 , 136, the Court of Final Appeal recognizes that a party is under a duty of good faith in the conduct of an arbitration, and a breach of bona fide justifies the court of enforcement to recognize and enforce the award, notwithstanding that a valid ground is made out. 3. Arbitration is by consensual agreement. As a mode of dispute resolution, arbitration is seen as more informal in nature than litigation in courts. Nevertheless, lack of due process, and breach of the rules of natural justice in the arbitral process are recognized grounds to set aside or refuse recognition of an award: whether under the ground of lack of proper notice of the arbitration, or for inability to present a party’s case, or for bias on the part of the tribunal, or for breach of public policy. Fairness, and due process, underpin the arbitral process and are the pre-requisites for the recognition it is afforded by the courts. 4. Hence, the fundamental principle of the law and of natural justice - that a person against whom any claim is made or any relief or remedy is sought in any proceedings must be given due and fair notice of those proceedings, so as to enable him to answer and defend these claims - applies to arbitration as much as it applies to legal proceedings in court. Service of notice of arbitration is an important step in the arbitration, and bears no less significance than the service of the writ or other originating process in judicial proceedings. This case is about the validity of service of the notice of arbitration, and of the award. 5. The object of service must be to give notice of the process to the party who may be affected by the proceedings, and any order, judgment or award which may be made in the proceedings against him. The law must be aimed to ensure that a party affected by the proceedings and orders made in the proceedings must be made properly aware of the proceedings, to give him a fair opportunity to present his case before an order or award is made against him. Natural justice requires this. The dispute in this case is whether and how these principles are altered by the parties’ agreement, and by the Model Law. Background 6. At the material time, the plaintiff (“ Sun ”) owned all the shares in Sky Global Limited (“ Sky ”), which in turn held 63% of the interests in a company on the Mainland known as 吉林市吉美天然氣有限公司(“ JV Company ”). 37% of the interests in the JV Company was owned by a state owned company named吉林市天然氣有限公司. The JV Company carried on business on the Mainland in the development of infrastructure and networks for the supply of natural gas in Jilin. 7. At all material times, the defendant (“ Gas ”) was and is a BVI company, and a wholly owned subsidiary of Hong Kong and China Gas International Limited, which is in turn wholly owned by Hong Kong and China Gas Company Limited, a company listed in Hong Kong. 8. By an agreement dated 7 February 2005 (“ Agreement ”), Gas acquired from Sun all his shares in Sky, and thereby indirectly the 63% interests in the JV Company, for the price of HK$101,886,792 (“ Price” ), payable in 3 trenches. There is no dispute at least that Gas paid the 1 st and 2 nd trenches of the Price, but never paid the 3 rd installment of HK$20,377,358.40, which was approximately 20% of the Price. Gas refused to make the 3 rd trenche payment, on the ground that the relevant audited financial statements in 2004 failed to show the asset value of the JV Company as warranted, and also failed to show that the relevant associated companies were free from encumbrances. On that basis, Gas alleged that Sun was in breach of the guarantees and warranties provided under the Agreement. By a letter dated 3 August 2005, Gas notified Sun that it would withhold payment of the 3 rd trenche of the Price, and reserved its claim against Sun for damages in respect of his breach of the Agreement. 9. The Agreement is governed by Hong Kong law. It provides for all disputes in connection with the Agreement, its performance and interpretation to be finally resolved by arbitration in Hong Kong by the HKIAC. 10. On 18 November 2005, Gas commenced arbitration against Sun under the Agreement (“ Arbitration ”). The Notice of Arbitration (“ NOA ”) was served on Sun at 3 addresses in Hong Kong and in Jilin on the Mainland. The Arbitration finally led to an award which was issued on 15 March 2007 (“ Award ”), and served on Sun at the same 3 addresses in Hong Kong. Under the Award, Sun was ordered to pay to Gas damages of HK$4,263,831.95, and a declaration was made that Gas was entitled to withhold payment of the 3 rd trenche of HK$29,337,358.40. 11. On Sun’s case, he had been arrested in Shenzhen by Mainland public security officers on 11 August 2005, and was subsequently transferred to Jilin, where he was detained in custody. Sun was apparently formally arrested by the authorities in Jilin on 16 September 2005, on suspicions of having provided false capital. Prosecution against Sun commenced in the Jilin court in December 2007, for charges of deception, providing false capital, misappropriation and bribery. It was only on 8 November 2010 that Sun was granted bail pending trial, but he was taken to an apartment in Beijing under house arrest, where Sun stayed with public security officers and remained monitored by them. According to Sun, during the entire time when he was detained after his arrest in August 2005, he was deprived of contact with the outside world. His family, friends and colleagues did not know where he was detained, until 29 November 2005 when he met with a lawyer assigned to him for the first time. In September 2006, Sun was finally able to meet with his own lawyer, Gao. 12. During this time, there were 2 rounds of criminal prosecution against Sun. The 1 st round of charges made against Sun in December 2007 were withdrawn on 19 February 2009, but he remained in custody. On 4 June 2009, the prosecution of the 2 nd round of charges was commenced. Sun remained in custody throughout, including being kept under house arrest from 8 November 2010. He met with his lawyer Gao and, on one occasion, with his colleague Du, during this period of detention. However, according to Sun, these meetings were tightly monitored and restrained. 13. It was only on 6 March 2012 that all criminal charges against Sun were withdrawn, and Sun was able to return to Hong Kong a month later. He fled to the United States on 3 April 2013, out of fear for his personal safety, and returned to Hong Kong in June 2014. 14. On Sun’s case, the Arbitration was commenced without his knowledge and proceeded in his absence during the period of his incarceration. He claims that the NOA was not validly served on him, and he had no proper notice of the commencement of the Arbitration. He was not represented at the Arbitration, and the Award was made in his absence. He never had the opportunity to present his case and answer the claims made against him in the Arbitration, and the Award which was made in his absence was never validly served on him. 15. Significantly, Sun claims that his arrest, detention and incarceration were all known to Gas. Not only was the matter of Sun’s arrest highly publicized in Jilin. Sun claims that the charges brought against him, and for which he was arrested, were related to the Agreement and the subject matter of the Agreement. Personnel of the JV Company acquired by Gas under the Agreement were interviewed in respect of the prosecution, and in any event had knowledge of Sun’s arrest and detention. Hence, it is Sun’s case that Gas knew that the NOA (and later, the Award) could not have been received by Sun when the NOA was served in November 2005 and the Award was delivered in March 2007, and Gas further knew that Sun would not be able to appear in the Arbitration to present his case, but withheld such information from the Tribunal. 16. According to Sun, he only received the Award in May 2015. In around October to December 2014 (after Sun’s release), Sun had been told by his staff in Jilin that some documents relating to the Arbitration had been found in Du’s former office in Jilin. Sun instructed his staff to pass the documents to Gao. In April 2015, Gao retrieved the Award (but without the Reasons for the Award (“ Reasons ”)) from documents in the Jilin court, and these were passed to Sun in May 2015. 17. Accordingly, on 16 October 2015, Sun commenced these proceedings to set aside the Award, on the grounds that he was not given proper notice of the Arbitration, and was unable to present his case (under Article 34 (2) (a) (ii) of the Model Law), and that the Award is in violation of the public policy of Hong Kong. Sun seeks an extension of time to apply for the setting aside of the Award, to the extent that it is required. 18. On Gas’s case, the NOA and the Award were validly served on Sun by virtue of the express provisions of the Agreement, and under Articles 3 and 31(4) of the Model Law. Gas further claims that Sun’s application to set aside is out of time, and that the Court has no power to extend time under Article 34 (3) of the Model Law, after 3 months from the date on which Sun had received the Award. 19. As the parties agree, Cap 341 applies to the Arbitration, which commenced before 1 June 2011, the operative date of Cap 609 . Was Sun given proper notice of the arbitral proceedings? 20. According to Gas, the NOA was sent to Sun at 3 addresses: (1) Unit 2301, Hong Kong Convention and Exhibition Centre (“ Centre ”) (“ 1 st Address ”), by fax and by delivery; (2) Room 3003 Great Eagle Centre (“ 2 nd Address ”), by delivery; and (3) an address of a company in Jilin (“ 3 rd Address ”), by courier and fax for the attention of Du, for Du to forward to Sun. 21. The 1 st Address and fax number was the communication address (“通訊地址”) specified for Sun under clause 10.3 of the Agreement. Clauses 10.1 and 10.2 provide as follows (as translated): “10.1 Any notice to be served by one party to the other party pursuant to this Agreement shall be in writing, and in the Chinese language. 10.2 Any notice to be sent shall specify the communication addresses of both parties set out in clause 10.3. Any notice which clearly specifies the communication addresses of the parties in accordance with the following rules shall be regarded as formally delivered : (a) for personal delivery, delivery to the communication address of the other party shall be regarded as delivery; (b) for airmail, the 7 th banking business day after the date of posting shall be regarded as delivery; (c) for dispatch by fax, the time of dispatch of the fax shall be regarded as delivery.” 22. Clause 10.4 of the Agreement requires any party to duly notify the other with regard to any change in its communication address set out in clause 10.3. 23. The 1 st Address was also the registered office address of GeoMaxima Holdings Co Ltd (“ Geo ”), a Hong Kong company which was controlled by Sun at the material time for the management of his business interests. This is according to an Annual Return dated 29 November 2004, filed on behalf of Geo at the Companies Registry in December 2004. It was only on 28 December 2004 that the registered office address of Geo was changed to the 2 nd Address, as evidenced by a Notification of Situation of Registered Office filed at the Companies Registry in January 2005. Much later, in November 2011, the registered office address of Geo was further changed to another address in Discovery Bay, but stated to be with effect from 28 December 2004. 24. On Gas’s own evidence, when the NOA was delivered to the 1 st Address on 18 November 2005, there was in fact no unit 2301 at the Centre. The fax number specified for Sun in clause 10.3 of the Agreement was also incorrect (which is taken to mean that the NOA could not be faxed to the stated number). An example can be seen from the correspondence exchanged between the Tribunal and Gas’s solicitors, Messrs Johnson Stokes and Master (“ JSM ”), when JSM referred the Tribunal to their purported service of the witness statements on Sun, at the 1 st Address by the fax number stated in clause 10.3 of the Agreement. The fax report relied upon by JSM (at p 1468 of the hearing bundles) recorded that there was “no facsimile connection”. 25. The NOA was delivered to the 2 nd Address on 18 November 2005, but the document was returned to the solicitors acting for Gas (who effected the service of the NOA) under cover of Geo’s letter dated 21 November 2005, stating that Sun had left and no longer worked at Geo. 26. The NOA was also delivered and faxed to Du at the 3 rd Address. Gas maintains that this was in reliance upon a letter of authorization dated 26 August 2005 (“ Authorization ”), purportedly signed by Sun and Du, whereby Sun appointed Du to be his agent, to (inter alia) negotiate, receive documents, commit to or give up rights and obligations under the Agreement. The Authorization was stated to be for a term from 24 July 2005 until the completion of all matters under the Agreement, and was to be regarded as irrevocable until the appointment of another agent by a written letter of authorization. According to Gas, the Authorization was prepared by Gas and sent to Sun with a letter dated 25 August 2005, and that Gas received a duly signed copy of the Authorization from Geo by return of fax, on 26 August 2005. 27. According to both Sun and Du, they never signed the Authorization, and it was a forgery. Sun highlighted the fact that he was already arrested on 8 August 2005, and there was no way he could have signed the Authorization on 26 August 2005, as alleged by Gas. He was incommunicado as from 8 August 2005. 28. Gas claims that there is no cogent and compelling evidence to substantiate Sun’s allegation of forgery, and claims that it is more likely that Sun himself, or those working for Sun, had caused the Authorization to be signed and delivered to Gas in view of Sun’s detainment, in order to keep an open dialogue with Gas for matters relating to the Agreement. In any event, Gas highlights the fact that service on Du as Sun’s agent at the 3 rd Address was only one of 3 valid modes of service relied upon by Gas. 29. Claims of forgery and non-execution of documents have, sadly and unfortunately, become commonplace in litigation in Hong Kong in the past few years. Witnesses before the courts too readily are prepared, on oath, to disavow documents which bear what appear to be their signatures. I accept that these claims have to be substantiated to the requisite high degree of proof, before they are accepted by the court. In an application to set aside an award on the ground of alleged fraud or forgery, the court has to be satisfied that there are real prospects of success (the test for setting aside a regular judgment) that the applicant would be able to establish its claim ( Karaha Bodas Company LLC v Perusahaan Pertambangan Minyak Dan Gas Buni Negara (Pertamina) (2009) 12 HKCFAR 84 ), but in this case, it may not be necessary to come to that stage. Delivery to the 1 st Address 30. I accept the submissions made on behalf of Gas, that the 1 st Address was the communication address specified for Sun under clause 10.3 of the Agreement. By virtue of the express provisions of clause 10.2 of the Agreement, any delivery of the NOA to Sun at the address specified in clause 10.3 of the Agreement is to be regarded as valid delivery. If the NOA had been left at the 1 st Address, I would have accepted it to have been deemed and valid service under clause 10.3 of the Agreement. On the evidence, however, there was no actual delivery of the NOA to the 1 st Address, since there is no claim made by Gas that the NOA was left at the 1 st Address as purported delivery. 31. According to the evidence filed on behalf of Gas, the server from JSM attempted to deliver the NOA to the 1 st Address, but was not able to locate Sun there, since there was no unit 2301 (paragraph 44 of the affirmation of Yip, and the letter dated 4 January 2006 from JSM to HKIAC). Nor could the NOA have been successfully faxed to the number specified for Sun in clause 10.3 of the Agreement, since JSM acknowledged in their letter of 4 January 2006 to HKIAC that the fax number was not the correct number. If the fax number was incorrect, there could not have been facsimile connection (as supported by the facsimile report attached to JSM’s letter of 4 December 2006), and the NOA could not have been “dispatched”, within the meaning of clause 10.2 (c) of the Agreement. 32. Notwithstanding the fact that there was no unit 2301 at the Centre, and the fact (as Sun claims) that the 1 st Address was no longer the address at which he worked at the time of the Agreement (since the office of Geo had already been moved to the 2 nd Address), it is not disputed by him that he had never communicated to Gas any other address for service or for communication with him, as required under clause 10.4 of the Agreement. As submitted by Mr Chan SC on behalf of Gas, that was a breach by Sun of his obligation under clause 10.4, which directly led to Gas’s inability to effect proper service of the NOA on Sun after the date of the Agreement in November 2005, and Sun cannot rely on his own breach of the Agreement in order to claim any benefits or assert any rights or advantage which arise in consequence of his own breach ( Kensland Realty Ltd v Whale View Investment Ltd (2001) 4 HKCFAR 381 ). I accept Mr Chan’s submissions in this regard. Although Sun claims that even before the execution of the Agreement, Gas had received notice from Geo of its change of address to the 2 nd Address, and the insertion of the 1 st Address in the Agreement was simply an oversight, I agree with Mr Chan that any standard form notification from Geo of its change of address in December 2004, before the parties’ execution of the Agreement in February 2005, could not reasonably have been taken by Gas to mean that the new address of Geo should be taken to be Sun’s own personal communication address under the Agreement. 33. My finding, therefore, is that Sun cannot rely on his breach of clause 10.3 of the Agreement to assert that the NOA could not have been served, or had not been validly served on him at the 1 st Address. If I should be wrong on this, I deal below with the other arguments advanced for Gas on service. Delivery to the 2 nd Address 34. Gas relies further on Article 3 (1) of the Model Law and Article 2 of the UNCITRAL Rules (“ Rules ”), to assert that the NOA should be considered to have been received by Sun. Article 3 (1) provides: “Unless otherwise agreed by the parties: (a) any written communication is deemed to have been received if it is delivered to the addressee personally or if it is delivered at his place of business, habitual residence or mailing address ; if none of these can be found after making a reasonable inquiry, a written communication is deemed to have been received if it is sent to the addressee’s last known place of business, habitual residence or mailing address by registered letter or any other means which provides a record of the attempt to deliver it; (b) the communication is deemed to have been received on the day it is so delivered.” (Emphases added) 35. Article 2 of the Rules similarly provides: “For the purposes of these Rules, any notice, including a notification, communication or proposal, is deemed to have been received if it is physically delivered to the addressee or if it is delivered at his habitual residence, place of business or mailing address , or, if none of these can be found after making reasonable inquiry, then at the addressee’s last known residence or place of business. Notice shall be deemed to have been received on the day it is so delivered.” 36. Mr Chan argued that the “deeming provisions” in Article 3 (1) of the Model Law and Article 2 of the Rules as stated above (“ Deeming Provisions ”) are conclusive, since they are silent as to their being rebuttable by evidence showing the contrary. Hence, it was argued that the fact and effectiveness of the delivery and receipt of the NOA are deemed, even if the relevant document is not personally or physically delivered to or actually received by the recipient. On that basis, since the NOA was delivered to both the 1 st Address and the 2 nd Address, which are Sun’s stated mailing address and his place of business respectively, the effectiveness of the delivery and Sun’s receipt should be conclusively deemed. 37. Even accepting that the Model Law is aimed to achieve effective arbitration without delay, and that the objective of the Rules is to provide for finality and certainty in the process of arbitration, I cannot agree that the Model Law can or was ever intended to derogate from principles of natural justice and fairness, for the reasons highlighted in the opening parts of my Decision. I therefore do not agree that the Deeming Provisions set out in Article 3 (1) and Article 2 of the Rules can preclude a party from adducing evidence to show that, notwithstanding the delivery of any written communication to his last known place of business, habitual residence or mailing address, he had not in actual fact received such written communication. As highlighted in paragraphs 4 and 5 of this Decision, the initiation of the arbitration is an important step in the process, and it would offend fundamental rules of natural justice if a party is shut out entirely from presenting the evidence which can establish that he was never given actual notice of the arbitration, because he had never received the notice of commencement of the arbitration left at an address - which can be for a myriad of legitimate and conceivable reasons. It will be for the Tribunal and the court to consider and decide on the facts of each case whether there is sufficient and credible evidence to rebut the presumptions of receipt. 38. This is supported by Article 34 (2) (a) (ii) of the Model Law, which permits a party to furnish proof to the supervisory court that he was not given “proper notice” of the arbitral proceedings, to set aside the award, and Article 36 (1) (a) (ii), which permits a party against whom an award is invoked to furnish proof to the enforcement court that it was not given “proper notice” of the arbitral proceedings, as a ground to resist enforcement of the award. 39. On the evidence, Sun had been arrested on 11 August 2005 and detained incommunicado thereafter. Significantly, the NOA left at the 2 nd Address on 18 November 2005 was returned to JSM on 21 November 2005, with a letter from Geo stating that Sun had left, and no longer worked at Geo. Irrespective of whether Gas knew on 18 November 2005 that Sun had been arrested and was no longer at the 2 nd Address, Gas and JSM knew on 21 November 2005 that Sun had not in fact received the NOA which had been left at the 2 nd Address. 40. On Sun’s evidence, I find that the Deeming Provisions in Art 3 and Art 3 (2) of the Rules have been rebutted since the NOA delivered to the 2 nd Address was not actually received by him, and had been returned. There was no effective or valid service of the NOA on Sun by its delivery to the 2 nd Address on 18 November 2005. 41. The NOA was not even delivered to the 1 st Address, so the Deeming Provisions do not apply at all. If they apply, they are rebutted on Sun’s evidence. Delivery to the 3 rd Address 42. As for the 3 rd Address, this was neither Sun’s place of business, habitual residence or mailing address. It was Du’s address, and JSM purported to serve the NOA on Du as Sun’s agent in reliance on the Authorization. Given Sun’s incarceration since 11 August 2005, it seems highly unlikely and incredible that Sun could have signed the Authorization on 26 August 2005 (which even on Gas’s case was only sent to Sun on 25 August 2005), as Gas alleges, and to have returned the Authorization to Gas on the same day. I believe Sun’s evidence that he was arrested on 11 August 2005 and was detained without being given the opportunity to communicate with anyone in August 2005. 43. By 21 October 2005, the Vice President of Hong Kong and China Gas International Limited (the holding company of Gas) had already been interviewed by officers of the Jilin Security Bureau at Hong Kong Police Headquarters, relating to Sun’s arrest. On the evidence, Sun’s arrest and detention was also known to the personnel of the JV Company in August 2005, and (according to Sun) was widely publicized in Jilin. It is unlikely that Gas would not have been made aware, through the JV Company and its officers in Jilin and/or Hong Kong, of Sun’s predicaments, even if they may not have been certain, at that stage, of his actual whereabouts. Pertinently, as Ms Wong SC highlighted on behalf of Sun, Gas has never, in any of the evidence filed on its behalf in these proceedings, refuted the claims made by Sun that Gas must have had knowledge of Sun’s arrest and detention. 44. It is not necessary to decide how Sun’s signature was forged and who procured his signature to the Authorization. Suffices it to say that on the evidence available, there is a real prospect of success in Sun’s claim that the Authorization did not bear his signature for the purpose of an application to set aside the Award. 45. Mr Chan SC relies on this court’s decision in Dana Shipping & Trading SA v Sino Channel Asia Ltd HCCT 47/2015, 14 March 2016, to support his argument that service of the NOA on Du, as Sun’s authorized agent, is good service on Sun. Dana Shipping was a decision on an application for security, and this court was only conducting a preliminary review of the merits of the respondent’s intended application to the English supervisory court to set aside an arbitral award. The question of an agent’s authority to accept service of arbitral proceedings was not fully argued before this court. Since the decision of this court in Dana Shipping , the English court in fact set aside the award on the ground that the agent had neither actual, nor implied or apparent authority to accept service of the notice of arbitration, referring to Lantic Sugar Ltd and anr v Baffin Investments Limited (“The Lake Michigan”) [2010] 2 Lloyd’s Reports 141. In The Lake Michigan , the English court held that the P&I Club agent did not have actual authority to accept service of a notice of arbitration, despite its wide authority generally to act on behalf of its members/principals, including conducting settlement negotiations and granting extensions of time to commence arbitration, etc. In Sino Channel Asia Limited v Dana Shipping And Trading Pte Singapore [2016] E WHC 1118 (Comm), the English court accepted the analogy of the wide authority of solicitors to deal with a case on behalf of a client, but (without more) that does not translate into authority to accept service of proceedings on behalf of the client. Emphasis was placed on the significance of a notice to commence arbitration, being an important step which has significant legal consequences beyond the performance of ordinary contractual obligations. 46. Even if I should reject and ignore the assertions made by Sun and Du that the Authorization was a forgery, I am not satisfied that the purported service on Du by virtue of the Authorization is effective and valid service of the NOA on Sun. Under the Authorization, Du was authorized generally to undertake all matters and to make decisions “in the execution (or implementation) of the Agreement and in the process of the resolution of disputes relating to the Agreement”, including negotiating with Gas and “receiving documents”. Bearing in mind the significance of the NOA which commences the Arbitration, imposes obligations on Sun to take steps such as the appointment of an arbitrator, and will lead to serious consequences against Sun, I do not consider that even if genuinely executed, the terms and scope of the Authorization extended to cover any authority for Du to accept service of the NOA, or service of proceedings against Sun. Receiving documents in relation to the Agreement and even in the “resolution of disputes” relating to the Agreement is different to receiving or being served with documents which initiate legal proceedings or an arbitral process, which have significant consequences. Again, the analogy with solicitors is useful. They may have wide powers to act for a client on a transaction or case, but they do not have authority to accept service of proceedings on behalf of the client without express authorization. The mere fact of being appointed an agent under the Authorization, and the fact that Du may have powers under the Authorization to deal with a wide and specified range of matters in relation to the Agreement, is not sufficient to give rise to a representation by Sun that Du had authority to accept service of legal proceedings or of arbitral proceedings, or of orders and awards made in such proceedings. 47. For these reasons, I would hold that there was no effective service of the NOA on Sun or his authorized agent by delivery of the NOA to the 3 rd Address. Was Sun unable to present his case? 48. Matters concerning whether service of the NOA should be “deemed” valid may be more technical, but the reality of this case is that by virtue of his incarceration and detention from August 2005 until his release in April 2012, or if that should be relevant, until his release on bail and house arrest in November 2010, Sun was not able to participate in the Arbitration, or to properly defend the claims made against him in the Arbitration which led to the Award in March 2007. I have considered the expert evidence of Gas, relating to various provisions of the PRC law concerning the rights of a person under arrest or detention. Nothing in that evidence casts serious doubt on the realities of the situation actually faced by Sun - irrespective of what his strict legal rights were. 49. Significantly, Du (who is alleged to be Sun’s agent under the Authorization) had expressly disclaimed and disowned any ability or power on his part to represent Sun in the Arbitration or to present his case in the Arbitration. This was made clear in Du’s letters to the Tribunal and to JSM dated 16 January 2006, 17 January 2006 and 9 February 2006. 50. In his letter of 16 January 2006 to HKIAC, Du informed HKIAC that Sun was unable to attend the Arbitration, and that Du himself was not able to contact Sun in any way, and was not qualified to participate in the Arbitration as he did not know Sun’s stance. In Du’s letter to JSM of 17 January 2006, he informed JSM that Sun was not able to attend the Arbitration “for reasons known to everyone”. Du claimed in the letter that he was not able to forward JSM’s letters to Sun, and suggested a postponement of the hearing of the Arbitration until Sun himself was able to attend or to issue an authorization. By his letter of 9 February 2006, Du wrote again to HKIAC on the appointment of the arbitrator, stating that his company was under investigation, that senior officers of the company were restricted from leaving the Mainland, and that he was unable to attend the Arbitration. This was repeated in a subsequent letter of 27 March 2006 from Du to HKIAC. Despite this, the appointment of the arbitrators proceeded, and communications continued to be served on Du, on behalf of Sun. 51. In April 2006, the company at the 3 rd Address sent a letter to HKIAC, stating that Du did not work there and that documents should not be sent to it at the 3 rd Address. On 3 November 2006, the company at the 3 rd Address sent a letter to JSM, stating that neither Sun nor Du worked there and documents faxed to the 3 rd Address could not be forwarded to them. 52. In December 2006, JSM on behalf of Gas applied to the Tribunal for the Arbitration to be dealt with on paper, without any oral hearing. They relied on service of the NOA and other documents such as the witness statements on Sun at the 1 st , 2 nd and 3 rd Addresses. The Tribunal aceded to such application and this led to the Award being issued on 15 March 2007. The Award and Reasons were sent under cover of a letter to Sun, at the 1 st , 2 nd and 3 rd Addresses. 53. During the entire time after commencement of the Arbitration, Sun had been in prison or under house arrest, and had not been able to take part in the Arbitration in Hong Kong. Du, whom JSM and the Tribunal treated as Sun’s agent or attorney, did not have the opportunity to meet with Sun to take his instructions as to the claims made against him, and any evidence which Sun may adduce in defence in the Arbitration, and how generally to present Sun’s case in the Arbitration. This was what Du told JSM and the Tribunal. Pertinently, Gas’s officers and personnel knew that Sun had been arrested, and could not participate in the Arbitration. 54. Even if the NOA had been validly served on Sun at the 1 st Address, or either of the 2 nd or 3 rd Address, I readily accept Sun’s submission that he had not actually been able to present his case, for reasons outside his control. After his being taken into custody on 11 August 2005, Sun had remained in detention under one form or another, and it was only in September 2006 that Sun met, for the first time, a lawyer of his choice, and instructed Gao as his criminal defence lawyer, for the proceedings on the Mainland. There is no direct evidence on Gas’s side to contradict Sun’s account of how he had been detained, and how the criminal proceedings had been conducted. It cannot fairly be said that Sun had made a decision not to take part in the Arbitration, despite being given notice of the proceedings. In his predicament, he did not have any genuine choice. 55. In Sun’s circumstances, as described by him, it is hardly realistic to expect that he would have been able to give Gao (or any other lawyer) instructions as to the conduct of the Arbitration in Hong Kong - even if he had indeed received the NOA or any of the statements and other documents served at the 3 Addresses, and which were relied upon by Gas in the claims made against him in the Arbitration. On Sun’s evidence, he only had limited access to Gao, and it was Gao who reviewed the papers in the criminal proceedings and prepared Sun’s defence. 56. Nor is it Gas’s case that Du, whom Gas had treated as Sun’s authorized agent, had in fact presented any evidence or defence on behalf of Sun. Gas simply relied on the service of the NOA and other documents in the Arbitration at the 3 Addresses, and the absence of any response from Sun, to press for a determination by the Tribunal without a hearing. 57. On the evidence in this case, I accept that it was not possible for Sun to attend or participate in the Arbitration, by himself or any authorised agent on his behalf, to properly present his case. The error and conduct complained of in this case, which had deprived Sun of the fair opportunity to consider the evidence and to present his case in the Arbitration, is sufficiently serious and egregious, for the court to find that the ground in Article 34(2)(a)(ii) is established ( Grand Pacific Holdings Ltd v Pacific China Holdings Ltd (in Liq) (No 1) [2012] 4 HKLRD 1 ). 58. I also agree with Ms Wong that even if any of the Deeming Provisions can operate to “deem” service of the NOA on Sun, he was not given “proper notice” of the arbitral proceedings. The ground to set aside under Article 34 (2) (a) (ii) is not lack of “notice”, but lack of “proper notice”, which describes the necessary quality of the service. Fictional notice deemed by purported delivery to an address at which the recipient could not be found and, in this case, was known by Gas and JSM not to have been found, cannot be “proper notice”. Whether enforcement of the Award would be contrary to the public policy of Hong Kong 59. In any event, fundamental principles of natural justice require a fair opportunity to be given to a person against whom claims are made, to answer and properly present his case against such claims. Our notions of open justice dictate that a party is entitled to know the case asserted against it, to see the evidence put against it, and to be given the opportunity to meet the case advanced against it. To deprive a party against whom claims are made of any fair or real opportunity, as in this case, to know the case against him, the evidence given against him, and to correct or contradict the statements made which affect him, when he is unable to do so or prevented by circumstances beyond his control from doing so, would in my view be shocking to the court’s conscience and our fundamental conceptions of justice ( Hebei Import & Export Corp v Polytek Engineering Co Ltd (1999) to HKCFAR 111, 139 F; A v R (Arbitration: Enforcement) [2009] 3 HKLRD 389 ). 60. My finding that Sun was actually unable to present his case in the Arbitration does not require or depend on a finding that Gas was imputed with the knowledge of its personnel and officers that Sun had been arrested and was in detention, and was not able to attend the Arbitration. To enforce an award made in circumstances when Sun was in fact unable to present his case in the Arbitration as aforesaid would itself be contrary to the public policy of Hong Kong, so as to make enforcement repugnant. If Gas had knowledge of Sun’s incarceration and inability to attend the Arbitration, it would only make enforcement of the Award more repugnant. 61. However, since the Court of Final Appeal recognizes that a party is under a duty of good faith and bona fide in an arbitration, I consider that Gas had a duty to inform the Tribunal at the material time that the NOA could not be delivered to the 1 st Address, was returned from the 2 nd Address, and in November 2005, April 2006 and November 2006, that Gas and JSM had been advised that Sun could no longer be contacted at the 2 nd and 3 rd Addresses. Breach of such a duty led to the Tribunal deciding to deal with the Arbitration on papers in Sun’s absence (in the belief that he had been served with the papers and witness statements), and to the Award being delivered to addresses at which Sun was not located for receipt of the Award. This constituted prejudice to Sun. Exercise of residual discretion 62. Having found that Sun had been deprived of a fair opportunity to know and meet the claims and evidence against him, and to present his case in the Arbitration, such that there was a lack of due process and the making of the Award was contrary to fundamental principles of natural justice, I see no just basis to exercise the court’s residual discretion to recognize and enforce the Award when it is repugnant to the court’s notions of conscience. As Sir Anthony Mason NPJ observed in Hebei Import & Export Corp v Polytek Engineering Co Ltd (1999) 2 HKCFAR 111 (at p 138C of the reported judgment), “it is difficult to imagine that a court would do so, if enforcement were contrary to public policy”. 63. Mr Chan submitted that Sun’s claims against Gas for the third trenche of the Price are by now time-barred, and Sun will not be able to seek recovery of the amount from Gas under the Agreement. As such, it was argued that Sun cannot be said to have been prejudiced by the declaration made in the Award, that the 3 rd trenche is not payable. I cannot agree. An Award made against Sun, declaring that the third trenche is not payable, and further, that he is liable to pay damages to Gas, is an award which is adverse to Sun’s interests if it should be allowed to stand - irrespective of whether Sun is himself able to seek recovery from Gas. Whether Sun’s application was out of time 64. The crucial issue in dispute is whether Sun’s application to set aside the Award, which was issued in October 2015, was out of time and should be barred. 65. Under Article 34 (3) of the Model Law, an application for setting aside “ may not be made after 3 months have elapsed from the date on which the party making that application had received the award ”. 66. Article 31 (4) of the Model Law provides for the Tribunal’s duty to deliver the Award. It states: “After the award is made, a copy signed by the arbitrators in accordance with paragraph (1) of this article shall be delivered to each party.” (Emphasis added) 67. On the evidence, the Award and the Reasons were sent by the Tribunal to Sun, under cover of the Tribunal’s letter of 15 March 2007 which was, on its face, sent by double registered post to the 1 st Address and the 2 nd Address, and by airmail to the 3 rd Address. 68. On behalf of Gas, it was argued that by virtue of the Deeming Provisions, Sun had received the Award under Article 3 (1) when the Award was delivered to the 3 Addresses. Gas further highlights the fact that even on Sun’s own evidence, the Award had been received by him at the latest in May 2015, after Gao was able to retrieve the Award from the files in the Jilin court and it was sent to Sun. The application which was only made in October 2015 was after 3 months of Sun’s receipt of the Award, and under the express terms of Article 34 (3) which provide that an application for setting aside “may not be made” after 3 months, the time period cannot be extended by the Court. 69. Any delivery of the Award to the 1 st Address by registered post could not have been successfully delivered, when on the evidence, there was no unit 2301 at the Centre at the relevant time. In the absence of delivery there, the Deeming Provisions cannot even be triggered. 70. In 2007, the 2 nd Address was still the registered office address of Geo as then recorded at the Companies Registry (the change of registered office address to Discovery Bay was not filed until 2011). However, on the evidence, I am not satisfied that in 2007, the 2 nd Address which was the place of business of Geo could still be regarded as Sun’s “place of business”, or his mailing address. Geo had by its letter of 21 November 2005 informed JSM that Sun was no longer there. In 2007, Sun was still in prison. The 2 nd Address was certainly not his “habitual residence”. 71. Nor, for that matter, is there any evidence to show that the 1 st Address was still Sun’s “place of business”, mailing address or habitual residence in March 2007 – even if the Award had somehow been successfully delivered there. 72. In view of Du’s express disclaimer of his representation of Sun by his letters to HKIAC and JSM dated 16 January 2006 and 17 January 2006, the 3 rd Address cannot in 2007 be reasonably regarded by the Tribunal or by Gas as Sun’s valid “mailing address”. 73. There is no evidence that the Tribunal, Gas or JSM had at any time attempted to make any inquiry as to Sun’s whereabouts in March 2007, for the Award or other documents to be sent there, and for the Award to be received by him. 74. I have found that there are real prospects of success in Sun’s case that the Authorization was forged and does not bear his signature. Even if the Authorization was genuine, I consider that the terms of the Authorization do not extend to authorizing Du to accept service of notice of the Arbitration, or of the Award. In his letter to HKIAC of 16 January 2006 (in response to HKIAC’s letter on the appointment of the arbitrator for the Arbitration), Du had stated that as the former agent of Sun, he was not able to contact Sun in any way, did not know Sun’s stance and was not qualified to participate in the Arbitration. In my view, Du cannot be said to have any actual, implied or usual authority to accept service of the Award on Sun’s behalf. 75. In any event, I have also found that any presumption based on the delivery to the 1 st , 2 nd and 3 rd Addresses can be rebutted and has been rebutted by Sun’s evidence that he had not actually received any of the documents sent there. 76. The provisions of clause 10.1 of the Agreement for service refer to any notice to be served “by one party to the other party”. It only affects the arrangement between Gas and Sun under the Agreement, and does not extend to communications from the Tribunal or 3 rd parties to the Agreement. 77. My finding therefore is that there is no evidence of the Tribunal having effectively delivered the Award and Reasons to Sun in March 2007, and that Sun had not received the Award for the 3 months specified under Article 31 (4) to commence from March 2007. 78. On the evidence filed in this case, I am not prepared to accept that Gao’s forwarding of a copy of the Award to Sun in May 2015 can have the effect of Sun being deemed to have received the Award and the Reasons. 79. On Gao’s evidence, it was in the course of his representation of Sun in the criminal proceedings on the Mainland that he was able to examine the court file in Jilin, and saw a copy of the Award. Gao did not discuss it with Sun or supply him with a copy, although he referred to it in the papers he prepared for Sun’s defence in the criminal proceedings. According to Gao, he did not even give a copy of the defence to Sun. There is no evidence that Du had taken part in the Jilin proceedings, and if the Jilin court or the prosecution had obtained the Award from the parties affected by the Arbitration, it is more likely to have been provided by Gas or the JV Company, rather than by Sun. I am not prepared to infer from these facts, as Mr Chan urged me to do, that Sun must have duly received the Award from the Tribunal’s delivery in March 2007. 80. Between October and December 2014 (after his release), Sun was informed by his staff in Jilin that some documents which appeared to relate to the Arbitration had been retrieved from Du’s former office with Sun’s company in Jilin. These documents were forwarded to Gao directly, since Sun was then in Hong Kong. According to Gao, he received the documents and in around May 2015, passed to Sun all the documents he had been able to retrieve in his investigations (on Sun’s instructions) into Sun’s assets and affairs since his arrest, including the Award. The Award was not actually forwarded or sent by Du to Sun, after Du’s own receipt of the Award from the Tribunal or JSM. 81. In my view, the fortuitous discovery by Sun, through his staff, of the Award in 2015 - which was 8 years after the purported delivery to any of the 3 Addresses, cannot complete the Deeming Provisions to constitute valid or deemed receipt of the document, for the purpose of triggering the 3 months time limitation period to run under Article 34 (3). Nor should it be considered actual receipt resulting from a valid delivery of the Award in March 2007, in accordance with Article 31 (4), when the original purported delivery had failed to reach the recipient or person to be served within a reasonable time. Can time be extended under Art 34 (3)? 82. If I should be wrong on Sun’s receipt of the Award in May 2015, my finding is that on construction of Article 34 (3), the period of 3 months is not mandatory and the court has discretion to grant an extension of time for application to be made to set aside the Award. 83. Ms Wong referred to the UN Commentary on the Model Law to support her contention that the Model Law does not preclude the court from regulating the procedure of applications to set aside awards. The Commentary states at p 71: “Existing national laws provide a variety of actions or remedies available to a party for attacking the award. Often equating arbitral awards with local court decisions, they set varied and sometimes extremely long periods of time and set forth varied and sometimes long list of grounds on which the award may be attacked. Article 34 is designed to ameliorate this situation by providing only one means of recourse (paragraph (1)), available during a short period of time (paragraph (3)) and for a rather limited number of reasons (paragraph (2)). It does not, beyond that, regulate the procedure, neither the important question whether a decision by the Court of article 6 may be appealed before another court nor any question as to the conduct of setting aside proceedings itself.” 84. The New York Convention (“ Convention ”) does not establish a comprehensive procedural regime for the recognition and enforcement of foreign awards. With regard to procedure, the Convention only provides rules on the burden of proof and the documents to be submitted by the party requesting enforcement. Article III of the Convention stipulates that recognition and enforcement shall be “in accordance with the rules of procedure of the territory where the award is relied upon”. National courts apply their national law to supplement the Convention, and the Model Law was created as a suggested pattern for national courts to adopt as part of their domestic legislation and rules. Section 44 of Cap 341 (applying to the Arbitration under the Agreement) provides that an international arbitration is governed by Chapters I to VII of the Model Law. 85. Article 34(3) therefore is part of the procedural law applicable to the Arbitration. 86. I agree with Ms Wong, that in ordinary usage, the word “may” (as used in Article 34(2) and (3)) connotes the existence of a discretion ( R (Gallastegui) v Westminster City Council [2013] 1 WLR 2377 at 2387C). 87. As explained in R (Hetoja) v Secretary of State for the Home Department [2002] EWHC2146 (Admin), the use of the phrase “may not” is ambiguous, as the term may be mandatory (meaning “must not”) or permissive (meaning “may not”) depending on its context. 88. Specifically, Article 34 (2) which sets out the grounds for challenging an award under the Model Law, as derived from Article V of the Convention, has been held by the Hong Kong courts to mean that the court has a discretion whether or not to set aside or refuse enforcement of an award, even when a ground has been established. Such a discretion has been recognized by the Court of Final Appeal in Hebei Import & Export Corp v Polytek Engineering Co Ltd , and by the Court of Appeal in Grand Pacific Holdings Ltd v Pacific China Holdings Ltd (in liq) (No 1) [2012] 4 HKLRD 1 , with emphases laid on the word “may” as used in the Convention and Article 34. 89. In Hebei Import & Export Corp , Sir Antony Mason NPJ observed at p 136A-B of his judgment: “... it is appropriate that the courts should have regard to the principles of finality and comity to the extent to which they are consistent with the provisions of the Ordinance and the Convention. Both the Ordinance and the Convention give effect to the principles of finality and comity by prohibiting refusal of enforcement of a Convention award except in the cases for which they provide ( Arbitration Ordinance ( Cap 341 ), s2AA (2) (b), s 44 (1); New York Convention, arts VI). But both provide for exceptions to that prohibition by stating the grounds on which enforcement may be refused.” 90. When “may not” as used in Article 34 (3) is read in the context and in conjunction with Article 34 (2), I would agree with Ms Wong that the discretionary element interpreted by the Hong Kong courts to exist in Article 34 (2) is retained in and extended to Article 34 (3), such that the court has a discretion to decide whether or not to permit the application to set aside to be made after the period of 3 months specified. In the context, the phrase “an application for setting aside may not be made after 3 months” means that such application may not be made, without an extension of time or leave being granted by the court in the exercise of its discretion. 91. The decisions made by the Singapore court, to which counsel have preferred, that the Singapore court has no power to extend the time under the Singapore equivalent of Article 34 (3), should be distinguished on the basis that the procedural law, ie Order 69A rule 2 (4) of the Rules of the High Court of Singapore 1996 current at the time of ABC v XYZ Co Ltd [2003] 3 SLR(R)546,expressly provided that an application to set aside “shall be made” to the court within 3 months, thereby making the time limit mandatory by way of the applicable domestic rules. By contrast, our Order 73 rule 5 RHC governs the procedures for applications under the Ordinance, and it makes no express reference to the time limit for applications to be made under s 81 of the Cap 609 and Article 34 of the Model Law. Implicitly, the 3 months stated in Article 34 (3) applies. The national law of a Convention state may have its own domestic provisions for extending the time limit under Article 34 (4) in particular circumstances, as apparent from the New Zealand and Malaysian cases cited by counsel. As Ms Wong submitted, this is consistent with the approach referred to in paragraph 83 above. 92. Since the time limit prescribed under Article 34 (3) is procedural, the court has the jurisdiction and discretion to extend such time, and regulate the proceedings before it. Should time be extended to Sun? 93. If Sun received the Award in May 2015, the application to set aside should have been made by August 2015, but Sun’s Originating Summons was only issued in October 2015. 94. Ms Wong emphasized that although Sun received a copy of the Award in May 2015 in the circumstances described in the earlier parts of this Decision, he only received the Reasons in February 2016, after these proceedings were commenced. In June 2015, after Sun received a copy of the Award from Gao, he instructed his lawyers to write to HKIAC for copies of the documents relating to the Arbitration. The Tribunal apparently sought assistance from JSM, but it was only after commencement of these proceedings and when documents were filed on behalf of Gas in opposition to the application that Sun obtained, for the first time, the Reasons and the 2 nd Award made by the Tribunal. The 2 nd Award is dated 9 May 2007, relating to interest and costs. 95. Bearing in mind the objectives of the Ordinance, that there should be finality in an award, the short period of 3 months set out in the Model Law should not, as a general rule, be extended unless the applicant can establish to the satisfaction of the court that there are good reasons to do so. The facts and circumstances of Sun’s detention in this case are, of course, very exceptional. He never participated in the Arbitration and did not have sight of the witness statements or know the case against him. He did not obtain a copy of the Award until about 8 years after it was issued, and he did not receive the Reasons until after the commencement of these proceedings. 96. From August 2015 to October 2015 there is only a period of about 2 months’ delay. Without an opportunity to review the Reasons for the Award, Sun was understandably handicapped in preparing for the application to set aside. He was incarcerated, against his will and beyond his control, from August 2005 until his release in 2012, when the charges against him on the Mainland were all withdrawn. As Counsel highlighted, Sun’s circumstances and restraints had to be considered and understood in the context of the situation on the Mainland, as opposed to circumstances prevailing in Hong Kong and other common law jurisdictions. On Sun’s evidence, his focus after his release was to restore his life and business to order, and to retrieve the assets which had been seized from him during the time of his incarceration. 97. Gas has not taken steps to enforce the Award in Hong Kong. Any prejudice Gas may sustain as a result of leave being granted to Sun to apply to set aside the Award out of time should be balanced against the prejudice to Sun, should the Award be allowed to stand, notwithstanding the merits of his application to set aside the Award, on the basis that he was not given proper notice of the Arbitration, nor the opportunity to present his case in the Arbitration. 98. In all the circumstances of this case, leave should be given to Sun to apply to set aside the Award, even if his application was out of time. Order excluding time for limitation purpose 99. The question of whether Sun’s claims for the 3 rd trenche payment under the Agreement were time barred was raised in the course of submissions made by Mr Chan. Consequently, Ms Wong on Sun’s behalf sought an order under s 34 (5) of the Limitation Ordinance (repealed by Cap 609 ), that if the Award should be set aside, the period between the commencement of the Arbitration and the date of the order to set aside should be excluded in computing the time prescribed by the Limitation Ordinance , for the commencement of proceedings (including arbitration) with respect to the dispute referred (“ Limitation Order ”). Mr Chan objected to this, on the basis that no prayer for such an order was included in the Originating Summons. To that, Miss Wong argued that Sun would be at liberty to apply for the Limitation Order as and when the Award is set aside, which order is consequential upon or ancillary to the order setting aside the Award, with the effect that the court would not be functus even if the application is made after the proceedings and the order for setting aside is made. Since the making of the Limitation Order is a question of law, and does not require factual evidence, and since I have allowed Counsel to make further written submissions on the making of the Limitation Order, I am prepared to consider the application made on behalf of Sun, to avoid the expense and delay of another application to the court made after the setting aside order. 100. Section 34 (5) was repealed by operation of Cap 609 . However, by virtue of s 1 (1) of Schedule 3 to Cap 609 , since the Arbitration was commenced before the commencement of Cap 609 , the Arbitration and all related proceedings, including (where the Award has been set aside) arbitral proceedings resumed after the setting aside of the Award, are to be governed by Cap 341 “as if ( Cap 609 ) had not been enacted”. Accordingly, s 34 (5) of the Limitation Ordinance would continue to apply to the Arbitration and related proceedings, as if s 34 (5) had not been repealed, and Sun is entitled to seek the Limitation Order, as consequential to an order setting aside the Award. 101. It is instructive to bear in mind that under Cap 609 , s 14 (4) replaces s 34 (5) of the Limitation Ordinance , and makes it mandatory for the relevant period between the commencement of the arbitral proceedings and the date of the order of the court setting aside the award to be excluded, in computing the time prescribed by the Limitation Ordinance for the commencement of proceedings with respect to the matter submitted to arbitration. 102. The substantive grounds argued on behalf of Gas in opposition to the making of the Limitation Order is that he never commenced the Arbitration, or any arbitral proceedings to assert any claim, nor did he raise any counterclaim in the Arbitration, for s 34 (5) to apply. The answer to that must be that he was not able to do so, as he was imprisoned shortly after the time Gas gave notice (by its letter of 3 August 2005) that it was withholding the 3 rd trenche of payment under the Agreement. By the time he was released in 2012, the cause of action based on Gas’s refusal to pay the 3 rd trenche under the Agreement had already become time-barred. 103. The claims made by Gas for the declaration in respect of the 3 rd trenche payment and Sun’s alleged breach of the Agreement, and Sun’s potential claim for payment of the 3 rd trenche and in respect of Gas’s alleged breach arise out of the same facts, and constitute the same dispute submitted to the Tribunal for determination in the Arbitration. 104. In all fairness, and consequently to the order I make setting aside the Award, I grant the order under s 34 (5) of the Limitation Ordinance , which should in effect preserve the limitation period for both Sun and Gas in respect of the dispute which is the subject matter of the Arbitration commenced by Gas. Orders 105. The Award is set aside. The Limitation Order is made. I will further make an order nisi that Sun’s costs of and occasioned by the Originating Summons, including any costs reserved, are to be paid by Gas, with certificate for 2 Counsel. (Mimmie Chan) Judge of the Court of First Instance High Court Ms Lisa Wong SC and Mr Richard Khaw SC, instructed by Francis & Co, for the plaintiff Mr Chan Chi Hung SC and Mr Derek Chan, instructed by Mayer Brown JSM, for the defendant Look up this case on Lawcite Noteup",
  "length": 63172,
  "headers_seen": [
    "Introduction",
    "Background",
    "Was Sun given proper notice of the arbitral proceedings?",
    "Delivery to the 1 st Address",
    "Delivery to the 2 nd Address",
    "Delivery to the 3 rd Address",
    "Was Sun unable to present his case?",
    "Whether enforcement of the Award would be contrary to the public policy of Hong Kong"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2016/1611",
  "query": "Model Law",
  "ts": "2025-10-16T10:53:10",
  "ok": true
}