{
  "title": "ADVANCED CONNECTION LTD V. ABLE TECHNOLOGY (HONG KONG) LTD AND OTHERS | [2018] HKCFI 2465 | HKLII",
  "court": null,
  "year": 2018,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2018] HKCFI 2465 ADVANCED CONNECTION LTD V. ABLE TECHNOLOGY (HONG KONG) LTD AND OTHERS Judgment Information Date 8 Nov, 2018 Action No. HCA2594/2013 Neutral Cit. [2018] HKCFI 2465 Download MS Word Judgment Reading Options Translation Toggle Highlight Appeal History HCA2594/2013 HCA2594/2013 ADVANCED CONNECTION LTD v. ABLE TECHNOLOGY (HONG KONG) LTD AND OTHERS HCA 2594/2013 [2018] HKCFI 2465 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE ACTION NO 2594 OF 2013 ________________________ BETWEEN ADVANCED CONNECTION LIMITED Plaintiff 先進網絡有限公司 and ABLE TECHNOLOGY (HONG KONG) LIMITED 1 st Defendant 愛保科技（香港）有限公司 YUEN SO LAN 袁素蘭 2 nd Defendant KWOK HON CHEONG EINSTEIN 郭漢昌 3 rd Defendant (also known as CHUNG WAI YIN) ________________________ Before: Hon Ng J in Chambers Date of Hearing: 20 June 2018 Date of Judgment: 9 November 2018 __________________ J U D G M E N T __________________ Introduction 1. On 28 February 2018, Master KW Wong granted leave to the Plaintiff to amend the Writ of Summons herein by adding Yuen So Lan 袁素蘭 as the 2 nd Defendant (“ Yuen ”) and Kwok Hon Cheong Einstein 郭漢昌 (also known as Chung Wai Yin) as the 3 rd Defendant (“ Kwok ”) as well as leave to re‑amend the Amended Statement of Claim herein to plead its case against Yuen and Kwok. 2. This is the 1 st to 3 rd Defendants’ appeal against the learned Master’s decision. The parties’ case 3. The Plaintiff’s case, as pleaded in the Re‑amended Statement of Claim, can be summarized as follows. 4. The 1 st Defendant is a company incorporated in Hong Kong and carries on business as a telecommunication operator providing, inter alia , messaging services in Hong Kong. Kwok was and is the sole director and shareholder of the 1 st Defendant, as well as its managing director, and directly involved in managing its business, operation and affairs, including the infringing acts complained of below. The 1 st Defendant has at all material times been the registrant of the internet domain name “ablesms.com”. 5. Yuen is the wife of Kwok and was at all material times the sole director of Commerce One Limited (“ Commerce One ”), a Hong Kong company with its registered address right next door to that of the 1 st Defendant. 6. The Plaintiff is a famous company specialising in the business of telecommunication services by reference to the mark “Accessyou” (“ Plaintiff’s Mark ”) since 1999. The Plaintiff’s Mark has been used as a trademark to denote services provided by the Plaintiff since at least 1999. The Plaintiff’s Mark has come to be well‑known to the public in Hong Kong and a substantial reputation exists in it. The Plaintiff has at all material times been the registrant of the internet domain name “accessyou.com” (“ Plaintiff’s Domain Name ”). Since 1999, the Plaintiff has begun marketing efforts to promote its business of telecommunication services by reference to the Plaintiff’s Mark as well as the Plaintiff’s Domain Name in Hong Kong. 7. On 12 August 2011, the Defendants registered the internet domain name of “accessyou.co” (“ Infringing Domain Name ”). Subsequently, the Infringing Domain Name was automatically linked to its website “www.ablesms.com”. 8. In or about September 2012, Yuen either on her own volition or at the direction of the 1 st Defendant and/or Kwok purchased the domain name “ablesms.com” and the tradenames “ABLESMS” and “AbleSMS” for and on behalf of the 1 st Defendant from GoDaddy.com LLC. 9. On 29 October 2012, the Defendants registered the trademark “ABLESMS” in Clauses 38 and 42 of the Hong Kong Trade Marks Registry under registration no. 302417526 (“ Defendants’ Registered Trademark ”) in respect of inter alia telecommunication services relating to the provision of access to a platform for customers to deliver short message service (“ SMS ”) online. 10. The Defendants have passed off and/or attempted to pass off in Hong Kong telecommunication services as and for the services of the Plaintiff and/or provided under licence from the Plaintiff and/or associated with the Plaintiff. 11. In addition, the Defendants have, since the date of registration of the Infringing Domain Name, passed off the Plaintiff’s business by using in Hong Kong in relation to telecommunication services for which the Infringing Domain Name is identical and/or similar to the Plaintiff’s Domain Name, by reason whereof the public has been misled. 12. Yuen and Kwok have each acted in concert with the other Defendants to further the common design in relation to the infringing acts complained of in this action. They are also jointly and severally liable for all the infringing acts of the other Defendants complained of in this action. 13. In the prayer for relief, the Plaintiff claims for inter alia : (1) A declaration that the 1 st Defendant’s trade mark registration no. 302417526 is invalid and shall be removed from the Trade Marks Registry. (2) An injunction to restrain the Defendants from doing the following acts: (a) passing off, and/or attempting to pass off the Plaintiff’s telecommunication business by reference to the domain not the domain of or associated with the Plaintiff; (b) using and/or dealing in or with any domains and/or websites under or by reference to the domain names and/or websites “accessyou.co” and “www.accessyou.co”. (3) Damages or an account of profits. 14. As stated in their counsel’s skeleton submissions, Yuen’s and Kwok’s case is that: (1) The 1 st Defendant ceased redirecting “accessyou.co” to its website on 24 February 2014 and its registration for the domain name “accessyou.co” lapsed on 11 August 2014. (2) Yuen has never been involved in any way in the management and operations of the 1 st Defendant — she is neither a director, shareholder nor employee of the 1 st Defendant. She had no involvement with any of the matters pleaded in this action. (3) On 13 September 2012, the 1 st Defendant purchased the domain name “ablesms.com” comprising its mark “ABLESMS”. The “ablesms.com” domain name was purchased by the 1 st Defendant online from the well‑known domain name registrar GoDaddy, and was paid for using Yuen’s Mastercard. (4) At the time of purchase of the “ablesms.com” domain name, neither the 1 st Defendant nor Kwok owned a credit card so Yuen was asked to provide her credit card information for payment. She did not know the purpose of such purchase or its subject matter as the payment was handled solely by the 1 st Defendant. (5) While Kwok is the sole director and shareholder of the 1 st Defendant, he has never had any involvement in the day‑to‑day management and operations of the 1 st Defendant. 15. In short, Yuen’s and Kwok’s defence is one of denial — they deny having any involvement in passing off or attempted passing off the Plaintiff’s business. Deliberation 16. RHC O 15 r 6(2)(b) provides that the Court may order that any person to be added as a party if: (1) his presence before the Court is necessary to ensure that all matters in dispute in the cause or matter may be effectually and completely determined and adjudicated upon, or (2) between him and any party to the cause or matter there may exist a question or issue arising out of or relating to or connected with any relief or remedy claimed in the cause or matter which in the opinion of the Court it would be just and convenient to determine as between him and that party as well as between the parties to the cause or matter. 17. Prima facie , a Plaintiff is entitled to choose the person against whom it wishes to proceed: Hong Kong Civil Procedure 2018 Vol 1 para 15/6/6. 18. The purpose of joinder is to bring all parties to disputes relating to one subject‑matter before the Court at the same time so that the disputes may be determined without the delay, inconvenience and expense of separate actions and trials: Byrne v Brown (1889) 22 QBD 657 . The rule should be construed liberally so as to ensure that, as far as possible, all matters in dispute between the parties are completely and finally determined, and all multiplicity of legal proceedings with respect to any of those matters is avoided: Lin Man Yuan v Kin Ming Holdings International Ltd [2012] 3 HKLRD 550 . 19. The test to apply in a joinder application is whether there is a bona fide claim and a proper question to be tried as between the plaintiff and the intended defendant that is necessary or just and convenient for resolution between them as well as between the plaintiff and the defendant in the proceedings. At this stage, there is no requirement for an applicant to show merits of his case under this rule: Wong Shan Shan v The Incorporated Owners of Yue Wah Mansion unrep, HCA 1086 of 2013, 28 January 2015, DHCJ Kent Yee; Wong To Yick Wood Lock Ointment Ltd v Merika Medicine Factory Ltd & Anr unrep, HCA 562 of 2014, 10 March 2017, DHCJ A Lee. 20. In Pang Kwok Lam v Schneider Electric Asia Pacific Ltd unrep, HCPI 90 of 2010, 5 January 2011, at [72] and [73] Master Marlene Ng (as she then was) commented: “ 72. In my view, given the objectives of Order 15 rule 6(2)(b) of the RHC outlined above, the court’s power to join parties is a generous one, and the court’s attitude is permissive although it must still ensure that the joinder is necessary and/or just having regard to the statutory criteria. According to Hong Kong Civil Procedure 2011 Vol 1 para 15/6/1 at pp 285‑286, ‘[the] power given by the rule is, however, widely exercised … though the addition of new parties may cause new expense and necessitate new evidence … But, generally speaking, the court will make all such changes in respect of parties as may be necessary to enable an effectual adjudication to be made concerning all matters in dispute … The court will not, however, decide questions of right on applications under the rule …’ 73. I am persuaded that the relevant approach to be adopted is whether there is a bona fide claim and a proper question to be tried as between the Plaintiff and Law/BLC that is necessary or just and convenient for resolution between them as well as between the Plaintiff and the Defendant in the present proceedings.” 21. On the question of whether the Plaintiff has a bona fide claim and a proper question to be tried as between the plaintiff and the intended defendant, this court has been supplied with the Court of Appeal’s decision in Yeung Pui Ying Anna v Day & Chan (a firm) & Ors unrep, CACV 67 of 2010, 20 July 2010, Ma CJHC (as he then was) & Roger VP. In that case, DHCJ Burrell ordered that the 2 nd Defendant to be joined upon the Plaintiff’s application. The 2 nd Defendant appealed to the Court of Appeal. The issue was whether the joinder of the 2 nd Defendant ought to have been disallowed by reason of the relevant limitation period having already expired at the time of the application to join. DHCJ Burrell was of the view that it had not; at least arguably not. At [11], Ma CJHC made the following observation: “ 11. I have approached this matter as though it had been an application to strike out. In other words, the burden was on the 2 nd Defendant to show that it was plain and obvious that the limitation period had expired.” 22. Mr Clark, for the Plaintiff, submits that on a joinder application, the burden is therefore on the parties opposing to establish that it is plain and obvious that the Plaintiff has no case against the proposed Defendants. This court agrees. 23. Mr Hughes, on behalf of the Defendants, submits that the Plaintiff has manifestly failed to establish a bona fide claim and a proper question to be tried against Yuen and Kwok. In essence, his argument is that there is no evidence to suggest that Yuen and Kwok had any involvement whatsoever in the decision by the 1 st Defendant in August 2011 to register the domain name “accessyou.co” and resolve it ie automatically link it to the 1 st Defendant’s website. 24. Given the issues are one of fact, it is difficult to see how the court can resolve such factual issues on a joinder application. Adopting the same approach as in an application to strike out, the court will not conduct a trial on affidavit evidence, and disputed facts were to be taken in favour of the party sought to be struck out: Hong Kong Civil Procedure 2019 Vol 1 para 18/19/4. 25. Furthermore, Yuen’s explanation that at the time of purchase of the “ablesms.com” domain name, neither the 1 st Defendant nor Kwok owned a credit card so she was asked to provide her credit card information for payment somewhat beggars belief, to say the least. As Mr Clark submits, Kwok has not confirmed in his own affirmation that he did not possess a credit card at the time of purchase. Similar comments can be made in relation to Kwok’s denial of having any involvement in the day‑to‑day management of the 1 st Defendant and he just left it to a team working within the company. But, for the present purpose, it is not necessary for this court to come to any view on the veracity of such explanation and denial. 26. In MEI Fields Designs Ltd v Saffron Cards Ltd & Anor [2018] EWHC 1332 (IPEC), Judge David Stone observed at [113] as follows: “ 113. Given the frequency with which such claims are made, there is a developing body of case law in the IPEC relating to joint tortfeasorship. I was taken to Grenade (UK) Limited v Grenade Energy Limited and Another [2016] EWHC 877 (IPEC), a decision of HHJ Hacon. HHJ Hacon said this (at paragraphs 22 to 24): ‘22. I should add that the most up to date summary of the law in relation to joint tortfeasance is to be found in the judgment of the Supreme Court in Sea Shepherd UK v Fish & Fish Ltd [2015] UKSC 10 ; [2015] AC 1229 . I attempted a very short summary of the key criteria for joint tortfeasance identified by Lord Sumption in Sea Shepherd in my judgment in Vertical Leisure Ltd v Poleplus Ltd [2015] EWHC 841 (IPEC), where I said this at paragraph 66: ‘ I interpret this to mean that in order to fix an alleged joint tortfeasor with liability, it must be shown both that he actively co‑operated to bring about the act of the primary tortfeasor and also that he intended that his co‑operation would help to bring about that act (the act found to be tortious).’ 23. Mr Chawla is both the sole director and sole shareholder of the first defendant. As Mr Sampson put it, he is a one‑man company. In my view, this raises an evidential presumption that all acts done by the first defendant were done at the instigation of Mr Chawla alone. In effect, he was under an evidential burden to show why, contrary to what one might expect, the acts complained of were not initiated and controlled by him . 24. In fact, in Mr Chawla’s pleadings and in his evidence, he has not identified anybody else who was, on his account, responsible for the acts complained of. Therefore, to my mind, there can be no real doubt that Mr Chawla was indeed the sole instigator and controller of those acts. I therefore take the view that he procured the acts complained of or, to put it another way, he actively cooperated with his company to bring about the infringements of community trademarks and passing off, that he intended his cooperation would bring about those acts and that there is no real prospect of Mr Chawla establishing to the contrary at trial.’ ” 27. To conclude, without discovery, detailed witness statements and cross examination at trial, this court is simply unable to conclude that the Plaintiff has no case against either Yuen or Kwok. Disposition and costs order nisi 28. The 1 st to 3 rd Defendants’ appeal is hereby dismissed. There shall be an Order nisi that costs be to the Plaintiff, to be taxed if not agreed, and paid forthwith, with certificate for counsel. (Peter Ng) Judge of the Court of First Instance High Court Mr Douglas Clark, instructed by Benny Kong & Tsai, for the Plaintiff Mr Sebastian Hughes, instructed by Huen & Partners, for the 1 st to 3 rd Defendants Look up this case on Lawcite Noteup",
  "length": 15971,
  "headers_seen": [
    "Introduction",
    "The parties’ case",
    "Deliberation",
    "Disposition and costs order nisi"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2018/2465",
  "query": "domain name",
  "ts": "2025-10-17T10:43:49",
  "ok": true
}