{
  "title": "JINGDONG E-COMMERCE (TRADE) HONG KONG CORPORATION LTD V. MAVIN ELECTRONS LTD | [2024] HKCFI 3110 | HKLII",
  "court": null,
  "year": 2024,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2024] HKCFI 3110 JINGDONG E-COMMERCE (TRADE) HONG KONG CORPORATION LTD V. MAVIN ELECTRONS LTD Judgment Information Date 5 Nov, 2024 Action No. HCA1032/2023 Neutral Cit. [2024] HKCFI 3110 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCA1032/2023 HCA1032/2023 JINGDONG E-COMMERCE (TRADE) HONG KONG CORPORATION LTD v. MAVIN ELECTRONS LTD HCA 1032/2023 [2024] HKCFI 3110 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE ACTION NO 1032 OF 2023 _______________ BETWEEN JINGDONG E-COMMERCE (TRADE) HONG KONG CORPORATION LIMITED Plaintiff and MAVIN ELECTRONS LIMITED Defendant _______________ Before: Deputy High Court Judge Jonathan Wong in Chambers Date of Hearing: 6 August 2024 Date of Decision: 6 November 2024 ________________________ DECISION ________________________ 1. Introduction 1.1 This is my decision on an application by the Defendant (“ D ”) to stay the present proceedings in favour of arbitration. 1.2 The Plaintiff (“ P ”) commenced these proceedings against D on 30 June 2023. In its Amended Statement of Claim (“ ASOC ”), P seeks repayment of US$11,170,170.84 from D pursuant to an agreement dated 8 December 2022 (“ 8/12/22 Agreement ”). The 8/12/22 Agreement was entered into following D’s non-compliance with its payment obligations. Clause 4 thereof provides: “ 與本協議有關的一切糾紛或者爭議，由香港特別行政區有管轄權的法院管轄。” 1.3 Prior to the 8/12/22 Agreement, the parties (and D’s director Mr Ma Kwong Chin (“ Ma ”)) had entered into a number of agreements, namely: (1) A Master Sale and Purchase Agreement dated 10 November 2021 between P and D (“ SPA ”); (2) A Supplemental Agreement between P and D dated 16 June 2022 [1] which amended the payment terms of the SPA (“ Supplemental Agreement ”). Clause 1(2) thereof expressly provides that the other terms of the SPA remain unchanged; and (3) A guarantee signed by Ma on 30 August 2022 in favour of P guaranteeing D’s liabilities under the SPA and the Supplemental Agreement (“ Guarantee ”). 1.4 The dispute resolution clauses in the SPA and the Guarantee are as follows: (1) Clause 9.9 of the SPA: “ This Agreement shall be governed by the laws of the Hong Kong, without regard to its conflicts of laws principles. In the event any controversies or differences arise between the parties out of this Agreement, they shall consult with each other and use their best efforts to settle such disputes, controversies or differences. Any dispute, controversy, difference or claim arising out of or relating to this Agreement, including the existence, validity, interpretation, performance, breach or termination thereof or any dispute regarding non-contractual obligations arising out of or relating to it shall be referred to and finally resolved by arbitration administered by the Hong Kong International Arbitration Centre under the HKIAC Administered Arbitration Rules in force when the Notice of Arbitration is submitted. The law of this arbitration clause shall be Hong Kong law. The seat of arbitration shall be Hong Kong. The number of arbitrators shall be one or three. The arbitration proceedings shall be conducted in Chinese ”; and (2) Clause 6 of the Guarantee (in simplified Chinese characters): “ 本擔保函適用中華人民共和國法律，因本擔保函產生的糾紛，由主協議約定的人民法院或仲裁機構管轄 ”. 1.5 It is common ground that the disputes arising from the SPA, the Supplemental Agreement and the Guarantee are to be referred to arbitration. 1.6 As stated in D’s summons, it is D’s case that the present proceedings should be stayed pursuant to SPA Clause 9.9. At the hearing, P was represented by Mr Mark Lin of Messrs Hogan Lovells and D by Ms Natalie So of counsel. 2. Background 2.1 The relevant background facts may be shortly stated. Unless otherwise stated, the matters set out in this section are undisputed or indisputable. 2.2 P is a subsidiary within the “Jingdong” group, a substantial e-commerce business headquartered in the Mainland. P is a Hong Kong company which carries on international trading involving both business-to-business and business-to-consumer dealings. D is also a Hong Kong company which engages in the trading of electronic products. 2.3 As stated above, P and D entered into the SPA on 10 November 2021. The SPA is in both English and Chinese. Clause 9.11 thereof provides that, in the event of any discrepancy or conflict between the English version and Chinese version, the Chinese version shall prevail. The submissions made before me do not raise any issues of discrepancy or conflict between the two versions. 2.4 The SPA makes provisions for the supply of Products (as defined therein) by P to D. Inter alia : (1) Under Clause 2, D is to submit to P written Purchase Orders for the Products, but P is not obliged to sell any or all of the Products. Any Purchase Orders placed by D is subject to P’s confirmation (Clause 2.1). Under clause 2.2, D is to pay for the Products at the prices specified in the relevant Purchase Orders; (2) Clause 3 makes provisions for the shipment, delivery and acceptance of the Products. In particular, clause 3.5 thereof provides “ The Buyer shall inspect the Products within five (5) business days after delivery of the Products. Any claim by the Buyer regarding Products shall be notified by the Buyer to JD within thirty (30) days after the Delivery. If the Buyer claims for alleged breach of warranties, the Buyer shall, together with such notice, submit an independent surveyor's report and full and final written statement specifying the particulars of all defects which the Buyer has discovered. In the event the Buyer fails to provide such notice (and the report and the written statement, if applicable) within such thirty (30) days period, the Buyer shall be deemed to have waived any claim with respect to Products and JD shall not be liable therefor. With respect to a defect in Products properly notified by the Buyer, JD shall repair, replace or otherwise cure such defect as JD deems fit, which shall be exclusive of any other remedy provided by law ”; (3) Clause 4 makes provisions for payment. The main clause thereof (Clause 4.1) is the subject of amendment by the Supplemental Agreement; (4) Clause 5 makes provisions for the warranty and returns/replacements of the Products: “ The warranty for Products to be given by JD to the Buyer shall be strictly limited to those expressly given by the manufacturer of Products to JD in writing and provided to the Buyer. Except to the extent provided therein, JD hereby disclaims any and all warranties with respect to Products, expressed or implied, including, BUT NOT LIMITED TO, warranties of merchantability, fitness for a specific purpose, intellectual property rights, non-infringement of third party rights and warranties against defects of Products under applicable laws. Except for quality issue, under no circumstance will Buyer return Products to ID for a refund nor replacement. If there are special cases, the parties will conduct friendly negotiations ”; and (5) Clause 8 makes provisions for the termination of the SPA. Mr Lin confirmed at the hearing that, at the material time, the SPA had not been terminated, whether by notice under clause 8.1 or upon the exercise of its right upon the occurrence of a specified event of default. In any event, clause 8.3 expressly states that “ Neither the termination nor the expiration of this Agreement for any reason shall relieve either party of its continuing obligations under this Agreement. Without limiting the foregoing, all Purchase Orders accepted by JD prior to the termination or expiry of this Agreement shall continue in full force and effect, and JD shall perform under such Purchase Orders in accordance with the respective terms thereof. Sections 8.3 and Section 9 of this Agreement shall survive the termination or expiration of this Agreement ”. 2.5 Between November 2021 and June 2022, D placed 3 Purchase Orders under the SPA, which were fulfilled uneventfully. 2.6 The Supplemental Agreement dated 16 June 2022 supplemented and/or amended SPA Clause 4.1. Supplemental Agreement Clause 1.1 (which effectively replaced SPA Clause 4.1), provides 3 different payment methods for the Products. 2.7 Thereafter, between July and September 2022, D submitted 12 Purchase Orders to P (“ Subject Purchase Orders ”). It appears that the Subject Purchase Orders adopted the first of the 3 payment methods set out at Supplemental Agreement Clause 1.1. Under the 1 st payment method, D was to pay a 20% deposit within 7 days of the placing of a Purchase Order. Upon receipt of the deposit, P was to prepare the Products at its warehouse in Hong Kong, and upon completion, give written notice to D (“ Preparation Completion Date ”). Within the time stipulated in the Purchase Order (in respect of each of the Subject Purchase Orders, within 60 days after the Preparation Completion Date), D was to pay the remaining balance to P. After receipt of the remaining balance, P was to ship the Products to a destination designated by D or D was to collect the Products from P’s warehouse (“ 1 st Payment Method ”). 2.8 ASOC §8 pleads that, in respect of the Subject Purchase Orders, D was unable to pay the remaining balance by the stipulated deadlines. The foregoing is not factually disputed by the evidence adduced by D. Hence, the 8/12/22 Agreement. 2.9 Before I address the terms of the 8/12/22 Agreement, it is pertinent to note that, under the 1 st Payment Method, within 3 days after the receipt by P of the remaining balance in respect of a Purchase Order, either P was to deliver the Products to a destination designated by D or D was to collect the Products from P’s warehouse. 2.10 According to the 8/12/22 Agreement: (1) P and D had agreed that the Preparation Completion Dates for the Products covered by the Subject Purchase Orders had been achieved by 9 September 2022 (Recital); (2) In respect of each of the Subject Purchase Orders, the parties had agreed on the remaining sum payable and the latest payment date and latest collection date (ranging from 21 December 2022 to 20 January 2023) (Clause 1); and (3) Clause 2 makes provision in the event of D’s default in its repayment obligations, including (a) accelerated payment and default interest and (2) P’s right to deal with the Products and claims against D for losses. 2.11 It is D’s evidence that, following the execution of the 8/12/22 Agreement, it became aware that P might have damaged the original packaging of some of the Products covered by the Subject Purchase Orders. 2.12 On 16 January 2023, D’s staff carried out an inspection at P’s warehouse. It is D’s evidence that some of the Products had been opened and/or damaged. It is clear from the documentary evidence that D’s complaints were contemporaneously discussed between P and D although P then questioned, and now questions, the legitimacy of D’s complaints. 2.13 P commenced these proceedings on 30 June 2023. By a letter dated 16 August 2023, D’s solicitors set out detailed reasons justifying a stay in favour of arbitration by reference to the claim as originally pleaded. It seems clear that P’s solicitors were of the view that there was substance in the reasons advanced by D’s solicitors, as P obtained leave to substantially amend the original claim on 12 September 2023. By a letter dated 14 September 2023, P’s solicitors cursorily, and without engaging the reasons set out by D’s solicitors, rejected the jurisdictional challenge. 2.14 In a nutshell, P advanced the following contentions at the hearing [2] : (1) P’s claim is only premised on a breach of the 8/12/22 Agreement; (2) P does not rely upon the SPA for its claim and submits that the SPA and the 8/12/22 Agreement are two distinct and independent contracts entered into between P and D; and (3) Therefore, SPA Clause 9.9 does not govern the 8/12/22 Agreement. 3. The applicable principles 3.1 Section 20 (1) of the Arbitration Ordinance Cap 609 (“ AO ”) gives effect of to Article 8 of the UNITRAL Model Law. Article 8 of the Model Law provides as follows: “ (1) A court before which an action is brought in a matter which is the subject of an arbitration agreement shall, if a party so requests not later than when submitting his first statement on the substance of the dispute, refer the parties to arbitration unless it finds that the agreement is null and void, inoperative or incapable of being performed. (2) Where an action referred to in paragraph (1) of this article has been brought, arbitral proceedings may nevertheless be commenced or continued, and an award may be made, while the issue is pending before the court.” 3.2 The principles governing a stay in favour of arbitration are well-established. As set out at Mice Engineering Ltd v Johnson Controls Hong Kong Limited [2022] HKCFI 2768 §§17-18 (and the further cases cited therein): (1) On a stay application under section 20 of the AO, the court would consider the following questions: (a) is there an arbitration agreement between the parties (b) is the clause in question capable of being performed (c) is there in reality a dispute or difference between the parties and (d) is the dispute or difference between the parties within the ambit of the arbitration agreement; (2) The onus is on the applicant for stay to demonstrate only that there is a prima facie case that the parties are bound by an arbitration clause, and unless the point is clear, the court should not attempt to resolve the issue and the matter should be stayed in favour of arbitration, as it is for the tribunal to decide first on its jurisdiction. 3.3 Where, as here, the differences between Ms So and Mr Lin stem from the effect of, on the one hand, a clause conferring jurisdiction on the Hong Kong court (in this case Settlement Agreement Clause 4) and an arbitration clause (in this case SPA Clause 9.9), the proper approach has been discussed in a number of cases. 3.4 At Houtai Investment Holdings Ltd v Leung Yat Tung & Ors [2021] HKCFI 1504 Mimmie Chan J observed as follows: “ [20] The modern approach to the construction of arbitration agreements is the presumption in favour of arbitrability and the “one ‑ stop” adjudication approach (Fili Shipping Co Ltd and others v Premium Nafta Products Ltd [2007] BUS LR 1719), at least as a useful starting point . In Fili Shipping, Lord Hoffman referred to the construction of an arbitration clause as “starting from the assumption that the parties, as rational businessmen, are likely to have intended any dispute arising out of the relationship in which they have entered or purported to enter to be decided by the same tribunal”. There are of course reminders from the courts that the presumption may be rebutted and would not be applicable in particular cases, where the parties have entered into different interlinked agreements, relating to different aspects of an overall and often complex commercial transaction, and where there are differently expressed choices of jurisdiction and/or law in different agreements providing for different manner of resolution of disputes. The Fiona Trust presumption and principles are always subject to consideration of the presumed intention of the parties, and what is required in each case is a careful and commercially minded construction of the agreement in question . [21] Where there are multiple related commercial agreements, each dealing with different aspects of the parties’ relationship and dealings, and each containing its own provision for expressed choices of jurisdiction, law and/or mode of dispute resolution, the proper test in ascertaining the parties’ intention on how the dispute should be dealt with is to identify the nature of the claim, and the agreement which has the closest connection with such dispute and claim (the agreement “at the centre of gravity of the dispute” , as referred to in Trust Risk Group SpA v Amtrust Europe Ltd [2017] 1 CLC 456, or at the “commercial centre of the transaction” in question, as referred to in paragraph 4.59 in Joseph on Jurisdiction And Arbitration Agreements And Their Enforcement, 6th edition).” (emphasis added) 3.5 Of particular relevance is Neo Intelligence Holdings Ltd v Giant Crown Industries Ltd , HCA 1127 of 2017, 27 November 2017. In that case, like the present case, an earlier agreement (defined in the Decision as the June Agreement) contained an arbitration clause and a later agreement (the November Agreement) contained an exclusive jurisdiction clause in favour of the Hong Kong court (Decision §§11 and 12). 3.6 In Neo Intelligence , DHCJ Sherrington was of the view that the November Agreement was not intended to replace the June Agreement. In his analysis, he said: “ [22] The only argument for suggesting that the arbitration clause in 8.1 of the June Agreement has no effect is that Clause 4.1 of the November Agreement post-dated it and is inconsistent with it and so it must have been the parties’ intentions to waive prior agreement to arbitrate no longer valid. [23] I am unable to conclude that that is necessarily the case given the differing scopes of the two clauses in question. [24] Clause 8.1 is a detailed dispute resolution clause specifying the procedures which shall be followed in the event of a dispute arising which includes a stepped process of consultation and negotiation first and only if that fails submission to arbitration. [25] Clause 4.1 on the other hand is a simple jurisdiction clause albeit it might be said to be otiose to the extent that Clause 8.1 is still valid as that already provides for Hong Kong law to be the governing law. It seems to me that the drafters had in mind merely making it clear beyond peradventure that the November Agreement was also governed by Hong Kong law and for this purpose added a provision for submission to the non ‑ exclusive jurisdiction of the Hong Kong courts. [26] In seeking to reconcile two clauses such as this with an express choice of English law both in the jurisdiction clause and in the arbitration clause Gloster J in AXA Re v Ace Global Markets (at §32) had no difficulty in finding there was no inconsistency: ‘ I accept Mr Berry’s submission that the fact that there are two clauses, with an express choice of English law, both in the jurisdiction clause and in the arbitration clause, does not result in any inconsistency. I accept Mr Berry’s submission that Mr Green’s arguments are, in effect, based on a so‑called presumption against surplusage in a contract. However, it is well recognised that there is no presumption against surplusage in a commercial contract and no conclusions can be drawn from the presence of two express choices of English law. In my judgment, in a commercial contract such as this, one should not be surprised to see parties stating clearly in a belt and braces way, the intention that English law is to apply.’ [27] Nor do I find the inclusion of a non ‑ exclusive submission to the Hong Kong courts, which could be as the lex arbitri or for the purposes of post arbitral enforcement, as amounting to a sufficiently clear and unequivocal indication of waiver of the arbitration clause in the June Agreement. [28] Absent overwhelming evidence of an unequivocal waiver, a stay in favour of arbitration should be ordered since to do otherwise would be to usurp the function of the arbitration tribunal which is empowered by Article 16.1 of the UNCITRAL Model Law to rule on its own jurisdiction including any objection as to the existence or validity of the Arbitration Agreement and as to whether disputes had arisen concerning the contracts : Paladin Agricultural Ltd v Excelsior Hotel (Hong Kong) Ltd [2001] 2 HKC 215 . [29] I cannot accept the plaintiff’s submission that there was an unequivocal agreement to disregard the arbitration agreement in this case. The precise wording of Clause 4 in the November Agreement does not make it plain that there is an abandonment or waiver of the Arbitration Agreement and I accept the submission by the defendants that Clause 4 can be read as a jurisdiction clause which can sit, even if not wholly happily, in parallel with the Arbitration Agreement . [30] Thus I am satisfied that the defendant has established a prima facie or plainly arguable case that the parties are bound by an arbitration clause and that a stay of proceedings is justified. I accordingly make an order in terms of the defendant’s summons issued on 17 July 2017 .” 3.7 Mr Lin places heavy emphasis on the case of AAA v DDD [2024] 1 HKLRD 1358 in which DHCJ Reyes SC set out a very detailed analysis at §§45-73 on how the arbitral tribunal had erred in determining that it had jurisdiction in that case. The background is set out at AAA §§1-20. For present purposes, it is sufficient to note that the dispute was whether the arbitration clause in a Loan Agreement conferred jurisdiction on the arbitral tribunal formed under it to determine related disputes arising out of a Promissory Note which contained its own arbitration agreement. The arbitral tribunal determined that it had jurisdiction and AAA is concerned with an application to the court to decide the matter under Article 16(3) of the Model Law (which section 34 of the AO gives effect). DHCJ Reyes SC quashed the arbitral tribunal’s decision on jurisdiction. Mr Lin relies in particular on the following observations: “ [62] What I derive from AmTrust is that there can be no initial presumption that the parties intended all their disputes to be resolved in a single forum, if there are several contracts with different dispute resolution clauses. There can be no such presumption in this case, even though the contracts here constitute a package having the objective of providing financing for the Borrower’s acquisition of shares, while ensuring security for the Lender. Instead of applying a presumption, one must construe each contract in the package to map out what disputes must have been intended to be covered by the dispute resolution clause of a given contract. … [69] At the end of his submissions, Mr Chan suggested that, purely as a matter of common sense, all disputes relating to the Promissory Note should be dealt with in a single forum. In an ideal world, Mr Chan may be right. However, the notion of a one-stop shop for the resolution of parties’ related disputes can only be pressed so far. It should not be a procrustean bed into which all multiple contract situations are made to fit, ignoring indications of a contrary intention among the parties. [70] The parties could conceivably have bargained for a regime whereby disputes arising out of different contracts are to be dealt with in separate forums. They could have accepted a risk of contradictory outcomes and fragmentation. In the present case, despite the Fiona Trust principle or presumptions like it being inapposite, there would still be ways of minimising the risk of conflicting outcomes… [71] In brief, the question whether the Guarantors remain liable to pay under the Promissory Note falls within the “centre of gravity” of the dispute resolution clause in the Promissory Note. It is therefore outside the Tribunal’s jurisdiction. I will make an order (1) quashing the Tribunal’s Decision on jurisdiction and (2) declaring that the Tribunal lacks jurisdiction to decide claims for payment under the Promissory Note.” 4. Analysis 4.1 It should be pointed out at the outset that I do not regard P can derive much assistance from AAA . 4.2 First, AAA is a case where the arbitral tribunal had already decided that it had jurisdiction. In the court application to challenge the jurisdictional decision of an arbitral tribunal, the approach is different from that in the present case: (1) In the present application, as stated above, I only have to determine whether D has demonstrated a prima facie case that the parties are bound by SPA Clause 9.9. Unless the point is clear, the court should not attempt to resolve the issue, and the matter should be stayed in favour of arbitration, as it is for the Tribunal to decide first on its jurisdiction; (2) Under an application under section 34 of the AO (as in the case in AAA ), the court reviews the arbitral tribunal’s decision on a de novo basis: CMB v Fund & Ors [2023] HKCFI 760 and AAA §27. (3) As such, the thresholds are entirely different. 4.3 Secondly, it is plain that the facts which in AAA are completely different from those in the present case. As DHCJ Reyes SC noted at AAA §62, the analysis is fact-sensitive: “What I derive from AmTrust is that there can be no initial presumption that the parties intended all their disputes to be resolved in a single forum, if there are several contracts with different dispute resolution clauses. There can be no such presumption in this case , even though the contracts here constitute a package having the objective of providing financing for the Borrower’s acquisition of shares, while ensuring security for the Lender. Instead of applying a presumption, one must construe each contract in the package to map out what disputes must have been intended to be covered by the dispute resolution clause of a given contract.” (emphasis added) 4.4 For the following reasons, I am of the view that D has demonstrated a prima facie case that the parties are bound by SPA Clause 9.9 and it is for the arbitral tribunal to decide on its jurisdiction. As it is likely that the arguments will be ventilated again before the arbitral tribunal, I will only set out my brief observations in relation to the 4 questions set out at §3.2(1) above. 4.5 As regards the 1 st question (is there an arbitration agreement between the parties), there is plainly an arbitration agreement between the parties, by reference to SPA Clause 9.9. Insofar as Mr Lin’s arguments that the SPA and the 8/12/22 Agreements are separate and distinct, it seems to me that those contentions are more appropriately dealt with in the context of the 4 th question. 4.6 As regards the 2 nd question (is the arbitration clause capable of being performed), P does not suggest that SPA Clause 9.9 is incapable of being performed. 4.7 In terms of the 3 rd question (is there in reality a dispute between the parties), I do not agree with Mr Lin that there is no dispute or difference between the parties on P’s claim made pursuant to the 8/12/22 Agreement (and therefore by extension no dispute or difference under the SPA), for the following reasons: (1) Although the parties had, by 8/12/22 Agreement Clause 1 renegotiated and agreed a revised payment term and latest collection dates, the 8/12/22 Agreement (arguably) does not have the effect of disentitling D from relying on SPA Clause 3.5. As pointed out above, SPA Clause 3.5 allows D to lodge a claim within 30 days after the delivery of the Products; (2) Whilst it is true that SPA Clause 3.5 is only in respect of delivery of the Products by P instead of collection of the Products by D, it seems to me to logical that the right to lodge a claim applies also to the situation where D collects the Products. Where it requires the claim to be supported by an independent surveyor’s report, it seems to me to be implicit that D must be afforded an opportunity to inspect the Products; (3) In the present case, as stated above, D only inspected the Products after the execution of the 8/12/22 Agreement. Whilst I acknowledge the arguments made by P on the legitimacy of the complaints, the crucial question, as accepted by Mr Lin, is whether there was a clear and unequivocal admission not only to liability but also to quantum . I am of the view that it is plain (or at least arguable) that there was no such clear and unequivocal admission; (4) In other words, unless there is a provision in the 8/12/22 Agreement which ousts SPA Clause 3.5, I do not believe Mr Lin can contend that the 8/12/22 Agreement amounts to a clear and unequivocal admission when the contractual bargain between the parties in the SPA is arguably that D is entitled to raise a claim after collection; (5) As discussed at the hearing, there is also no provision in the 8/12/22 Agreement to exclude a right of setoff; (6) Mr Lin further accepts that any defence raised by D premised on SPA Clause 3.5 to the sum sought pursuant by P pursuant to the 8/12/22 Agreement has to be resolved in arbitration. 4.8 In terms of the 4 th question (is the dispute or difference between the parties within the ambit of the arbitration agreement), I am of the view that it is plainly arguable that the disputes between the parties are within the ambit of SPA Clause 9.9: (1) On the authority of Neo Intelligence , it seems to me that it is arguable that 8/12/22 Agreement Clause 4 can sit in parallel with SPA Clause 9.9, in that the former only has the effect of stating the obvious proposition that the Hong Kong court is the supervisory court of the HKIAC arbitration to be commenced pursuant to SPA Clause 9.9; (2) The ambit of SPA Clause 9.9 [3] is extremely wide and clearly encompasses D’s payment obligations. Indeed, the 8/12/22 Agreement expressly refers to the SPA and the Supplemental Agreement. 5. Conclusion 5.1 I am of the view that the present proceedings should be stayed in favour of arbitration pursuant to SPA Clause 9.9. 5.2 I also make a costs order nisi that P is to pay the costs of this application on an indemnity basis to be summarily assessed on the papers. D is to lodge its Statement of Costs within 3 days hereof, and P its Statement of Objections within 3 days thereafter. (Jonathan Wong) Deputy High Court Judge Mr Mark Lin of Messrs Hogan Lovells, for the Plaintiff Ms Natalie So, instructed by Messrs Haldanes, for the Defendant [1] Signed by D on 30 June 2022. [2] P’s Skeleton Submissions §§15-17 [3] Any dispute, controversy, difference or claim arising out of or relating to the SPA, including the existence, validity, interpretation, performance, breach or termination thereof or any dispute regarding non-contractual obligations arising out of or relating to it Look up this case on Lawcite Noteup",
  "length": 30049,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2024/3110",
  "query": "seat of arbitration",
  "ts": "2025-10-16T10:49:58",
  "ok": true
}