{
  "title": "THE INCORPORATED OWNERS OF TAK TAI BUILDING V. LEUNG YAU BUILDING LTD | [2004] HKCFI 910 | HKLII",
  "court": null,
  "year": 2004,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2004] HKCFI 910 THE INCORPORATED OWNERS OF TAK TAI BUILDING V. LEUNG YAU BUILDING LTD Judgment Information Date 27 Jun, 2004 Action No. HCCT24/2004 Neutral Cit. [2004] HKCFI 910 Download MS Word Judgment Corrigendum Reading Options Translation Toggle Highlight Appeal History HCCT24/2004 HCCT24/2004 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO.24 OF 2004 ___________________________ IN THE MATTER OF THE ARBITRATION ORDINANCE CAP. 341 and IN THE MATTER OF AN ARBITRATION ___________________________ BETWEEN THE INCORPORATED OWNERS OF TAK TAI Applicant BUILDING (Respondent in Arbitration) and LEUNG YAU BUILDING LTD Respondent (Claimant in Arbitration) ___________________________ Before : Deputy High Court Judge Poon in Chambers Dates of Hearing : 29 March, 3 April and 21 June 2004 Date of Judgment : 21 June 2004 Date of Handing Down Reasons for Judgment : 28 June 2004 ___________________________ C O R R I G E N D U M ___________________________ Please kindly note the following amendment: 1. In paragraph 39, the sentence “Thus, the applicant was at the outset of these proceedings …”, “these proceedings” should read as “the hearing before me”. Date: 24 th August 2004 (A.Lam)(Miss) Clerk to Deputy High Court Judge Poon HCCT000024/2004 THE INCORPORATED OWNERS OF TAK TAI BUILDING v. LEUNG YAU BUILDING LTD HCCT24/2004 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO.24 OF 2004 ___________________________ IN THE MATTER OF THE ARBITRATION ORDINANCE CAP. 341 and IN THE MATTER OF AN ARBITRATION ___________________________ BETWEEN THE INCORPORATED OWNERS OF TAK TAI BUILDING Applicant (Respondent in Arbitration) and LEUNG YAU BUILDING LTD Respondent (Claimant in Arbitration) ___________________________ Before : Deputy High Court Judge Poon in Chambers Dates of Hearing : 29 March, 3 April and 21 June 2004 Date of Judgment : 21 June 2004 Date of Handing Down Reasons for Judgment : 28 June 2004 ___________________________ REASONS FOR JUDGMENT ___________________________ 1. This is an application for leave to appeal against an interim award made by Mr Stephen K.L. Lee (“the Arbitrator”) dated 17 February 2004 (“the Interim Award”) pursuant to section 23 of the Arbitration Ordinance (“the Ordinance”). On 21 June 2004, at the conclusion of the hearing, I refused the application. These are my reasons. Background 2. The applicant is the Incorporated Owners of TakTai Building of 35-37, 41-43 Texaco Road, 19-23 Tai Ha Street, 4-8 Tak Ti Path, Kwai Chung, New Territories. By an agreement dated 17 May 2002, the applicant engaged the respondent to carry out renovation works at Tak Tai Building for the sum of HK$7,570,000 (“the Contract”). One of the contractual documents was the Agreement and Schedule of Conditions of Building Contract (the Standard Form of Building Contract) for use in Hong Kong (Without Quantities) Second Edition 1976 (April 1998 Revision). Clause 35 of this standard form contained an arbitration agreement which obliged the parties to refer to arbitration any dispute arising from the Contract (“Clause 35”). 3. Disputes subsequently arose. On 12 October 2002, the applicant terminated the Contract. Commencing arbitration proceedings 4. Aggrieved, the respondent served on the applicant a notice of arbitration dated 11 March 2003 purportedly under Clause 35. Pursuant to the request for assistance by the respondent’s solicitors, Messrs Francis Kong & Co. (“FK”), the Hong Kong Institute of Architects (“HKIA”) and the Hong Kong Institute of Surveyors (“HKIS”) recommended that the Arbitrator be appointed. The parties were informed of the same on 16 May 2003. By letters respectively dated 26 May 2003 from FK and 23 June 2003 from the applicant’s former solicitors, Messrs Li, Wong & Lam (“LWL”), the parties accepted the Arbitrator’s appointment. 5. By letter dated 27 June 2003, FK proposed to LWL certain directions for the arbitration, including the direction that Part II of the Ordinance shall apply. The proposed directions were agreed by LWL by letter dated 30 June 2003. 6. The 1 st preliminary meeting before the Arbitrator was held on 30 June 2003 (“the Meeting”). Both parties were legally represented. Mr Lai Tsz Ming, Chairman of the applicant also attended. Upon the Arbitrator’s request for clarification, both FK and LWL confirmed that there was no amendment to Clause 35. The Arbitrator then took that Clause 35 was the written arbitration agreement between the parties. 7. On 2 July 2003, the Arbitrator issued the Order for Directions No. 1, recording the meeting and procedures for the arbitration agreed at the Meeting. 8. Pursuant to the Arbitrator’s directions, the respondent filed its statement of claim on 4 August 2003. In the month of September 2003, LWL obtained three extensions of time for filing the defence and counterclaim, which, in toto , extended the deadline for filing the pleading up to 17 October 2003. 9. The applicant then acted in person. On 8 October 2003, the applicant wrote to the Arbitrator, alleging, inter alia , that there was no contract between the parties on the ground that the respondent had failed to take out a performance bond within 14 days after the execution of the contractual agreements and 14 days before entering into the site. Further correspondence then exchanged between the applicant and the Arbitrator. On 14 October 2003, the Arbitrator granted the applicant a further extension to file the defence and counterclaim on 31 October 2003. 10. On 20 October 2003, the applicant wrote to the Arbitrator again, advising him that it desired to stop the arbitration and go for litigation, subject to agreement by its newly appointed counsel. On the same date, the Arbitrator wrote to the applicant and reminded it that (1) there was an arbitration clause in the contract whereby the parties agreed to resolve the disputes by arbitration instead of litigation; (2) that he had been duly appointed as the arbitrator pursuant to that arbitration clause; and (3) that pursuant to the Ordinance, he might determine his own jurisdiction in this arbitration. The Arbitrator advised the applicant to seek legal advice. 11. On 24 October 2003, the applicant appointed Messrs Bought & Company (“BC”) to represent it. BC then applied for but failed to obtain a further extension of time to file the defence and counterclaim from the Arbitrator. The defence and counterclaim was then duly filed on 31 October 2003. Disputing jurisdiction of the Arbitrator 12. In paragraph 7 of the defence and counterclaim, the applicant denied for the first time that the respondent had any standing to institute the arbitration on the ground that Clause 35 had been deleted by one of the contractual documents, namely, the Conditions of Contract signed by the parties. The applicant therefore averred that the respondent had no “jurisdiction” to bring the dispute to arbitration. Further, in the counterclaim, the applicant counterclaimed against the respondent for damages to be assessed that it had suffered by reason of the latter’s breach. 13. The parties agreed that the Arbitrator had power to decide his own jurisdiction. Pursuant to his directions, the parties put in written submissions on this issue on 12 and 19 January and 2 February 2004. The Arbitrator’s determination on jurisdiction 14. In the Interim Award, the Arbitrator first found (at paragraph 47) that Clause 35 had been deleted. He then went on to say: “48. It is common ground that both parties agreed to the appointment of myself as the arbitrator and the terms and conditions of my appointment and security of fees was provided. 49. I do not accept the Respondent’s argument that “Clause 16(2) expressly caters for the situation where one party does not agree to refer the matter to arbitration by reason of its lack of jurisdiction but on the other hand has to appoint an arbitrator before the jurisdictional issue could be resolved.” The Respondent could have simply objected to the appointment of the arbitrator which was done in accordance with a purported arbitration agreement that actually does not exist. It was a waste of time and costs for the Respondent to allow the appointment and then challenge the jurisdiction of the arbitral tribunal on the simple ground that there was no agreement to arbitrate. The argument that “an agreement to appoint the arbitrator could not be taken as an agreement to arbitrate” is not logical and hence not acceptable. If the argument was true, it means that the Respondent agreed to appoint an arbitrator with the sole intention and expectation that he then would decide that he has no jurisdiction to arbitrate the dispute and resigns as the arbitrator. 50. In fact, the Respondent accepted that the standard arbitration clause (Clause 35) is part of the Contract by : (a) not objecting to the Claimant’s application to HKIS and HKIA to appoint the arbitrator pursuant to the standard arbitration clause (Clause 35), (b) leading me to the standard arbitration clause (Clause 35) as the arbitration agreement during the preliminary meeting (the Respondent has no objection to this assertion made by the Claimant), (c) advising me jointly with the Claimant during the preliminary meeting that there was no amendment to this standard arbitration clause (Clause 35). 51. I FIND as a FACT that the Respondent had accepted that there was written arbitration agreement in the Contract at least till 8 th October 2003 when it wrote to me in person advising me that it was seeking counsel’s opinion, if not later. 52. Bearing this in mind, I accept the Claimant’s argument that the Respondent’s acceptance of the Claimant’s proposed directions for this arbitration by its letter dated 30 th June 2003 constituted an arbitration agreement by exchange of written communications between the parties pursuant to Section 2AC (2)(b) of the Arbitration Ordinance ( Cap. 341 ). 53. I HOLD as a matter of LAW that either there is a written arbitration agreement between the parties or an arbitration agreement has been made by exchange of written communications between the parties and that I have the jurisdiction to arbitrate the disputes between the parties.” 15. The Arbitrator further found (at paragraphs 54 to 59) that by filing the counterclaim, the applicant had submitted to the jurisdiction of the arbitral tribunal; and that the applicant had failed to raise the jurisdictional plea in time; and that the delay in raising the plea was not justified. He therefore refused to exercise his discretion to allow a late plea. Questions of law 16. Applying for leave to appeal, the applicant now raises three questions of law for my determination : (1) The Arbitrator erred in holding that the applicant had failed to raise the plea on jurisdiction in time (“Ground 1”). (2) The Arbitrator erred in finding that there is a written arbitration between the parties or an arbitration agreement had been made by exchange of written communications between the parties pursuant to section 2AC(2)(b) of the Ordinance (“Ground 2”). (3) The Arbitrator erred in holding that the applicant had submitted to the jurisdiction of the arbitral tribunal by filing its counterclaim (“Ground 3”). The respondent’s notice 17. By notice filed on 14 June 2004 pursuant to paragraph 2 of Practice Directions 6.2, the respondent sought to support the Arbitrator’s finding that there was an arbitration agreement by two grounds not expressed in the Interim Award. They are : (1) That by (a) leading the Arbitrator to Clause 35 as the arbitration agreement during the Meeting and (b) advising the Arbitrator that there was no amendment to the arbitration clause, there was a written arbitration agreement between the parties pursuant to section 2AC(2)(d) and/or (e) of the Arbitration Ordinance (“Ground 4”); and (2) Further or alternatively, by reason of the parties’ conduct, there was an ad hoc arbitration agreement between them (“Ground 5”). The applicable principles 18. The applicable principles are well settled. There is a presumption of finality in arbitrations. The strength of this presumption depends on whether the clause in question or issue in dispute is a one-off event or standard. When the construction of a one-off clause is involved, the court would grant leave to appeal when, but only when, the arbitral tribunal’s construction appeared to be obviously wrong. On the other hand, where there is a question of law of general public importance or the construction of a standard clause is involved, the courts should normally grant leave when, but only when, there is at least a serious doubt as to it correctness. No matter what type of clause is involved, the threshold is a high one. See Swire Properties Ltd & Ors v. Secretary for Justice [2003] 2 HKLRD 986 . 19. None of the grounds raised by the of parties involves any question of law of general public importance. They all involve one issue, namely, whether there existed an arbitration agreement between the parties in the circumstances of this case. This is a “one-off” question. Accordingly, the applicant has to show that the Arbitrator was obviously wrong. 20. With the above in mind, I first examine Grounds 1 to 3. The Arbitrator erred as per Grounds 1 and 3 21. There is no doubt that the Arbitrator did err in holding that the applicant had failed to dispute jurisdiction in time (Ground 1). This arbitration is a domestic arbitration. Section 13B of the Ordinance provides that Article 16(2) of the UNCITRAL Model Law on International Commercial Arbitration applies to an arbitral tribunal that is conducting arbitration proceedings under a domestic arbitration agreement in the same way as it applies to an arbitral tribunal that is conducting arbitration proceedings under an international arbitration agreement. Under Article 16(2), a plea that the arbitral tribunal does not have jurisdiction shall be raised not later than the submission of the statement of defence. In short, a party to a domestic arbitration may dispute the jurisdiction of the arbitral tribunal at the time when it files its defence. That is exactly what the applicant had done here. The Arbitrator’s ruling that it had failed to raise the plea in time flies directly in the face of Article 16(2). It cannot be supported. 22. The Arbitrator also erred in holding that the applicant had submitted to the jurisdiction of the arbitral tribunal by filing its counterclaim (Ground 3). In paragraph 7 of the defence, the applicant had already raised the plea on jurisdiction. Paragraph 21 of the counterclaim made express reference to paragraph 7 of the defence. In the circumstances, the counterclaim must have been included without prejudice to its plea on jurisdiction. Further, this plea on jurisdiction can either be resolved as a preliminary issue or as part of an award on the merits : see Fung Sang Trading Ltd v. Kai Sun Sea Products & Food Co. Ltd , HCMP2674/1991, unreported, 29 October 1991, per Kaplan J at p.17. Thus, the applicant cannot be said to have submitted to the Arbitrator’s jurisdiction merely by filing the counterclaim. The respondent’s concession and the effect thereof 23. At the first hearing before me on 29 March 2004, Mr Dawes, counsel appearing for the respondent, conceded, and rightly so in my view, that the Arbitrator did err as per Grounds 1 and 3. But that concession does not resolve the matter. For the Arbitrator did make a finding that an arbitration agreement existed. If the applicant fails to obtain leave to argue Ground 2, granting leave to appeal on Grounds 1 and 3 alone cannot possibly substantially affect the parties’ rights. The questions of law raised by Grounds 1 and 3 will then become purely academic. Leave should not be granted : see section 23(4) of the Ordinance, and Pioneer Shipping Ltd v. BTP Tioxide Ltd [1980] QB 547 , per Lord Denning at p.564D-E. 24. This brings me to Ground 2. Ground 2 25. The Arbitrator’s reasoning as to his finding that there existed an arbitration agreement between the parties is set out in paragraphs 48 to 53 of the Interim Award, which have been reproduced in paragraph 14 above. Before proceeding any further, I would like to make one observation on his finding. In paragraph 53, the Arbitrator held as a matter of law “that there is a written arbitration agreement between the parties or an arbitration agreement has been made by exchange of communication between the parties” (Emphasis supplied). He had thus made two alternative findings : (1) a written arbitration agreement or (2) an arbitration agreement by exchange of written communications. But the tenor of the paragraphs 48 to 52 in the Interim Award is really on how he came to finding (2). It is not clear how the Arbitrator came to finding (1). As can be seen below, finding (2) is addressed in Ground 2 whereas finding (1) is dealt with in Grounds 4 and 5. 26. Ground 2 concerns section 2AC(1) of the Ordinance, which provides that an agreement is not an arbitration agreement for the purposes of the Ordinance unless it is in writing. Section 2AC(2)(b) then stipulates that an agreement is in writing for the purposes of subsection (1) if it is made by exchange of written communications. Paragraph (b) is capable of two meanings : (i) a set of documents which themselves include or embody an arbitration agreement; and (ii) a set of documents evidencing an arbitration agreement in writing. It is critical that the exchange of communications should clearly provide a record of the arbitration agreement : see generally, Morgan , The Arbitration Ordinance of Hong Kong — A Commentary : 1997 Supplement , at pp.31-32. 27. On a proper analysis, the Arbitrator’s reasoning that led him to his finding that there was an arbitration agreement made by exchange of correspondence is briefly this : (1) Clause 35 had been deleted and there was therefore no written arbitration agreement between the parties. (2) But the applicant had accepted that Clause 35 as part of the Contract by conduct by not objecting to his appointment, leading him to Clause 35 as the arbitration agreement during the Meeting and by advising him during the Meeting that there was no amendment to Clause 35. (3) Accordingly, when the applicant agreed to the respondent’s directions for arbitration by letter dated 30 June 2003, such acceptance constituted an arbitration agreement by exchange of written communications pursuant to section 2AC(2)(b) of the Ordinance. 28. The Arbitrator had obviously taken into account the applicant’s acceptance of Clause 35 as part of the Contract when construing the effect of the parties’ letters on the agreement of the proposed directions for arbitration. But, as rightly pointed out by Ms Lan, the letters constituted an agreement on the applicable rules for the conduct of the arbitration proceedings only, as opposed to an unequivocal agreement to arbitrate, especially when the right to challenge his jurisdiction is reserved under Article 16 of the Model Law. Thus, I agree with Ms Lan that the Arbitrator’s finding on the effect of the letters is not supportable. 29. Mr Dawes argued that there is simply no point in agreeing to directions and procedural rules when there is no intention to arbitrate and the Arbitrator was entitled to come to the conclusion that by reason of the written communication, an arbitration agreement was made. But this begs the question whether the parties had agreed to arbitrate in the first place. And it does not answer Ms Lan’s point that the letters did not contain an unequivocal agreement to arbitrate. I will therefore hold that the Arbitrator erred as per Ground 2 as well. Arbitration agreement by conduct 30. As I understand Mr Dawes, he is not seriously supporting the Arbitrator’s finding that there was an arbitration agreement by exchange of written communications. Instead, he sought to support the Arbitrator’s finding that there was a written arbitration agreement by relying on Grounds 4 and 5. To recap, they are : (1) That by (a) leading the Arbitrator to Clause 35 as the arbitration agreement during the Meeting and (b) advising the Arbitrator that there was no amendment to the arbitration clause, there was a written arbitration agreement between the parties pursuant to section 2AC(2)(d) and/or (e) of the Arbitration Ordinance (Ground 4); and (2) Further or alternatively, by reason of the parties’ conduct, there was an ad hoc arbitration agreement between them (Ground 5). 31. As Mr Dawes developed his submissions, the two grounds really boiled down to one point. The conduct of the parties at the Meeting could well justify a finding that the parties had agreed to arbitrate. This is particularly so when the applicant’s Chairman, who attended the Meeting, had raised no objection to the parties’ agreement to arbitrate pursuant to Clause 35. I agree. 32. Ms Lan submitted that the applicant if not both parties must have acted under a mistake as to the existence of Clause 35 at the Meeting. However, there is nothing before the Arbitrator as to why the applicantreferred to Clause 35 as the arbitration agreement at the Meeting despite the fact that it had already been deleted earlier. In the absence of the requisite evidence, I am unable to accept Ms Lan’s submission. 33. I now turn to Grounds 4 and 5 in greater detail. Ground 4 34. Ground 4 involves sections 2AC(2)(d) and (e) of the Ordinance. I will look at section 2AC(2)(d) first. This subsection stipulates that an agreement is in writing for the purposes of section 2AC(1) if the parties to the agreement agree otherwise than in writing by referring to terms that are in writing. It encompasses two principal situations: (1) Oral arbitration agreements which incorporate by reference the terms of a written form of agreement containing an arbitration clause. (2) Arbitration agreements by conduct. See Morgan , at p.33. However, it should be noted that for arbitration agreements by conduct, the existence of some form of writing is still necessary because of the requirement that the terms referred to have to be in writing. 35. I have already concluded in paragraph 31 above that there are materials before the Arbitrator to justify a finding that there was an arbitration agreement by conduct. And at the Meeting, the parties did refer to Clause 35, which is in writing, as the arbitration agreement. Thus, the Arbitrator’s finding that there was a written arbitration agreement is capable of being supported by section 2AC(2)(d). 36. I next turn to section 2AC(2)(e). This subsection provides that an agreement is in writing for the purposes of subsection (1) if the agreement, although made otherwise than in writing, is recorded by one of the parties to the agreement, or by a third-party, with the authority of each of the parties to the agreement. Here, the arbitration agreement is by conduct. The record is made by the Arbitrator at the Meeting. Thus, the Arbitrator’s finding is also supportable by section 2AC(2)(e). Ground 5 37. An ad hoc agreement in the present context means an agreement to refer the present disputes of the parties to arbitration. For the same reasons above, I also accept Mr Dawes’s submission that there was an ad hoc arbitration agreement between the parties in term of Clause 35. Conclusion 38. Although the applicant has succeeded in all Grounds 1 to 3, the Interim Award is capable of being supported by Grounds 4 and 5. The applicant has been unable to demonstrate that the Arbitrator’s finding that there was an arbitration agreement between the parties was obviously wrong. In the circumstances, I will refuse leave to appeal. Costs 39. On the question of costs, the usual order is that costs should follow the event. But as demonstrated above, the Arbitrator did err as per Grounds 1 to 3. The Interim Award has nevertheless survived because of Grounds 4 and 5. These two additional grounds were alluded to by Mr Dawes in his written submissions filed for the first hearing on 29 March 2004 and verbally at the second hearing on 3 April 2004. But they were properly formulated only when the respondent’s notice was filed on 14 June 2004. Thus, the applicant was at the outset of these proceedings aware of the fact that respondent would be taking these two points but the respondent was not entitled to argue it until the respondent’s notice had been filed. Looking at the matter in the round, I am of the view that the respondent should be entitled to half of the costs only. And I so order. (J. Poon) Deputy High Court Judge Ms Gekko Lan, instructed by Messrs Bough & Co., for the Applicant Mr Victor Dawes, instructed by Messrs Peter Lau & Co., for the Respondent Remarks: Appeal by the applicant to Court of Appeal. Appeal dismissed with costs. Please refer to CACV230/2004. Look up this case on Lawcite Noteup",
  "length": 24999,
  "headers_seen": [
    "Background",
    "Commencing arbitration proceedings",
    "Disputing jurisdiction of the Arbitrator",
    "The Arbitrator’s determination on jurisdiction",
    "Questions of law",
    "The respondent’s notice",
    "The applicable principles",
    "The Arbitrator erred as per Grounds 1 and 3"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2004/910",
  "query": "arbitration",
  "ts": "2025-10-14T11:20:46",
  "ok": true
}