{
  "title": "SEA POWERFUL II SPECIAL MARITIME ENTERPRISES (ENE) V. BANK OF CHINA LTD | [2016] HKCA 205 | HKLII",
  "court": null,
  "year": 2016,
  "date": null,
  "content": "HKLII Databases Court of Appeal [2016] HKCA 205 SEA POWERFUL II SPECIAL MARITIME ENTERPRISES (ENE) V. BANK OF CHINA LTD Judgment Information Date 23 May, 2016 Action No. CACV36/2016 Neutral Cit. [2016] HKCA 205 Parallel Cit. [2016] 3 HKLRD 352 [2017] 1 HKC 153 Download MS Word Judgment Reading Options Translation Toggle Highlight Appeal History CACV36/2016 CACV36/2016 SEA POWERFUL II SPECIAL MARITIME ENTERPRISES (ENE) v. BANK OF CHINA LTD CACV 36/2016 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF APPEAL CIVIL APPEAL NO. 36 OF 2016 (ON APPEAL FROM HCMP NO. 2399 OF 2015) ________________________ BETWEEN SEA POWERFUL II SPECIAL MARITIME ENTERPRISES (ENE) Plaintiff and BANK OF CHINA LIMITED Defendant ________________________ Before: Hon Yuen, Kwan and McWalters JJA in Court Date of Hearing: 13 April 2016 Date of Judgment: 13 April 2016 Date of Reasons for Judgment: 24 May 2016 ________________________ REASONS FOR JUDGMENT ________________________ Hon Yuen JA: 1. I agree with the reasons for judgment of Kwan JA. Hon Kwan JA: 2. The plaintiff, which is a vessel owner, issued an originating summons for an anti-suit injunction against the defendant bank, as the lawful holder of the bill of lading (“B/L”), to restrain the latter from continuing proceedings against it (“Mainland Proceedings”) commenced in the Qingdao Maritime Court (“QMC”) in breach of an arbitration clause. Anthony Chan J dismissed the application in a judgment handed down on 12 January 2016 ( [2016] 1 HKLRD 1032 ). The plaintiff brought this appeal against his judgment. It was necessary for us to decide the appeal urgently, as the plaintiff would have to take a substantive step in proceedings in the Mainland by 14 April 2016, if the proceedings were not allowed to go by default. At the conclusion of the hearing, we dismissed the appeal with costs to the defendant with certificate for two counsel, with reasons to be handed down. These are my reasons for judgment. Background 3. As stated by the judge, there is little factual dispute. I will take the background matters from his judgment at §§3 to 14, omitting the footnotes: “3. … As the owner of the vessel MV Zagora (“Vessel”), the plaintiff entered into a contract of carriage, as contained in a bill of lading (“B/L”) dated 14 December 2013. The defendant’s undisputed case is that it has become the lawful holder of the B/L and thereby assumed all rights and liabilities under the same. 4. On the face of the B/L, it was stated as follows: (a) “TO BE USED WITH CHARTER-PARTIES”; (b) “Freight payable as per Charter Party 19 Nov 2013”; (c) “FOR CONDITIONS OF CARRIAGE SEE OVERLEAF”. 5. On the back of the B/L, it was expressly provided under Conditions of Carriage: “(1) Terms and Conditions. All terms and conditions, liberties and exceptions of the Charter Party, dated as overleaf, including the law and Arbitration Clause, are herewith incorporated. (2) General Paramount Clause. The Hague Rules … dated Brussels the 25 th August 1925 as enacted in the country of shipment, shall apply to this Bill of Lading ….” 6. Under clause 54 of the Charter Party dated 19 November 2013 (“C/P”), the arbitration clause (which included a choice of law), stated as follows: “Any dispute arising out of this Charter Party or any Bill of Lading issued hereunder shall be referred to arbitration in Hong Kong … English law shall apply. … Any claim must be made in writing and the claimant’s arbitrator nominated within twelve months of the final discharge of the cargo under this Charter Party, failing which any such claim shall be deemed to be waived and absolutely barred .” [emphasis added] 7. The cargo in question (71,650 mt of hematite ore lump) was shipped from Western Australia and was fully discharged from the Vessel on 31 December 2013 at Lanshan Port in the Mainland. According to the arbitration clause in question (“Clause”), the limitation period (“Limitation Period”) for the institution of arbitration expired on 30 December 2014. 8. In respect of the Mainland Proceedings, the Vessel was arrested on 29 August 2014, and released on 24 September 2014 after security by way of a bank guarantee (“Guarantee”) was put up by the plaintiff in place of the Vessel. In dealing with the release of the Vessel, the plaintiff had acted via its Mainland lawyers. It is uncontroversial that the arrest procedure was a different set of proceedings from the Mainland Proceedings which followed. 9. A statement of claim (“SOC”) for the Mainland Proceedings, a claim for wrongful discharge of cargo, was issued on 15th September 2014 prior to the release of the Vessel. This constituted the commencement of the Mainland Proceedings. However, it was only served on the plaintiff on 13th May 2015 (a delay of 8 months). … 10. There was a confirmation letter (“Letter”) issued by the plaintiff to the defendant on 9 January 2015 confirming that the Vessel was not under any bareboat charter at the material time. There is no evidence as to why there was such a letter. However, it appears that the confirmation was actually made to the Qingdao Maritime Court (“QMC”) (quoting the case number of the Mainland Proceedings), and it was signed by the plaintiff as the defendant in that action. … 11. The plaintiff applied to challenge the jurisdiction of the QMC on 5 June 2015 based on the Clause. On 19 June 2015, Mr Wang [one of the Mainland legal representatives of the defendant] was informed by the QMC about the jurisdictional challenge. It was the first time that Mr Wang and his firm were, to their surprise, made aware of such a challenge. Although there is no evidence from the defendant as to when it had knowledge of the challenge, the reasonable inference is that it would not have such knowledge before Mr Wang learned of it. 12. The jurisdictional challenge was rejected by the QMC on 29 June 2015. It appears from the evidence that, under Mainland law, an arbitration clause would only be validly incorporated into a contract if it is clearly stated on the front side of the contract. The B/L does not meet that requirement. An appeal was lodged on 12 August 2015 by the plaintiff with the Shandong Higher People’s Court in respect of the rejection. That appeal was also rejected on 6 November 2015, after the filing of the OS [i.e. the originating summons herein filed on 25 September 2015]. Service of the Mainland Proceedings 13. After the acceptance of the defendant’s case by the QMC (this was a specific step in the Mainland civil procedure which involved an examination by the court of the viability of the claim), a hearing was fixed to take place on 7 November 2014. Under Mainland law, service of the SOC (together with related papers) had to be executed by the QMC. The unsuccessful attempts to serve the papers on the plaintiff may be summarised as follows: (a) The QMC tried to serve the SOC and other documents on the plaintiff by post to its registered office in Greece. The documents were returned because, allegedly, there was no such company at the address; (b) As a consequence of the failure to serve the papers on the plaintiff, the hearing on 7 November 2014 had to be cancelled; (c) The QMC then contacted the plaintiff’s Mainland lawyers, who claimed that they had no authority to acknowledge service for the plaintiff; (d) The defendant’s Mainland lawyers also contacted those lawyers repeatedly and were given the same answer; (e) Finally, the QMC had to resort to service by way of public announcement on 3 April 2015; (f) A receipt of service was signed by a representative of the plaintiff on 13 May 2015 thereby formally acknowledging service of documents by the QMC. 14. It is common ground that the plaintiff has not taken any substantive step or submitted to the jurisdiction of the QMC.” The judgment below 4. The judge held that the arbitration clause had been validly incorporated into the B/L. There is no appeal against this holding. 5. The judge made these pertinent findings of fact, and there is no challenge by either party against these findings on appeal: (1) The plaintiff was evading service in the PRC and waiting for the Limitation Period of the arbitration agreement to expire, which was the only motive for the delay (§33). (2) The plaintiff had deliberately delayed taking any action to assert its right under the arbitration agreement for eight months (§53). (3) The plaintiff’s delay is not confined to the eight-month period. Almost four months elapsed after the plaintiff made its challenge before the QMC and the filing of the originating summons. The delay in this case by the plaintiff is both inordinate and culpable (§§55 to 56). (4) When the Mainland Proceedings were instituted in September 2014, there were three months left to run under the Limitation Period. Making an anti-suit injunction application based on an arbitration clause is a simple application. There was ample time for the plaintiff to do so, and there is no credible evidence to explain why that could not be done (§60). (5) The defendant was unaware of the arbitration clause. It took no step to obtain a copy of the C/P to ascertain the position and as a result did not become aware of the clause until June 2015 when the plaintiff challenged jurisdiction for the first time in the Mainland Proceedings. The defendant had failed to act reasonably in failing to preserve its right to sue in the contractual forum (§§34 and 38). 6. Having examined the plaintiff’s inordinate and culpable delay against the relevant circumstances of this case (§51), the judge declined to exercise his discretion to grant the anti-suit injunction on the ground of delay alone (§56). He referred to the fountain head of the applicable legal principles being the decision of the English Court of Appeal in The Angelic Grace [1995] 1 Lloyd’s Rep 87. He decided to follow a line of English authorities which in his view supported the proposition that delay is a free-standing argument ( Essar Shipping Ltd v Bank of China Ltd [2015] EWHC (Comm) [1] ; Ecobank Transnational Incorporated v Tanoh [2015] EWHC 1874 (Comm); Ecobank Transnational Incorporated v Tanoh [2015] EWCA Civ 1309 (“ Ecobank CA ”)). 7. If he were wrong in holding that delay can be a stand-alone ground for declining the application, he would have no hesitation in refusing relief given the delay coupled with the comity considerations, which are closely associated with delay (§§61 and 63). He found useful guidance on this in Ecobank CA. 8. The defendant’s argument that the application should be dismissed on the ground of serious prejudice to the defendant by reason of the expiration of the Limitation Period was rejected. This is because the judge found that the defendant had not acted reasonably in failing to preserve its right to sue in the contractual forum (§64). This is not challenged on appeal. 9. As for any serious prejudice to the defendant by the loss of security being the Guarantee, the judge would not have declined to grant the injunction on this ground, noting that he has the power to impose conditions in granting the injunction such as a condition whereby the Guarantee would be preserved (§65). This appeal 10. This appeal is against the exercise of discretion of the judge. For the appeal court to interfere with his decision, the approach is as stated in Ecobank CA at §138 by Christopher Clarke LJ who in turn quoted Burnton LJ in Joint Stock Asset Management Company Ingosstrakh-Investments v BNP Paribas SA [2012] EWCA Civ 644 at §63: “unless the judge’s finding of the primary facts is shown to have been mistaken, this Court will interfere with the conclusion of the judge at first instance only if it is shown that he erred in law, or that he ignored a relevant factor or took into account an irrelevant factor, or if his conclusion was one that he could not reasonably or sensibly have come to.” 11. Mr Charles Sussex, SC who appeared with Mr Christopher Chain for the plaintiff, formulated this single point of law for this court: “Where an anti-suit injunction is sought to enforce a contractually agreed arbitration clause, and there has been no submission to the jurisdiction of the foreign court by the applicant, and no relevant irreparable prejudice to the respondent, can mere delay and comity considerations arising from that mere passage of time constitute sufficient freestanding justification for the refusal of the grant of an anti-suit injunction?” 12. Mr Sussex submitted that the judge erred in law in following the English cases of Essar , Ecobank and Ecobank CA . He contended that these recent decisions had departed from the well established principles and jurisprudential rationale behind the grant of anti-suit injunctions, which respect, uphold and give effect to the sanctity of the contractual bargain agreed to by the parties to an arbitration clause, save in exceptional circumstances, citing Donohue v Armco Inc [2002] CLC 440 in which Lord Bingham of Cornhill said at §24: “If contracting parties agree to give a particular court exclusive jurisdiction to rule on claims between those parties, and a claim falling within the scope of the agreement is made in proceedings in a forum other than that which the parties have agreed, the English court will ordinarily exercise its discretion (whether by granting a stay of proceedings in England, or by restraining the prosecution of proceedings in the non-contractual forum abroad, or by such other procedural order as is appropriate in the circumstances) to secure compliance with the contractual bargain, unless the party suing in the non-contractual forum (the burden being on him) can show strong reasons for suing in that forum. I use the word ‘ordinarily’ to recognise that where an exercise of discretion is called for there can be no absolute or inflexible rule governing that exercise, and also that a party may lose his claim to equitable relief by dilatoriness or other unconscionable conduct. But the general rule is clear: where parties have bound themselves by an exclusive jurisdiction clause effect should ordinarily be given to that obligation in the absence of strong reasons for departing from it. Whether a party can show strong reasons, sufficient to displace the other party’s prima facie entitlement to enforce the contractual bargain, will depend on all the facts and circumstances of the particular case. …” 13. Mr Sussex submitted that mere delay does not amount to a strong enough standalone reason to displace agreed contractual rights. The only other matter advanced before the judge was comity. He submitted that in respect of comity considerations, it is necessary to distinguish between an anti-suit injunction in the context of forum non conveniens cases (“FNC anti-suit injunction”) and an anti-suit injunction to enforce an arbitration agreement (“Contractual anti-suit injunction”). Such a distinction was drawn by Millett LJ (as he then was) in The Angelic Grace in these passages at p 96: “In my judgment, the time has come to lay aside the ritual incantation that this is a jurisdiction [i.e. the power to grant an anti-suit injunction to enforce an arbitration clause] which should only be exercised sparingly and with great caution. There have been many statements of great authority warning of the danger of giving an appearance of undue interference with the proceedings of a foreign Court. Such sensitivity to the feelings of a foreign Court has much to commend it where the injunction is sought on the ground of forum non conveniens or on the general ground that the foreign proceedings are vexatious or oppressive but where no breach of contract is involved. In the former case, great care may be needed to avoid casting doubt on the fairness or adequacy of the procedures of the foreign Court. In the latter case, the question whether proceedings are vexatious or oppressive is primarily a matter for the Court before which they are pending. But in my judgment there is no good reason for diffidence in granting an injunction to restrain foreign proceedings on the clear and simple ground that the defendant has promised not to bring them. … I cannot accept the proposition that any Court would be offended by the grant of an injunction to restrain a party from invoking a jurisdiction which he had promised not to invoke and which it was its own duty to decline. … In my judgment, where an injunction is sought to restrain a party from proceeding in a foreign Court in breach of an arbitration agreement governed by English law, the English Court need feel no diffidence in granting the injunction, provided that it is sought promptly and before the foreign proceedings are too far advanced. I see no difference in principle between an injunction to restrain proceedings in breach of an arbitration clause and one to restrain proceedings in breach of an exclusive jurisdiction clause as in Continental Bank N.A. v Aeakos Compania Naviera S.A. , [1994] 1 W.L.R. 588. The justification for the grant of the injunction in either case is that without it the plaintiff will be deprived of its contractual rights in a situation in which damages are manifestly an inadequate remedy. The jurisdiction is, of course, discretionary and is not exercised as a matter of course, but good reason needs to be shown why it should not be exercised in any given case.” 14. Hence, Mr Sussex submitted that for a Contractual anti-suit injunction, considerations of comity are of minimal relevance, if any. He contended this is borne out by various dicta in subsequent cases, such as: OT Africa Line Ltd v Magic Sportswear Corporation [2005] 2 Lloyd’s Rep 170 at §§32 and 33 “32. In the case of exclusive jurisdiction clauses, however, comity has a smaller role. It goes without saying that any court should pay respect to another (foreign) court but, if the parties have actually agreed that a foreign court is to have sole jurisdiction over any dispute, the true role of comity is to ensure that the partiesʼ agreement is respected. Whatever country it is to the courts of which the parties have agreed to submit their disputes is the country to which comity is due. It is not a matter of an English court seeking to uphold and enforce references to its own courts; an English court will uphold and enforce references to the courts of whichever country the parties agree for the resolution of their disputes. This is to uphold party autonomy not to uphold the courts of any particular country. 33. The corollary of this is that a party who initiates proceedings in a court other than the court, which has been agreed with the other party as the court for resolution of any dispute, is acting in breach of contract. The normal remedy for this breach of contract is the grant of an injunction to restrain the continuance of proceedings unless it can be shown that damages are an adequate remedy; but damages will not usually be an adequate remedy in fact, since damages will not be easily calculable and can indeed only be calculated by comparing the advantages and disadvantages of the respective fora. This is likely to involve an even graver a breach of comity than the granting of an anti-suit injunction.” (per Longmore LJ) Deutsche Bank AG v Highland Crusader Partners LP [2010] 1 WLR 1023 at §50 “An injunction to enforce an exclusive jurisdiction clause governed by English law is not regarded as a breach of comity, because it merely requires a party to honour his contract.” (per Toulson LJ. This dictum was adopted by the Court of Appeal (Lam VP, Barma JA and Poon J) in Compania Sud America De Vapores SA v Hin-Pro International Logistics Ltd [2015] 2 HKLRD 458 at §§56 and 57). 15. Mr Sussex prayed in aid the statutory regime for granting a stay in favour of arbitration under section 20(1) (which adopts Article 8 of the UNCITRAL Model Law) and 20(5) of the Arbitration Ordinance , Cap 609 , which provides for a mandatory stay of proceedings in favour of arbitration unless the applicant has taken a substantive step in the action by submitting his first statement on the substance of the dispute. He submitted that as comity considerations are of minimal (if any) relevance in cases of Contractual anti-suit injunctions, there is no principled basis for drawing a distinction between how the court should approach stays in favour of arbitration, and how it should approach anti-suit injunctions to enforce an arbitration agreement. So just as mere delay (in the absence of a step in the action) would have no bearing on whether the court grants a stay of proceedings in favour of arbitration, it should have no bearing on the grant of a Contractual anti-suit injunction. 16. Mr Sussex pointed out that the English courts in Essar, Ecobank and Ecobank CA did not consider the regime for mandatory stay of proceedings in favour of arbitration under section 9 of the Arbitration Act 1996 (equivalent to section 20 in our Arbitration Ordinance ). The importance of protecting the sanctity of contractual bargains was not emphasised. Instead, emphasis was placed on the discretionary nature of Contractual anti-suit injunctions. Comity considerations were put forward as the principled basis behind why mere delay can amount to sufficiently strong reason to refuse the grant of a Contractual anti-suit injunction. Mr Sussex contended this represented an erroneous departure from established and well-reasoned principles. Furthermore, he submitted that the courts in those three decisions are wrong to allow concerns of wastage of judicial resources (where there is delay in applying for anti-suit injunctions) to override substantive contractual rights between the parties. In any event, the wastage of judicial resources should be minimal where no substantive step has been taken in the foreign court. Discussion 17. I agree with Mr Sussex that to ascertain the true role of comity considerations in Contractual anti-suit injunctions, a distinction should be drawn between FNC anti-suit injunctions and Contractual anti-suit injunctions. This distinction is made clear in the authorities he cited – The Angelic Grace at p 96; OT Africa Line Ltd at §§32 and 33; Deutsche Bank AG v Highland Crusader Partners LP at §50. 18. However, this is not to say that for Contractual anti-suit injunctions, comity would have no or minimal relevance, as Mr Sussex has contended. In Contractual anti-suit injunctions, comity considerations would have reduced importance, not that they would have no importance. This is borne out in the cases we have been referred to, see Ecobank CA §§105 and 106. It is also pertinent to note the context in which Longmore LJ’s statements were made in §§32 and 33 of OT Africa Line Ltd. As pointed out in Ecobank CA at §100, in that case there was no question of the applicant having been dilatory and the court was not concerned with the impact of delay. 19. Mr Sussex placed particular emphasis on those parts of Millett LJ’s judgment in The Angelic Grace that a Contractual anti-suit injunction is to grant practical relief to the contractual rights of the innocent party and so the English Court need feel no diffidence in granting relief. But Millett LJ had also said, to quote again the relevant dictum in full: “where an injunction is sought to restrain a party from proceeding in a foreign Court in breach of an arbitration agreement governed by English law, the English Court need feel no diffidence in granting the injunction, provided that it is sought promptly and before the foreign proceedings are too far advanced.” This was echoed by Mance J, as he then was, in Toepfer v Molino Boschi [1996] 1 Lloyd’s Rep 510 at 516, that it had “never been the law that a foreign defendant could with complete impunity allow foreign proceedings to continue practically to judgment and then seek at the last minute relief in England which would halt or undermine.” 20. At §42 of his judgment, the judge had regard to the judgment of Walker J in Essar at §§42 to 43 which supported the proposition that delay alone may be a sufficient ground for refusing an anti-suit injunction (“promptness alone may justify refusal of an anti-suit injunction”). As mentioned earlier, he decided in §56 to refuse relief on the ground of delay alone, even without the comity considerations. 21. I am inclined to think the better view is that delay and comity are related. As observed by Burnton LJ in Ingosstrakh-Investments v BNP Paribas at §66, “the question of delay and that of comity are linked”. This seems to be accepted by Mr Edward Chan, SC, who appeared for the defendant with Mr Gary Lam. The subject of delay and comity was discussed at some length in Ecobank CA at §§120 to 137, some of which has been quoted by the judge in §62 of his judgment. These passages are of particular relevance: “122. … I do not accept that delay was wholly irrelevant … An injunction is an equitable remedy. Before granting it the court must consider whether it is appropriate to do so having regard to all relevant considerations, which will include the extent to which the respondent has incurred expense prior to any application being made, the interests of third parties, including, in particular, the foreign court, and the effect of making such an order in relation to what has happened before it was made. 123. A relevant consideration, particularly in relation to interlocutory relief, as was sought in the present case, is whether the party seeking an injunction has acted with appropriate speed. The longer a respondent continues doing that which the applicant seeks to prevent him from doing, the greater the amount of labour and cost that he will have expended which could have been avoided. … … 126. Moreover the prejudice or detriment which would be involved in Ecobank allowing the proceedings to continue without seeking injunctive relief and then securing an injunction would not have been limited to Mr Tanoh. It extends to third parties involved in the litigation and, most importantly, the foreign courts which, in the present case, have held hearings and produced judgments of considerable length which are obviously the product of much labour. 127. I agree with the judge that it is not a precondition to the refusal of an injunction that the respondent should establish detrimental reliance, if by that is meant that he must show (a) that he believed that no application for an injunction would be made or (b) that he believed that and, if he had realised that an application would or might be made, he would have abandoned the foreign proceedings. The existence or otherwise of such reliance is relevant but not determinative. The relevance of delay is wider than that. The need to avoid it arises for a variety of reasons including the avoidance of prejudice, detriment, and waste of resources; the need for finality; and considerations of comity. 128. It is, thus, not, in my view, a complete answer for Ecobank to say that someone in the position of Mr Tanoh has only himself to blame because it his breach which will have caused the waste. The court is, in an appropriate case, entitled to be reluctant to use its coercive powers to restrain that which the applicant has in fact allowed to continue without any application for relief for some time. This is especially so if, as appears to me to be the case here, little useful purpose is likely to be served by the party who claims to be entitled to an injunction holding back from claiming it. … 129. Further the tenor of modern authorities is that an applicant should act promptly and claim injunctive relief at an early stage; and should not adopt an attitude of waiting to see what the foreign court decides. In The Angelic Grace Leggatt LJ said that it would be patronising and the reverse of comity for the English court to decline to grant injunctive relief until it was apparent whether the foreign court was going to uphold the objection to its exercising jurisdiction and only do so if and when it failed to do so. Whilst those observations related to the approach of the court it seems to me that they are a guide to what should be the approach of a would-be applicant for anti-suit or anti-enforcement relief. 130. The proposition that delay in this field is immaterial in the absence of prejudice and that there is necessarily no prejudice if the respondent is aware of the challenge to the jurisdiction of the foreign court which is being pursued there would have curious consequences. Firstly it would revolutionise the approach that has previously been taken in respect of the need for applicants to act promptly. Secondly it would mean that applicants could have two bites at the cherry. They could, without seeking or threatening any injunctive relief in this country, resist the foreign proceedings on the ground that the issue should be arbitrated and, provided they had not submitted to the jurisdiction, they could then, if the challenge failed, seek an anti-enforcement injunction. The impunity which Mance J had thought “never [to have] been the law ” or something very like it would have arrived. … 132. Comity has a warm ring. It is important to analyse what it means. We are not here concerned with judicial amour propre but with the operation of systems of law. Courts around the free world endeavour to do justice between citizens in accordance with applicable laws as expeditiously as they can with the resources available to them. This is an exercise in the fulfilment of which judges ought to be comrades in arms. The burdens imposed on courts are well known: long lists, size of cases, shortages of judges, expanding waiting times, and competing demands on resources. The administration of justice and the interests of litigants and of courts is usually prejudiced by late attempts to change course or to terminate the voyage. If successful they often mean that time, effort, and expense, often considerable, will have been wasted both by the parties and the courts and others. Comity between courts, and indeed considerations of public policy, require, where possible, the avoidance of such waste. 133. Injunctive relief may be sought (a) before any foreign proceedings have begun; (b) once they have begun; (c) within a relatively short time afterwards; (d) when the pleadings are complete; (e) thereafter but before the trial starts; (f) in the course of the trial; (g) after judgment. The fact that at some stage the foreign court has ruled in favour of its own jurisdiction is not per se a bar to an anti-suit injunction: see AES [2] . But, as each stage is reached more will have been wasted by the abandonment of proceedings which compliance with an anti-suit injunction would bring about. That being so, the longer an action continues without any attempt to restrain it the less likely a court is to grant an injunction and considerations of comity have greater force. 134. Whilst a desire to avoid offence to a foreign court, or to appear to interfere with it, is no longer as powerful a consideration as it may previously have been, it is not a consideration without relevance. A foreign court may justifiably take objection to an approach under which an injunction, which will (if obeyed) frustrate all that has gone before, may be granted however late an application is made (provided the person enjoined knew from an early stage that objection was taken to the proceedings). Such an objection is not based on the need to avoid offense to individual judges (who are made of sterner stuff) but on the sound basis that to allow such an approach is not a sensible method of conducting curial business. … 137. In short, both general discretionary considerations and the need for comity mean that an applicant for anti-suit relief needs to act with appropriate despatch. In Transfield Shipping [3] at [78] I observed that “ …comity, which involves respect for the operation of different legal systems, calls for challenges … to be made promptly in whatever is the appropriate court ”. Whilst recognising that delay is not necessarily a bar to relief, and the importance of upholding the rights of those who are the beneficiaries of exclusive jurisdiction agreements, I do not regard the cases subsequently decided by this court as rendering that statement inaccurate.” 22. Arguments similar to those raised by Mr Sussex were rejected in Ecobank CA for the reasons as fully explained. They accord with good sense and fairness. I do not see the approach as a departure from well established principles. In this exercise, one is concerned with discretionary considerations. It would not be fair to say that the court did not have regard to the importance of protecting the sanctity of contractual rights. In the exercise of judicial discretion, what appropriate weight should be accorded to a particular factor when all relevant considerations are taken into account must vary with the particular circumstances of each case. 23. I do not think the judge could fairly be criticised for giving significant weight to the comity considerations mentioned in §61 of the judgment. Here, a grant of an anti-suit injunction would mean that the two decisions of the PRC courts (in ruling against the jurisdictional challenge by the plaintiff) would practically be overturned. There is uncontradicted evidence given by the defendant’s PRC law expert that the Mainland courts would likely regard this application as “an intrusion or obstruction of the judicial sovereignty of the Chinese courts”, and the QMC had “accepted” the Mainland Proceedings, which involved a thorough examination of the defendant’s claim pursuant to Article 119 of the Civil Procedure Law of the PRC. 24. As for Mr Sussex’s analogy with section 20 of the Arbitration Ordinance , this has been considered by the judge at §§47 and 48 and he rejected it at §49 in light of the decision in Ecobank CA . I agree with the submission of Mr Chan that the analogy is inapt. The power to stay proceedings in section 20(5) is inapplicable where no arbitration proceedings are on foot in Hong Kong and the parties do not intend to go to arbitration. Besides, the power to grant an anti-suit injunction is exercised pursuant to section 21L of the High Court Ordinance , Cap 4 . As submitted by Mr Chan, in the exercise of the discretion under that provision, the court may take into account wider considerations. 25. I do not propose to deal with various cases cited by Mr Sussex where Contractual anti-suit injunctions were granted notwithstanding the lapse of time, to illustrate his proposition that mere delay was not a sufficient freestanding justification to refuse relief. Suffice it to say that each of those cases was decided on its own facts, and because it was held there was good reason for the delay or for part of the delay, the position is not as presented by Mr Sussex that delay was immaterial to the exercise of discretion. Further, in a number of those cases, there was no limitation period in issue. 26. Mr Sussex submitted that the judge could have granted an anti-suit injunction upon the condition that no point would be taken on the expiry of the Limitation Period if arbitration proceedings are brought. This may be dealt with shortly. We were given to understand that the judge had asked Mr Sussex if the plaintiff would be prepared to give such an undertaking to the court and Mr Sussex informed the judge he had no instructions to do so. I do not think the judge could be criticised for not imposing a condition on an unwilling party. 27. The judge had found deliberate, inordinate and culpable delay on the part of the plaintiff, and the only motive was to wait for the Limitation Period to expire before applying for an anti-suit injunction so that the defendant would be left without a remedy in any available forum. In §63, the judge exercised his discretion to refuse relief given such delay coupled with the comity considerations. I do not think he has erred in law, or that he has ignored a relevant factor or taken into account an irrelevant factor, or that his conclusion was one he could not reasonably or sensibly have reached. The appeal must therefore be dismissed. Hon McWalters JA: 28. I agree with the reasons for judgment of Kwan JA. (Maria Yuen) Justice of Appeal (Susan Kwan) Justice of Appeal (Ian McWalters) Justice of Appeal Mr Charles Sussex SC and Mr Christopher Chain, instructed by Howse Williams Bowers, for the Plaintiff (Appellant) Mr Edward K S Chan SC and Mr Gary Lam Chin Ching, instructed by Zhong Lun Law Firm, for the Defendant (Respondent) [1] We were given to understand that an appeal from this decision was withdrawn by consent. [2] AES Ust-Kamenogorsk LLP v Ust-Kamenogorsk JSC [2013] 1 WLR 1889 [3] Transfield Shipping Inc v Chiping Xinfa Huayu Alumina Co Ltd [2009] EWHC 3629 (QB) Look up this case on Lawcite Noteup",
  "length": 36850,
  "headers_seen": [
    "Background",
    "The judgment below",
    "This appeal",
    "Discussion"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkca/2016/205",
  "query": "anti-suit injunction",
  "ts": "2025-10-16T10:47:00",
  "ok": true
}