{
  "title": "WISDOM GLORY INVESTMENT LTD V. ADWO MEDIA HOLDING LTD | [2022] HKCFI 1296 | HKLII",
  "court": null,
  "year": 2022,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2022] HKCFI 1296 WISDOM GLORY INVESTMENT LTD V. ADWO MEDIA HOLDING LTD Judgment Information Date 2 May, 2022 Action No. HCCT70/2020 Neutral Cit. [2022] HKCFI 1296 Download MS Word Judgment Reading Options Translation Toggle Highlight Appeal History HCCT70/2020 HCCT70A/2020 WISDOM GLORY INVESTMENT LTD v. ADWO MEDIA HOLDING LTD HCCT 70/2020 [2022] HKCFI 1296 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO 70 OF 2020 ______________________ IN THE MATTER of the Share Redemption Agreement entered into between the Applicant and the Respondent on 15 December 2015 (the “Share Redemption Agreement”) and IN THE MATTER of an Arbitration in respect of the Share Redemption Agreement (the “Arbitration”) and IN THE MATTER of an application to set aside the Final Award dated 13 July 2020 under section 81 of the Arbitration Ordinance ( Cap 609 ) and Order 73 of the Rules of the High Court ( Cap 4A ) ______________________ BETWEEN WISDOM GLORY INVESTMENT LIMITED Applicant and ADWO MEDIA HOLDING LIMITED Respondent ______________________ Before: Hon Anthony Chan J in Chambers Date of Hearing: 3 May 2022 Date of Decision: 3 May 2022 __________________ D E C I S I O N __________________ 1. This is AW’s application for leave to appeal against the Judgment of this court dated 26 January 2022 ( [2022] HKCFI 341 ). The nomenclature used in the Judgement is adopted herein. 2. The central issue in this case concerned the validity of Award 2 when it was contradictory to Award 1 in respect of key factual findings. The Awards were made by two Tribunals with a common member, and AW and W were parties to both arbitrations. 3. As I understand from the proposed Grounds of Appeal, AW is not contending that the contradiction was not unusual or acceptable. Rather, it argues that, eg, due to additional evidence which was not before Tribunal 1, the contradictory findings were justified. AW complains (Ground 1) that this court ought not to have taken a “high level” approach towards the many arguments advanced on its behalf to justify the contradictory findings of Tribunal 2. 4. There are two fundamental problems with the complaint. Firstly, there is binding authority on the supervisory role of the court and that the court is only concerned with the structural integrity of the arbitral proceedings (see Judgment, [29]-[30] and Soh Beng Tee & Co Pte Ltd v Fairmount Development Pte Ltd [2007] 3 SLR(R) 86, [65(f)]). 5. In Grand Pacific Holdings Ltd , allegations were made regarding the conduct of the arbitral proceedings as a consequence of which it was alleged that the respondent was unable to present its case, and the CA looked into the details of such allegations. I do not believe that it follows that the court is required to do so in every case. Indeed, Grand Pacific established no such principle. Much will depend on the issue(s) in the case. 6. Grand Pacific is clearly distinguishable from the present case. In this case, AW ran the same factual case of misrepresentations in both arbitrations, the outcome were diametrical and one of the arbitrators sat in both proceedings. Such facts were plain. It required no detailed examination to elicit the same. 7. Secondly, Tribunal 2 did not in any way explain why it came to contradictory findings. It was not for this court to look into the details and substitute its own view for that of the Tribunal or to second-guess why Tribunal 2 came to very different conclusions (see Judgment, [30]). I therefore fail to see the relevance of a close examination of the evidence before Tribunal 2. At the risk of stating the obvious, had the Tribunal given reason(s) for making different findings, it might be appropriate for the court to examine the material relevant to the reason(s). 8. I am unable see a valid criticism (Ground 1(5)) over the adoption of the Decision by this court when the issues were analysed by M Chan J with cogency and the conclusion reached by the learned Judge compelling, and this court agreed with it (Judgment, [26]). 9. It is unhelpful for AW to argue that M Chan J was only required to consider the merits “on a brief consideration”. Properly read, the Decision was arrived at after careful consideration of all the arguments. It was envisaged by the court that with the benefit of the view expressed in the Decision on the merits of W’s application to set aside Award 2, that application together with AW’s application for leave to enforce Award 2 might be disposed of by consent (see Decision, [66]-[67]). 10. It appears that Ground 2 is based on a misunderstanding of paras 37 and 40 of the Judgment. In those paragraphs, this court took the view that it was not for this court to second-guess why Tribunal 2 came to contradictory findings. Any explanation for the same should have come from the Tribunal. 11. The reliance by AW on Mr Tao’s duty of confidentiality (such that he was prevented from disclosing Award 1) (Grounds 2(2) and 3(4)) is unattractive as a matter of plain common sense because he was a member of both Tribunal 1 and Tribunal 2, and W and AW were parties to both proceedings. As a member of Tribunal 2, Mr Tao knew about the findings he recently made as a member of Tribunal 1. Further, the proposition that Mr Tao should maintain confidentiality over Award 1 which was clearly known to both W and AW is perplexing. 12. Furthermore, as a matter of law, the duty of confidentiality is not absolute. The issue was dealt with in para 54 of the Decision. 13. In respect of Ground 4(1), I fail to see a legitimate basis for this court to substitute its own view for that of Tribunal 2. Indeed, it would be contrary to Grand Pacific on the role of the court in a challenge over an arbitral award. 14. As for Ground 5, it relates to Ground 1 and 2. I do not believe that there are “novel points of law”. Rather, this case involved the application of established principles to the facts before the court. 15. As regards the allegation of concealed evidence which was not before Tribunal 1 (Ground 5(2)), the point may be a forceful one if that was the reason given by Tribunal 2 to depart from the findings in Award 1. In the absence of such a reason, the point is both speculative and involves substituting the court’s findings for that of the agreed forum. 16. For those Grounds which have not been specifically dealt with above, I have not found it necessary to do so because they add little to AW’s arguments and, with respect, are of little merits. 17. I bear in mind the well-established threshold for leave to appeal, including the higher threshold on an appeal against an exercise of discretion by the court, and I decline this application. There is no argument on the costs order sought by W. Accordingly, I order that the costs of this application be to W, to be taxed on indemnity basis if not agreed, with a certificate for 2 counsel. ( Anthony Chan ) Judge of the Court of First Instance High Court Mr Robert Whitehead SC and Mr David Fong, instructed by Gallant, for the Applicant Mr William Wong SC, Mr Adrian Lai and Mr Martin Lau, instructed by Wilkinson & Grist, for the Respondent Look up this case on Lawcite Noteup",
  "length": 7261,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2022/1296",
  "query": "set aside award",
  "ts": "2025-10-16T10:43:32",
  "ok": true
}