{
  "title": "CHOY BING WING V. HONG KONG INSTITUTE OF ENGINEERS | [2015] HKCFI 2173 | HKLII",
  "court": null,
  "year": 2016,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2015] HKCFI 2173 CHOY BING WING V. HONG KONG INSTITUTE OF ENGINEERS Judgment Information Date 26 Nov, 2015 Action No. HCA309/2015 Neutral Cit. [2015] HKCFI 2173 Download MS Word Judgment Reading Options Translation Toggle Highlight Appeal History HCA309/2015 HCA309B/2015 CHOY BING WING v. HONG KONG INSTITUTE OF ENGINEERS HCA 309/2015 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE ACTION NO 309 OF 2015 ____________ BETWEEN CHOY BING WING Plaintiff and HONG KONG INSTITUTE OF ENGINEERS Defendant ____________ Before: Hon Au-Yeung J in Chambers Date of Hearing: 18 November 2015 Date of Decision: 27 November 2015 ______________ D E C I S I O N ______________ 1. There are 2 summonses before the court: (1) The defendant’s application: (a) to strike-out the statement of claim and to dismiss the action; (b) alternatively to determine a question of law (“ the Question ”) under Order 14A, namely, “whether the references to a person being ‘convicted of a criminal offence’ in the Defendant’s Constitution and Disciplinary Regulations include the situation where a person was found guilty of criminal contempt of court”; and (2) The plaintiff’s application to strike-out the plaintiff’s strike-out summons. Background 2. The background facts are neither disputed nor disputable. 3. The plaintiff (“ Mr Choy ”) used to be a member of the defendant (“ HKIE ”). 4. Article 13(4)(d) of the Constitution of HKIE provides that if a member shall be found by the Board of Inquiry to have been guilty of “improper conduct”, the Council may, amongst others, order that his membership be suspended for any period. 5. “Improper conduct” is defined under Article 13(5)(c) to include “conviction by a competent tribunal of a criminal offence which in the opinion of the Council renders a member unfit to be a member”. 6. Under Article 13(4A) of the Constitution, an appeal against an order by the Council for improper conduct shall lie to an Appeal Committee and the decision of the Appeal Committee shall be final. 7. Mr Choy was committed twice for contempt of court in HCMP 4694/2003 and HCMP 1313/2010 (collectively “ the Contempt Proceedings ”). For that, he was sentenced to imprisonment for 6 months and 4 months respectively. [1] 8. On 3 October 2012, HKIE gave written notice of the hearing to be held before the Board of Inquiry on 9 November 2012 at 2:30 pm. 9. On 24 October 2012, the Plaintiff commenced HCA 1994/2012 against the President of HKIE for an injunction to prevent the holding of the inquiry hearing on 9 November 2012. 10. HCA 1994/2012 was struck out and dismissed. Mr Choy’s appeal therefrom was dismissed by Mimmie Chan J. His further appeal to the Court of Appeal was struck out for persistent and contumelious disobedience of the court’s directions. His application for leave to appeal to the Court of Final Appeal was likewise dismissed. 11. On 9 November 2012, in the absence of Mr Choy, the Board of Inquiry found Mr Choy to have been guilty of improper conduct by reason of the 2 committals for contempt. 12. On 17 January 2013, pursuant to the finding of the Board of Inquiry, the Council of HKIE ordered that Mr Choy’s membership with HKIE be suspended for 3 years with effect from 18 January 2013 to 17 January 2016 (“ the Suspension Order ”). 13. On 21 January 2013, Mr Choy served on HKIE a notice of appeal against the Suspension Order. An Appeal Committee has been appointed as a result. That appeal is pending and hence the Suspension Order is not yet in force. 14. On 5 February 2015, Mr Choy issued the present action against HKIE for a declaration that the Suspension Order was null and void. A preliminary question of recusal 15. At the outset, I have asked the parties whether they objected to my hearing this case because one of the findings of contempt relied on by HKIE was against me when I was Registrar of the High Court, although I bore no personal grudge against Mr Choy. Neither party sought my recusal. In actual fact, the issues at stake are on points of law and not on merits of the acts in contempt or the contempt procedure itself. I therefore proceeded to hear this case. Legal principles for striking out 16. The following principles are well established and have been well set out in the skeleton submission of Ms Lau, counsel for HKIE: (a) It is only in plain and obvious cases that the court should exercise its summary powers to strike out any pleading. The claim must be obviously unsustainable, the pleadings unarguably bad and it must be impossible, not just improbable, for the claim to succeed before the court will strike it out. (b) A reasonable cause of action means a cause of action with some chance of success when only the allegations in the pleadings are considered. So long as the statement of claim discloses some cause of action, or raises some question fit to be decided by a judge or jury, the mere fact that the case is weak is no ground for striking out. (c) A proceeding is frivolous when it is not capable of reasoned argument, is without foundation or cannot possibly succeed. A proceeding is vexatious when it is oppressive and/or lacks bona fides. (d) As regards “abuse of the court’s process”, the court must be used bona fide and properly and must not be abused. The court will prevent the improper use of it machinery and will, in a proper case, summarily prevent its machinery from being used as a means of vexation and oppression in the process of litigation. Hong Kong Civil Procedure 2016 , Vol. 1, §§18/19/4-18/19/10 Mr Choy’s pleaded case 17. Mr Choy seeks a declaration that the Suspension Order was null and void. The grounds for his claim can be summarized as follows: A. HKIE charged him twice for having been convicted of criminal offence under the Contempt Proceedings; B. HKIE violated his common law rights, as underpinned by Articles 39 and 87 of the Basic Law and Article 11(2) of the Hong Kong Bill of Rights Ordinance , Cap 383 (“BORO”), by failing to disclose his criminal records of convictions and sentences; C. HKIE made the Suspension Order on 17 January 2013, after a delay of over 65 days from the purported hearing date of 9 November 2012 in the absence of Mr Choy; D. HKIE violated Regulation 6.3 of the Disciplinary Regulations and the rule of natural justice that a man may not be a judge in his own cause; HKIE turned a blind eye to its cause of non-disclosure; and E. The decision of Mimmie Chan J in HCA 1994/2012 was wrong. 18. It will be useful to analyze the Question first as it forms the core dispute. After that, the answers to Mr Choy’s pleaded case will become obvious. Whether “conviction of a criminal offence” under the Constitution and Disciplinary Regulations includes a finding of criminal contempt of court 19. Mr Choy submits that the judgments in the Contempt Proceedings made “findings” that he was in contempt of court. The words “conviction” or “sentence” were not used. Fingerprints of his would have been taken before the trial: section 59 of the Police Force Ordinance , Cap 232 . Had he been convicted, there would have been a certificate of conviction. Not being a court of law, HKIE could not lay a criminal charge against him and suspend him for 3 years. There is no other avenue to sort out the Suspension Order. Only a court of law has that power under Article 83 of the Basic Law, so Mr Choy submits. 20. Mr Choy relies heavily on the dicta of Rimer J cited in Cobra Golf Inc and anor v Rata and others [1998] Ch 109 , 137C-F, wherein it is stated that contempt of court is not a criminal offence although the standard of proof is the criminal standard. 21. In the Cobra Golf case, the issue before Rimer J was whether there was a privilege against self-incrimination for civil contempt and whether civil contempt constituted the commission of a criminal offence (at pages 128E & 129E). 22. In the course of his judgment, Rimer J referred to 2 lines of authorities. The first line appears to have held that a proceeding for civil contempt of court was not for a criminal offence although the standard of proof was the criminal standard (at pages 128D to 142C). Mr Choy relies heavily on one case in this line of authorities, namely, Garvin v Domus Publising Ltd [1989] Ch 335 , 345, per Walton J (appearing at page 136C of the Cobra Golf case ). The second line of authorities held, some being obiter dicta, that proceedings for civil contempt was a common law misdemeanour and criminal in nature (at pages 142C to 155H). Included in the second line of authorities was a case relied on by Ms Lau, namely, Balogh v St Albans Crown Court [1975] 1 QB 73 , Lord Denning MR at 85H , Stephenson and Lawton LJJ at 87C & 91E. 23. Rimer J did not directly answer the question of whether or not civil contempt was a criminal offence. At page 156H-157A, he heldthat proceedings for civil contempt were for the “recovery of a penalty” in respect of which there was a privilege against self-incrimination. He relied on the second line of authorities. Implicitly, he did not accept the proposition that contempt of court was not a criminal offence. Accordingly, contrary to Mr Choy’s submission, the Cobra Golf case does not assist him. 24. In Hong Kong, it has been held that an intention and act to interfere with or impede the due administration of justice is criminal contempt. Criminal contempt is a common law criminal offence punishable by imprisonment. See Chiu Luen Public Light Bus Co Ltd v Persons Unlawfully Occupying or Remaining on the Public Highway & ors [2014] 6 HKC 298 at §§123 & 124, Au J. 25. In fact, Mr Choy himself has contended before the court in HCMP 4694/2003 that the 1 st contempt was “criminal” contempt. He challenged the court’s jurisdiction there, contending that he could only be tried in a criminal court upon indictment and Order 52 of the Rules of the High Court gave no jurisdiction in respect of criminal contempt: judgment of Hartmann and Suffiad JJ dated 12 December 2005, at §9. 26. Hartmann and Suffiad JJ agreed with Mr Choy that the contempt of which he stood accused was a criminal contempt, being conduct which interfered with the due administration of justice. A criminal contempt was a matter for the Secretary for Justice to raise, acting as the guardian of the public interest in ensuring the protection of the due administration of justice. Whilst proceedings in respect of criminal contempt have in the past been instituted by way of indictment, it was now the preferred practice to proceed by way of committal proceedings under Order 52 of the Rules of the High Court even for criminal contempt (§§ 10-11, 13-16). 27. Before Mimmie Chan J in HCA 1994/2012, Mr Choy took a contrary argument, namely, that contempt of court was not a criminal matter, that he had not been “sentenced” to imprisonment in a criminal manner, that a committal for contempt does not amount to a criminal conviction and there was no basis for the President of HKIE to initiate the disciplinary inquiry. That was rejected by the learned judge (at §§9-11 of her decision dated 12 August 2013). 28. Having regard to the above analyses, I am of the view, firstly , that contempt of court is a criminal offence. 29. Secondly , for contempt of court, a defendant does not have to be “charged” by the police but can be directly brought before the court. The court could on its own volition consider whether he was guilty of contempt in the face of the court. See eg Balogh v St Albans Crown Court . Alternatively, the defendant can be made the subject of contempt proceedings by the Secretary of Justice as a guardian of public interest: HCMP 4694/2003, 12 December 2005, at §10. 30. Accordingly, section 59 of the Police Force Ordinance , Cap 232 , concerning the power and duty of the police to take fingerprints of a suspect or person “charged” does not apply. 31. Thirdly, the word “convicted” or “conviction” simply means that a person charged has been found, or has pleaded guilty: Stroud’s Judicial Dictionary of Words and Phrases (8 th ed.) pp. 608 – 610, citing (amongst others) S (an infant) v Recorder of Manchester [1971] AC 481 at 489B-C, Lord Reid; R v Manchester Justices [1937] 2 KB 96 at 101 Humphreys J. 32. Fourthly , the conviction of contempt will be recorded and a subsequent court dealing with another conviction (whether of a similar or dissimilar offence) of that person should be informed about it: R v Newbury Justices ex parte Pont & ors (1983) 78 Cr App R 255 , at 262 per May LJ. 33. Applying the above principles, there can be no doubt that Mr Choy had been convicted twice of a criminal offence of contempt of court. The absence of the word “sentence” in the judgments in the Contempt Proceedings is irrelevant. It is undeniable that Mr Choy had been sentenced to imprisonment twice and he had served those sentences. 34. It is an abuse of the process of the court for Mr Choy to re-run the contradictory arguments before Hartmann and Suffiad JJ, and Mimmie Chan J to challenge HKIE’s current application. 35. At this hearing, Mr Choy relies heavily on another case of General Medical Council v Spackman [1943] AC 627 for the proposition that the court must distinguish between public law (criminal law) and private law (civil law). The HKIE is a statutory body for fact finding and is not a court of law. Under Article 83 of the Basic Law, it is a court of law that has power to issue the Suspension Order against him, so Mr Choy submits. 36. In the Spackman case, the Medical Council had power to direct the registrar to erase the name of a medical practitioner from the register if he was (i) convicted of felony or misdemeanor; or (ii) after due inquiry be judged by the General Council to have been guilty of “infamous conduct” in any professional respect. 37. Viscount Simon LC pointed out the significant distinction between the 2 situations. Under situation (i), the decision of the Council was properly based on the fact of the conviction and the practitioner could not go behind it and endeavour to show that he was innocent of the charge and should have been acquitted. In situation (ii), the decision of the Council, if adverse to the practitioner, must be arrived at after due inquiry. 38. The infamous conduct of the medical practitioner in question was a finding of adultery in a divorce suit and fell within situation (ii). The Council refused to hear evidence tendered by the medical practitioner with a view to showing that he was not guilty of the infamous conduct alleged and that the finding of the Divorce Court against him as co-respondent was wrong. The House of Lords held that the Council had not made “due inquiry”. (p 634-635 of the judgment) 39. To the extent that Mr Choy reminds the court to distinguish between public/criminal law and private/civil law, and that HKIE/Board of Inquiry is not a court of law, there is no reason to disagree with him. However, the Spackman case does not assist Mr Choy on whether or not a finding of contempt of court was a conviction. To the contrary, it assists HKIE in that, just like the Medical Council in Spackman, HKIE can rely on a court’s conviction to initiate an investigation against a member for “improper conduct”. 40. Spackman required the Medical Council to make due inquiry which included the hearing of evidence. In the present case, HKIE/Board of Inquiry had given opportunities for Mr Choy to appear and make representation. It was Mr Choy who opted not to attend the hearing. 41. Mr Choy relies also on a number of other authorities: (i) The Reasons for Decision of To J in the present case dated 29 September 2015. That decision concerns Mr Choy’s appeal against a Master’s decision on directions for disposal of the present summonses and, without disrespect, has no bearing on the issue before me. (ii) R v Palmer [1992] 1 WLR 568 , 572F where it was held that a court dealing with a person for criminal contempt has no power to make a probation order. It neither supports Mr Choy’s proposition (in his letter dated 19 December 2011) that contempt of court is not a criminal offence; nor his allegation that the President had perjured himself when stating that Mr Choy had been “convicted” of contempt. 42. Having regard to the above analyses, the reference to a person “being convicted of a criminal offence” in the Constitution includes the situation where a person is found guilty of contempt of court. 43. I now proceed to analyze Mr Choy’s pleaded case. Ground A – That HKIE charged Mr Choy twice for having been convicted of criminal offence 44. To put the position straight: it was not HKIE but the Secretary for Justice who applied for committal for contempt in the Contempt Proceedings. What HKIE did was to rely on (and justifiably so) the findings of the contempt in the Contempt Proceedings as the bases for initiating disciplinary investigation. Ground A is a plainly unarguable cause and there is no chance of Mr Choy succeeding in it. Ground B – HKIE violated Mr Choy’s common law rights, as underpinned by Articles 39 and 87 of the Basic Law and Article 11(2) of the Hong Kong Bill of Rights Cap 383 (“BORO”), by failing to disclose his criminal records of convictions and sentences. 45. Mr Choy has had no criminal convictions before any of the 2 findings of contempt. He was not charged by the police for contempt and the usual process of taking fingerprints of a suspect pursuant to the Police Force Ordinance was not gone through. 46. Whilst these were true, they were irrelevant. I repeat paragraphs 29-30 above. In fact, the police had purported to obtain the fingerprints of Mr Choy whilst he was detained. It was objected to by Mr Choy and, for reasons that this court need not investigate, the police had not pursued it. 47. HKIE does not have access to Mr Choy’s criminal record. In any case, I can hardly see how failure to disclose someone’s conviction record (even if it existed) can prevent the findings of contempt from being a conviction, or the Board of Inquiry from proceeding with the hearing. 48. Mr Choy claims that his common law right is underpinned by various legislative provisions: (i) Article 39 of the Basic Law, which provides for application of ICCPR and other conventions to Hong Kong; (ii) Article 87 of the Basic Law, which provides for the right of an arrested person to a fair trial and presumption of innocence until convicted; and (iii) Article 11(2) of BORO, which provides for minimum guarantee for a person charged with a criminal offence. 49. These provisions are simply irrelevant for the reasons given under Ground B. 50. Ground B is frivolous or vexatious. Ground C – HKIE made the Suspension Order on 17 January 2013, after a delay of over 65 days from the purported hearing date of 9 November 2012 in the absence of Mr Choy 51. The hearing of 9 November 2012 was to decide the question of whether or not Mr Choy was guilty of improper conduct. The Board of Inquiry could not decide the penalty. It was the job of the Council. The Constitution and the Regulations did not prescribe the time when the Council should decide the penalty after the Board of Inquiry had made its finding and Mr Choy did not point to any relevant provision. The complaint under Ground C is in lack of a reasonable cause, and is frivolous or vexatious. Ground D – HKIE violated Regulation 6.3 of the Disciplinary Regulations and the rule of natural justice that a man may not be a judge in his own cause, HKIE turned a blind eye to its cause of non-disclosure 52. Under Regulation 6.3(b) of the Disciplinary Regulations of HKIE, the Board of Inquiry may at its discretion suspend the conduct of the investigation or inquiry if there are “pending legal proceedings in respect of the Alleged Offender on the same subject matter that initiated or resulted in his or its investigation or inquiry and if in his or its view, the pending legal proceedings may affect such investigation or inquiry or its outcome”. 53. The subject matter that initiated or resulted in the investigation of Mr Choy was the findings of contempt. The Contempt Proceedings had been concluded and were not pending. On the other hand, HCA 1994/2012 was to stop the President from exercising his powers in investigating Mr Choy. Regulation 6.3 was simply not engaged. In any case, Regulation 6.3 merely confers on the Board of Inquiry a discretion, not obligation, to suspend its inquiry. 54. There was no breach of natural justice. The disciplinary hearing was heard by a Board of Inquiry independent from the Investigation Commission. Mr Choy did not complain about the constitution of each of these bodies. Their members were not judging their own cause. The issue of non-disclosure of Mr Choy’s conviction record was unsustainable for reasons given under Ground B. 55. Further, HCA 1994/2012 had been struck out. There cannot be any complaint that the Board of Inquiry had proceeded improperly on 9 November 2012 in the face of that High Court action. 56. Ground D is frivolous or vexatious. Ground E – The decision of Mimmie Chan J in HCA 1994/2012 was wrong 57. The proper avenue to challenge the decision of Mimmie Chan J was closed. It is simply frivolous or vexatious and an abuse of court process to challenge it in the present action. Abuse of process 58. Under Article 13(4A) of the Constitution, an appeal against an order by the Council for improper conduct shall lie to an Appeal Committee. Mr Choy has resorted to that channel already. This is a clear abuse of the process of the court for him to commence the present action in parallel. This action ought to be struck out. 59. In summary, there cannot be any doubt that Mr Choy had been convicted of a criminal offence and hence was guilty of “improper conduct” within the meaning of Article 13(4)(d) and 5(c). Ground A is unarguably bad and doomed to fail. Grounds B to E are frivolous or vexatious and an abuse of the process of the court. Ground C also lacks a reasonable cause of action. It is plain and obvious that the statement of claim ought to be struck out and the action dismissed. HKIE’s application under Order 14A 60. Under Order 14A of the Rules of the High Court , the Court may upon the application of a party or of its own motion determine any question of law or construction of any document arising in any cause or matter where it appears to the Court that (a) such question is suitable for determination without a full trial of the action; and (b) such determination will finally determine (subject only to any possible appeal) the entire cause or matter or any claim or issue therein. 61. The Question clearly satisfies the above two requirements. I repeat paragraphs 19-42 above and answer the Question with a “ Yes ”. Mr Choy’s summons to strike out HKIE’s summons 62. In paragraph 1(ii)(a) of his summons, Mr Choy refers to the Cobra Golf case at page 136 and R v Palmer at page 572 in contending that HKIE has no ground to issue its summons as contempt of court is not a criminal offence. Given that the court now accepts the submission of HKIE, Mr Choy’s contention is plainly unarguable. 63. In paragraph 1(ii)(b) of Mr Choy’s Summons, Mr Choy said that he had made known the “plot (presumably of HKIE’s) in its bundle dispatched to the HKIE of HKSAR government in its attempt [to] make [Mr Choy] a convict in the criminal record under Cap 232 on 8/12/2005 by sending a police to gain entry into Lai Chi Kok Reception Centre by impersonating Solicitor Wong to procure the Plaintiff’s finger prints as a convict. It is the prosecution duty of [HKIE] to disclose the criminal record of [Mr Choy] under Cap 232 .” 64. I repeat the analyses under Ground B. 65. The grounds for striking out HKIE’s summons are unarguable. Conclusion 66. I order that: (1) In respect of HKIE’s summons, (a) The plaintiff’s claim be struck out and the action be dismissed on the grounds that it discloses no reasonable cause of action, is frivolous or vexatious and is an abuse of the process of the court; (b) The Question is determined by answering it with “yes”. (2) Mr Choy’s summons be dismissed. 67. Mr Choy has wholly failed in both summonses. I make an order, nisi , that costs should follow the event and be to HKIE. The costs are summarily assessed and allowed, again on nisi basis, in the sum of $150,000. 68. I thank Ms Lau for her assistance. (Queeny Au-Yeung) Judge of the Court of First Instance High Court The plaintiff appeared in person Ms Zabrina Lau, instructed by Wilkinson & Grist, for the defendant [1] See the judgments in HCMP 4694/2003, of Hartmann and Suffiad JJ dated 25 October 2005 at §93 and 7 December 2005, at §29; and the judgments in HCMP 1313/2010 of McMahon and Macrae JJ dated 7 January 2011, at §41 and 11 February 2011, at §18. Look up this case on Lawcite Noteup",
  "length": 24832,
  "headers_seen": [
    "Background",
    "A preliminary question of recusal",
    "Legal principles for striking out",
    "Hong Kong Civil Procedure 2016 , Vol. 1, §§18/19/4-18/19/10",
    "Mr Choy’s pleaded case",
    "Whether “conviction of a criminal offence” under the Constitution and Disciplinary Regulations includes a finding of criminal contempt of court",
    "Ground A – That HKIE charged Mr Choy twice for having been convicted of criminal offence",
    "Ground C – HKIE made the Suspension Order on 17 January 2013, after a delay of over 65 days from the purported hearing date of 9 November 2012 in the absence of Mr Choy"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2015/2173",
  "query": "contempt of court",
  "ts": "2025-10-16T12:11:35",
  "ok": true
}