{
  "title": "宁波梅山保税港区和光泰润二号股权投资中心(有限合伙) V. 北京微影时代科技有限公司 | [2024] HKCFI 2723 | HKLII",
  "court": null,
  "year": 2024,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2024] HKCFI 2723 宁波梅山保税港区和光泰润二号股权投资中心(有限合伙) V. 北京微影时代科技有限公司 Judgment Information Date 13 Oct, 2024 Action No. HCCT61/2022 Neutral Cit. [2024] HKCFI 2723 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCCT61/2022 HCCT61/2022 宁波梅山保税港区和光泰润二号股权投资中心(有限合伙) v. 北京微影时代科技有限公司 HCCT 61/2022 [2024] HKCFI 2723 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO. 61 OF 2022 ______________________ IN THE MATTER of the enforcement of an Arbitral Award of the CIETAC made on 19 th May 2022 and IN THE MATTER of sections 84 and 92 of the Arbitration Ordinance , Cap. 609 and Order 73 , rule 10 of the Rules of the High Court , Cap. 4A ______________________ BETWEEN 宁波梅山保税港区和光泰润二号股权投资中心(有限合伙) Applicant and 北京微影时代科技有限公司 1 st Respondent Weying Co. Limited (香港微影時代有限公司) 2 nd Respondent (Discontinued) Weying (BVI) Limited 3 rd Respondent (Discontinued) ____________________ Before: Hon Anthony Chan J in Chambers Date of Hearing: 29 September 2024 Date of Decision: 14 October 2024 ________________ DECISION ________________ 1. This is the hearing of the 1 st Respondent’s (“R1”) Summons filed on 30 October 2023 (“Summons”) by which it seeks, inter alia , time extension to apply to set aside the Enforcement Order granted on 29 July 2022 (“Enforcement Order”) in respect of an arbitral award of China International Economic and Trade Arbitration Commission (“CIETAC”) dated 19 May 2022 (“Award”). 2. There were 4 respondents in the arbitration. R1 was the 4 th respondent and the Applicant (“A”) was the applicant in the arbitration. Issues 3. There are 3 grounds in support of this application : (1) Material Non-Disclosure (“MND”) Ground: The Enforcement Order was obtained by A on an ex parte basis on 29 July 2022. R1 contends that the Enforcement Order should be set aside by reason of A’s failure to make full and frank disclosure to the Court in connection with its ex parte application by failing to inform the Court that (a) R1 had commenced an application with the Mainland Supervisory Court to set aside the Award and (b) the Conditions Precedent to R1’s share redemption obligation under the Award was not satisfied; (2) Not Yet Binding Ground: The Award is not yet binding as the Condition Precedent in relation to R1’s share redemption obligation under the Shareholders’ Agreement [1] has not been fulfilled. It follows that the enforcement of the Award, which has not yet become binding, should be refused under s 95 (2)(f)(i) of the Arbitration Ordinance , Cap 609 (“Ordinance”); (3) Illegality Ground: The Award, which requires R1 to specifically perform the share repurchase/redemption obligation under the Shareholders’ Agreement, is unenforceable because the performance is contrary to public policy, illegal and gives rise to a matter which is not capable of settlement by arbitration. In particular, the performance of such share redemption obligation is contrary to Mainland and Hong Kong Laws, including the Companies Ordinance , Cap 622 . Accordingly, enforcement should be refused under s 95(3)(a)-(b) of the Ordinance. 4. In addition, A contends that no extension of time should be granted to R1 in light of its inordinate and unexplained delay in making the set aside application. Background 5. The background facts are largely uncontroversial. In or around April 2016, a number of parties, including A and R1, entered into an agreement for, inter alia , investment in R1. The terms of their agreement were set out in a Shareholders’ Agreement (北京微影時代科技有限公司之股東協議) and a Capital Injection Agreement (北京微影時代科技有限公司之增資協議). 6. Pursuant to those Agreements, which were executed on 22 December 2016, A was to provide capital to R1 in the sum of RMB 200,000,000, and in return it would receive shares in R1. 7. Clause 5.1 of the Shareholders’ Agreement also contained a “redemption right” which required, inter alia , R1 to cause itself to be listed on a reputable stock exchange within 4 years of the date of registration of A’s capital injection. If R1 failed to cause itself to be listed within the timeframe, R1 would be required to buy-back its shares from A. 8. Clause 5.1(3) of Shareholders’ Agreement provided that: “if a Shareholder with Redemption Right exercises the redemption right, it shall send a written notice to [R1] and/or [its managing shareholders] (“Notice of Sale”), requiring [R1] and/or [its managing shareholders] to purchase at one time all or part of the [shares of R1] then held by the Shareholder with Redemption Right at the redemption price. [R1] and/or [its managing shareholders] shall, within 30 days after the Notice of Sale is issued by the Shareholder with Redemption Right, unconditionally pay the corresponding redemption price in one lump sum to the bank account of the Shareholder with Redemption Right set forth in the Notice of Sale”. 9. There is no dispute that in or about April 2016, in accordance with the Capital Injection Agreement, A made the relevant capital injection into R1. The capital injection was registered on 26 December 2016. 10. Disputes ensued after R1 and its managing shareholders failed to make the required payment despite A’s Notices of Sale under clause 5.1(3) which was delivered to R1 in December 2020. In those circumstances, the CIETAC arbitration was commenced by A in around early 2021. 11. The Award was rendered on 19 May 2022 in favour of A. On a date before 1 August 2022, R1 applied to the No 4 Intermediate People’s Court in Beijing (“Beijing Court”) to set aside the Award (“1 st Application”). The 1 st Application was formally accepted (“立案”) by the Beijing Court on 1 August 2022. A’s evidence that it was only notified of the 1 st Application on 4 August 2022 is not challenged. 12. On 29 July 2022, A applied on an ex parte basis for and obtained the Enforcement Order before this Court. 13. A Charging Order Nisi based on the Enforcement Order was granted on 6 April 2023 in favour of A against 1 ordinary share of the 2 nd Respondent (“R2”) held by R1. The parties have agreed that the Charging Order Absolute will follow the result of the Summons. Delay 14. It was held in KB v S & Ors [2016] 2 HKC 325 at [20] that : “… Under an arbitration agreement, the parties agreed to refer their disputes to arbitration, and further agreed that the arbitral award should be final and binding upon them. Once an award is made, the parties are entitled to expect the award to be final, and binding, and if any permissible recourse is to be made to the court, it should be made promptly, so that any challenge to the award can be clarified and disposed of quickly, and parties know without unnecessary delay where they stand in relation to the award, and its recognition and enforcement. The aim of O 73 rr 5 and 10, and their provisions setting out the timetable and the summonses and affidavits in support to be filed, is to achieve this early resolution of the status of the award.” 15. In this case, the Enforcement Order was served on R1 on 14 October 2022 via the Mainland Judiciary. Pursuant to para 2 of the Enforcement Order, leave was granted to A to serve the Order on R1 out of jurisdiction at a Beijing address. Para 3 of the Order provided that within 14 days after the service of the Order, R1 might apply to set it aside. In the premises, the time for R1 to apply to set aside the Enforcement Order expired on 28 October 2022. 16. By a letter dated 28 October 2022 from R1’s solicitors (“28.10.22 Letter”), it was said that R1 had taken time to review the Enforcement Order and had sought Hong Kong legal advice. It was indicated that R1 intended to apply to set aside the Enforcement Order. On 16 January 2023, A’s solicitors wrote to those of R1 noting that despite the expression of intention to set aside the Enforcement Order, no paper had been served on A, and that A intended to take out enforcement actions against R1. 17. Eventually, the Summons was issued on 30 October 2023, 1 year and 2 days after the applicable deadline. I agree with Mr Dan Leung, who appeared for A, that on any view a delay of over a year is significant. 18. As for the reasons for delay advanced by R1, it was said that R1 was labouring under the mistaken advice of its Mainland lawyers that by taking out Mainland setting aside proceedings (which it did), the enforcement of the Enforcement Order would be stayed. It was suggested that the COVID pandemic also had an adverse effect because the management of R1 was homebound. 19. I am unable to accept any of these reasons. The 28.10.22 Letter demonstrated that R1 was able to instruct solicitors and obtain Hong Kong legal advice not later than 14 days after receiving the Enforcement Order. Its intention to set aside the Enforcement Order was stated. Unless there is a proper explanation for the delay in making the set aside application, the inescapable inference is that R1 had made a deliberate choice not to pursue such application until 30 October 2023. Possibly, it was hoping that the set aside application it made in the Mainland and its resistance to the Mainland enforcement actions taken by A might prevail. 20. R1 had made two applications before the Mainland Supervisory Court to set aside the Award. The 1 st Application was dismissed on 29 September 2022, before the Enforcement Order was served on R1. The second one was not made until 22 November 2022 (it was dismissed on 9 February 2023). Hence, there was no Mainland set aside application on foot which could have, according to the alleged erroneous advice, acted as a stay when the Enforcement Order was served on R1 on 14 October 2022. There is considerable force in Mr D Leung’s submission that the alleged erroneous advice is an attempt to mislead the Court. 21. In the premises, apart from the inordinate delay, R1 had tried to mislead the Court on the reasons for delay. I am inclined to the view that such reprehensible behaviour would justify a rejection of this application. It would be wrong for the Court to countenance such behaviour. Therefore, for the reason of delay alone, this application must be dismissed. 22. In case I were wrong, I shall deal with the merits of the 3 grounds succinctly to see if they may justify this application. MND 23. It is R1’s case that by the time the application for the Enforcement Order was heard on 29 July 2022, it had taken out the 1 st Application, and A had failed to make full and frank disclosure to the Hong Kong Court about the same. There is, however, no evidence from R1 as to when the 1 st Application was made or why it had not been able to provide such evidence in support of this application. 24. In any case, given the unchallenged evidence on when A was informed of the 1 st Application, this is not in truth a point of MND but whether A should have gone back to the Court to inform it of the change of circumstances, ie, the 1 st Application had been made after the Enforcement Order was granted. Quite fairly, Mr D Leung did not seek to argue that there was no such duty. 25. However, the 1 st Application was duly dismissed (before the Enforcement Order was served on R1) and there is no real suggestion of any prejudice having been suffered by R1 due to the failure of A to inform the Court of the change of circumstances. Indeed, by the time the Enforcement Order was served on R1, there was no setting aside application on foot. 26. I have no reason to believe that the failure on A’s part was anything other than inadvertence. I see no sufficient reason to discharge the Enforcement Order. 27. As regards the alleged Condition Precedent, its relevance concerns whether the Award was final and binding, which I shall deal with under the 2 nd ground. Not yet binding 28. The grounds for refusal of enforcement of a Mainland award are exhaustively listed under s 95 of the Ordinance. The fact that an award has yet to become binding on the parties is one of the grounds of refusal of enforcement under s 95(2)(f)(i) of the Ordinance. 29. Mr D Leung had referred the Court to Societe Nationale D’operations Petrolieres De La Cote D’ivoire-Holding v Keen Lloyd Resources Ltd [2004] 3 HKC 452 , [6], for the proposition that an award is binding if it is not open to appeal on the merits. Although this case was on the enforcement of a Convention award pursuant to the old Arbitration Ordinance , Cap 341 , I see no reason why the Ordinance should be construed differently. No such suggestion was made by Mr A Leung, who appeared for R1 with Mr Pang. 30. There is no viable suggestion that the Award is open to appeal on the merits. I therefore agree with Mr D Leung that this is the end of the matter for this ground. 31. For completeness, first, I also agree with Mr D Leung that in truth R1’s case about the difficulty or impossibility in carrying out a reduction of capital so as to allow the repurchase of A’s shares is an argument of impossibility of performance (not whether the Award is binding). Such argument is not relevant on enforcement of award. In Xiamen Xinjingdi Group Ltd v Eton Properties Ltd [2009] 4 HKLRD 353 , [28]-[29] : “28. In considering whether or not to refuse the enforcement of the award, the court does not look into the merits or at the underlying transaction. Its role is confined to determining whether or not grounds exist for refusing to enforce the award because it would be contrary to public policy. As the Judge recognized, the court’s role should be as ‘mechanistic as possible’. 29. As regards public policy, the only ground the appellants rely on as justifying a refusal to enforce the award is impossibility of performance. It was said that it is now impossible to deliver the land and, further, because of the restructuring, the shares can no longer be transferred. Since the conversion of an award into a judgment of the court does not involve going into the merits, it is difficult to see how impossibility of performance is relevant at the registration stage. No authority has been cited for the proposition that impossibility of performance is sufficient reason to justify a refusal to enforce an award under public policy grounds.” 32. Second, on 25 September 2023, R1 brought another arbitral proceedings before CIETA for, inter alia , a confirmation that if it needed to perform the repurchase obligation under the Shareholders’ Agreement, it should treat the completion of capital reduction in accordance with the law as a precondition for performance. On 4 July 2024, the tribunal issue an award rejecting all of R1’s claims. 33. It is fair to say that R1 had taken out multiple proceedings in the Mainland to set aside the Award and to resist enforcement of the same. None of them was successful, and A had been successful in various enforcement proceedings against R1 in the Mainland. 34. In the premises, this ground is rejected. Illegality / public policy 35. First, the relevant part of the Award was as follows : “The Respondents shall jointly bear the responsibility for the equity purchase and shall pay to [A] the principle of RMB 200,000,000 for the repurchase and the interest calculated at …”. 36. Second, the alleged Condition Precedent arose from the following observation of the Tribunal : “The arbitral tribunal also noted that the Respondents claimed that it is in violation of the relevant provisions of the Company Law for the Applicant to require them to undertake the equity repurchase obligation pursuant to the valuation adjustment mechanism. The arbitral tribunal held that the valuation adjustment mechanism reflects the autonomy of will of the parties in commercial activities, rather than forcing the Company to violate the capital maintenance principle stipulated in the Company Law in order to fulfill its repurchase obligation. As for how the Company performs its obligations for valuation adjustment, it belongs to the internal affairs of the Company and has nothing to do with the legitimacy of the valuation adjustment mechanism. In particular, if it is not impossible for the Company to perform the equity repurchase obligation, the Company’s acquisition of the equity in accordance with legal procedures does not violate the mandatory provisions of the Company Law, provided that it does not violate the capital maintenance principle and does not harm the interests of creditors. At the same time, the arbitral tribunal also think that the Company should undertake the repurchase obligation after the capital reduction and other relevant procedures are performed in accordance with the Company Law.” 37. Third, I do not believe that the repurchase can only be done after a capital reduction by R1. For instance, R1 can find a buyer for A’s shares and the other shareholders of R1 may purchase A’s shares. Indeed, A had been taking enforcement actions in the Mainland against the assets of R1. In the worst case, R1 may have to be wound-up if the responsibility for the repurchase is not met. I should also mention that R1’s evidence on the alleged difficulty in capital reduction is not entirely satisfactory, eg, there is evidence from only 1 shareholder on the opposition to capital reduction. 38. In the premises, I am unable to accept that the performance of R1’s obligations under the Award is against Mainland law, especially in light of the fact that the Award had been upheld by the Mainland Court, the Mainland Court had granted enforcement relief in favour of A and R1 had failed in its arbitration (see para 32 above). 39. Further, it is trite that where public policy is relied upon as a ground to resist enforcement of an award, it is the domestic public policy of the court of enforcement (in this case, Hong Kong) which is relevant: Song Lihua v Lee Chee Hon (No 2) [2023] 5 HKLRD 488 . In so far as Hong Kong companies law is concerned, it has no application to R1, which is a Mainland company. 40. For these reasons, this ground is also rejected. Disposition 41. The Summons is dismissed with costs to A on indemnity basis, to be taxed if not agreed. Pursuant to para 13 above, I make a Charging Order Absolute. 42. I am grateful for the assistance of counsel. ( Anthony Chan ) Judge of the Court of First Instance High Court Mr Dan Leung, instructed by Peter Chen Law Office, for the Applicant Mr Adrian Leung and Mr Ronald Pang, instructed by Grandall Zimmern Law Firm, for the 1 st Respondent [1] See para 5 below. Look up this case on Lawcite Noteup",
  "length": 18493,
  "headers_seen": [
    "Issues",
    "Background",
    "Delay",
    "MND",
    "Not yet binding",
    "Illegality / public policy",
    "Disposition"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2024/2723",
  "query": "enforcement of award",
  "ts": "2025-10-17T10:41:57",
  "ok": true
}