{
  "title": "EMPLOYER V. CONSULTANT | [2022] HKCFI 887 | HKLII",
  "court": null,
  "year": 2022,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2022] HKCFI 887 EMPLOYER V. CONSULTANT Judgment Information Date 28 Mar, 2022 Action No. HCCT39/2021 Neutral Cit. [2022] HKCFI 887 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCCT39/2021 HCCT39/2021 EMPLOYER v. CONSULTANT HCCT 39/2021 [2022] HKCFI 887 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO 39 OF 2021 ____________________ IN THE MATTER of Section 2 of Schedule 2 of the Arbitration Ordinance , Cap 609 and IN THE MATTER of Arbitrations ____________________ BETWEEN Employer Plaintiff (Claimant in Arbitration) and Consultant ( “the 1 st Arbitration” ) 1 st Defendant (Respondent in Arbitration) AND Employer Plaintiff (Claimant in Arbitration) and Contractor A 2 nd Defendant (1 st Respondent in Arbitration) Contractor B 3 rd Defendant (2 nd Respondent in Arbitration) Contractor C 4 th Defendant (3 rd Respondent in Arbitration) Contractor D ( “the 2 nd Arbitration” ) 5 th Defendant (4 th Respondent in Arbitration) AND Contractor A 2 nd Defendant and Subcontractor ( “the 3 rd Arbitration” ) 6 th Defendant (Respondent in Arbitration) ____________________ Before: Hon Mimmie Chan J in Chambers Date of Hearing: 19 November 2021 Date of Decision: 29 March 2022 _____________ D E C I S I O N _____________ 1. The Plaintiff (“ Employer ”) is the employer, the 1 st Defendant (“ Consultant ”) is the consultant, the 2 nd to 5 th Defendants (“ Contractors ”) are the contractors and the 6 th Defendant (“ Subcontractor ”) is the sub-contractor under a project (“ Project ”) for the construction of the Bridge . 2. The Employer and the Consultant entered into a consultancy agreement (“ Agreement ”) on 28 March 2002, whereby the Consultant agreed to render consultancy, design, supervision and other services for the Project. The 3 rd to 5 th Defendants were parties to a joint venture in the name of the 2 nd Defendant, responsible for the execution of construction works in relation to the Bridge, under a main contract dated 25 August 2003 made with the Employer (“ Contract ”). The Subcontractor was appointed as sub-contractor for the works, under a sub-contract dated 24 November 2004 made with the Contractors. 3. The Bridge was substantially completed on about 25 December 2005. On 15 February 2019, defects were discovered. An external pre-stressing tendon of the Bridge was found to have ruptured (the “ T3 Tendon ”). Emergency replacement and disruptions followed. According to a report dated 18 June 2019 prepared by a team of experts (“ Investigation Report ”), there were blockages of an air release during grouting of the T3 Tendon, leading to the formation of air pockets or voids within the T3 Tendon and resulting in corrosion of the steel strands/wires which should have been properly protected by grouting within the T3 Tendon. More comprehensive investigation and reviews of the other tendons of the Bridge took place after the production of the Investigation Report, and widespread voids, corrosion and defects were discovered in other tendons of the Bridge. As a result, extensive protective, preservative and remedial works had to be carried out, which included the replacement of over 70 tendons. 4. The disputes concerning the defects found were submitted to arbitration pursuant to the arbitration clauses contained respectively in the Agreement between the Employer and the Consultant, the Contract between the Employer and the Contractors, and the Subcontract between the Contractors and the Subcontractor. By agreement of the parties, Mr T was appointed as the sole arbitrator in all the 3 arbitrations. The arbitration between the Employer and the Contractors under the Contract (“ 2 nd Arbitration ”) has by consent been consolidated with the arbitration between the Contractors and the Subcontractor (“ 3 rd Arbitration ”). The 2 nd Arbitration and the 3 rd Arbitration are referred to collectively as “ Consolidated Arbitration ” . 5. In these proceedings, the Employer seeks the consolidation of the arbitration between the Employer and the Consultant under the Agreement (“ 1 st Arbitration ”) with the Consolidated Arbitration. The application is made under section 2 of Schedule 2 (“ Schedule ”) of the Arbitration Ordinance Cap 609 (“ Ordinance ”), on the ground that there are common questions of law and fact in the arbitrations, that the rights to relief claimed are in respect of or arise out of the same transaction or series of transactions, and that it is desirable to make an order for consolidation. The Contractors and the Subcontractor agree to the consolidation, but the Consultant opposes the application. 6. The issue in dispute between the Employer and the Consultant is whether section 2 (1) of the Schedule applies to the Agreement. If the Schedule does not apply, there is no basis for the application to consolidate. 7. The Agreement, Contract and Subcontract were all made before the commencement of the Ordinance in 2011. 8. The relevant arbitration clause in the Agreement is clause 44 of the General Conditions of Employment (“ Clause 44 ”), which provides for arbitration of any dispute or difference of any kind which shall arise between the Employer and the Consultant in connection with or arising out of the Agreement, to be in accordance with the Arbitration Ordinance or any statutory modification thereof for the time being in force, and that the Hong Kong International Arbitration Centre Domestic Arbitration Rules shall apply to any arbitration instituted in accordance with the clause, unless the parties agree to the contrary. 9. The common ground between the parties is that: (1) the 1 st Arbitration and the Consolidated Arbitration are now governed by the Ordinance; (2) section 2 of the Schedule applies to the Consolidated Arbitration; and (3) at the time when the Agreement was made in 2002, the applicable arbitration rules referred to in Clause 44 were the 1993 HKIAC Domestic Arbitration Rules (“ 1993 Rules ”). 10. Section 100 of the Ordinance states as follows: “All the provisions in Schedule 2 apply, subject to section 102, to- (a) an arbitration agreement entered into before the commencement of this Ordinance which has provided that arbitration under the agreement is a domestic arbitration ; or (b) an arbitration agreement entered into at any time within a period of 6 years after the commencement of this Ordinance which provides that arbitration under the agreement is a domestic arbitration.” 11. The key issue for determination by the Court is whether Clause 44 of the Agreement provided that the 1 st Arbitration under the Agreement is a domestic arbitration. 12. There is no serious dispute as to the intention or purpose of section 100 of the Ordinance. The Ordinance which came into effect in 2011 introduced a unitary regime for arbitration agreements and arbitrations in Hong Kong, and removed the distinction between domestic and international arbitration agreements made in the Arbitration Ordinance Cap 341 (“ Cap 341 ”). Parties were given the option under the Ordinance to agree and accept the “opt-in provisions” contained in the Schedule, which automatically apply in the cases provided for in section 100. When the Ordinance was introduced, the Working Group had noted that section 100 was to address the concern raised by the construction industry, that the term “domestic arbitration” was a common feature of standard forms of construction contracts used in Hong Kong, and that such users may continue to employ the term “domestic arbitration” in contracts before and for some time after the commencement of the Ordinance. A six-year transitional period was accordingly provided for in section 100, to allow time to the construction industry to make the necessary preparations for the unified arbitration regime. After the transitional period, parties who wish to utilize the domestic arbitration regime will be required to expressly opt in pursuant to section 99 of the Ordinance, and to adopt the Schedule in whole or in part. 13. In this case, Counsel for the Employer and Counsel for the Subcontractor have both highlighted the distinction between section 99 and section 100 of the Ordinance. Whereas section 100 (and the wholesale application of the Schedule) refers to the requirement of an arbitration agreement which “has provided” or “provides” that the arbitration under the agreement is a domestic arbitration, section 99 employs the words “provide expressly”, and section 100 is silent as to whether the provision has to be “express”. Section 99 of the Ordinance states: “ An arbitration agreement may provide expressly that any or all of the provisions (of the Schedule) are to apply…” 14. I agree that this is a valid distinction. By omitting the use of “expressly”, section 100 does not exclude an implied provision in the arbitration agreement, and the effect of such implied provision. 15. On behalf of the Consultant, Counsel argued that section 100 should not be interpreted to include “implication”, as it goes against the natural and ordinary meaning of the words in the section and the legislative intent behind section 100. 16. I do not agree that by its natural and ordinary meaning, used in the context of and with reference to a contract or agreement, “provide” cannot include, or must exclude, an implied provision or term. A contract can provide for a right, a matter, an event, or result, either expressly or by implication. 17. If the legislative intent is to permit the construction industry to retain the use and any benefit of the domestic arbitration regime, when they had agreed to use a common standard form of contract which refers to “domestic arbitrations”, with the intention to follow and adopt the domestic arbitration regime that brings about, then it is not against such legislative intent to construe section 100 to extend and apply to an agreement which makes implied provision for domestic arbitrations. 18. The decisions in A & ors v D [2017] 1 HKLRD 779 and Buda Pipe Rehab Eng Co Limited v CPC Construction Hong Kong Limited [2019] HKCFI 503 do not cover the current situation. 19. In A v D , this Court held that it cannot be said that an arbitration agreement will by implication provide for domestic arbitration, or be intended by the parties to be a domestic arbitration agreement, simply because or by virtue of the fact that the parties are Hong Kong residents and have a place of business in Hong Kong. The Court did not consider whether an agreement can provide for domestic arbitration by implication. What was argued in A v D was that the absence of a requirement for express provision in section 100 meant that so long as an arbitration agreement meets the test for a domestic arbitration agreement under Cap 341 , the Schedule would automatically apply, and that test was met because the parties in the case were Hong Kong residents with places of business in Hong Kong. That suggestion was dismissed by the Court. It was not claimed, in A v D , that there was any implied provision in the arbitration agreement that the arbitration was a domestic arbitration. 20. In Buda Pipe , the Court construed an arbitration clause and held that it did not amount to a provision that the arbitration is a domestic arbitration for the purposes of section 100. Again, there was no determination of whether or not section 100 permits a provision by implication. The clause in question simply provides for arbitration of disputes “in accordance with Cap 341 ”, and since Cap 341 permits domestic as well as international arbitration, the clause obviously cannot amount to a provision that the arbitration is a domestic arbitration as required under section 100. 21. The decision in SOL International Ltd v Guangzhou Dong Jun Real Estate Interest Co Ltd [1998] 2 HKLRD 637 does not assist this case. SOL concerned the question of whether the parties had “agreed in writing” within the terms of section 2M of Cap 341 . 22. In my judgment, the “provision” in section 100 may be by implication, and be one implied in the agreement. 23. The second issue for determination in this case is therefore whether Clause 44 in the Agreement provides for arbitration to be a domestic arbitration, expressly, or by implication. 24. What is clear is that Clause 44 makes no express provision for the arbitration thereunder to be a domestic arbitration. 25. Counsel for the Employer argued in this case that Clause 44 makes more provision and is clearer in its implication, than the clauses considered in A v D and in Buda Pipe . Clause 44 expressly states that the 1993 Rules for domestic arbitration shall apply to the arbitration under the Agreement. Does such incorporation of the 1993 Rules amount to making provision that the arbitration pursuant to these rules is a domestic arbitration? 26. On behalf of the Consultant, emphasis was placed by Counsel on the objectives of the Ordinance, set out in sections 3, 4 and 9 of the Ordinance. 27. Section 3 of the Ordinance states the object of the Ordinance, to facilitate the fair and speedy resolution of disputes by arbitration without unnecessary expense. The Court should interfere in the arbitration of a dispute only as expressly provided for in the Ordinance. I agree that the objectives set out in section 3 are material considerations and have borne them in mind. 28. Section 4 of the Ordinance states that the provisions of the Model Law which have effect under the Ordinance have the force of law in Hong Kong, subject to the modifications and supplements as expressly provided for in the Ordinance. Under section 9 of the Ordinance, interpretation of the Model Law should give regard to its international origin and to the need to promote uniformity in its application, and questions concerning matters governed by the Model Law which are not expressly settled in it are to be settled in conformity with the general principles on which the Model Law is based. 29. Sections 99 and 100 of the Ordinance are unique to the Ordinance, and are not provisions of the Model Law. 30. Counsel for the Employer accepts that whilst it is clear that the arbitration agreement in Clause 44 was a domestic agreement under Cap 341 , that by itself does not mean that “domestic arbitration” had been provided for, as per A v D . However, Counsel pointed out that “arbitration agreement” is defined in broad terms under section 19 of the Ordinance. In particular, section 2 (2) of the Ordinance states as follows: “If – (a) a provision of this Ordinance refers to the fact that the parties have agreed, or in any other way refers to an agreement of the parties, the agreement includes any arbitration rules referred to in that agreement; or (b) a provision of this Ordinance provides that the parties may agree, the agreement, if any, may include any arbitration rules by referring to those rules in that agreement.” 31. Applying section 2 (2), section 100 (a) means that the Schedule applies to an arbitration agreement, including the 1993 Rules, which have provided (expressly or by implication) that arbitration under the agreement, or the 1993 Rules, is a domestic arbitration. 32. Counsel for the Consultant has highlighted the fact that the 1993 Rules do not themselves state that the arbitration applying them is a domestic arbitration. The Court accepts, as the Consultant has pointed out, that the HKIAC Domestic Arbitration Rules can be applied by the parties to an international arbitration under Cap 341 . The 1993 Rules do not expressly “provide” that the arbitration conducted under the rules would be a domestic arbitration. 33. However, I accept the submissions made on behalf of the Employer in this case, that when one considers the Agreement at the time when it was made in 2003, there can be no dispute that the parties had intended, and could not have any dispute then, that Clause 44 was intended to be a domestic arbitration agreement under Cap 341 in force at the time, and that Clause 44 contemplated and intended a domestic arbitration. The adoption of the 1993 Rules reflected that intention, and certainly could not be an indication that the parties did not intend, in 2003, a domestic arbitration – albeit the 1993 Rules themselves did not provide expressly for such. 34. As Counsel for the Subcontractor pointed out, at the time when the Agreement was made, which is the relevant time for objectively construing the intention of the parties as reflected in the Agreement, section 100 of the Ordinance was not in existence. At that point in time, when both parties to the Agreement were Hong Kong parties, their arbitration agreement was domestic by operation of the law, without the need for them to make any specification or provision for their agreement and arbitration to be domestic. It went without saying, in those circumstances and in the context of the Agreement, that their agreement provided for domestic arbitration, and there is no specification otherwise. Counsel for the Employer also pointed out that once made, the Agreement and Clause 44 became binding on the parties from 2002, and would not change in its substance, nature and meaning by the subsequent commencement of the Ordinance in 2011. 35. Construed in its proper context, the agreement set out in Clause 44 must have provided for domestic arbitration, by reference to and the agreed application of the 1993 Domestic Rules. The application of the said rules does not change the nature of the agreed mode of arbitration, being domestic, notwithstanding the fact that the 1993 Rules do not themselves state the nature of the arbitration. Although the rules may be applied, by the parties’ consent, to an international arbitration, the domestic rules themselves were intended for use in domestic arbitrations. Counsel for the Employer pointed out that the 1993 Rules themselves stated that they were not intended for use in arbitration relating to international disputes. 36. What section 100 requires is that there must be an established intention of the parties in the arbitration agreement, that they intended to have a domestic arbitration, and I am satisfied that has been demonstrated in this case. By referring to and incorporating the 1993 Rules in their arbitration agreement under Clause 44, the agreement between the Employer and the Consultant had by implication provided for domestic arbitration. This is not a case of the Employer merely relying on the arbitration agreement being domestic by operation of the law at the time of the Agreement, under Cap 341 , to claim (as the party did in A v D ) that the parties had “provided” for a domestic arbitration. 37. Having held that section 2 of the Schedule applies to the Agreement and the 1 st Arbitration, the Court has power to order the consolidation sought. 38. On the evidence in this case, I am satisfied that there are clearly common questions of law and fact in the 1 st Arbitration and the Consolidated Arbitration. The rights to relief claimed undoubtedly arise out of the same transaction or series of transactions in the Project, concern the construction of the Bridge, and whether the Consultant, the Contractors and/or the Subcontractor should be liable in contract or in negligence for the defects discovered in the design, construction and the execution of the relevant works relating to the P3 Tendon and the other defects complained of by the Employer as employer. There would be substantial savings in time and costs, if all the relevant parties are included in the consolidated arbitrations, so that discovery and evidence can be exchanged for all parties, witnesses can be called at the same hearing, and the risks of inconsistent findings can be avoided. 39. I do not accept the submissions made by the Consultant, that their liability is dependent upon the Employer succeeding in its claims against the Contractors, and that if the Employer’s claims against the Contractors fail, the Employer’s claims against the Consultant would fall away, such that the Consultant’s time and costs of participating in a consolidated arbitration would be wasted if the Employer should fail in its claims against the Consultant. The Consultant seeks an order that the 1 st Arbitration be heard only after the Consolidated Arbitration, or be stayed until the determination of the Consolidated Arbitration. 40. As pointed out by Counsel for the Contractors, the Employer claims that the Consultant had duties under the Agreement to prepare the specifications for the works to be executed by the Contractors in the Project, to approve the Method Statements prepared by the Subcontractor for the works, to supervise the preparation and application of the Method Statement, and that it had the duty to warn of any deficiency. These claims are not dependent upon the Employer succeeding in its claims against the Contractors. Far from so, the role of the Consultant in the causation of the alleged defects and alleged breaches of the Contractors and Subcontractor under their contracts is part of the essential dispute in the arbitrations. The entire dispute is complex, multilayered but intertwined, and it is necessary for the arbitrator to be able to manage the claims and the dispute under one ceiling or reference, in a consolidated arbitration. 41. If there should indeed be parts of the case that, in the opinion of the Consultant, do not concern its liability, no doubt it would be open to the Consultant to inform the arbitrator of its stance, and the hearing can be managed for parts of the evidence to be taken without the attendance of the Consultant and its advisers, if this should be preferred by the Consultant in the interests of costs and time-saving. 42. In all the circumstances of this case, I am prepared to grant the order for consolidation of the 1 st Arbitration and the already Consolidated Arbitration. It would be more appropriate for the arbitrator to decide how the consolidated arbitrations should be dealt with in the most appropriate manner, and this Court should not usurp the powers of the arbitrator by ordering which arbitration should be heard first, or how the consolidated arbitrations should be heard. 43. Since the Employer has succeeded in its application, the order nisi is that the costs of the application are to be paid by the Consultant to the Employer and to the Contractors. The Subcontractor does not seek any costs. There will be certificate for Counsel for all parties. (Mimmie Chan) Judge of the Court of First Instance High Court Mr Gary Soo, instructed by Li & Partners, for the plaintiff Mr James Niehorster, instructed by Bryan Cave Leighton Paisner LLP, for the 1 st defendant Mr Julian Cohen, instructed by Cocking & Co LLP, for the 2 nd to 5 th defendants Mr Jonathan Chang SC, instructed by King & Wood Mallesons, for the 6 th defendant Look up this case on Lawcite Noteup",
  "length": 22967,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2022/887",
  "query": "arbitration",
  "ts": "2025-10-14T11:20:28",
  "ok": true
}