{
  "title": "HKSAR V. LAU CHEUNG FAI | [2018] HKCFI 604 | HKLII",
  "court": null,
  "year": 2018,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2018] HKCFI 604 HKSAR V. LAU CHEUNG FAI Judgment Information Date 15 Mar, 2018 Action No. HCCC367/2015 Neutral Cit. [2018] HKCFI 604 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCCC367/2015 HCCC367A/2015 HKSAR v. LAU CHEUNG FAI HCCC 367/2015 [2018] HKCFI 604 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CRIMINAL CASE NO 367 OF 2015 _______________ HKSAR v LAU Cheung-fai (劉璋輝) _______________ Before: Hon Zervos J in Court Date of Hearing: 16 March 2018 Date of Sentence: 16 March 2018 __________________________ REASONS FOR SENTENCE __________________________ Introduction 1. By a unanimous verdict of the jury, the defendant has been found guilty of the murder of Miss Kwok Wai Ming on 14 December 2014. 2. The defendant’s trial originally commenced on 27 December 2017 before another jury where he entered a plea of not guilty to murder but guilty to manslaughter. The prosecution did not accept the guilty plea and the trial proceeded against the defendant for the offence of murder. During the trial, an application was made pursuant to section 75 of the Criminal Procedure Ordinance , Cap 221 , to determine whether the defendant was under a disability so that he was not fit to be tried. [1] The application was supported by the expert reports of two psychiatrists, Dr Sylvia Chia Lu Chen and Dr Chan Kwok Tung. The treating psychiatrist of the defendant, Dr Oliver Chan, disagreed with their opinions. The jury was then directed to decide the issue, and after the presentation of the evidence, including psychiatric evidence, they returned a verdict by a majority of five to one (one juror having been previously excused) that the defendant was not under a disability and was fit to be tried. As required by law, a new jury was empanelled to try the defendant for the offence of murder. The facts of the case 3. It was not in dispute that on 8 December 2014, the defendant killed Kwok Wai Ming, the deceased, by asphyxiation. 4. The defendant, who was 34 years old and married at the time of the offence, had arranged through a social medium, WeChat, to meet the deceased, who was 15 years old, in the afternoon of 8 December 2014 for private photo shooting for an agreed fee of $500. 5. In interviews with the police, the defendant explained how he accessed social network sites to try to get a response from other parties, and that he obtained and stored photos of pretty girls that had been posted. He said that he made contact with others through social mediums and bluffed other people to add him to WeChat. It was through this social medium that he saw the deceased’s post where she mentioned that she modelled for private photo shooting. He added her to his post and then engaged in a series of text messages with her over several days and arranged a photo shooting session. The deceased made inquiries as to what kind of photographs he intended to take and whether he had a photographic studio. The defendant in turn inquired about her height and weight to which she replied. There followed a discussion between them where the deceased told the defendant she required $500 for taking photographs for 2 hours with a half hour break in between. The deceased requested to look at the photos of the outfit for the photo shoot, and the defendant replied that he would go to buy the outfit with her directly at Langham Place. 6. At one stage the photoshoot was called off but the deceased in the end said she could make it. The defendant arranged to meet the deceased at 3:15 pm on 8 December 2014 at Langham Place. The deceased eventually met him there, although she arrived late. He took her to a clothing shop on the 9 th floor of Langham Place to look at costumes but she refused to go inside the shop, claiming that the clothing would give her a skin allergy. The deceased had brought along a Christmas costume and according to the defendant, he asked her to put it on so that he could see it. He suggested that she change in one of the restrooms at Langham Place but she declined to do so. 7. According to the defendant, he had not brought his camera as he thought he might be stood up, even though he had withdrawn $6,000 prior to meeting her, as well as making initial inquiries about renting a room for a period of three months. He requested that the deceased come to his flat so he could pick up his camera. There was some suggestion that she might change into her costume there so that he could see what it looked like. 8. Having lured the deceased to meet him, he then took her to his flat on the pretence of collecting his camera. Before going into the flat, he checked to make sure that none of his family members were at home. Once in the flat, he attacked her without warning and subjected her to terrible indignities in a sustained and escalating violent assault, which included acts of gross indecency which were both repulsive and callous. 9. The flat to where the defendant took the deceased belonged to his mother-in-law, where he and his wife also lived. Once inside, the defendant claimed that he told her that he was recently unemployed and that she responded by saying that money would “easy come, easy go”. He said that this triggered a nerve and aroused experiences of having been previously bullied and feelings of inferiority. 10. The defendant without warning grabbed a glass ketchup bottle and struck the deceased’s head several times with it. The deceased put up a struggle but he continued hitting her and she fell to the floor. Although, she tried to resist him, he was able to bind her hands to her head with adhesive tape and wrapped plastic straps around her neck. He also bound her legs as she kept on struggling and kicking. In her defenceless state, the defendant applied KY gel to the deceased’s anus and thrusted a wine bottle inside her anus many times. He claimed he did this to try to get her drunk. She obviously suffered excruciating pain as she begged him not to hurt her anymore, not to put anything into her anus. She told him that she would do anything he asked. He made her drink the remaining wine in the bottle. The subsequent post mortem report revealed that she had a high blood alcohol level, clearly due to being forced by the defendant to consume the wine. He said the wine was leaking from her anus and he put a plastic bottle top inside her anus. During the subsequent autopsy, the plastic bottle top was found inside her anal canal. 11. After she consumed the wine, the defendant started licking her vagina which he said in the police interviews he did “out of lechery”. 12. He noticed the clock and became concerned that his family members might return home soon. He bound the deceased with adhesive tape covering her nose and mouth, and he tightened the plastic straps around her neck as well as squeezing her neck with his hands. He said that she moved less, and looked completely still. He checked her heartbeat but felt none. He then packed the deceased’s body into a suitcase intending to check into a hotel. He cleaned up the flat and collected the deceased’s personal belongings which he hid or later threw away. 13. According to the forensic pathologist, the deceased’s death was caused by mechanical asphyxia. There is no doubt that before the deceased died she suffered terribly, and was subjected to gross acts of indecency which also continued when the defendant took her body to a nearby hotel and on two separate occasions on the day that she was murdered he had sexual relations with her body. 14. With the deceased’s body forced into a suitcase, the defendant dragged it to a nearby hotel and checked in. He put the deceased’s body on the bed of the hotel room and had vaginal and anal intercourse with the deceased’s body. He then went out to make inquiries about renting a room with the intention that he would hide the deceased’s body there. The inquiries were unsuccessful and he returned to the hotel room where he had vaginal intercourse with the deceased’s body once more. In his interviews with the police, he said he was “lecherous” when he had sexual relations with the deceased’s body. 15. As if nothing had happened, he contacted his wife and arranged to meet her for dinner. He then left the hotel. He had dinner with his wife, during which she noticed that he had injuries to his body. He said he received them when he visited a friend and fell down the staircase at his friend’s home. After dinner, the couple went home and watched TV, and he then went to bed. 16. The defendant got up early the next morning and arranged to collect the deceased’s body that had been left in the hotel room overnight. He returned to the hotel room with two large carry bags as well as black plastic rubbish bags and cardboard that he purchased. He put the deceased’s body in a number of bags using the cardboard to conceal any outline of her body. He borrowed a handcart from a nearby refuse depot and returned with the deceased body in the bags which he dumped in a large rubbish bin. When a cleaner at the depot asked what was in the bags, he replied ordinary garbage. 17. Fortunately, the cleaner was suspicious and opened the bag and saw the body of the deceased. The police were immediately alerted and were able to trace the defendant through the hotel registration. He was arrested for murder of the deceased that afternoon at 2:38 pm. After being cautioned, he said: “I know that I was wrong. I accidentally killed the other party. I am regretful.” 18. The defendant then participated in a series of video recorded interviews and a video reconstruction of the killing of the deceased. 19. The deceased, Kwok Wai Ming, was a young girl that had been warned by her father to beware of shady model companies and the perils of private photo shooting. However, she had no way of knowing or appreciating what lay ahead in meeting up with the defendant, given her young age and inexperience. It was acknowledged during the course of the trial that the deceased was totally innocent and had done nothing wrong. The character and behaviour of the defendant 20. The defendant has been seeking to secure a finding of guilt of manslaughter instead of murder by reason of suffering from a mental illness at the time of the killing. Whilst it is the defendant’s right to contest the allegations against him at trial as he sees fit, where matters have arisen that reflect on his character and behaviour, they can be appropriately addressed when passing sentence on him. 21. The jury by its verdict has rejected his reliance on the defence of diminished responsibility. They have rejected, and rightly in my view, that the defendant was suffering from an abnormality of mind that substantially impaired his mental responsibility for the killing. It would appear that the defendant has some behavioural issues or problems, and has more recently experienced psychotic episodes, although they emerged prior to scheduled trial dates. Throughout these proceedings, the defendant has been keen to present himself as suffering from mental illness and that he should be found guilty of manslaughter and not murder. 22. The defendant in his interviews with the police that immediately took place after the killing gave a detailed account of the events before, during and after the killing of Kwok Wai Ming. He repeatedly stated that the deceased had refused to change into her Christmas costume, and when he had mentioned to her that he had recently become unemployed, she said “money came fast and went fast”, invoking thoughts of his state of unemployment, and having been bullied and humiliated by his work colleagues. He said he was very angry towards his colleagues and he transferred this anger to an innocent person. He said this “triggered a nerve” and he got ketchup bottle and started to hit her. 23. The significance of this is that the defendant in his oral testimony as well as in his interviews with the two defence psychiatrists claimed that at the time of killing the deceased, he was experiencing delusions and hearing voices - the term “blood ritual” had come into his mind and he was hearing a male authoritative voice that later after he came down from the hotel room on the second occasion told him to chop up the deceased into pieces which he did not do. 24. The defendant had not mentioned these matters in his interviews with the police or during his numerous interviews with Dr Oliver Chan, his treating psychiatrist. As noted by Dr Oliver Chan in a report dated 28 July 2017: “14 In an interview on 2 September 2016, he told me that there would be a change of legal representative for the trial and he had additional information to supplement as regards his case. On that day he said he was being ‘possessed by ghosts’ when penetrating the victim at the guesthouse, and he said the ‘ghost’ commanded him to chop victim into pieces although he did not succumb to that. When asked to elaborate on the nature of the command and the feeling of being possessed he was unable to do so; in a later interview on 30 September 2016 he claimed that a vocabulary ‘blood ritual’ appeared in his mind as he strangulated victim in his mother-in-law’s home. He said this experience only happened around the material time of the alleged offence. The above was never reported or elicited during my (more than 20) earlier interviews with him, nor was it mentioned during his cautioned statement with the Police.” 25. Dr Oliver Chan having dismissed the defendant was suffering from any mood or psychotic disorders, noted in paragraph 25 of his report that his account in September 2016 was inconsistent with the earlier ones between December 2014 and August 2016. 26. It was the defence case that the defendant was suffering with an abnormality of mind at the time of the killing which substantially impaired his mental responsibility for what he did. 27. Also from the defendant’s account of the events on 8 December 2014, that he told the police and the psychiatrists, he stated that the deceased’s boastful and sarcastic comments that the money she earnt would “easy come, easy go” reminded him that he had no job and how he had been bullied by his previous colleagues and this at the time provoked him which caused him to suddenly or temporarily lose his self-control. 28. In his evidence at trial, the defendant said that he squeezed the neck of the deceased because he saw “blood sacrifice” in his mind and a voice later told him on the second occasion he came down from the hotel to obtain all the knives in his kitchen and chop up the deceased into pieces and throw the pieces off the ferry pier. He said he was suffering from a mental illness and God had told him that his case was manslaughter. Throughout his oral evidence, the defendant made numerous references to God and that he was not guilty of murder but of manslaughter because of his mental illness. 29. The two defence psychiatrists supported the defendant’s claim that he was suffering with an abnormality of mind at the time of the offence and they diagnosed him as suffering from various disorders. Together they consulted the defendant for one hour during the course of his first trial on 3 January 2018 where they expressed the opinion that the defendant was in an unstable, deranged, psychotic state of mind. 30. Dr Oliver Chan who gave evidence in rebuttal on the issue of diminished responsibility expressed the opinion that the defendant was not suffering from any psychiatric disorders at the time of the killing, although he did acknowledge that the defendant had certain behavioural problems and recently had psychotic episodes for the first time in October 2017 which he said was not uncommon for someone in custody. He did stress however that the defendant’s claims of blood sacrifice coming into his mind and hearing a voice at the time of the offence were a gross inconsistency to what he had previously said about the offence. The defendant in his oral evidence said that he did not mention these things before because he did not want to put into a mental institution. However, when Dr Oliver Chan asked him why he had not mentioned these matters earlier, he said that no one would believe him so he did not bother to talk about them. 31. On a consideration of the evidence as a whole, I do not accept what the defendant said about hearing voices and having things go through his mind at the time of the killing which only arose for the first time in September 2016. In the video recorded interviews and the reconstruction, one can see and assess the manner and demeanour of the defendant when answering questions where he gives a detailed and sometimes graphic account of events relating to the offence. There is also the CCTV footage capturing the defendant meeting up with the deceased at Langham Place, taking her to and entering his flat, taking her body in the suitcase from the flat to and in the hotel, taking her body in carry bags onto a handcart which he wheeled to the refuse depot, and after dumping her body there, then leaving. The footages depict him behaving calmly and casually, particularly when he takes the deceased’s body to the hotel and later dumped her body at the refuse depot. 32. As stressed by the prosecution, the defendant’s behaviour and actions were organised and deliberate and did not disclose a mind that was confused or disorganised. Sentencing the defendant 33. The sentence for murder is fixed by law and is one of life imprisonment, that is the sentence which I have passed upon the defendant for the charge of the murder of Kwok Wai Ming. 34. The defendant bluffed his way into the social chat site to which the deceased belonged on WeChat and targeted her in order to lure her out to meet him. He took the deceased to his flat and carried out terrible atrocities and indignities on her before extinguishing her life. She pleaded with him not to hurt her, and from the defensive injuries that were later disclosed on her body, she fought for her life. He showed her no mercy or human feeling in the deliberate and sustained infliction of violence and torture on her. He is the type of person that all parents fear and dread when their children go onto social mediums or social networking sites. I am firmly of the view that he poses a very real danger to the public. 35. The defendant’s claim that he was suffering with a mental illness at the time of the killing so that he did not know what he was doing was rejected by the jury and with complete justification. The clinical notes from the psychiatric centre revealed the extent to which he was calculating and desirous of being convicted of manslaughter because he was mentally unwell rather than murder. In his interviews with the police and in the reconstruction a day after the killing, at no stage did he say that he was hearing the term “blood sacrifice” when he killed the deceased and later hearing a voice that told him to chop the deceased up into pieces. His explanation that he did not want to be put in a mental institution if he had mentioned these things was rejected by the jury. I am in no doubt that he either made things up or exaggerated matters in an attempt to present himself as suffering from mental illness at the time of the killing to such an extent that he did not know what he was doing. This has been soundly rejected by the verdict of the jury. Social mediums and networking sites 36. The tragic loss of the life of this young girl may not have happened if not for the ease of access that people like the defendant have to the young and vulnerable on social mediums and social networking sites. 37. In his book, Principles of Cybercrime, [2] Jonathan Clough notes: “The proliferation of digital technology, and the convergence of computing and communication devices, has transformed the way in which we socialise and do business. While overwhelmingly positive, there has also been a dark side to these developments. Proving the maxim that crime follows opportunity, virtually every advance has been accompanied by a corresponding niche to be exploited for criminal purposes.” 38. The learned author went on to address the serious problem facing communities throughout the world of the new global phenomenon of crime in cyberspace. He said: “It is one thing to enact criminal offences to address online conduct; it is quite another to assert jurisdiction over offenders who may be located anywhere in the world.” 39. He further explains that jurisdictions in attempting to address the problem of crime in cyberspace apply traditional territorially based rules on online activity and largely refuse to acknowledge or treat the Internet as beyond their competence. He states that this is particularly true in the criminal law which is necessarily grounded in notions of territoriality. The problem of cybercrime in its various forms and facets is getting worse, and unfortunately mainly through neglect or exasperation. 40. Following a request from the Court, Mr Martyn Richmond, for the prosecution, has made inquiries about crimes in relation to social networking on the Internet. He submitted a press release dated 6 February 2013, where the then acting Secretary for Security, Mr John Lee, (now the Secretary for Security), responded to a question about the increasing number of cases of young girls being exploited and threatened by acquaintances on the Internet. In reply, he revealed that there were criminals who, on the disguise of making friends on the Internet, have committed offences including rape, indecent assault, criminal intimidation or deception on victims. It was noted that victims of sexual assault who met the offenders through the Internet were mostly underage girls. It was also noted that the Hong Kong Police Force was very concerned about sex crimes arising from making acquaintances on the Internet, particularly cases in which underage girls are the target. In addition to investigating and prosecuting such cases, the police have engaged in a comprehensive campaign to educate young people to be aware of the dangers of the Internet and to protect themselves when using the Internet. Similar community awareness campaigns are being conducted by the Education Bureau and the Social Welfare Department. 41. I have been informed that the police also liaise with individual Internet service providers and social medium platforms about the correct use of their services, or the dissemination of crime prevention messages on their websites and platforms. However, I was not provided with any illustrations of electronic banners or posters providing warnings for the protection of the young and vulnerable and for crime prevention. 42. As a result of this case, inquiries were made with WeChat of the measures they employ to protect young and vulnerable users. WeChat stated that it gives general advice to users to be careful when using the application but did not have any special warning to young or vulnerable users of the dangers in contacting strangers via the social media. WeChat said that they will follow up on this. 43. WeChat also stated that when it receives a complaint that a user is behaving suspiciously or improperly, they will follow it up and may terminate the user’s account. However, no notification would be announced to WeChat users. In effect, this means that such banned user can re-emerge by using another account. 44. WeChat finally stated that when it receives a complaint that a user is suspected to have committed a criminal offence via its account, they make an assessment and may report the case to the police. 45. Mr Richmond also informs me that from his research, there are no specific offences that deal with improper and criminal conduct on the Internet except for section 161 of the Crimes Ordinance , Cap 200 , and the established criminal offences that are normally available. Section 161 concerns “access” to a computer with criminal or dishonest intent. More particularly, there does not seem to be any statutory, regulatory, or administrative provisions delineating legal obligations and responsibilities on owners and operators of social mediums and social networking sites. 46. The owners and operators of social mediums and social networking sites in which criminal activities take place bear greater responsibility for the enforcement of the law in its most fundamental terms. From what I have been told, it seems that they are not doing enough to prevent and report crime or protect the young and vulnerable. Improper and criminal conduct on the Internet should not be the sole responsibility of the law enforcement agencies or relevant government departments or bodies concerned with the protection and welfare of the public. The operators and owners of social mediums and social networking sites also have an important role to play. 47. As we have warning signs on our streets and products alerting us to potential hazards or dangers, or reminding us of the law or of our legal responsibilities, it would seem that at the very least we should have such warning signs in cyberspace where required. This is but one of many measures that may be available to address the problem. Solving this problem will not be easy but it needs to be addressed, and by appropriate persons and bodies that can make an informed and constructive set of recommendations that hopefully will deal with and arrest the increasing victimisation of the young and vulnerable on the Internet. (Kevin Zervos) Judge of the Court of First Instance High Court Mr Martyn Richmond and Mr Kelvin Man, counsel on fiat, for HKSAR Mr Michael Arthur and Mr David Cheng, instructed by Ip, Kwan & Co., assigned by Director of Legal Aid, for the defendant [1] See HKSAR v LAU Cheung-fai, HCCC 367/2015, 4 January 2018. [2] Principles of Cybercrime, Jonathan Clough, Cambridge University Press, 2010. Look up this case on Lawcite Noteup",
  "length": 25978,
  "headers_seen": [
    "Introduction",
    "The facts of the case",
    "The character and behaviour of the defendant",
    "Sentencing the defendant",
    "Social mediums and networking sites"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2018/604",
  "query": "cybercrime",
  "ts": "2025-10-17T10:44:31",
  "ok": true
}