{
  "title": "WISDOM GLORY INVESTMENT LTD V. ADWO MEDIA HOLDING LTD | [2022] HKCA 685 | HKLII",
  "court": null,
  "year": 2022,
  "date": "2025-01-02",
  "content": "HKLII Databases Court of Appeal [2022] HKCA 685 WISDOM GLORY INVESTMENT LTD V. ADWO MEDIA HOLDING LTD Judgment Information Date 12 May, 2022 Action No. CAMP364/2021 Neutral Cit. [2022] HKCA 685 Download MS Word Judgment Reading Options Translation Toggle Highlight Appeal History CAMP364/2021 CAMP364/2021 WISDOM GLORY INVESTMENT LTD v. ADWO MEDIA HOLDING LTD CAMP 364/2021 [2022] HKCA 685 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF APPEAL MISCELLANEOUS PROCEEDINGS NO. 364 OF 2021 (ON AN INTENDED APPEAL FROM HCCT NO. 70 OF 2020) ________________________ IN THE MATTER of the Share Redemption Agreement entered into between the Applicant and the Respondent on 15 December 2015 and IN THE MATTER of an Arbitration in respect of the Share Redemption Agreement and IN THE MATTER of an application to set aside the Final Award dated 13 July 2020 under section 81 of the Arbitration Ordinance ( Cap. 609 ) and Order 73 of the Rules of the High court ( Cap. 4A ) ________________________ BETWEEN WISDOM GLORY INVESTMENT LIMITED Applicant and ADWO MEDIA HOLDING LIMITED Respondent ________________________ Before: Hon Cheung and Chu JJA Date of Judgment: 13 May 2022 ________________________ JUDGMENT ________________________ Hon Chu JA (giving the judgment of the Court): A. Introduction 1. This is a renewed application by the respondent (“AW”) for leave to appeal against the decision of Mimmie Chan J (“the Judge”) given on 17 June 2021 (“the Decision”) refusing its application for security against the applicant (“Wisdom”). [1] AW’s previous application for leave to appeal was refused by the Judge on 16 August 2021. [2] 2. Having considered the documents filed by the parties and their respective submissions, we consider that it is appropriate to determine the application without a hearing pursuant to Order 59 rule 2A (5)(a) of the Rules of the High Court , Cap. 4A . We now give our judgment on the application. B. The facts 3. Wisdom and AW were parties to two arbitrations concerning certain disputes arising from a framework agreement made on 21 September 2015 (“Framework Agreement”) and a share redemption agreement made on 15 December 2015 (“Share Redemption Agreement”). HKIAC/A 17026 was an arbitration commenced under the Framework Agreement (“Arbitration 1”), whereas HKIAC/PA 17141 was an arbitration commenced under the Share Redemption Agreement (“Arbitration 2”). 4. In both Arbitration 1 and Arbitration 2, AW alleged, amongst other things, that Wisdom was guilty of misrepresentation. The contents of the alleged representations pleaded by AW are identical, namely, Wisdom represented to AW that (i) Pu Yi (“PY”), the sole shareholder and director of Wisdom, owned 16.449% of the shareholding in AW prior to and at the time of September 2015 (“Shareholding Representation”); and (ii) the ownership and/or control of Wisdom and/or a company known as Beijing Adwo Media Holding Limited (“BJ AW”) pertaining to the shares held by PY were not subject to any actual or potential disputes (“Disputes Representation”). [3] 5. The tribunal in Arbitration 1 consisted of Mr Anthony Neoh SC, Mr Tao Xiuming and Mr Philip Yang (“Tribunal 1”). The tribunal in Arbitration 2 consisted of Ms Winnie Tam SC, Mr Tao Xiuming and Mr Ing Loong Yang (“Tribunal 2”). Mr Tao Xiuming (“Common Arbitrator”) was a common arbitrator in both arbitrations. 6. On 13 March 2020, Tribunal 1 handed down the award in Arbitration 1 (“Award 1”). In Award 1, Tribunal 1 found in favour of Wisdom and dismissed AW’s misrepresentation claim. [4] On 13 July 2020, Tribunal 2 handed down the award in Arbitration 2 (“Award 2”). In Award 2, Tribunal 2 found in favour of AW on its claim for misrepresentation and held that the Share Redemption Agreement was rescinded for misrepresentation. [5] The decisions of both tribunals were unanimous. 7. On 12 October 2020, Wisdom commenced the action below (HCCT 70/2020) to set aside Award 2 on the grounds of issue estoppel and apparent bias. The present application is not concerned with the apparent bias ground, which the Judge found was devoid of merits. 8. On the issue estoppel ground, Wisdom’s case is that Award 2 is in conflict with the public policy of Hong Kong in that, contrary to principles of fairness, due process and justice, Tribunal 2 ignored the findings on issues which were already determined in Arbitration 1 and made inconsistent findings on the same issues between the same parties. Wisdom highlighted the fact that the Common Arbitrator, who formed part of a unanimous tribunal in both Arbitration 1 and Arbitration 2, made findings in Award 2 which were inconsistent with the findings he made in Award 1. 9. On 30 December 2020, AW applied by summons to enforce Award 2, for judgment to be entered in terms of Award 2, and for security to be provided Wisdom in respect of the sums payable under Award 2 (“Security Application”). C. The Judge’s Decision 10. The Judge dismissed the Security Application. 11. The Judge had regard to the applicable principles in Soleh Boneh International Ltd v Government of the Republic of Uganda [1993] 2 Lloyd’s Rep 208 at 212. These principles, which have been applied in Hong Kong [6] and are not disputed by counsel, are as follows: “In my judgment two important factors must be considered on such an application, although I do not mean to say that there may not be others. The first is the strength of the argument that the award is invalid, as perceived on a brief consideration by the Court which is asked to enforce the award while proceedings to set it aside are pending elsewhere. If the award is manifestly invalid, there should be an adjournment and no order for security, if it is manifestly valid, there should either be an order for immediate enforcement, or else an order for substantial security. In between there will be various degree of plausibility in the argument for invalidity; and the Judge must be guided by his preliminary conclusion on the point. The second point is that the Court must consider the ease or difficulty of enforcement of the award, and whether it will be rendered more difficult, for example, by movement of assets or by improvident trading, if enforcement is delayed. If that is likely to occur, the case for security is stronger; if, on the other hand, there are and always will be insufficient assets within the jurisdiction, the case for security must necessarily be weakened.” 12. In respect of the first factor, the merits of the setting aside application, the Judge was of the view that Award 2 is manifestly invalid in what Her Ladyship described as a “highly unusual case” [7] . 13. The Judge reviewed the pleadings in the two arbitrations and the findings of facts made in the two awards, and considered that there were inconsistencies and contradictions which could not be reconciled on the basis of the same facts and that the inconsistencies in findings raised concern as to whether it would be just to permit the two awards to stand and bind the same parties in the two arbitrations [8] . In particular, the Judge was concerned with “the structural integrity of the arbitral process and the arbitral award” [9] as well as the implication of the presence of a common arbitrator in Tribunal 1 and Tribunal 2. The Judge’s reasoning is encapsulated in [50] to [57] of the Decision as follows: “50. It is of course trite that arbitral awards are final and binding between the parties to the arbitration. In an application to set aside or oppose enforcement of an arbitral award, the Court does not sit on appeal to review the correctness of the award on either facts or law. It may be said that Tribunal 2 was wrong in law to have ignored the principles of issue estoppel, but this is not a ground to set aside Award 2. 51. However, the Court is concerned with the structural integrity of the arbitral process and the arbitral award. If there is conduct which is serious, or egregious, such that due process is undermined (the conduct described in Grand Pacific Holdings Ltd v Pacific China Holdings Ltd (in liq) (No 1) [2012] 4 HKLRD 1 (CA) at paras 94 and 105), the Court may consider whether the award should be enforced, or set aside on the ground of public policy. 52. In this case, as Counsel for [the Applicant] highlighted, Mr Tao was a member on both Tribunal 1 and Tribunal 2. He did not issue any dissenting decision in either Arbitrations, meaning that he agreed with all the findings made in Award 1 and Award 2, despite their being inconsistent and/or leading to different results. Mr Tao did not explain in Award 2 why the findings on the same facts were different, or why he did not consider [the Applicant] and [the Respondent] to be bound by the findings made in Award 1. Having submitted its dispute to Tribunal 2 for decision in Arbitration 2, [the Applicant] was entitled to expect Tribunal 2, including Mr Tao, to deal with the question of issue estoppel after Award 1 was handed down, when Mr Tao dealt with the same facts differently in resolving the disputes in Arbitration 2. His failure to deal with and explain the inconsistent findings constitutes injustice and grave unfairness to [Applicant] ( A v B [2015] 3 HKLRD 586 ). 53. When Mr Tao became aware of the findings made in Award 1, fairness and the justice of the case required him to invite submissions to be made by [the Applicant] and [the Respondent] in Arbitration 2, as to the effect of Award 1 on the issues to be decided in Arbitration 2. By doing so, Tribunal 2 would have the benefit of hearing submissions from the parties, as to whether the parties and Tribunal 2 were bound by the findings made by Tribunal 1, and how and the extent to which they were bound. The parties were entitled to be heard before any inconsistent findings were made against either of them. 54. I accept the submissions made for W, that confidentiality of Arbitration 1 and Award 1 does not prevent Mr Tao from disclosing Award 1 to the other members of Tribunal 2. As the Judicial Committee of the Privy Council explained in AEGIS Ltd v European Reinsurance Co of Zürich [2003] 1 WLR 104 1, the legitimate use of an earlier award in a later arbitration between the same parties would not raise the mischief against which confidentiality rules are directed. 55. I do not consider that W can be said to be at fault simply by having appointed different arbitrators to the Arbitrations, when it knew that AW had appointed the same arbitrator, namely Mr Tao, for both. It is the right of a party to appoint any arbitrator of its choice. It is entitled to expect that whoever it appoints, the candidate would discharge his/her duty to act fairly and impartially. 56. On the facts of this case, I accept that Award 2 is manifestly invalid. It would be contrary to our conceptions of justice to enforce Award 2, and there is substantial injustice arising out of Award 2, by virtue of the findings made in Award 2 which contradicted and were inconsistent with the findings which had already been made by Tribunal 1 on the same issues, and which findings were binding on [the Respondent] and [the Applicant], the same parties in the two Awards. This is considered in conjunction with the lack of explanation in Award 2 as to why there were such inconsistent findings, and the failure on the part of Tribunal 2 to give [the Applicant] and [the Respondent] the opportunity to address Tribunal 2 on Award 1, before Tribunal 2 made its award in Arbitration 2. Material to my decision on the invalidity of Award 2 is the fact that there was a common arbitrator in Tribunal 1 and Tribunal 2. 57. Setting aside an award is an undesirable decision to make, but as emphasized in Sun Tian Gang v Hong Kong & China Gas (Jilin) Limited [2016] 5 HKLRD 221 , fairness and due process underpin the arbitral process and are the prerequisites for the recognition it is afforded by the courts. Absent these underpinning factors, Award 2 cannot be enforced.” 14. As to the second factor [10] , whether enforcement would be rendered more difficult, the Judge observed that it is of less significance in light of the finding on the first factor. The Judge pointed out that neither Wisdom nor AW has assets in Hong Kong, which was chosen as a neutral venue for arbitration, and thus there was no additional difficulty in enforcing the award in Hong Kong. The Judge further found there was no solid evidence to suggest that Wisdom had moved any assets out of Hong Kong to evade enforcement or that there is any real risk that Wisdom would take steps to defeat AW’s enforcement of Award 2 in Hong Kong. 15. The Judge concluded that Wisdom had a strong case on the merits to set aside Award 2 and it would not be just to order security against Wisdom [11] . D. AW’s intended grounds of appeal 16. Before considering the grounds of appeal AW put forward in support of the intended appeal against the Judge’s decision, it is relevant to take note of the applicable legal principles, which are as follows: (1) The intended appeal is an interlocutory appeal against the exercise of discretion of the Judge in refusing to order security. It is well-established that an appellate court would not disturb the exercise of discretion unless it is shown that the judge had made an error of law, or had misapprehended material facts, or had failed to take into account relevant matters, or had taken into account irrelevant matters, or was plainly wrong. (2) It should also be noted that, in accordance with the principles set out in Soleh Boneh , supra, (see [11] above) on an application for security, the judge’s assessment on the strength of the argument that an award is invalid is “perceived on a brief consideration by the Court” and guided by a “preliminary conclusion on the point”. (3) In light of the high threshold for the appellate court to interfere with the Judge’s exercise of discretion and the preliminary nature of the Judge’s assessment on the validity of Award 2, it must be demonstrated that there is a reasonable prospect of success that the Judge’s refusal to order security was plainly wrong before leave to appeal will be given. 17. With these principles in mind, we turn to consider the specific grounds of appeal advanced by AW in the draft notice of appeal at [2] to [9] (respectively “Ground (2)” to “Ground (9)”). D1. Ground (2): Issue estoppel 18. Ground (2) contended that the Judge erred in ruling that issue estoppel was engaged. The essence of AW’s arguments was that the misrepresentations alleged in the two arbitrations were made at different points in time and for different agreements. 19. We are not persuaded that the Judge was plainly wrong in her analysis on issue estoppel. It is clear from the analysis in [39] to [44] and the conclusion in [45] of the Decision that the Judge was well aware of the difference in timing regarding the misrepresentation claims in the two arbitrations as well as the fact that different agreements were involved. The Judge, however, took the view that the representations which Tribunal 2 found to have been made were found to be contained in the Framework Agreement itself in September 2015, which was within the timeframe examined by Tribunal 1. This was highlighted by the Judge’s reasons for refusing leave to appeal when she stated that “the conclusions made by Tribunal 2 were on representations of facts which were made in the same sequence of events as those reviewed by the Tribunal 1.” [12] The Judge’s view was supported by the specific findings made by Tribunal 2 in [373(6)] (on the representation being made prior to or at the time of the Framework Agreement) and [374] (on the continuing nature of the representations) of Award 2. 20. Further, the argument that the alleged misrepresentations were made in respect of different agreements does not detract from the fact that the contents of the alleged representation were identical on AW’s pleaded case in the two arbitrations. Given that issue estoppel is concerned with “the fulfilment of an identical condition” [13] required for a cause of action, the Judge cannot be said to be plainly wrong in taking the view that issue estoppel was engaged on the basis that Tribunal 1 and Tribunal 2 had made inconsistent findings on a common condition in founding the cause of action of misrepresentation. D2. Ground (3): Different decisions reached by the two tribunals 21. Ground (3) contended that there was “nothing untoward” for Tribunal 2 to decide differently on the basis of different evidence and arguments. Reliance was placed on certain new evidence said to have only surfaced in Arbitration 2 as well as the observations in Lincoln National Life Insurance Co v Sun Life Assurance Co of Canada [2006] 1 All ER (Comm) 675 at [68] and [83] on the possibility for different arbitral tribunals to reach different results on closely inter-linked issues by reason of the private nature of arbitration. It was argued by AW that Tribunal 2 was entitled to arrive at a different conclusion based on a different set of facts. 22. In our view, this ground is misplaced. The Judge was not concerned with whether it was correct for Tribunal 2 to have reached a conclusion different from the one reached by Tribunal 1 on the merits. Instead, the Judge made it clear in [50] of the Decision that the Court was concerned with the structural integrity of the arbitral process and the arbitral award, which underlined the Judge’s view in [53] of the Decision that fairness and justice of the case required the Common Arbitrator to invite submissions from the parties on the effect of Award 1 on the issues to be decided in Award 2. It may well be that Tribunal 2’s decision would have remained the same, but the lack of an opportunity for the parties to address Tribunal 2 on the issue estoppel point is what gave rise to the concern of the structural integrity of the arbitral process. In this regard, we are not satisfied that the Judge was plainly wrong in taking the view that the parties ought to be afforded an opportunity to be heard before any inconsistent findings were to be made against either of them. 23. Further, a unique feature in the present case is that the Common Arbitrator sat in both Tribunal 1 and Tribunal 2. The present case is therefore readily distinguishable from Lincoln National Life Insurance Co v Sun Life Assurance Co of Canada , supra , in which the two arbitral tribunals consisted of completely different members (see [2] and [5]). The Judge considered the existence of the Common Arbitrator in this case was a material consideration in determining whether Award 2 should be set aside. We see no ground to disagree with the Judge’s view. D3. Grounds (4) and (5): Arbitrator’s duty 24. The thrust of AW’s arguments under Grounds (3) and (4) is that there is no positive duty on the part of the Common Arbitrator to refer parties to the findings in Award 1 because: (i) estoppel is a matter to be raised by a party in an adversarial setting rather than by an arbitrator assuming an inquisitorial role; and (ii) the Common Arbitrator was bound by his duty to uphold confidentiality in relation to the matters addressed in Award 1. 25. Similar to Ground (3), AW’s arguments fail to address the crux of the Judge’s reasoning, namely, as a matter of fairness, the parties should be given the opportunity to address Tribunal 2 given that the Common Arbitrator had made an inconsistent finding as between the same parties in Award 1. 26. As to the Common Arbitrator’s duty of confidentiality in respect of Award 1 and Arbitration 1, as the Judge pointed out, it is not absolute [14] . The duty of confidentiality is not understood to prohibit all forms of disclosure of the existence of a related arbitration in the absence of express consent: Halliburton Co v Chubb Bermuda Insurance Ltd [2020] 3 WLR 1474 at [99] and [101]. There are also well-recognised circumstances in which disclosure of confidential information or documents in arbitration is permissible, including where “it is reasonably necessary for the protection of legitimate interests of an arbitrating party” and where “the interests of justice require disclosure”: Emmott v Michael Wilson & Partners Ltd [2008] Bus LR 1361 at [107]. 27. In the context of the present case, the issue that is engaged is the arbitrator’s duty to invite submissions from the parties as to whether Tribunal 2 could make findings that would be inconsistent with those found by Tribunal 1. The Judge took the view that even the Common Arbitrator was bound by a duty of confidentiality, it would not have prevented him from inviting submissions from AW and Wisdom, when they and he himself knew the contents of Award 1 and the substance of Arbitration 1 [15] . Such a course was considered to be necessary to protect the interests of both AW and Wisdom, while at the same time fairness and due process require the arbitrator to give clear reasons for the totally inconsistent findings made [16] . 28. Moreover, in the unique circumstances of this case, it appears to us that it would be unrealistic to suggest that the Common Arbitrator, in deliberating on Arbitration 2, should close his mind to the reasoned findings on misrepresentation in Award 1 as if they had never been made. We fail to see how it could be said that the Judge was plainly wrong in holding that, as a matter of fairness and for the purpose of upholding the integrity of the arbitral process, the parties were entitled to expect the Common Arbitrator to have invited them to address Tribunal 2 on whether it could make findings inconsistent with those made by Tribunal 1. 29. In short, we do not think the Judge had erred on the law or was plainly wrong in her application of the law and analysis of the case. Neither do we accept that the Judge’s holding gives rise to a novel and important point of law for which leave to appeal should be given. D4. Ground (6): Waiver 30. AW’s complaint in Ground (6) is that Wisdom knowingly decided not to refer Tribunal 2 to Award 1 and had therefore waived any irregularity. Contrary to AW’s arguments, the Judge has considered and addressed this “waiver” argument in [48] to [55] of the Decision. The Judge noted that while Wisdom had not drawn the attention of Tribunal 2 to Ward 1, it had made Tribunal 2 aware that there were concurrent arbitration proceedings in progress and that there was a risk of inconsistent findings being made on the issues. The Judge considered that the Common Arbitrator must be aware of the issues decided in Award 1 and the findings on the essential ingredients and conditions necessary for the findings on misrepresentation in Award 2, and he had not issued dissented decision in either of the arbitrations. The Judge highlighted the importance of the structural integrity of the arbitral process and the arbitral award, pointing out that parties to arbitration are entitled to expect that the arbitrators appointed would discharge their duty to act fairly and impartially. 31. In our view, the “waiver” argument fails to address the reasoning and concern of the Judge, especially the concern over the structural integrity of Arbitration 2 that would justify the Court’s intervention. We do not consider this argument to be reasonably arguable. D5. Grounds (7) to (9): Exercise of discretion 32. Grounds (7) to (9) are directed at the Court’s discretion on whether to order security for the sums due under Award 2 and the costs. It was argued that Award 2 was not manifestly invalid and that substantial security should be ordered against Wisdom. In particularly, AW complained that the Judge failed to consider the prejudice from the perspective of the supervisory court in that AW’s enforcement attempts are likely to be stayed, thus allowing Wisdom a window to dissipate assets, and that Wisdom’s lack of assets in Hong Kong was a relevant factor for ordering security for costs. 33. Grounds (7) to (9) are premised on AW succeeding in showing that the Judge was plainly wrong in her assessment of the merits of the setting aside application. For the reasons set out above, we are not convinced that the Judge’s analysis on the validity of Award 2 and the merits of Wisdom’s setting aside application was plainly wrong. Further, in light of the matters taken into account by the Judge in assessing the risk of difficulty in enforcement [17] , including Wisdom’s asset position in Hong Kong and the lack of solid evidence to show a real risk of dissipation, we do not consider there are any reasonably arguable grounds for this Court to interfere with the Judge’s exercise of discretion. D6. Conclusion on the intended grounds of appeal 34. For the above reasons, we are not satisfied that there is any reasonable prospect of success in the intended grounds of appeal. Nor are we satisfied that there is any other reason in the interests of justice to grant leave to appeal. H. Disposition and costs 35. Accordingly, we dismiss the application for leave to appeal. 36. There is no reason to depart from the usual rule that costs should follow the event. Wisdom asks for costs to be awarded on indemnity basis, pointing out that the costs of the application for leave to appeal before the Judge was, by consent, awarded on indemnity basis. We accept that this application ought not to have been made since the intended interlocutory appeal is devoid of merits. We therefore order AW to pay Wisdom the costs of this application on indemnity basis to be assessed summarily. 37. We have considered Wisdom’s statement of costs for summary assessment, and take the view that the amount claimed is reasonable. We allow the amount claimed and summarily assess Wisdom’s costs at HK$130,740. 38. As this application is totally without merit, we further make an order pursuant to Order 59 rule 2A (8) of the Rules of the High Court that no party may under rule 2A(7) request the determination of this Court to be reconsidered at an oral hearing inter partes . (Peter Cheung) (Carlye Chu) Justice of Appeal Justice of Appeal Written submission by Mr David Fong, instructed by Gallant, for the applicant. Written Submissions by Mr Adrian Lai, instructed by Wilkinson & Grist, for the respondent. [1] [2021] HKCFI 1707 . [2] [2021] HKCFI 2382 . [3] Statement of Defence and Counterclaim in Arbitration 1, [13] [B3/455-456]; Statement of Claim in Arbitration 2, [9] [B3/500-501]. [4] Award 1, [172] and [189] [B2/246, 252]. [5] Award 2, [373], [374], [394], [399], [404] and [471(1)] [B2/383, 385, 387, 402]. [6] Weili Su v Shang Kang Fei [2019] 2 HKLRD 1214 , and X v Jimmy Chien [2019] HKCFI 2172 . [7] Decision, [1]. [8] Decision, [33]. [9] Decision, [51]; see also the decision of this Court in Grand Pacific Holdings Ltd v Pacific China Holdings Ltd (in liq) (No 1) [2012] 4 HKLRD 1 at [7]. [10] Decision, [63] to [65]. [11] Decision, [66]. [12] Decision on leave to appeal, [7]. [13] Thoday v Thoday [1964] P 181 at 198. [14] Decision on leave to appeal, [10]. [15] Decision on leave to appeal, [9]. [16] Decision on leave to appeal, [9]. [17] Decision, [65]. Look up this case on Lawcite Noteup",
  "length": 27130,
  "headers_seen": [
    "A. Introduction",
    "B. The facts",
    "C. The Judge’s Decision",
    "D. AW’s intended grounds of appeal",
    "D1. Ground (2): Issue estoppel",
    "D2. Ground (3): Different decisions reached by the two tribunals",
    "D3. Grounds (4) and (5): Arbitrator’s duty",
    "D4. Ground (6): Waiver"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkca/2022/685",
  "query": "enforcement of award",
  "ts": "2025-10-17T10:41:59",
  "ok": true
}