{
  "title": "LWK V. ZQJ | [2018] HKFC 174 | HKLII",
  "court": null,
  "year": 2018,
  "date": null,
  "content": "HKLII Databases Family Court [2018] HKFC 174 LWK V. ZQJ Judgment Information Date 15 Oct, 2018 Action No. FCMC6391/2016 Neutral Cit. [2018] HKFC 174 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History FCMC6391/2016 FCMC6391A/2016 LWK v. ZQJ FCMC 6391/2016 [2018] HKFC 174 IN THE DISTRICT COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION MATRIMONIAL CAUSES NUMBER 6391 OF 2016 ---------------------------- BETWEEN LWK Petitioner and ZQJ Respondent ---------------------------- Coram: Her Honour Judge Grace Chan (paper disposal) Date of decision: 16 October 2018 ------------------------------------- DECISION (Leave to appeal) ------------------------------------- Introduction 1. On 31 July 2018, I handed down my judgment (“ Judgment ”) refusing the petitioner husband’s application for permanent stay of these proceedings under FCMC 6391 of 2016 on his ground that China is a more convenient forum to dispose of the ancillary relief disputes between him and the respondent wife (“ Stay Order ”). In the same Judgment, I granted an anti-suit injunction order in favour of the wife restraining him from taking further part into the 2017 PRC Proceedings initiated by him in the People’s Court of Nanshan district, Shenzhen, China (深圳市南山區人民法院) on 21 March 2017 but after he has commenced this case in the family court of Hong Kong (“ Anti-suit Injunction Order ”). [1] 2. This is the husband’s application by way of his summons filed on 28 August 2018 for leave to appeal the Anti-suit Injunction Order. There is no appeal in respect of the Stay Order. 3. In this Decision, I shall adopt the abbreviations used in the Judgment. 4. The background and the litigation history of this case, as well as the various proceedings taken out by the husband in the PRC, including the 2017 PRC Proceedings are set out in §§6-29 and §§30-34 of the Judgment. It is helpful to highlight the following facts or findings by me: (1) The parties were married in the PRC in 2005 and resided in the Matrimonial Home in the PRC. They are two of the three shareholders of 3 HK Companies (the other shareholder is the husband’s sister). It is the wife’s allegation that the husband had diverted funds out of the HK Companies beyond her knowledge and reach, to which the husband has not expressly denied this allegation in his affirmations in reply; [2] (2) The husband had initiated at least 3 legal proceedings against the wife at various stages since 2016 in the jurisdiction of Hong Kong and the PRC against the assets under her name and/or in respect of his ancillary relief claims against her. These include the 2016 PRC Proceedings (commenced on 15 April 2016), these proceedings in Hong Kong (commenced on 26 May 2016) and the 2017 PRC Proceedings (commenced on 27 March 2017); (3) More particularly, he filed his petition for divorce in Hong Kong in May 2016. Decree absolute was granted on 27 January 2017 by the family court of Hong Kong. Four days after the grant of decree absolute, he commenced another set of litigation in the PRC, namely the 2017 PRC Proceedings, in respect of his ancillary relief claim against the wife. Pertinently, in the papers filed by him in the 2017 PRC Proceedings, he described that that the district court of Hong Kong SAR, in trying the divorce case of the parties, has not dealt with the assets and liabilities set out in his civil claim statement (「香港特別行政區區域法院在審理原告和被告離婚案件中，并未對上述財產和債務作出處理」). This is misleading in my view. The family court of Hong Kong is handling his ancillary relief claim and is in the process of various first appointment hearings on the ancillary relief matters; (4) Further, nowhere in his petition, Form E or other documents filed with this court (before his application for stay of proceedings) has he indicated that that he ever planned or wished to segregate the main suit from his ancillary relief claim by issuing separate legal proceedings for his ancillary relief claim in the PRC; (5) On the contrary, he participated actively and unequivocally in the Hong Kong proceedings for his ancillary relief claim against the wife (until he took out his application for stay of proceedings), which can be seen in the prayer of his petition, his Form E and the first appointment bundles filed by his solicitors. He expressly sought in his Form E (dated 23 November 2016) that the wife shall not dispose of the Matrimonial Home before “any judgment is delivered by the courts of Hong Kong” (in part 6.1), and that the loans taken out by her and secured by the Matrimonial Home be set aside, or that he shall not be held liable for the wife’s debts (in parts 5.5 and 6.5); (6) Due to the chronology of the case and in particularly the facts highlighted above, I found that the husband is guilty of forum-shopping/hopping, a practice which should be restrained to meet the ends of justice. Applicable Legal P rinciple 5. Section 63A(2) of the District Court Ordinance provides that leave to appeal shall not be granted unless: (1) the intended appeal has a reasonable prospect of success; or (2) there is some other reason in the interests of justice that the appeal should be heard. 6. The relevant test of whether an appeal has a reasonable prospect of success is whether the applicant can show that he has an arguable case with reasonable chances of success on appeal. A reasonable prospect of success therefore means an appeal with prospects that are more than “fanciful” but which do not need to be shown to be “probable”: SMSE v KL [2009] 4 HKLRD 125; KNM v HTF , HCMP 288/2011. P roposed G rounds of A ppeal 7. In the draft notice of appeal attached to the affirmation of his solicitors filed on 20 August 2018, the husband purports to set out 4 grounds of appeal, which in my view, actually boil down to 2 major grounds as follows: (1) I erred in law and in fact by concluding that that the husband is guilty of forum-shopping or forum-hopping; (2) I erred in law in my approach in granting the Anti-suit Injunction Order by: (a) not taking into account or sufficient account of the wife’s wrongful and/or unconscionable actions; (b) wrongly focusing upon the husband’s conduct, rather than the wife’s conduct; (c) failing to take into account of all relevant matters, such as the wife’s lack of allegation regarding whether and why the pursuit of the 2017 PRC Proceedings can be regarded as vexatious or oppressive in the light of the husband’s explanation; or such as whether the wife had a legitimate interest which needs to be protected by the grant of a restraining order. Error in finding of forum-shopping/hopping 8. In the Judgment, I concluded in §70 that the husband is forum-shopping/hopping. The basis of my conclusion is not merely on the 4 pieces of facts that are set out in §1 i) a) to d) of the draft notice of appeal. My conclusion is based on the overall chronology and finding set out in the earlier parts of the Judgment. 9. Importantly in this leave to appeal application, the husband has not sought to argue that the chronology set out by me in the Judgment is erroneous. 10. In the draft notice of appeal, the husband argues that I erred in failing to take into account that he petitioned for divorce in Hong Kong due to the refusal of the PRC court to assume jurisdiction, and erred in not according any or sufficient weight to the expert report. In his written submission, Mr Austin Yiu of counsel for the husband, argues that the expert report states that parties wishing to seek a divorce in the PRC must provide evidence as to their habitual residence in the PRC. However, the husband was not aware of the wife’s address at the material times and thus he could not commence his divorce in the PRC, but only in Hong Kong. He thus cannot be regarded as acting in bad faith and/or forum shopping (See: The Adhiguna Meranti [1987] HKLR 904). 11. To begin with, whether a party is guilty of forum-shopping is a finding of fact to be made by this court, but not by the expert. The expert did not give an opinion as to whether there was, or was not, evidence of “habitual residence” in this case. Mr Yiu argues that the husband did not know the address of the wife. But this line of submission does not sit well at all with the fact that in the 2016 PRC Proceedings initiated by him, the address of the Matrimonial Home was stated as her address, and that she is the registered owner of the Matrimonial Home. It is therefore erroneous for the husband to say that he did not know the address of the wife to be provided to the PRC court if he truthfully wished to divorce in the PRC. 12. Further, the husband has provided no documentary evidence, apart from his bare oral allegation, that the PRC courts had refused to assume jurisdiction of his intended divorce application, so that he had no choice but to file his petition for divorce in Hong Kong. 13. I conclude that there is no reasonable prospect of success in overturning my finding on forum-shopping. Wrong approach in granting the Anti-suit Injunction Order 14. I shall address to this proposed ground of appeal in the sequence of sub-points set out in §7(2) above. 15. In relation to §7(2)(a) above, Mr Yiu submits that this court has not taken into sufficient account that the wife did not come with clean hands. For example, she had sent a few men to threaten the husband and forced him out of the Matrimonial Home in March 2016; she had pledged the Matrimonial Home for raising various loans which she did not repay without informing the husband; and that such loans were obtained by her wrongfully by misrepresenting that she was a single woman and by presenting a certificate issued by the marriage registry of Hong Kong that she was single. 16. I am fully alive to the above allegations or facts, which are considered and set out by me in the Judgment (at §§15-18 and §§36-37) in concluding that the Anti-suit Injunction Order should be made. I have not expressly mentioned about the husband’s allegation that he was forced out of the Matrimonial Home by the wife in March 2016. Notably, this allegation of being forced out of the Matrimonial Home is in direct contradiction to the fact that one year later after he was allegedly forced out of the Matrimonial Home, he still gave the address of the Matrimonial Home as his residence in his civil claim statement (民事起訴狀) dated 21 March 2017 filed for the 2017 PRC Proceedings. 17. I shall deal with the grounds set out in §7(2)(b) and (c) above together. And before I go into the details, it must be remembered that the wife’s affirmations in relation to the application for anti-suit injunction were home-made. Shen was unpresented at those material times. 18. Mr Yiu accepts that the correct legal principles are set out in §67 of the Judgment, and thus the ultimate concern of the court is whether the grant of such injunction order would meet “the ends of justice”. Mr Yiu has not provided any authority that merely the conduct of the wife (ie the applicant of the injunction) alone should be considered by the court in granting or declining an anti-suit injunction order. In my view, it must be true that in an overall balancing exercise of all relevant factors, the court is required to consider the conduct of both parties, so as to meet the ends of justice. All the relevant factors are already set out in the chronology and the finding of the Judgment, upon considering of which I came to the conclusion that the conduct of the husband in orchestrating the causing duplicity of the Hong Kong proceedings and the PRC proceedings dealing with similar subject matters including the Matrimonial Home is a weighty factor in granting the Anti-suit Injunction Order. Here is what I have said in §70 of the Judgment: “70. In view of the chronology set out in the earlier parts of this judgment, there is no doubt in my mind that it is the husband who has orchestrated and caused the duplicity in having 2 sets of proceedings in 2 different jurisdictions but dealing similar subject matter(s), including the Matrimonial Home. It is clear to me that he is guilty of forum-shopping or forum-hopping, a practice which should not be endorsed by this court and thus should be restrained, in order to meet the ends of justice. His argument that he suffers prejudice of not being able to comply with the order of the PRC court is red herrings. I refuse to accept this line of argument. I conclude that a final anti-suit injunction should be ordered.” 19. The oppressiveness of the husband’s pursuit in the 2017 PRC Proceedings and the wife’s legitimate interest to protect must be understood in the context that it is her case that the husband has drained away the assets or money of the HK Companies and refused to provide the books of accounts of the HK Companies to her. [3] Therefore, it must be implicit that the pursuit of the 2017 PRC Proceedings by the husband would deprive her of the chance to investigate into these alleged dissipation of companies assets, due to the lack of a discovery process in the PRC legal system, and is thus oppressive. 20. The husband fails to show that he has any reasonable prospect of success on this ground/sub-grounds. Conclusion 33. Upon considering all the submission made by counsel for the respective parties, I reject the argument of the husband. And for the matters and reasons set out above, I shall make the following order: (1) the husband’s summons for leave to appeal the Anti-suit Injunction Order shall be dismissed; and (2) the husband shall bear the wife’s costs of this application to be taxed if not agreed, with certificate for counsel. Grace Chan District Judge Mr Austin Yiu instructed by Yan Lawyers for the petitioner (husband) Ms Isabel Tam instructed by Ho & Associates for the respondent (wife) [1] The wife has already given her undertaking to this court on 8 August 2017 that she shall maintain the status quo of all her assets under her name, including the Matrimonial Home, and shall not sell, rent out or mortgage or cause adverse encumbrances to the same without the approval of the court or the written consent of the husband. [2] Wife’s affirmation dated 18 August 2017 [60/§10] & husband’s affirmation dated 15 September 2017 [68/§7]. [3] Wife’s affirmation dated 3 October 2017. Look up this case on Lawcite Noteup",
  "length": 14304,
  "headers_seen": [
    "Introduction",
    "Applicable Legal P rinciple",
    "P roposed G rounds of A ppeal",
    "Error in finding of forum-shopping/hopping",
    "Wrong approach in granting the Anti-suit Injunction Order",
    "Conclusion"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkfc/2018/174",
  "query": "anti-suit injunction",
  "ts": "2025-10-16T10:46:57",
  "ok": true
}