{
  "title": "RE PROMAN INTERNATIONAL LTD | [2022] HKCFI 1450 | HKLII",
  "court": null,
  "year": 2016,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2022] HKCFI 1450 RE PROMAN INTERNATIONAL LTD HCCW215/2021 PAN SUTONG V. BANK OF CHINA LTD (TRADING AS “BANK OF CHINA LIMITED SHENZHEN BRANCH”) HCSD28/2021 Collapse Titles Judgment Information Date 17 May, 2022 Action No. HCCW215/2021 HCSD28/2021 Neutral Cit. [2022] HKCFI 1450 Parallel Cit. [2022] HKCLC 625 Download MS Word Judgment Reading Options Translation Toggle Highlight Appeal History HCCW215/2021 HCSD28/2021 HCSD28/2021 PAN SUTONG v. BANK OF CHINA LTD (Trading as “Bank of China Limited Shenzhen Branch”) HCSD 28/2021 HCCW 215/2021 [2022] HKCFI 1450 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE APPLICATION TO SET ASIDE STATUTORY DEMAND NO 28 OF 2021 _______________ BETWEEN PAN SUTONG (潘蘇通) Applicant and BANK OF CHINA LIMITED (中國銀行股份有限公司) (Trading as “Bank of China Limited Shenzhen Branch” “中國銀行股份有限公司深圳市分行”) Respondent _______________ IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE COMPANIES (WINDING UP) PROCEEDINGS NO 215 OF 2021 ________________ IN THE MATTER of Proman International Limited (保萬國際有限公司) and IN THE MATTER of Companies (Winding Up and Miscellaneous Provisions) Ordinance ( Cap. 32 ) ________________ (Heard together) Before: Hon Linda Chan J in Court Date of Hearing: 21 April 2022 Date of Judgment: 18 May 2022 _______________ J U D G M E N T _______________ 1. There are 2 applications before the court: (1) a winding up petition presented on 7 June 2021 (“ Petition ”) by the petitioner, Bank of China Limited trading as Bank of China Limited Shenzhen Branch (“ BOC ”), against Proman International Limited (“ Proman ”); and (2) an application dated 5 July 2021 by Mr Pan Sutong (“ Pan ”) to set aside a statutory demand (“ SD ”) served on him by BOC on 17 June 2021 (“ Application ”). 2. The applications are both concerned with the “2020 Master Agreement” (as defined in §17(4) below) and the “2020 Loan Agreement” (as defined in §19 below) under which Tianjin Huading Zhiye Ltd (天津華鼎置業有限公司) (“ Tianjin Huading ”) owed the “Subject Loan” (as defined in §19(1) below) to BOC. The Subject Loan was secured by inter alia (1) the “Pan Guarantee” (as defined in §18(1) below) and (2) the “Proman Guarantee” (as defined in §18(2) below) [1] (together “ 2020 Guarantees ”). Pan is the ultimate controller of Proman and Tianjin Huading. [2] 3. The Subject Loan was due on 14 April 2021 but not paid by Tianjin Huading. (1) On 22 April 2021, BOC served a statutory demand on Proman requiring it to pay RMB 691,978,062.29, being the principal of the Subject Loan and interest accrued up to 22 April 2021. (2) On 17 June 2021, BOC served the SD on Pan, requiring him to pay RMB 696,424,582.60, being the principal of the Subject Loan and interest up to 28 May 2021 (“ Debt ”). (3) As at the date of the hearing, the Debt has not been paid. 4. Proman and Pan (together “ Ps ”) contend that there are bona fide disputes in respect of the Debt on the following grounds: (1) The 2020 Guarantees were executed as a result of duress and are therefore unenforceable ( Duress Ground ). (2) The 2020 Loan Agreement is void or unenforceable for breaches of the Mainland law. Hence, no liability arises under the 2020 Guarantees. The conflicting expert evidence on Mainland law cannot be resolved without cross-examination ( Illegality Ground ). (3) The use of intended bankruptcy proceedings and the Petition constitute abuses of court process ( Abuse of Process Ground ). 5. On the other hand, BOC contends that the grounds advanced by Ps are untenable: (1) Duress Ground : the allegation is a recent fabrication as it is inconsistent with (a) Ps’ stance in April 2021 that Pan did not know about the 2020 Loan Agreement and the 2020 Guarantees; (b) the absence of any protest from Ps during the 4 years after the alleged imprisonment on 29-30 January 2016; (c) Pan’s companies continued to utilise the substantial facilities extended by BOC; and (d) Pan continued to sign a series of loan documents when he was in Hong Kong. (2) Illegality Ground : BOC’s relevant dealings with Pan and his companies had been the subject of regular reports to the regulatory authorities in the Mainland. There is no indication that anything was amiss. It is also clear from the Mainland law evidence that there can be no violation of any regulation which renders the contracts void. (3) Abuse of Process Ground : there is no triable issue which requires determination in arbitration and none has been commenced by Proman in respect of the Proman Guarantee. A. Background 6. Pan founded, owned and controlled 2 group of companies which he described as the “Goldin Group” and “Matsunichi Group” . (1) The Goldin Group engages in property development and provision of financial services: (a) At the apex of the property development arm is Goldin Properties Holdings Ltd (高銀地產控股有限公司) [3] (stock code 00283) (“ Goldin Properties ”), whose shares are listed on The Stock Exchange of Hong Kong Ltd (“ HKEx ”), and Pan owns 64.45% of its issued shares. Goldin Properties owns a number of direct and indirect subsidiaries including Goldin Properties (Tianjian) Co., Ltd (“ Goldin Tianjin ”) and Tianjin Huading. (b) At the apex of the financial services arm is Goldin Financial Holdings Ltd (高銀金融 (集團) 有限公司) (stock code: 0530) (“ Goldin Financial ”) whose shares are listed on HKEx and Pan owns 70.39% of its issued shares. (2) The Matsunichi Group engages in production, trading, research and development of electronic products and includes, inter alia : (a) Matsunichi Digital Development (Shenzhen) Co Ltd (松日數碼發展 (深圳) 有限公司) (“ MD ”), held through Goldin Real Estate Financial Holdings Ltd (高銀金融地產控股有限公司), a BVI company; and (b) Goldland Electronics (Shenzhen) Co Ltd (高先電子 (深圳) 有限公司) (“ GE ”) held through Absolute Glory Ltd, a BVI company. A1. Agreements and dealings prior to late-Jan 2016 Meetings 7. By the second half of 2013, MD and GE owed substantial amounts of debts to BOC. At around that time, BOC adjusted its trade finance policy and gave MD and GE a 2-year grace period (from August 2013 to July 2015) to adjust their operations. [4] During 2015: (1) BOC and MD entered into a credit line agreement dated 16 February 2015 which was secured by inter alia a maximum guarantee contract (2015年圳中銀司保額字第0004號最高額保証合同) executed by Pan on 17 February 2015 whereby he agreed to guarantee MD’s debt up to RMB 210 million (“ 17/2/2015 Guarantee ”). (2) After the grace period, MD and GE continued to face liquidity problems. In July, BOC stopped MD and GE from drawing any new loans. [5] (3) BOC and GE entered into a credit line agreement dated 30 September 2015 and the parties agreed that Pan would provide a guarantee up to the specified amounts in stages. (4) By letter dated 5 October 2015 to the Liaison Office of the Central People’s Government in the Hong Kong Special Administrative Region (香港中聯辦) (“ LOCPG ”), Pan described MD as one of the core businesses of Goldin Group and requested BOC to restructure the debts by converting the same into medium or long term loans (“ 1 st LOCPG Letter ”). (5) On 7 October 2021, the LOCPG requested BOC to actively consider Pan’s request. 8. According to the minutes produced by BOC, a series of meetings were held both internally and with Pan to discuss the debts owed by MD: (1) The meeting held on 22 October 2015 between BOC and Pan (who was accompanied by Mr Fred Zhou (周曉軍) (“ Zhou ”), an executive director of Goldin Properties); (2) The meeting held on 17 December 2015 between BOC and Pan (accompanied by Zhou). The minutes were signed by Pan; and (3) The meeting held on 13 January 2016 between BOC and Pan (accompanied by 周登超, a deputy general manager). Pan signed the minutes. 9. During the same period, Pan signed many documents [6] including the following documents (all written in Chinese) whereby Pan confirmed his agreement to guarantee the debts owed by MD and GE up to the specified amounts (collectively “ pre-late Jan 2016 Guarantees ”): (1) A maximum guarantee contract (最高額保證合同) < 2015 年圳中銀融保字第21號> dated 27 October 2015 (“ 27/10/2015 GE Guarantee ”) whereby Pan agreed to pay the amount owed by GE under the facility agreement “2015圳中銀融額協字第0000981號的 ” up to US$708,575,400, and to procure further security to be provided to BOC including (a) a mortgage over MD’s property right to 松日鼎盛大廈 and (b) a mortgage over his residential property in Shanghai; (2) A maximum guarantee contract (最高額保證合同) <2016 圳中銀融保字第004 號> dated 13 January 2016 (“ 13/1/2016 MD Guarantee ”) whereby Pan agreed to pay the amount owed by MD under the facility agreement “2015圳中銀司額協字第0000047號的 ” up to RMB 34 billion; (3) 2 letters of confirmation (確認書) dated 13 January 2016 whereby Pan confirmed that (a) any dispute relating to MD’s facility agreement “2015圳中銀司額協字第0000047號的 ” and the 13/1/2016 MD Guarantee shall be submitted to arbitration; and (b) if the accounts receivables of MD is not sufficient to cover its liability to BOC, he would pay the shortfall; (4) A letter of confirmation (確認書) dated 13 January 2016 that if the accounts receivables of GE is not sufficient to cover its liability to BOC, he would pay the shortfall; (5) A letter of commitment (承諾書) <2016 圳中銀SR 承諾第002號> dated 31 January 2016 whereby Pan agreed inter alia (a) to provide his 64.47% issued shares in Goldin Properties to BOC as security for MD’s debts and (b) an undertaking in the following term (§3): “本人承諾將積極籌集資金，不遲於2016年3月31日籌集不少於等值人民幣33 億元的資金用於清償松日數碼 [MD] 、高先電子 [GE] 在貴行的債務 ；不遲於2016年6月30日再籌集不少於等值人民幣67 億元的資金用於代為清償松日數碼、高先電子在貴行的債務 ” (underlined added) (6) A letter of commitment (承諾書) <2016 圳中銀SR 承諾第003 號> dated 31 January 2016 where Pan referred to (a) the 27/10/2015 GE Guarantee, (b) the 13/1/2016 MD Guarantee, and (c) the liquidity problem faced by MD and GE, and gave an irrevocable undertaking to procure various mortgages as security for the debts owed by MD and GE within half a month. A2. Late-Jan 2016 Meetings 10. It is not in dispute that on 29 January 2016, there was a meeting between BOC and Pan (accompanied by Zhou) to discuss the indebtedness of MD and GE. The matters discussed were recorded in the minutes prepared by BOC but not signed by Pan. BOC produced further minutes of internal meetings held on 30-31 January 2016 which recorded their internal discussions. 11. As further described below, Ps allege that at the meetings held on 30-31 January 2016 between BOC and Pan (accompanied by Zhou) in Beijing (“ late-Jan 2016 Meetings ”), BOC applied illegitimate pressure on Pan as a result of which he signed the “Initial Documents”. The Initial Documents include the pre-late Jan 2016 Guarantees (allegedly back-dated by BOC) and the following documents signed by Pan (allegedly post-dated by BOC) (collectively “ Feb 2016 Guarantees ”): (1) A maximum guarantee contract (最高額保證合同) <2016 圳中銀融保字第012號> dated 4 February 2016 whereby Pan agreed to pay the amount owed by MD under the facility agreement “2015圳中銀司額協字第0000047號的 ” (and the amendments thereto) which stood at US$3,597,153,570 and RMB 11,821,306,682.50. (2) A deed of guarantee (保證契據) dated 4 February 2016 (“ 4/2/2016 Deed of Guarantee ”) whereby Pan undertook to guarantee the liabilities of all the companies owned or controlled by him, which were defined (in clause 1.1) as: “ 潘先生集團 ” 是指潘蘇通、其所擁有的公司、以及其所擁有控制權的公司，包括, 但不限於, 松日數碼發展 (深圳) 有限公司 [MD] 及高先電子 (深圳) 有限公司 [GE]，而潘蘇通或任何一間屬於潘先生通集團的成員以下稱為 “ 集團成員 ” Immediately before Pan’s signature was a statement which reads as follows: “本人通過簽署本契據確認，本人已依本人的自由意志簽訂和簽署本契據，並承認本人已獨立諮詢法律意見。” (3) A letter of commitment (承諾書) dated 4 February 2016 where Pan referred to (a) the 27/10/2015 GE Guarantee, (b) the 13/1/2016 MD Guarantee, (c) the liquidity problem faced by MD and GE, and gave an irrevocable undertaking to reduce the debts owed by MD and GE to less than RMB 32 billion by the end of 2016. A3. 2017 Credit Agreements and 2017 Guarantees 12. MD and GE’s debts were extended in March 2017, before being partly rolled over in August 2017 (collectively “ 2017 Credit Agreements ”). In respect of such debts, Pan signed the following documents to guarantee MD and GE’s debts (collectively “ 2017 Guarantees ”): (1) A deed of confirmation (確認契據) dated 28 March 2017 confirming his agreement to guarantee the debts owed by, inter alia , MD and GE pursuant to the 4/2/2016 Deed of Guarantee; (2) A maximum guarantee contract (最高額保證合同) <2017 圳中銀融保字第016號> dated 25 August 2017 whereby Pan agreed to guarantee MD’s debt up to US$3,596,858,652 and RMB 11,813,249,153.47; and (3) A maximum guarantee contract (最高額保證合同) <2017圳中銀融保字第022號> dated 25 August 2017 whereby Pan agreed to guarantee GE’s debt up to US$708,479,163. A4. Restructuring of debts in 2018 and 1 st Transfer 13. By letter dated 17 July 2018 addressed to LOCPG (“ 2 nd LOCPG Letter ”): (1) Pan expressed his gratitude for BOC’s support and efforts in restructuring his companies’ debts since October 2015, and the steps taken by his companies to provide additional security to BOC in this way: “2015年10月以來，企業與中國銀行積極溝通， 配合中國銀行對存量債務進一步追加擔保措施，基本做到了抵質押物價值足額覆蓋貴行授信 。在中國銀行的支持下，企業對融資產品結構與期限進行了再安排，達到了較好的效果，松日數碼等企業目前均保持正常按期還息。同時，企業經營方面實施了戰略調整，逐步收縮松日數碼等電子加工板塊的生產經營，重點發展內地與香港房地產板塊，已取得積極成效。” (underlined added) (2) Pan asked LOCPG to coordinate with BOC for further support in (a) devising a reasonable plan for his companies to repay the debts, (b) providing further indulgence to his electronic business in view of its cashflow issue, and (c) supporting the development projects in Tianjin. 14. On 25 July 2018, the LOCPG forwarded the 2 nd LOCPG Letter to BOC’s headquarter and requested BOC to support Pan. As a result, in December 2018 and following extensive reviews and negotiations by both sides [7] , RMB 22 billion of MD’s debts were transferred (“ 1 st Transfer ”) to Goldin Tianjin [8] , a company controlled by Pan . 15. For the purpose of the 1 st Transfer, BOC (Shenzhen and Tianjian Branches), MD, GE and Goldin Tianjin entered into an Overall Repayment Agreement (整體還款安排協議) dated 17 December 2018 which stated, inter alia , that: (1) MD and GE shall be referred to as “松日系債務人”; (2) MD owed US$3,596,858,652 and RMB 11,807,949,153.47 to BOC under the 2017 Credit Agreements (recital §§3-4); (3) GE owed US$708,479,163 to BOC, being the maximum amount under the 2017 Credit Agreements (recital §6); (4) Goldin Tianjin had executed a Third Party Repayment Agreement (債務代償協議) dated 17 December 2018 to confirm its agreement to pay MD’s liability to BOC up to RMB 22 billion (recital §7); and (5) The parties agreed that 松日系債務人 (i.e. MD and GE) and Goldin Tianjin shall ensure that the debts owed to BOC would not exceed (a) RMB 30 billion by 31 December 2019; (b) RMB 25 billion by 30 June 2020, and (c) RMB 20 billion by 31 December 2020 (cl.1.1). 16. Despite the above restructuring of the debts, MD, GE and Tianjin Goldin were unable to keep the overall debts to the level stipulated in the Overall Repayment Agreement. A5. 2 nd Transfer, 2020 Master Agreement, 2020 Loan Agreement and 2020 Guarantees 17. In January 2020, following reviews from both sides and their lawyers, Tianjin Huading agreed to assume RMB 5 billion of the debts owed by MD and GE under the 2017 Credit Agreements (and the subsequent agreements entered into in 2019) (“ 2 nd Transfer ”) by entering into the following agreements stated to have been executed on 12 January 2020: (1) An Application for Debt Repayment (債務代償申請書), which referred to (a) the US$708,479,163 owed by GE to BOC, (b) the US$2,086,747,864.89 owed by MD to BOC and (c) Tianjin Huading’s intention to assume GE and MD’s liability to repay RMB 5 billion to BOC; (2) A Third Party Repayment Agreement (債務代償協議) made between BOC, MD, GE and Tianjin Huading, whereby Tianjin Huading agreed to assume GE and MD’s liability to repay RMB 5 billion to BOC; (3) An Overall Repayment Agreement (整體還款安排協議) made between BOC (Shenzhen and Tianjin Branches), Goldin Tianjin, Tianjin Huading, MD and GE whereby the parties agreed that Tianjin Huading would assume MD and GE’s liability to repay RMB 5 billion to BOC ; (4) A credit line agreement (授信額度協議) <2020 圳中銀戰額協字第001號> (“ 2020 Master Agreement ”) whereby the parties agreed inter alia that (a) BOC shall advance an one-off facility of RMB 5 billion to Tianjin Huading; and (b) the agreement is governed by Mainland law and any dispute arising from the agreement shall be submitted to Shenzhen International Arbitration Tribunal (深圳國際仲裁院) for arbitration; (5) A guarantee whereby Pan agreed to guarantee Tianjin Huading’s liability under the 2020 Master Agreement up to RMB 5 billion; and (6) A guarantee whereby Proman agreed to guarantee Tianjin Huading’s liability under the 2020 Master Agreement up to RMB 5 billion. 18. As security for Tianjin Huading’s liability under the 2020 Master Agreement: (1) Pan executed a deed of guarantee (保證契據) <2020年圳中銀戰保字第010號> dated 15 February 2020 (“ Pan Guarantee ”) whereby Pan agreed to guarantee Tianjin Huading’s liability under the 2020 Master Agreement. The Pan Guarantee is governed by Hong Kong law (cl.13) and the parties agreed to submit to the non-exclusive jurisdiction of the Hong Kong court (cl.14); (2) Proman executed an undated maximum guarantee contract (最高額保證合同) <2020 年圳中銀戰保字第007號> (“ Proman Guarantee ”) whereby Proman agreed to guarantee Tianjin Huading’s liability under the 2020 Master Agreement. The Proman Guarantee is governed by Mainland law and any dispute arising from the guarantee shall be submitted to Shenzhen International Arbitration Tribunal for arbitration (cl.14). 19. Separately, BOC and Tianjin Huading entered into another loan agreement (借款合同) <2020 圳中銀戰借字第011號> dated 12 January 2020 (“ 2020 Loan Agreement ”) whereby the parties agreed, inter alia, as follows: (1) BOC shall advance a 5-year term loan of RMB 656,000,000 to Tianjin Huading (“ Subject Loan ”) for the specific purpose of repaying the debts owed by GE to BOC; (2) the Subject Loan is to be secured by, inter alia , the guarantees executed by Tianjin Huading and its related parties (cl.9(1)); and (3) the agreement is governed by Mainland law and any dispute arising from the agreement shall be submitted to Shenzhen International Arbitration Tribunal for arbitration (cl.16). A6. Demands made by BOC in 2021 20. By an acceleration notice dated 9 April 2021 issued to, inter alios , Tianjin Huading, MD, GE, Pan and Proman, BOC referred to the 2020 Master Agreement and the 2020 Loan Agreement and the multiple events of default which had occurred and demanded Tianjin Huading to repay RMB 4,199 million to BOC by 14 April 2021 (“ Acceleration Notice ”). 21. Upon Tianjin Huading’s failure to pay the amount demanded under the Acceleration Notice: (1) By letter dated 16 April 2021 BOC through its solicitors, Messrs. King & Wood Mallesons (“ KWM ”), referred to the 2020 Master Agreement, the 2020 Loan Agreement and the Acceleration Notice, and demanded Pan to pay RMB 691,113,461.12 to BOC within 21 days; and (2) In response, Pan through a letter dated 28 April 2021 issued by his solicitors, Messrs. Zhong Lun Law Firm LLP (“ ZL ”), to KWM, replied that he had no knowledge of the Pan Guarantee or the Subject Loan (“本所客戶對題述函件及附件中所聲稱的各協議並不知情”). 22. As described in §3 above, on 22 April 2021, BOC served a statutory demand on Proman requiring it to pay RMB 691,978,062.29. On 17 June 2021, BOC served the SD on Pan, requiring him to pay the Debt. 23. Further, BOC applied to the Tianjin court for bankruptcy against Tianjin Huading. The application was opposed by Tianjin Huading on the ground that the 2020 Loan Agreement was illegal. The Tianjin court declined to entertain BOC’s application for reason not known to the parties. B. Discussion 24. There is no dispute that the agreements set out in section A5 above were signed by the parties. Nor is there any dispute that BOC had advanced the Subject Loan to Tianjin Huading and the same has not been repaid. 25. Where a debtor disputes the debt in question, it bears the burden to show that there is a bona fide dispute on substantial grounds and, for this purpose, must adduce sufficiently precise factual evidence to substantiate its allegations. The Companies Court is not precluded from examining the evidence and taking a view on whether the debt is disputed on substantial grounds, but the Court does not try the dispute on affidavits ( Re Hongkong Bai Yuan International Business Co Ltd [2022] HKCFI 960 §23). 26. Another principle relevant to the applications is that persons of full age and understanding are bound by the documents they signed unless they can establish a recognised legal basis to disown such documents. For this purpose, the facts constituting the particular vitiating factor relied on must be pleaded and established by the evidence ( Ming Shiu Chung & ors v Ming Shiu Sum & ors (2006) 9 HKCFAR 334 at §§84-87, per Ribeiro PJ). In the context of winding up and bankruptcy proceedings where there are no pleadings, the court expects the party seeking to disown the documents signed to be able to give particulars on his allegations and adduce sufficiently precise factual evidence to substantiate such allegations. 27. With the above principles in mind, I turn to consider each of the ground advanced by Ps. B1. Duress Ground 28. The Pan Guarantee is governed by Hong Kong law while the Proman Guarantee is governed by Mainland law. 29. Mr Rimsky Yuen SC [9] submits that whether Hong Kong or Mainland law is applicable depends on the law which would govern if the contract were valid ( Conflicts of laws in Hong Kong, 3 rd ed., at §5.010). He submits that under Hong Kong law: (1) There are 2 elements in the wrong of duress: (a) illegitimate pressure amounting to compulsion of the will of the victim; and (b) causal effect of such pressure on the victim. (2) The legitimacy of the pressure depends on: (a) whether the pressure is lawful; and (b) the nature of the demand which the pressure is applied to support. The threat of any unlawful action will generally be regarded as illegitimate ( R v. AG for England and Wales [2003] E.M.L.R. 24 at §16). The question of legitimacy may also be examined by reference to a range of factors, including: (a) whether the person exerting the pressure acted in good faith; and (b) whether the victim had any realistic alternative but to submit to the pressure. (3) The concept of duress to the person has its own rules of causation. “But for” causation is not required. It is sufficient that the threat was a reason for the victim entering the contract. The victim does not have to show that he would not have entered the contract without the threat, or that he has no realistic alternative but to enter into the contract. Once it is shown that the threats to the person were made for the purpose of inducing the contract, the burden is reversed such that it is for the party who made the threats to prove that the threats were not even “a reason” causing the victim to enter into the contract ( Liao Zhiqiang v Cheung Sin Ling [2022] HKCFI 892 at §§90-91; Re Dai Yumin [2022] HKCFI 950 at §§106-110). (4) The threat to commence proceedings may amount to illegitimate pressure for the purpose of duress (a) where the proceedings amounts to an abuse of process or malicious prosecution ( Enonchong,Duress, Undue Influence and Unconscionable Dealing, 3 rd edn., at §§3-017, 3-018; Sheikh Tahnoon Bin Saeed Bin Shakhboot Al Nehayan v Ioannis Kent (aka John Kent) [2018] EWHC 333 (Comm) at §§187 & 212-213); or (b) the threat to commence proceedings was made on the basis of past unlawful action ( Enonchong, §3-031; Times Travel (UK) Ltd v Pakistan International Airlines Corp [2021] UKSC 40 at §4). This principle applies to insolvency proceedings, as it is an abuse of process to threaten to wind up a company or to bankrupt an individual where there exists a bona fide dispute. 30. As regards Mainland law, Mr Yuen submits that the principles on duress are similar to that under Hong Kong law [10] and may be summarised as follows: (1) Duress occurs when a person causes compulsion of the will to the victim, by way of illegitimate means. This includes illegitimate threats or damage against the person’s life, health, reputation or property. (2) The elements of “duress” include: (a) the threatener had an intention to effect duress, (b) the threatener committed acts of duress objectively, (c) the act of duress is illegitimate, such as illegitimate pressure or demand, and (d) the victim submitted for fear of the duress. (3) Depending on the facts, threats to commence litigation or the commencement of litigation could both constitute acts of duress by itself. (4) The victim of duress has the right to revoke the contract (no legal effect ab initio ), and the victim also has a right to damages. Besides, duress could give rise to claims for compensation in tort (e.g. trespass to the person, false imprisonment or intimidation, etc). (5) Mainland law recognizes the concept of continuing coercion. Where the coercion continues, the time limitation of one year will run from the date when the date of the act of coercion ceases. 31. Mr Bernard Man SC [11] does not dispute the above principles. He submits that the court may conclude that the allegations of physical duress did not raise bona fide dispute on substantial grounds taking into account (1) the 2 elements on the wrong of duress (pressure amounting to compulsion of the will of the victim and illegitimacy of the pressure) and (2) the factors such as whether the debtor had access to independent advice, whether he had time to consider the documents in question and whether he took steps to avoid the contract he seeks to disown ( Dundee Greentech Ltd v Dao Yumin [2022] HKCFI 950 ). 32. Ps’ case on duress seems to be a moving goalpost and kept expanding both in terms of when the alleged duress took place and which documents were affected by such duress. At this Court’s request, Mr Yuen clarifies Ps’ case on duress as follows. (1) In October 2008 Goldin Properties disposed of GE to a purchaser whose ultimate owner was a business acquaintance of Pan. Since then, Pan has ceased to have any interest in GE. But for BOC’s duress, Pan would not have provided any guarantee or any of his or his companies’ assets as security for the debts owed by GE. (2) The “ 1 st stage ” of duress was administered on Pan at the meeting on 22 October 2015 albeit that Pan did not sign any document. (3) The “ 2 nd stage ” of duress took place at the late-Jan 2016 Meetings during which Pan was subject to threats of death and false imprisonment by BOC. Consistent with similar threats made at the “1 st stage”, BOC’s representatives threatened that [12] : (a) There were other businesspersons who had already “died” or “killed” in jail, although they were indebted to state-owned entities (just like BOC) for much smaller sums. (b) The Commission for Discipline Inspection had wide-ranging powers for detention, and could have Pan jailed indefinitely. (c) If Pan chose to leave the meeting, there would be “serious consequences”; Pan would not be “saved” and would not be able to leave Beijing. Pan must at least execute the documents, failing which Pan would not be allowed to leave the meeting room. Instead, his detention would be transferred elsewhere. (4) As a result of such threats, Pan had no real alternative but to sign all the Initial Documents on 30 January 2016 which were either back-dated or post-dated by BOC to the dates stated on those documents. [13] (5) The “3 rd stage” of duress took place when Pan signed the 2020 Master Agreement, the 2020 Loan Agreement and the 2020 Guarantees on 12 January 2020 and 15 February 2020. As Pan had already signed the Initial Documents, he had no alternative but to succumb to BOC’s demands. (6) In his skeleton, Mr Yuen also refers to Pan’s affirmations where he tries to disown the agreements relating to the debts owed by MD and GE signed during the period from March 2016 to January 2020 on the basis that they were “caused to be signed by Pan under the influence of BOC’s threats” and that Pan was “subject to continuous threats by BOC. This was in additional to the continuing impact of the threats of death and imprisonment” [14] . The allegations do not fall within any of the 1 st to 3 rd stages of duress. In any event, the allegations are so lacking in particulars and contradictory to the fact that Pan and the representatives of the companies within the Goldin Group and the Matsunichi Group signed all the documents in question. 33. In my judgment, Ps’ case on duress is inherently improbable and can only be described as “practically moonshine”. The allegations are not supported by any contemporaneous document and is contradictory to the objective facts as well as Pan’s own conduct in dealing with BOC. The story rings very hollow when viewed against the background facts which show that far from exerting any duress on Pan, for over 5 years (from at least 2015 to 2020): (1) BOC gave multiple and very generous indulgences to Pan and the companies within his Groups so as to allow them to trade out of their financial difficulty; (2) Pan was able to enlist, and did benefit from, the support of LOCPG in October 2015 and July 2018 to request BOC to restructure his companies’ debts so as to avoid BOC taking enforcement actions against him and his Groups; (3) BOC continued to support Pan and his Groups by advancing very substantial loans and facilities to, inter alia , MD and GE and the companies benefitted from the continuation of such facilities; (4) BOC obtained and relied on the many agreements signed by Pan in which he consistently confirmed his agreement to guarantee the indebtedness of MD and GE and to provide his assets or his Groups’ assets as security for such debts; and (5) In particular, Pan on 5 different occasions span across 5 years signed multiple personal guarantees as security for the debts owed by MD and GE. These include (a) the 17/2/2015 Guarantee, (b) the pre-late Jan 2016 Guarantees, (c) the Feb 2016 Guarantees, (d) the 2017 Guarantees, and (e) the Pan Guarantee. 34. So far as the “1 st stage” of duress is concerned, it is bound to fail as there was no compulsion on the will of Pan, and Pan did not sign any agreement. 35. The “3 rd stage” of duress is equally demurrable: (1) On Pan’s case, the real “cause” for his signing the 2020 Master Agreement, 2020 Loan Agreement and Pan Guarantee was the fact that he had already signed the Initial Documents. There was no illegitimate pressure applied by BOC on Pan, let alone one which compelled him to sign these agreements in 2020. (2) Although there is a vague allegation that Pan was “subject to continuous threats by BOC”, Mr Yuen clarifies at the hearing that it is not alleged that any threats or pressure were administered on Pan when he signed the agreements, but that he thought he had no choice but to sign them. 36. That being the case, it is strictly speaking not necessary to consider whether the alleged “2 nd stage” of duress gives rise to a bona fide dispute on substantial grounds in respect of the debts payable by Pan under the pre-late Jan 2016 Guarantees as the Debt is not based on such Guarantees. 37. For these reasons alone, I do not think that there is any merit in the Duress Ground or that it gives rise to any bona fide dispute on substantial grounds in respect of the Debt. 38. Nevertheless, I shall set out the reasons why I consider Pan’s case on duress bears all the hallmarks of a recent fabrication, in case this matter goes further. 39. First , the main thrust of Pan’s case is that in the absence of any duress, he would not have agreed to provide any guarantee or any of his or his companies’ assets as security for the debts of MD and GE. The allegation cannot be true: (1) As stated in §7(1)-(3) above, in 2015, that is, before any of the alleged duress took place, Pan had already provided the 17/2/2015 Guarantee in respect of MD’s debt. After the grace period, in September 2015, Pan further agreed to provide a guarantee in respect of GE’s debt in stages. (2) In the 1 st LOCPG Letter, Pan described MD as one of the core businesses of Goldin Group (which, in turn, was owned and controlled by him). The Letter shows that Pan was desperate to restructure the debts so as to avoid BOC taking enforcement action against him and his Groups. There was no need for BOC to resort to any duress, let alone extreme measures as “death threats” or “false imprisonment”. 40. Second , the allegation that since 2008 Pan has ceased to have any interest in GE is flatly contradicted by the following documents: (1) the contents of the pre-late Jan 2016 Guarantees which show that Pan treated GE as his company; (2) As recorded in the meeting minutes dated 30 July 2015, Pan promised BOC that he would procure GE to provide a repayment plan within one week; (3) Even before the late-Jan 2016 Meetings, Pan had signed the pre-late Jan 2016 Guarantees. In addition, he also signed the 27/10/2015 GE Guarantee for up to USD 708,575,400 (§9(1) above). There is no suggestion that this Guarantee was signed under any duress [15] . Pan’s belated assertion that this document was only signed under duress at the late-Jan 2016 Meetings [16] is obviously untrue as it is contradicted by the letter of confirmation dated 2 November 2015 where GE confirmed that Pan had signed the 27/10/2015 GE Guarantee. This letter is not a document included in Mr Yuen’s list; (4) Pan also had access to GE’s audited accounts for at least 2016, 2018 to 2020, consistent with the fact that he owned and controlled GE; (5) Although Pan claims that GE was owned by a “Taiwanese businessman” [17] and he obtained the accounts from GE because of the “cordial commercial relationship with [him] and/or entities owned or controlled by [him]”, the assertion cannot be accepted as he is not able to name the “Taiwanese businessman” or produce any document to substantiate his assertion; (6) Clause 1.1 of the 4/2/2016 Deed of Guarantee described Pan’s companies as including but not limited to MD and GE (§11(2) above); (7) The 2017 Guarantees where Pan confirmed his agreement to guarantee the debts owed by GE (and MD) (§12 above); and (8) The Overall Repayment Agreement dated 17 December 2018 referred to MD and GE as “松日系債務人” and treated their indebtedness in the same manner (see §15 above). 41. The above objective facts show that at all material times Pan owned and controlled MD and GE. There was every reason for Pan to provide personal guarantee and assets controlled by him as security for the debts owed by MD and GE in return for BOC’s agreement to restructuring their debts, which was the only way to avoid BOC declaring an default and taking enforcement actions against MD and GE and the security held by BOC. 42. Third , as Mr Man submits, Pan’s allegation that he was intimidated and falsely imprisoned during the late-Jan 2016 Meetings can only be a recent fabrication, having regard to the following facts and matters: (1) After obtaining legal advice from ZL on KWM’s demand letter dated 16 April 2021, Pan asserted that he had “no knowledge” (並不知情) of the Pan Guarantee and the Subject Loan, without the slightest suggestion of any duress, intimidation or false imprisonment. (2) ZL had since at least early February 2016 represented Pan and his companies. [18] If the alleged acts of intimidation and detention had happened, instructions to the same effect would have been given by Pan to ZL, and no sensible lawyer would say that Pan had “no knowledge” of the documents signed. (3) Pan’s only explanation for such discrepancy is that “an agreement which was forced upon me simply could not [be] an agreement in the true sense of the word” [19] , which is a desperate argument and is utter nonsense. (4) Although Pan asserts that he reported the alleged duress to the police [20] and consulted lawyers contemporaneously, he is unable to produce a single document in support of his assertion. (5) Pan and his companies have had access to lawyers in Mainland and Hong Kong as well as in-house counsel after the late-Jan 2016 Meetings and throughout his dealings with BOC. [21] (6) Contrary to Ps’ submissions, neither the minutes of the 22 October 2015 meeting nor the 4 February 2016 meeting suggest any kind of “death threats” or “false imprisonment”. (7) In his letter to BOC in September 2020, Pan vaguely alleged, for the first time, that he was pressured to sign various documents at the late-Jan 2016 Meetings. There was no allegation that he was subject to false imprisonment or physical threats. Instead, the letter was couched in extremely courteous terms. BOC refuted the allegations unequivocally in its letter dated 30 September 2020. Pan never responded and did not repeat the allegation even when he was asked to honour the Pan Guarantee in April 2021. (8) In the answers filed by Tianjin Huading on 10 June 2021 for the purpose of the ongoing Shenzhen arbitration between BOC and Tianjin Huading, there was no reference to any alleged duress. 43. Fourth , the alleged duress is inconsistent with Pan’s conduct in continuing to deal with BOC after the late-Jan 2016 Meetings without any complaint or concern. These include: (1) Pan signed the 2017 Credit Agreements so as to benefit from the extensions granted by BOC to MD and GE in March 2017 and in August 2017 (§12 above); (2) Pan signed the 2017 Guarantees in respect of the debts owed by MD and GE (§12(1)-(3) above); (3) Pan wrote the 2 nd LOCPG Letter to express his gratitude for BOC’s support and efforts in restructuring his companies’ debts since October 2015 and the steps taken by his companies to provide additional security to BOC. Pan thanked BOC for the arrangements and expressly affirmed his commitment to pay off the debts (§13 above); (4) Pan agreed to and signed documents relating to the 1 st Transfer in December 2018 as part of the restructuring of the debts owed by MD and GE (§§14-15 above); (5) Pan agreed to the 2 nd Transfer in January 2020, thereby enabling his companies to benefit from the 2020 Master Agreement (§§17-19 above); and (6) He signed the Pan Guarantee on 15 February 2020 (see §18 above). 44. Fifth , in respect of the 1 st Transfer effected in December 2018 and the 2 nd Transfer effected in January 2020, some of the agreements in question were signed by the representatives of the companies concerned, not Pan. There is no affirmation made by any of these representatives to suggest that they signed the agreements under any duress. 45. Sixth , the alleged duress is also contradicted by the meetings’ minutes: (1) The minutes show that before the late-Jan 2016 Meetings, Pan had repeatedly promised to provide an unconditional personal guarantee and pledge his shares in Goldin Properties and Goldin Financial as security. Specifically, in the minutes dated 30 July 2015, Pan even wrote that: “非常感謝中國銀行坦誠、實際的溝通”. This shows that Pan’s assertion that the personal undertakings and securities were only offered as a result of the duress and intimidation at the late-Jan 2016 Meetings [22] is demonstrably false. (2) The minutes for the meetings on 30 July 2015, 17 December 2015 and 13 January 2016 were all signed by Pan. (3) In Pan 1 st Annex 1, Pan listed the documents that he says he was forced to sign on 30 January 2016, all of which were not dated 30 January 2016. They did not include any meeting minutes (even though he already had the unsigned versions of some of the minutes). (4) It was only after BOC had exhibited the signed meeting minutes that Pan belatedly alleged that these minutes were also signed on 30 January 2016 [23] . This is nothing but a desperate attempt on Pan’s part to explain away contemporaneous documents which expose the falsity of his allegations. 46. Seventh , Mr Man submits that the allegation that a state-owned entity like BOC would, in the presence of dozens of people (including some of the most senior officials of BOC), blatantly and explicitly threaten and detain a wealthy, resourceful and well-connected individual such as Pan, is absurd and most inherently incredible. I agree. 47. Lastly , on 31 January 2016, Zhou (who attended the late-Jan 2016 Meetings) attended and posed for photos at the Snow Polo World Cup held in Tianjin. If (as Pan alleges) he and Zhou had just been detained for over 30 hours and subject to continuous death threats, it would be wholly surprising for Zhou – who was legally educated and claims to have substantial experience in the legal field including having worked as legal consultant [24] – to then immediately proceed to take part in this kind of event and behaved as if nothing had happened. B2. Illegality Ground 48. Mr Yuen submits that there are triable issues as to the legality of the 2020 Loan Agreement for violation of Mainland law in that: (1) As a matter of Mainland law, the debts owed by MD and GE had since late 2015 been potentially “non-performing loans”. [25] Under Article 34 of the General Rules for Loans, non-performing loans include bad loans, idle loans, and overdue loans. [26] Notice No. 42 from the China Banking Regulatory Commission (“ CBRC ”) sets out the conditions upon which non-performing loans may be upgraded to performing loans (at §6). [27] (2) By around 2020, the default on the loans was very serious and MD and GE were “heavily balance sheet insolvent”. [28] The debts owed by MD and GE were potentially non-performing loans. (3) By executing the 2020 Master Agreement and/or the 2020 Loan Agreement in order to repay the non-performing loans (“借新還舊”), BOC plainly sought to conceal that the loans were non-performing loans or bad debts. [29] (4) This was in breach of Notice No. 42 from the CBRC as reflected by a decision of the China Banking and Insurance Regulatory Commission. [30] It was also be in breach of the public policy and regulatory requirements of Mainland that commercial loans must only be extended to property developers for the purposes of property development (see Notice No. 359 from the People’s Bank of China and China Banking Regulatory Commission and Notice No. 121 from the People’s Bank of China). [31] (5) Further, the loan transfers to Tianjin Huading would be injurious to the interests of the other creditors of Tianjin Huading, which could invalidate the loan agreements. [32] (6) In the circumstances, the 2020 Master Agreement and/or 2020 Loan Agreement would be void and unenforceable as a matter of Mainland law. [33] 49. Mr Man submits that Ps’ points are wholly unmeritorious for the following reasons. 50. First , BOC plainly did not conceal any non-performing loans or bad debts given that: (1) BOC duly reported the debt situation of Pan’s companies to the Mainland authorities from time to time. The relevant reports have been exhibited to BOC’s affirmations. Pan has no answer to this except to assert [34] that these reports might be forged, or that they might not have been delivered to the Mainland authorities, which are both desperate and groundless speculations. (2) The Mainland authorities have not found, charged, or commenced any investigations in respect of, any concealment of bad debts on the part of BOC. This is so even after Pan’s camp has openly raised this allegation in other actions between the parties, including the Shenzhen arbitration and the bankruptcy proceedings in Tianjin. [35] This confirms that BOC has done nothing wrong. (3) Contrary to Ps’ submissions, the Tianjin Intermediate People’s Court has not accepted or made any finding on Ps’ allegation of illegality. In fact, no court or tribunal has done so. 51. Second , the 2 nd Transfer did not violate any of the Notices relied on by Ps. As explained in Jiang 1 st §30, these Notices are concerned with regulating the inflow of capital into the real estate market and have no application where (as here) the loan was obtained by the real estate company for the sole purpose of paying off an intra-group indebtedness. As noted above, what BOC did was within the full cognizance of the regulatory authorities. 52. Third , it is clear that even if BOC has contravened the Notices, it will not affect the enforceability of the 2020 Master Agreement or the 2020 Guarantees in that: (1) It is inherently highly unlikely the Subject Loan will become irrecoverable simply because BOC has breached the Notices. Such a result will give a massive windfall to Ps, who had already obtained the benefit of these loans voluntarily, and be hugely unjust to BOC. (2) BOC’s expert has explained why it is clear that the agreements will remain enforceable. In gist (Jiang 1 st §§31-47): (a) According to the guidance issued by the Supreme People’s Court on 8 November 2019 commonly known as 九民紀要, any violation of a regulation (規章) will not generally affect the enforceability of the contract. (b) The Notices are merely “normative documents” (規範性文件), “not regulations”, and breach of which will not affect the enforceability of the agreements. (c) Further, in a judgment dated 31 December 2019, the Supreme People’s Court held that a breach of the 2007 Notice would not render the relevant loan agreement unenforceable since the notice is neither a “legislation” (法律) nor a “administrative regulation” (行政法規): p.13 of the judgment. The same reasoning and conclusion ought to apply to the other Notices. 53. Fourth , the allegation that BOC maliciously conspired with Tianjin Huading to act against the latter’s creditors is nonsense. This is neither side’s case and is baseless. The 2 nd Transfer was obviously done with a view to assisting Pan’s companies as well as increasing BOC’s returns, just like any other debt restructuring. 54. Mr Yuen has not been able to refute any of the points made by Mr Man. This is not surprising given that all that Ps’ expert has been able to say in his opinion is that it is “ possibl e” that the 2020 Master Agreement and/or the 2020 Loan Agreement is invalid. The possibility is at best a theory and is militated by the fact that the CBRC, which had received quarterly reports from BOC about the debts owed by Pan’s companies including the Subject Loan, did not raise any concern about the propriety of the debts, the restructurings of the debts including the 1 st and 2 nd Transfers and the 2020 Master Agreements, the 2020 Loan Agreement or the 2020 Guarantees. 55. I would add that Ps have made much criticism on the independence of BOC’s expert (Mr Jiang) [36] . The criticism is wholly without merit as Mr Jiang has disclosed in his report the fact that he had acted for Bank of China (Hong Kong) Ltd (“ BOCHK ”) in the past. [37] In any event, I do not see why having acted for BOCHK it can be said that Mr Jiang is not independent as BOCHK is a listed company in Hong Kong, which is a different entity from BOC. B3. Abuse of Process Ground 56. Mr Yuen advances 3 points under this Ground: (1) It is an abuse of process for BOC to have presented the Petition and served the SD when it knew that the 2020 Guarantees were only executed as a result of duress ( 1 st point ). (2) The right to present a petition for bankruptcy is a class right. It is an abuse of process for BOC to have intended to present a second petition against the same debtor ( 2 nd point ). (3) The court should dismiss the Petition as the Proman Guarantee contains an arbitration clause and the dispute should be resolved by arbitration. Proman satisfies the first 2 requirements of Lasmos Ltd v. Southwest Pacific Bauxite (HK) Ltd [2018] 2 HKLRD 449 . Although no arbitration has been commenced by Proman, that was because of the “prohibitively high” costs of arbitration in the region of RMB 42 million. In any event, in its letter dated 31 March 2022, Proman clearly stated that it intended to resolve the dispute with BOC by way of arbitration. As such, the petition should be dismissed or at least stayed ( 3 rd point ). 57. The 1 st point does not arise in light of my findings on the Duress Ground. 58. The 3 rd point can be disposed of briefly: (1) The court would only require the parties to resolve the dispute through arbitration if there is a “genuine dispute” or “ bona fide dispute on substantial grounds” in respect of the debt ( Hongkong Bai Yuan International business Co., Ltd [2022] HKCFI 960 , §§27-28; Re Guy Kwok Hung Lam [2021] HKCFI 2135 , §49). (2) In light of my conclusion on the Duress Ground, there is no genuine dispute between Ps and BOC which requires to be resolved in arbitration. In any event, the parties have already incurred costs and filed extensive evidence and submissions in respect of the Petition, it would be a waste of time and costs to require the parties to submit their dispute on the Proman Guarantee to arbitration. (3) Even if Lasmos principles are the governing principles, Proman has failed to satisfy the 3 rd requirement as it has not commenced any arbitration, despite having been served a statutory demand by BOC almost a year ago. Proman’s assertion that it “clearly has a genuine intention to have the matter resolved by arbitration” cannot be accepted, given how Pan and his companies have repeatedly sought to stay or terminate all the litigations and arbitrations brought by BOC [38] . 59. I turn to the 2 nd point. 60. Mr Yuen’s contends that the right to petition for bankruptcy is a class right. As such: (1) It is most unusual for 2 bankruptcy (or winding up) petitions pending simultaneously in respect of the same debtor. Consistent with the concept of class remedy, the law and practice are based upon the notion that there should only be one petition against a debtor at any one time ( Re China Greenfresh Group [2021] 3 HKC 1 at §4, per Harris J, following Edgeworth Capital (Luxembourg) SARL v Maud [2020] EWHC 1469 (Ch) at §98). (2) In the analogous winding up context, it has been said that a supporting creditor should appear in the original petition as a supporting creditor, and apply for substitution when necessary. In the absence of exceptional circumstances, issuing another petition will be an abuse of process ( Re Grand Peace Group Holdings Ltd [2021] 4 HKC 364 at §3). (3) This may also be viewed as an aspect of the general principle against the bringing of two claims before the court for the same relief ( Buckland v Palmer [1984] 1 WLR 1109 at 1114H-1115B; The Pertamina [1986] HKC 78 at 84B-C; Beneficial Finance Corp Limited v East Coast Printed Circuits Pty Ltd 7 ACSR 79 at p.80). (4) Similarly, in the bankruptcy context, it should be an abuse for a creditor to issue a petition where an extant petition is pending determination. This is especially because, where the original petitioner has not prosecuted the petition with due diligence, an unpaid creditor may apply for substitution under s.102 of the Bankruptcy Ordinance ( Cap. 6 ) (“ BO ”): Re Wong Wai Dai [2001] 2 HKLRD 465 , §§16-19. (5) An unpaid creditor cannot be prejudiced as one objective of the substitution mechanism is to allow the preservation of the commencement period in the public interest ( Re Hin-Pro International Logistics [2016] 5 HKLRD 282 at §14). (6) In the winding up context, if a winding-up order is set aside on appeal, then another person may apply to be substituted in the original petition ( McPherson & Keay: Law of Company Liquidation, 5 th edn, §3-145, citing Re Goldthorpe and Lacey Ltd (1987) 3 B.C.C. 595). (7) Despite the absence of statutory provisions, it has been the practice of the court to allow supporting creditors to appear at the hearing of bankruptcy petition (eg., Re Cheung Chun Yuen Barry , HCB 1223/2014, 15 April 2015 at §6; Re Yeung Kang Lam , HCB 5166/2005, 3 October 2005) at §14). 61. As China CITIC Bank (“ CITIC ”) has already presented a bankruptcy petition against Pan which will be determined by this Court on 7 June 2022, BOC’s threat to present a petition against Pan must be an abuse of process. Alternatively, the court should grant a case management stay of the SD or direct BOC not to present a bankruptcy petition pending final determination of CITIC’s petition. The court has jurisdiction to do so under rule 48 (7) of the Bankruptcy Rules ( Cap. 6A ) (“ BR ”), which confers a wide discretion as to the date on which a creditor may present a petition ( HSBC v Hui Shu Leung , HCSD 36/1999, 26 November 1999). 62. Mr Man contends that the 2 nd point should be dismissed in limine as the point was only raised in Pan 3 rd §§51-52 filed on 1 April 2022, in breach of: (1) The consent orders made by Anthony Chan J and this Court which stated that “no new issue is to be raised in the reply evidence without the leave of the court”; and (2) rule 47 of the BR, which provides that the grounds of a debtor’s application to set aside a statutory demand should be stated in his supporting affidavit. 63. These breaches cause substantial prejudice, as BOC has no opportunity to adduce evidence on its reasons for proceeding in the way it did. It is not open to Pan to ask the court to conclude that there is an abuse of process when he has deprived the other side of a proper chance to file evidence to deal with the point. 64. Mr Yuen is unable to provide any answer to the point. Nor has he applied for leave to allow Ps to raise the 2 nd point. For this reason alone, the 2 nd point must be rejected. 65. However, as the same point has been raised by Pan in HCB 6830/2021, which concerns a bankruptcy petition presented by Xinhua Financial Network Ltd, I will set out the reasons as to why I consider that the 2 nd point is misconceived. 66. Amongst the many cases cited by Mr Yuen, the only cases which may lend support to his proposition are Re China Greenfresh Group and Edgeworth Capital. However: (1) Re China Greenfresh Group is concerned with a winding up petition, not bankruptcy petition. The passages cited by Harris J came from Edgeworth Capital. (2) Edgeworth Capital is a bankruptcy case. As can be seen from §98, the basis for holding that it is most unusual for 2 bankruptcy petitions pending simultaneously is that under the English Insolvency Rules, there are specific rules in relation to bankruptcy proceedings which provide for (a) other creditors to give notice of an intention to appear to support or oppose an existing petition; and (b) a supporting creditor to be substituted for the original petitioner under rule 10.27 (eg. if the original petitioner wishes to withdraw the petition) or for a change of carriage of the petition under rule 10.29 (eg. if the original petitioner neglects to prosecute the petition). Snowden J considered that the proper construction of rule 10.149(i) is to enable the court to give priority as expenses of the bankruptcy those costs which relate to the petition upon which the bankruptcy order is made but not the costs of the other petition upon which no order has been made (§§99-100). (3) Unlike the Insolvency Rules, our BR do not contain any provisions which allow a creditor to file a notice of intention to appear and to support or oppose the petition. Nor do they allow a creditor to apply for substitution if the petitioner wishes to withdraw the petition. (4) While s.102 of the BO provides for substitution, the ground is limited to a situation where “the petitioner does not proceed with due diligence on his petition”. As Kwan J held in RE Wong Wai Dai , at 468I-469B, the court is empowered to dismiss or substitute as petitioner any other creditor only where it is established that the original petitioner does not proceed with due diligence on his petition. 67. In respect of a creditor’s right to present a second petition against the debtor, I do not think one can equate bankruptcy proceedings with winding up proceedings as they are governed by different Ordinances and Rules. For winding up proceeding which is a class remedy there are rules designed for creditors to participate in the petition already presented against the company, viz., (a) rule 30 [39] allows every persons who intends to appear on the hearing of the petition to file a notice of intention to appear on petition; (b) rule 31 requires the petitioner to prepare and make available a list of the persons who have given notice of their intention to appear on the hearing of the petition; and (c) rule 33 allows any creditor or contributory to apply for substitution as the petitioner. No such rules can be found under the BR. 68. Not only is there no provision under the BO or the BR which supports Ps’ contention that it is an abuse of process for a creditor to present a second petition against the same debtor, in fact, s.101 of the BO envisages that more than one petitions are presented against the same debtor: “Where 2 or more bankruptcy petitions are presented against the same debtor or against the same joint debtors the court may consolidate the proceedings or any of them on such terms as the court thinks fit.” 69. On the fact of this case, it is impossible to see how Ps can suggest that BOC’s act in serving the SD or that it intended to present a bankruptcy petition constitutes an abuse of process. The SD was served on Pan in June 2021, well before CITIC presented its petition against Pan in November 2021. [40] 70. I would add that at the hearing, Mr Yuen confirms that even if this Court holds against Pan on the 2 nd point, he will not object to BOC taking step to support the CITIC petition at the coming hearing. The confirmation is sought because this Court is keen to avoid wasting any further costs and the court’s time in adjudicating on another bankruptcy petition against Pan in circumstances where the court finds, as I do, that there is no valid ground to set aside the SD, such that Pan is deemed insolvent by virtue of s.6A(1)(a) of the BO. C. Disposition and Costs 71. For the reasons set out above, I reject all the grounds advanced by Ps in opposition to the Petition and in support of the Application to set aside the SD. I make the following order: (1) There be a usual winding up order against Proman; (2) The Application to set aside the SD is dismissed; and (3) BOC is authorized to present a bankruptcy petition against Pan forthwith. 72. The costs of the Petition are to be dealt with as part of the usual winding up order. 73. As for the costs of the Application, I make a costs order nisi that Pan shall pay the costs of and occasioned by the Application to BOC on an indemnity basis, to be taxed if not agreed with certificate for 2 counsel. It is appropriate to order Pan to pay costs on a higher scale as most of the costs were incurred by the parties in dealing with the Duress Ground which I find to be a recent fabrication and completely devoid of merit. (Linda Chan) Judge of the Court of First Instance High Court Mr Rimsky Yuen SC and Mr William Wong SC leading Mr Lai Chun Ho and Mr Adrian Lee, instructed by Charles Chu & Kenneth Sit, for the Applicant in HCSD 28/2021 and the Respondent in HCCW 215/2021 Mr Bernard Man SC leading Mr Thomas Wong, instructed by King & Wood Mallesons, for the Respondent in HCSD 28/2021 and the Petitioner in HCCW 215/2021 The Official Receiver is absent [1] Pan Guarantee [B1/32/404-422] [2] Corporate chart [B6/167/1627-1628] [3] Formerly known as Matsunichi Communication Holdings Ltd [4] Fang 1 st §11.1 [5] Fang 1 st §11.2 [6] A full list of which is summarized in Annex 5 to Niu 1 st [7] Niu 1st §§32-35 [8] See Application for Debt Repayment, Third Party Repayment Agreement [9] Appearing with Mr William Wong SC and leading Mr Lai Chun Ho and Mr Adrian Lee [10] Relying on Ps’ expert evidence §§46-61 [11] Leading Mr Thomas Wong [12] Pan 1 st §§19, 28-40 [13] See also Pan 1 st §§38-39 ; Pan 2 nd §6; Pan 3 rd §§12-13, 20-21 [14] Pan 1 st §§43-54 [15] Despite the fact that the point was raised in Niu 1 st [16] Pan 1 st §38(1) [17] Pan 3rd §18(2) [18] Emails between Zhou and Richard Zeng of ZL [19] Pan 1 st §61(3) [20] Pan 1 st §61(1); Pan 3 rd §25 [21] Zeng 1 st §§4, 7, 9 [22] Pan 1 st §43(1) [23] Pan 3 rd §13 [24] Screenshot of Goldin Financial’s website [25] Pan Expert 1 st , §35 [26] Pan Expert 1 st , §35 [27] Pan Expert 1 st , §35 [28] Pan Expert 1 st , §36 [29] Pan Expert 1 st , §§35(ii) and (iii)-36 [30] Pan Expert 1 st , §§35 and 38 [31] Pan Expert 1 st , §§38-41, 《关于加强商业性房地产信贷管理的通知》（银发(2007) 359号）第一条第二款,《关于进一步加强房地产信贷业务管理的通知 》（银发 (2003) 121号）第一条第三款 [32] Pan Expert 1 st , §42,《民法典》第一百五十四条 [33] Pan Expert 1 st , §43 [34] Hua 2 nd §27 [35] Pan 1 st §§69(3), 70(2) [36] Pan 3 rd §§37-38; Ps’ Skeleton §§31-36 [37] Jiang 1 st §5; Mr Jiang’s CV [38] Niu 1 st §§65-93 [39] Of Companies (Winding-up) Rules ( Cap. 32H ) [40] Niu 1 st §108 Look up this case on Lawcite Noteup",
  "length": 60656,
  "headers_seen": [
    "A. Background",
    "A1. Agreements and dealings prior to late-Jan 2016 Meetings",
    "A2. Late-Jan 2016 Meetings",
    "A3. 2017 Credit Agreements and 2017 Guarantees",
    "A4. Restructuring of debts in 2018 and 1 st Transfer",
    "A5. 2 nd Transfer, 2020 Master Agreement, 2020 Loan Agreement and 2020 Guarantees",
    "A6. Demands made by BOC in 2021",
    "B. Discussion"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2022/1450",
  "query": "costs of arbitration",
  "ts": "2025-10-16T10:45:23",
  "ok": true
}