{
  "title": "CHOW YUEN LING, THE ADMINISTRATRIX OF THE ESTATE OF CHOW PUI KEE, DECEASED V. KWAN LAU YING | [2014] HKDC 836 | HKLII",
  "court": null,
  "year": 2014,
  "date": null,
  "content": "HKLII Databases District Court [2014] HKDC 836 CHOW YUEN LING, THE ADMINISTRATRIX OF THE ESTATE OF CHOW PUI KEE, DECEASED V. KWAN LAU YING Judgment Information Date 29 Jul, 2014 Action No. DCMP1203/2013 Neutral Cit. [2014] HKDC 836 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History DCMP1203/2013 DCMP1203/2013 CHOW YUEN LING, the administratrix of the estate of CHOW PUI KEE, Deceased v. KWAN LAU YING DCMP 1203/2013 IN THE DISTRICT COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION MISCELLANEOUS PROCEEDINGS NO 1203 OF 2013 -------------------------- IN THE MATTER of Portion A of B1 on 3/F Hoi Hing Building Nos 32-34 Fuk Chak Street, Nos 35-47 Li Tak Street, Nos 2-16A Kok Cheung Street Kowloon (“the Property”) and IN THE MATTER of Section 17 of the Limitation Ordinance ( Cap 347 ) -------------------------- BETWEEN CHOW YUEN LING, the administratrix of the estate of CHOW PUI KEE, Deceased Plaintiff and KWAN LAU YING Defendant -------------------------- Before : Deputy District Judge Teresa Wu in Court Date of Hearing : 14 April 2014 Date of Judgment : 30 July 2014 -------------------------- JUDGMENT -------------------------- Introduction 1. The plaintiff is the administratrix of the estate of Chow Pui Kee, deceased (“the Deceased”). 2. The defendantis the registered owner of the property situated at Portion A of B1 on 3/F Hoi Hing Building Nos 32-34 Fuk Chak Street, Nos 35-47 Li Tak Street, Nos 2-16A Kok Cheung Street Kowloon (“the Property”). 3. By way of originating summons dated 7 May 2013 (“the Originating Summons”), the plaintiff seeks, inter alia , the following:- (1) A declaration that the defendant had discontinued possession of the Property or alternatively was dispossessed of the same from 1 June 1991; (2) The plaintiff has been in adverse possession of the Property for a period of 20 years as at 1 June 2011; (3) The defendant’s title to the Property was extinguished by section 17 of the Limitation Ordinance ( Cap 347 ) on 1 June 2011; and (4) The plaintiff has become the owner absolute in possession of the Property since 1 June 2011. 4. On 24 August 2013, Master Timon Shum made an order that service of the Originating Summons shall be deemed to have been effected on the defendant on the day when a notice of the present proceedings is published in the Hong Kong Commercial Daily and the defendant is required to file Acknowledgement of Service within 14 days thereafter. 5. On 5 September 2013, the plaintiff published notice of the present proceedings in the Hong Kong Commercial Daily. The defendant did not file any Acknowledgement of Service within 14 days thereafter or at any time. 6. On 8 October 2013, HH Judge Kent Yee made an order as follows:- (1) Leave be given to the plaintiff to file and serve further affirmations within 56 days; (2) All affirmations filed by the plaintiff, namely, the Affirmation of Chow Yuen Ling, the Affirmation of Yeung Ying, the 2 nd Affirmation of Chow Yuen Ling and the Affirmation of Ho Wai Kit, shall, subject to any contrary directions of the trial judge, stand as evidence in chief; (3) Hearing of the Originating Summons be adjourned to a date to be fixed in consultation of counsel’s diary before ajudge in court with 2 hours reserved; and (4) Notice of the trial date be given to the defendant by the plaintiff by way of substituted service within 14 days after itis fixed. 7. The trial has been scheduled to take place on 14 April 2014 at 2:30 pm (“the Trial”). 8. On 20 February 2014, the plaintiff published notice of the date of the Trial in the Hong Kong Commercial Daily. 9. The defendant has not turned up in court. The Trial has proceeded in his/her absence as scheduled. Material facts 10. The plaintiff relies on the following material facts in support of her claim:- (1) By an assignment dated 20 June 1988, Excellent Career Limited sold the Property to the defendant for $126,000. The defendant has become the registered owner of the Property since then. (2) By a provisional sale and purchase agreement dated 10 April 1991, Ms Wong Chau Yuet (“Ms Wong”), not being the registered owner, purported to sell the Property to Ms Ng Kam Sin (“Ms Ng”) for $145,000. (3) In or about May 1991, Mr Cheung Kei Chong (“Mr Cheung”) and Ms Wong, not being the registered owners, purported to sell the Property to Mr Yeung Fung Yun (“Mr Yeung”). (4) In or about June 1991, Mr Yeung moved into possession of the Property. By a provisional sale and purchase agreement dated 5 March 2004, Mr Yeung, not being the registered owner, purported to sell the Property and/or the right to reside therein to the Deceased for $100,000. The Deceased paid a deposit of $3,000 to Mr Yeung. (5) On 9 March 2004, the Deceased paid the balance of $97,000 to Mr Yeung. The Deceased moved into the Property and resided therein until his death on 18 May 2006. 11. Mr Leung, the counsel for the plaintiff, submits that the Deceased had been in adverse possession of the Property for over 20 years as a successive squatter since June 1991 as follows:- (1) In 1991, neither Ms Wong nor Mr Cheung was the registeredowner of the Property. (2) The purported sale and purchase of the Property by Mr Cheung and/or Ms Wong to Mr Yeung in or about May 1991 did not constitute a lawful conveyance of title. The defendant has remained to be the registered owner of the Property. (3) Mr Yeung had not entered into possession of the Property in June 1991 with the defendant’s licence or permission and was thus an adverse possessor. (4) When Mr Yeung purported to sell the Property to the Deceased on 5 March 2004, no lawful title de jure could have been passed to the Deceased as Mr Yeung had never been the registered owner of the Property in the first place. (5) The Deceased had succeeded Mr Yeung and had become an adverse possessor of the Property since 2004. (6) After the Deceased passed away on 18 May 2006, the Plaintiff has been in adverse possession of the Property. (7) Successive periods of adverse possession can be “added-up” to establish a claim in adverse possession for over 20 years. By virtue of section 17 of the Limitation Ordinance , taking into account the periods of successive adverse possession since June 1991, the title of the defendant as registered owner of the Property should have been extinguished by 1 June 2011. 12. Mr Leung submits alternatively that,if the court finds that the Deceased and his predecessors had only come into adverse possession of the Property after the statutory cut-off date of 1 July 1991, the relevant limitation period should be 12 years. He refers to Cheung JA’s decision in Yu Siu Cheuk v Realray Investments Limited , CACV 181/2009 (unreported, judgment dated 10 November 2009):- “29. At the hearing before us, I raised the issue whether the plaintiff could also rely on 12 years’ adverse possession to defeat the title of the defendant. In the statement of claim the plaintiff has certainly pleaded that he has been in adverse possession of the property in excess of 20 years and also ‘in excess of 12 years’ before the commencement of the action. It is true that for the purpose of deciding whether a 20 years’ or 12 years’ limitation period will apply, the plaintiff has said that he has entered prior to the cutoff date of 1991 and hence has to establish a 20 years’ adverse possession. But if the objective evidence shows that adverse possession only began at a much later day but is long enough to cover a period of 12 years prior to the commencement of the action (namely in February 1995), I cannot see any reason why the plaintiff is not entitled to rely also on the shorter period to establish his claim.” Applicable legal principles 13. The Court of Appeal in Yu Kit Chiu & Others v Chan She Woo , CACV 137/2010 (unreported, judgment dated 18 February 2011) summarized the applicable legal principles of adverse possession:- “15. A person claiming to be in adverse possession must be shown to have both factual possession and the requisite intention to possess animus possidendi . This requirement has been authoritatively affirmed by the Court of Final Appeal in Wong Tak Yue v Kung Kwok Wai & Another (No 2) (1997-1998) 1 HKCFAR 55 which approved the principles enunciated by Slade J in Powell v McFarlane (1979) 38 P&CR 452 and adopted in the subsequent line of cases such as R v Secretary of State for the Environment ex p Davies (1990) 61 P&CR 487, Buckinghamshire County Council v Moran [1990] Ch 623 . 16. The intention to possess involves the intention, in one’s own name and on one’s own behalf, to exclude the world at large, including the owner with the paper title if he be not himself the possessor, so far as is reasonably practicable and so far as the process of law will allow (per Slade J in Powell at pp 471-472). The question of intention is one of facts.” … 18. In J A Pye (Oxford) Ltd and another v Graham and another [2003] 1 AC 419 , the House of Lords affirmed the principles stated by Slade J in Powell . Lord Browne-Wilkinson at paragraphs 32 to 38 referred to the history of the English Limitation Act (upon which the Hong Kong Limitation Ordinance is based) and discussed the confusion in this area of the law…He held at paragraph 36, that ‘Many of the difficulties with these sections which I will have to consider are due to a conscious or subconscious feeling that in order for a squatter to gain title by lapse of time he has to act adversely to the paper title owner. It is said that he has to ‘oust’ the true owner in order to dispossess him; that he has to intend to exclude the whole world including the true owner; that the squatter’s use of the land has to be inconsistent with any present or future use by the true owner. In my judgment much confusion and complication would be avoided if reference to adverse possession were to be avoided so far as possible and effect given to the clear words of the Acts. The question is simply whether the defendant squatter has dispossessed the paper owner by going into ordinary possession of the land for the requisite period without the consent of the owner. 19. He continued to state at paragraph 37 that ‘The taking or continuation of possession by a squatter with the actual consent of the paper title owner does not constitute dispossession or possession by the squatter for the purposes of the Act.’ and ‘there will be a ‘dispossession’ of the paper owner in any case where (there being no discontinuance of possession by the paper owner) a squatter assumes possession in the ordinary sense of the word. Except in the case of joint possessors, possession is single and exclusive. Therefore if the squatter is in possession the paper owner cannot be. If the paper owner was at one stage in possession of the land but the squatter’s subsequent occupation of it in law constitutes possession the squatter must have ‘dispossessed’ the true owner for the purposes of [our section 8(1)] [paragraph 38].’ … 21. The only matter that Lord Browne-Wilkinson said Slade J had erred was his reference in pages 476 and 478 to the necessary intention as being an ‘intention to own’. Lord Browne-Wilkinson held that ‘Once it is accepted that in the Limitation Acts , the word ‘possession’ has its ordinary meaning (being the same as in the law of trespass or conversion) it is clear that, at any given moment, the only relevant question is whether the person in factual possession also has an intention to possess: if a stranger enters on to land occupied by a squatter, the entry is a trespass against the possession of the squatter whether or not the squatter has any long term intention to acquire a title [paragraph 42].” 14. Bokhary PJ in Cheung Yat Fuk v Tang Tak Hong & Others (2004) 7 HKCFAR 70 stated:- “4. There is no difficulty in aggregating the period of possession by the 1 st respondent personally and the period of possession by him through his tenant. The legal position was neatly expressed in Shelmerdine v Ringen Pty Ltd [1993] 1 VR 315 , a decision of the Supreme Court of Victoria (Appeal Division) cited by Mr Gerard McCoy SC for the respondents. There Brooking J said (at p. 341) that ‘where the adverse possession has been continuous, it is possible to tack the possession of one intruder on to that of another although there has been non assignment of possessory rights.” 15. In this relation, I also refer to paras 35-021 to 35-023 of Megarry & Wade’s The Law of Real Property (8 th edition) concerning successive squatters:- “(a) Dispositions by squatter. As already explained, a squatter has a title based on his own possession, and this title is good against everyone except the true owner. Accordingly, if a squatter who has not barred the true owner sells the land he can give the purchaser a right to the land which is as good as his own. The same applies to devises, gifts or other dispositions by the squatter, and to devolution on his intestacy; in each case the person taking the squatter’s interest can add the squatter’s period of possession to his own. Thus if X, who has occupied A’s land for eight years, sells the land to Y, A will be barred after Y has held the land for a further four years. (b) Squatter dispossessed by squatter. If a squatter is himself dispossessed the second squatter can add the former period of occupation to his own as against the true owner. This is because time runs against the true owner from the time when adverse possession began, and so long as adverse possession continues unbroken, it makes no difference who continues it. But as against the first squatter, the second squatter must himself occupy for the full period before his title becomes unassailable. This has already been explained, but a simple example may be useful here. If land owned by A has been occupied by X for eight years and Y dispossesses X, A will be barred when 12 years have elapsed from X first taking possession. But although at the end of that time A is barred, X will not be barred until 12 years from Y’s first taking possession; for Y cannot claim to be absolutely entitled until he can show that everybody with any claim to the land has been barred by the lapse of the full period. (c) Possession abandoned . There is no right to add together two periods of adverse possession if a squatter abandons possession before the full period has run and some time passes before either someone else takes adverse possession or he retakes adverse possession of the land. During the gap between the two squatters, the owner has possession in law, and there is no person whom he can sue. The land therefore ceases to be in adverse possession; and when adverse possession is taken by the second squatter a fresh right of action accrues to the true owner, who has the full period within which to enforce it.” Evidence & findings of fact 16. Both the plaintiff and Mr Wong Hoi Cheung (“Mr Wong”) have given evidence in the Trial. On the other hand, Ms Yeung Ying (“Ms Yeung”), who made the Affirmation of Yeung Ying on 9 July 2013, has not. I accept Mr Leung’s submission that due and considerable weight should nevertheless be given to Ms Yeung’s evidence as contained in her affirmation because a large part of it is supported by contemporaneous documents. 17. Having considered the evidence of the plaintiff, Mr Wong and Ms Yeung, I am satisfied that the Deceased had been in adverse possession of the Property for over 20 years as a successive squatter since June 1991:- (1) There is no evidence to show that the defendant had given licence or permission to Mr Yeung to enter into possession of the Property from June 1991 until 2004 when he purported to sell the Property to the Deceased. Ms Cheung and Ms Wong, who were not the registered owners of the Property, could not have conveyed any legal title to Mr Yeung in May 1991. Mr. Yeung had dispossessed the defendant as registered owner by going into ordinary possession of the Property in June 1991 with the intention to possess. (2) Mr Wong gives evidence that he had lived in Hoi Hing Building from 1960s to 2013. In 1991, he was appointed as a member of the Owners’ Committee. He had been responsible for collecting management fees from each unit personally since 1992. He was further appointed as the Secretary of the Incorporated Owners from 1994 to 2013. (3) Mr Wong also gives evidence that he had become acquainted with Mr Yeung and Ms Ng as couple after the establishment of the Incorporated Owners. Mr Wong recalls that he had collected management fees from Mr Yeung and Ms Ng, as well as a Ms Law, since 1992. Mr Yeung and Ms Ng had only stopped paying management fees when they moved out from the Property in 2004. (4) It is Ms Yeung’s evidence that she had witnessed the purported sale and purchase of the Property by Mr Yeung to the Deceased in 2004. Ms Yeung had been given $10,000 as witnessing fee. In the provisional sale and purchase agreement dated 5 March 2004, it was expressly stated that Mr Yeung had no legal title to the Property and he was only selling a “right to reside” to the Deceased. Ms Yeung (like Mr Wong) also gives evidence that Mr Yeung and Ms Ng were a married couple. (5) When the Deceased went into possession of the Property, he knew that Mr Yeung was not the registered owner. The Deceased had succeeded Mr Yeung to dispossess the defendant as registered owner by going into ordinary possession of the Property with the intention to possess. (6) Mr Wong gives evidence that after the moving out of Mr Yeung and Ms Ng and before the moving in of the Deceased, there might be a period of time when no one actually resided in the Property. Mr Wong mentions with caution that he had not verified because he did not have access to the Property. On the assumption that there was such a vacant period, the question to be asked is whether it could be said that Mr Yeung and Ms Ng had abandoned adverse possession of the Property before the Deceased retook it subsequently. In other words, could it be said that the Property had ceased to be in adverse possession upon departure of Mr Yeung and Ms Ng, and when the Deceased took adverse possession of the Property as a new squatter, a fresh right of action had accrued to the defendant such that the defendant should be given the full period to enforce it. The facts and evidence do not support that Mr Yeung had abandoned the Property. To the contrary, it is clear that Mr Yeung had purported to sell his “right” to the Deceased, and the Deceased moved into possession of the Property after having obtained such “right” from Mr Yeung. (7) According to the plaintiff’s evidence, the Deceased told her that he had acquired the Property from a Mr Yeung in 2004. The Deceased also told the plaintiff that he had acquired the Property partly to avoid his wife. The Deceased had shown the plaintiff around the Property in 2005. The plaintiff is able to describe the layout, setting and furniture of the Property. The plaintiff also gives evidence that the Deceased had rented out the Property. (8) The Deceased had been responsible for paying all the outgoings of the Property including management fees, government rates and utility fees etc. during his possession of the Property. Mr Wong recalls one occasion when the Deceased went to look for him in the management office in 2005. The Deceased told Mr Wong that he had become in charge of the Property. The Deceased had settled all outstanding management fees of the Property. (9) Since the death of the Deceased in 2006, the plaintiff and her sister have seized the only set of keys of the Property. The plaintiff gives evidence that they have managed to find the provisional sale and purchase agreement of the Property signed by the Deceased and Mr Yeung and some floor plans in the Property. The plaintiff and her sister have taken possession of the Property thereafter. They have renovated the Property before renting it out to different tenants. (10) The plaintiff has been responsible for paying all the outgoings and maintenances of the Property. Mr Wong gives evidence that he had received payment of management fees from the plaintiff after the death of the Deceased. (11) On the other hand, Mr Wong had not seen the defendant during his residence in Hoi Hing Building . 18. In the premises, I agree with Mr Leung’s submission that the Property had been adversely possessed by the Deceased and his predecessors for over 20 years since June 1991. By 1 June 2011, the defendant’s title in the Property as the registered owner should have been extinguished. Conclusion 19. I shall make an order in terms of paragraphs 1 to 3 of the Originating Summons. There shall be no order as to costs. 20. I also give leave to the plaintiff to serve a sealed copy of the order herein on the defendant in the same manner as ordered by HH Judge Kent Yee on 8 October 2013. ( Teresa Wu ) Deputy District Judge Mr Adrian Leung, instructed by V Hau & Chow, for the plaintiff The defendant was not represented and did not appear Look up this case on Lawcite Noteup",
  "length": 21025,
  "headers_seen": [
    "Introduction",
    "Material facts",
    "Applicable legal principles",
    "Conclusion"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkdc/2014/836",
  "query": "adverse possession",
  "ts": "2025-10-17T10:44:13",
  "ok": true
}