{
  "title": "KAMLING INTERNATIONA LTD V. FIRST RESOURCES (HK) DEVELOPMENT LTD | [2023] HKCFI 1713 | HKLII",
  "court": null,
  "year": 2023,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2023] HKCFI 1713 KAMLING INTERNATIONA LTD V. FIRST RESOURCES (HK) DEVELOPMENT LTD Judgment Information Date 29 Jun, 2023 Action No. HCA281/2022 Neutral Cit. [2023] HKCFI 1713 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCA281/2022 HCA281/2022 KAMLING INTERNATIONA LTD v. FIRST RESOURCES (HK) DEVELOPMENT LTD HCA 281/2022 [2023] HKCFI 1713 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE ACTION NO 281 OF 2022 _____________ BETWEEN KAMLING INTERNATIONA LIMITED Plaintiff (錦寧國際有限公司) and FIRST RESOURCES (HK) DEVELOPMENT LIMITED Defendant (第一資源(香港)發展有限公司) _____________ Before: Hon Mimmie Chan J in Chambers Date of Hearing: 23 June 2023 Date of Decision: 30 June 2023 _____________ D E C I S I O N _____________ 1. The parties do not dispute that on 7 March 2016, they entered into a Loan Agreement whereby the Plaintiff agreed to advance USD1 million to the Defendant (“ Contract ”). The Contract contains an arbitration clause, which provides that in the event of disputes which cannot be settled by mediation, the parties agree to arbitrate their dispute in Chengdu, applying PRC law: “雙方同意以仲裁方式解決糾紛，適用法律爲中國法律，仲裁地爲成都。” 2. The Plaintiff claims that the Defendant had defaulted in making payment under the Contract, and on 4 March 2022 commenced these proceedings against the Defendant to seek recovery. The Statement of Claim was filed and served only on about 23 November 2022. 3. On 6 January 2023, prior to filing any Defence, the Defendant applied by summons to stay these proceedings to arbitration pursuant to section 20 of the Arbitration Ordinance (“ Summons ”), relying on the arbitration clause to claim that the commencement of these proceedings constituted a breach of the parties’ arbitration agreement. Such application was opposed by the Plaintiff, evidence was filed by both parties for and against the stay application, and the hearing was scheduled for 23 June 2023. 4. In the Affirmation of Peng YouHong of the Plaintiff which was signed on 7 June 2023, the Plaintiff claimed that it had in fact commenced arbitration against the Defendant with the Chengdu Arbitration Commission on the Mainland (“ CAC ”) on 18 March 2019, but that it was notified by CAC that the arbitration clause in the Contract was defective and that CAC could not proceed with the arbitration. According to the Plaintiff, it had no alternative but to withdraw the application for arbitration in July 2019, as is evidenced by a Decision of CAC issued on 12 July 2019, referring to the Plaintiff’s request for withdrawal. 5. On the Plaintiff’s case, it commenced a second arbitration with CAC again in December 2019. CAC declined to accept the request for arbitration, as is evidenced by its Notice dated 4 December 2019. The Notice stated that CAC did not have jurisdiction when the arbitration clause in the Contract did not specify CAC as the arbitral commission. 6. The Plaintiff claims that after the Defendant had applied to stay these proceedings, it had attempted again to commence arbitration at CAC, but its request was still declined by CAC, which issued its Notice dated 23 February 2023. In the Notice, CAC stated again that the parties had failed to agree on the arbitral commission, and hence there was no compliance with the Arbitration Law. 7. The Plaintiff accordingly claims that it had no alternative but to commence and continue these proceedings, and maintained its opposition to the Defendant’s stay application on the basis that the arbitration agreement relied upon was invalid, inoperative, or incapable of being performed. It argued that under Article 18 of the Arbitration Law of the PRC, where the arbitration agreement failed to contain an agreement on the arbitral commission or if such agreement was uncertain, the parties may supplement their agreement, but if a supplemental agreement cannot be reached by the parties, the arbitration agreement shall be invalid. The plaintiff contended that at the time when proceedings were commenced, it was not in breach of any arbitration agreement because the arbitration clause in the Contract was invalid, for having failed to specify the agreed arbitral commission. Alternatively, the arbitration agreement was inoperative or could not be performed, as evidenced by CAC’s rejection of the Plaintiff’s requests for arbitration. It is the Plaintiff’s case that the application for stay should be dismissed. 8. On the Defendant’s part, it was pointed out that at the time when the Contract was made, there was only one arbitration commission in Chengdu, and that was CAC. Another arbitral commission was set up only in 2018. The Defendant’s expert on PRC law referred to various authorities, in support of the contention that where there was only one arbitration commission in a place specified for arbitration, the Mainland Court would uphold the validity of an arbitration agreement, and maintain that the dispute should be arbitrated by the one and only arbitration commission in the place of arbitration as specified by the parties. 9. The Plaintiff does not accept that this represents the position of PRC law. It argued further that the clause in the Contract is different to those interpreted in the authorities relied upon by the Defendant’s expert. However, not much turns on this issue of whether the arbitration clause could be said to have failed to identify the arbitral commission of the agreed place of arbitration, in the light of what the parties later agreed on the arbitral commission. 10. The Defendant further pointed out that as early as February 2022, its solicitors in Hong Kong had written to the Plaintiff’s solicitors, when a statutory demand was served by the Plaintiff for repayment of the amount due under the Contract. The Defendant’s solicitors had drawn attention to the arbitration clause in the Contract, and stated that any dispute between the parties in relation to the Plaintiff’s demand for repayment of the loan under the Contract should be referred to arbitration on the Mainland. Upon being served with the Writ in these proceedings in December 2022, the Defendant’s solicitors had written again to the Plaintiff’s solicitors on 21 December 2022 (“ December 22 Letter ”), with reference to the arbitration agreement which provided for arbitration in Chengdu, and claiming that these proceedings constituted a breach of the arbitration agreement. It was stated in the December 22 Letter that unless the proceedings were withdrawn, the Defendant would apply for a stay and seek costs on indemnity basis. 11. The Plaintiff drew attention to the fact that it had replied to the December 22 Letter, stating that the proceedings would not be withdrawn because the arbitration clause in the Contract was defective as a matter of PRC law, as it failed to identify the arbitral institution in Chengdu. The Plaintiff’s solicitors claimed in its letter that there were numerous factors in favour of the jurisdiction of the Hong Kong courts. 12. Since both parties had desired, albeit at different stages, to arbitrate the dispute under the Contract, the Court wrote to the parties on 21 June 2023, before the hearing of the stay application, in the following terms: “1. Bearing in mind that the Defendant seeks a stay of the action to arbitration, and in the light of the history of the arbitrations commenced by the Plaintiff, the parties should consider conferring on the possibility of agreeing on the arbitral commission to which the arbitration may be referred . 2. If agreement can be reached, parties may save time and costs as well as judicial time and resources which is a matter of public interest.” (Emphasis added) 13. The parties then embarked on a further exchange of correspondence. The Court was informed on 21 June 2023 that despite their correspondence, no agreement had been reached. 14. It transpired that the Defendant’s solicitors wrote to the Plaintiff’s solicitors on 21 June 2023, seeking the Plaintiff’s confirmation that CAC is the correct arbitral commission to adjudicate the dispute. In reply, the Plaintiff’s solicitors stated that the Plaintiff had “always been willing and prepared to submit to arbitration administered by the CAC” and that it was only upon CAC’s refusal to exercise jurisdiction and “the lack of the Defendant’s acceding to a supplemental agreement as to the arbitral commission that the Plaintiff had to resort to litigation in Hong Kong”. In the same letter, the Plaintiff’s solicitors proposed that the parties enter into a supplemental arbitration agreement on terms that any disputes arising from or in connection with the Contract should be submitted to and resolved by arbitration administered by CAC under CAC’s arbitration rules in force, and the law of the seat of arbitration shall be Chinese law. The Plaintiff’s solicitors further stated that in the absence of the parties reaching a supplemental arbitration agreement in favour of CAC, the action would proceed, and if a supplemental arbitration agreement can be entered into, the costs of the stay Summons should be to the Plaintiff. 15. The response of from the Defendant’s solicitors was that there was no direction from the Court for the parties to enter into any supplemental agreement, and that the terms proposed by the Plaintiff were not acceptable. The Defendant invited the Plaintiff to agree on the correct arbitral body and to bear the Defendant’s costs of the stay application. 16. The Court expressed surprise at the parties’ unreasonable persistence on their respective litigious stance, instead of attempting bona fide to effect agreement on the arbitral commission. It was pointed out that costs could be dealt with separately. 17. When the hearing commenced on 23 June 2023, upon further questioning by the Court, the parties finally were able to confirm that they could agree on arbitration by CAC, and undertook to enter into a written supplemental agreement on the terms set out in the letter from the Plaintiff’s solicitors of 21 June 2023. The outstanding matter was costs and the order to be made on the Defendant’s Summons: whether it should be dismissed subject to the parties’ undertaking, or whether a stay of the action should be ordered. 18. Costs are in the discretion of the Court, and as this Court had indicated to the parties even before the hearing on 23 June 2023, the conduct of the parties would be taken into consideration when the Court decides on the question of costs: whether they should be allowed, and the basis on which they should be allowed. In this regard, the underlying objectives set out in Order 1B RHC, and in this case, the object and principles as set out in section 3 of the Arbitration Ordinance , must be taken into consideration. 19. The Plaintiff complained of the Defendant’s alleged failure to accede to a supplemental agreement for arbitration as its rationale and justification for the commencement of these proceedings. However, there is no evidence that prior to this Court’s intervention and the parties’ correspondence on 21 June 2023, the Plaintiff had ever approached the Defendant in relation to their agreement to arbitrate as reflected in the arbitration clause of the Contract, or to seek the Defendant’s agreement to having the dispute under the Contract being referred to CAC for arbitration. This was notwithstanding the fact that the Plaintiff had attempted to commence arbitration before CAC on 3 occasions (in March 2019, in December 2019 and in February 2023), and had had their requests declined by CAC. The Defendant claims that it had only learned of these failed attempts and the reason why the CAC rejected the Plaintiff’s requests for arbitration when the Plaintiff served its evidence in opposition to the Summons in these proceedings. Notwithstanding the fact that the Plaintiff had suggested in the 1 st affirmation of Peng that the Defendant had a role to play in the Decision of CAC concerning the withdrawal of the Plaintiff’s request for arbitration, there is no evidence that the Defendant had ever been consulted, or notified, before the Plaintiff’s arbitrations had been withdrawn, or refused by CAC. There is no evidence that the Defendant had refused to have the dispute arbitrated by CAC. 20. It is clear that by 7 February 2022, when the Plaintiff served a statutory demanded in respect of the debt due under the Contract, the Defendant’s solicitors had indicated to the Plaintiff’s solicitors that any dispute in relation to the debt should be referred to arbitration in accordance with the arbitration agreement in the Contract. There was no follow-up invitation by the Plaintiff to the Defendant, as to whether the Defendant would agree to have the arbitration before CAC, or any other named commission. The Plaintiff simply proceeded with issuing the Writ in these proceedings. The December 22 Letter which followed the service of the Writ still referred to arbitration in Chengdu, but again, the Plaintiff failed to ascertain if the Defendant would agree to CAC or any other arbitration commission of the Plaintiff’s choice. The Plaintiff only maintained that the Writ could not be withdrawn, that the arbitration agreement is defective, and that there are factors in favour of the jurisdiction of the Hong Kong courts. 21. In my view, the Plaintiff and/or its solicitors had not acted reasonably, when the Defendant had indicated its agreement to arbitration, by failing to ascertain if there was agreement on the arbitral commission, if the Plaintiff had taken the view that the arbitration clause was unclear or defective in any way. It was only in June 2023 that the parties came close to agreeing to arbitrate by CAC, but such agreement could have been made earlier, if the parties had reasonably conferred before the commencement of these proceedings in March 2022, or before the Summons was issued on January 2023. 22. Even on 21 June 2023, the parties were not able to reach agreement on arbitration by CAC (or any other commission of the parties’ choice), because of their insistence on their litigious stance. It is not entirely comprehensible, but the parties had apparently focused on whether there was a supplemental agreement when CAC was (according to the Defendant) the “correct” arbitral body named in the arbitration clause. It is unfortunate if the Defendant’s solicitors had somehow taken the Court’s direction on 21 June 2023 as confirmation that CAC was the “correct” arbitral commission. There was no such indication. At the end of the day, all obstacles were removed after the hearing in Court, and the parties could realistically acknowledge that they agreed that there should be arbitration by CAC. 23. In the light of the history of the case, and against the background and correspondence, I consider that the order to be made on the Summons is that the action should be stayed to arbitration, on the terms agreed between the parties. 24. There was clearly an agreement to arbitrate, at the time when the Contract was made in 2016, as the Defendant had indicated from February 2022, and in December 2022, and as confirmed on 21 June 2023. The Plaintiff had in March 2019, December 2019 and February 2023 attempted to commence arbitration before CAC pursuant to the agreement to arbitrate contained in the Contract, and if it had only sought confirmation of agreement from the Defendant, that it also agreed to have the dispute under the Contract referred to arbitration before CAC, there would have been a “supplemental agreement” between the parties for the purpose of Article 18 of the Arbitration Law, for there to be a valid and operative arbitration agreement. 25. Bearing in mind that the Defendant only has to show a prima facie case on the existence of a valid and subsisting arbitration agreement, which is not inoperative or incapable of being performed at the time either of the hearing of the application for stay or at the commencement of the proceedings (as the Plaintiff argued), the threshold would have been met and a stay would have been granted. 26. The order on costs is that the costs of and incidental to the Summons up to 20 June 2023 should be paid by the Plaintiff to the Defendant on indemnity basis. In my view, both parties were unreasonable on 21 June 2023, in failing to reach agreement on the arbitration commission simpliciter . If they could agree on CAC, it was pointless to argue whether CAC was “correctly” the commission, or not. Hence, no order is made for costs incurred on and after 21 June 2023. (Mimmie Chan) Judge of the Court of First Instance High Court Mr Jeff Yau, instructed by Lee & Yik Lawyers, for the plaintiff Mr Yeung Pui Choi, Patrick, of Holman Fenwick Willan, for the defendant Look up this case on Lawcite Noteup",
  "length": 16836,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2023/1713",
  "query": "seat of arbitration",
  "ts": "2025-10-16T10:49:36",
  "ok": true
}