{
  "title": "AMERICAN INTERNATIONAL GROUP, INC AND ANOTHER V.. X COMPANY | [2016] HKCFI 1530 | HKLII",
  "court": null,
  "year": 2016,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2016] HKCFI 1530 AMERICAN INTERNATIONAL GROUP, INC AND ANOTHER V.. X COMPANY Judgment Information Date 29 Aug, 2016 Action No. HCCT60/2015 Neutral Cit. [2016] HKCFI 1530 Download MS Word Judgment Reading Options Translation Toggle Highlight Appeal History HCCT60/2015 HCCT60/2015 AMERICAN INTERNATIONAL GROUP, INC AND ANOTHER v.. X Company HCCT 60/2015 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO 60 OF 2015 ______________ IN THE MATTER of Order 73 rule 5 of the Rules of the High Court ( Cap 4A ) and IN THE MATTER of Arbitration Award dated 23 September 2015 in Case No 20025/RD (c. 20026/RD) made by the International Court of Arbitration, International Chamber of Commerce and IN THE MATTER of section 81 of the Arbitration Ordinance ( Cap 609 ) and Article 34 of The UNCITRAL Model Law on International Commercial Arbitration ______________ BETWEEN AMERICAN INTERNATIONAL GROUP, INC 1 st Plaintiff AIG CAPITAL CORPORATION 2 nd Plaintiff and X Company Defendant ______________ Before : Hon Mimmie Chan J in Chambers Dates of Hearing : 17 & 18 August 2016 Date of Decision : 30 August 2016 _____________ D E C I S I O N _____________ Introduction 1. This is an application made by American International Group, Inc and AIG Capital Corporation (“ Plaintiffs ”), to set aside an arbitral award dated 23 September 2015 (“ Award ”) made in an arbitration (“ Arbitration ”) between the Plaintiffs, X Company (“ Defendant ”) and Y Company (“ Y ”). By a majority of 2 (“ Majority ”) out of the 3 arbitrators constituting the tribunal (“ Tribunal ”), the Tribunal ordered that a deposit of US$475 million be returned by the Plaintiffs to the Defendant. The Arbitration was seated in Hong Kong. The Plaintiffs’ application to the Hong Kong supervisory court is for the Award to be set aside under s 81 (1) (2) (a) (iii) of the Arbitration Ordinance Cap 609 (“ Ordinance ”), on the ground that the arbitrators had exceeded their mandate in that the Award dealt with a dispute not contemplated by or not falling within the terms of the submission to arbitration, or contains decisions on matters beyond the scope of the submission to arbitration; and/or s 81 (1) (2) (a) (iv) of the Ordinance, on the ground that the arbitral procedure was not in accordance with the agreement of the parties and/or s 64 of the Ordinance. Under s 64, which applies Article 28 of the Model Law, an arbitral tribunal is required to decide the dispute in accordance with such rules of law as are chosen by the parties as applicable to the substance of the dispute, and under Article 28 (3), the tribunal “shall decide ex aequo et bono or as amiable compositeur only if the parties have expressly authorized it to do so”. The parties had never given express authorization to the Tribunal, to act as amiable compositeur . 2. The Arbitration relates to disputes which had arisen between the parties under a Share Purchase Agreement which was made between the Plaintiffs and Y on 9 December 2012 (“ SPA ”), whereby the Plaintiffs agreed to sell up to 90% of one of its subsidiaries (“ Subsidiary ”) to Y for approximately US$4.75 billion. Y was at all material times a “mere acquisition vehicle” funded by a consortium of potential investors. The Defendant was one of the intended investors. The SPA provides for a Long Stop Date for closing of the sale and purchase under the SPA to take place. The SPA further provides for a deposit of US$475 million (“ Deposit ”), representing 10% of the purchase price, to be paid into an escrow account. A separate agreement was made between the Plaintiffs, Y, the Defendant (as a potential investor providing the funds) and JP Morgan as escrow agent (“ Escrow Agreement ”). Pursuant to the Escrow Agreement, the Defendant paid the Deposit into the escrow account with the escrow agent’s branch in Beijing. 3. Under clause 7.18 of the SPA, the Plaintiffs as sellers and Y as purchaser agreed and acknowledged that the Deposit “constitutes a reasonable estimate of the damages that will be suffered by (Plaintiffs) as a result of any breach or failure” which would give rise to an event of breach entitling the Plaintiffs to terminate the SPA. 4. In brief, Y failed to raise the necessary funds for the purchase of the Subsidiary, and completion did not take place as envisaged under the SPA. The Plaintiffs terminated the SPA on 16 December 2013, and entered into an agreement with a third party for the sale of the shares in the Subsidiary. The dispute for determination by the Tribunal in the Arbitration focused on whether the Plaintiffs were entitled to the Escrow Deposit as liquidated damages under the SPA, or whether the Defendant had the right under the Escrow Agreement to seek the return of the Deposit by reason of its failure to obtain the regulatory approvals required for it to complete the purchase. 5. After a 7 day hearing in Hong Kong in March 2015, the Tribunal issued the Award on 23 September 2015. The Tribunal found that Y was in breach of the SPA for failing to complete the transaction, and that an LD Breach Trigger Event as defined in clause 7.11 of the SPA had occurred, which entitled the Plaintiffs to terminate the Agreement. Despite its finding that Y was in breach of the SPA, the Majority of the Tribunal found that the Plaintiffs were not entitled to the Deposit, which should be returned to the Defendant, on 2 grounds. First, the Majority found that the liquidated damages clause in the SPA constituted an unenforceable penalty. Secondly, the Majority held that there was an oral collateral agreement made between the parties, to the effect that the Deposit would be returned to the Defendant, if the Defendant failed to obtain all the necessary PRC regulatory approvals for the transaction. 6. Both the SPA and the Escrow Agreement provide for the laws of the State of New York to be the governing law, and for disputes arising out of or in connection with these agreements to be settled exclusively by arbitration in accordance with the Rules of Arbitration of the International Chamber of Commerce. The arbitration clause provides for the Arbitration to be conducted by 3 arbitrators, each of whom shall be qualified to practise law under the laws of the State of New York, and for the seat of the Arbitration to be Hong Kong. 7. On the Plaintiffs’ case, it was argued that the plain and express terms of the SPA call for the Deposit to be forfeited to the Plaintiffs as liquidated damages in the event of Y’s breach (which breach the Tribunal had found). However, the Majority considered that forfeiture of the Deposit would create a hardship for the Defendant, since the Deposit represented 5% of the Defendant’s total assets and 60% of its shareholder equity. The Plaintiffs argued that in coming to its eventual decision, the Majority had taken into consideration the fact that the Plaintiffs were “one of the world’s largest players in the financial markets” (paragraph 100 of the Award), and that the US Government had in 2008 injected a total capital of approximately $182 billion into the Plaintiffs, as the Plaintiffs were considered “too big to fail”. In particular, the Majority considered that as the Plaintiffs had been able to find another buyer to purchase the Subsidiary for more than the Plaintiffs had agreed to sell to Y, the Plaintiffs had suffered no actual loss, such that to allow the Plaintiffs to recover the Deposit as damages would give them a windfall, and it would not be just or fair to award the return of the Deposit to the Defendant. 8. On behalf of the Plaintiffs, Mr Coleman SC argued that clear principles of New York law, which the parties had agreed would govern the dispute, precluded the findings made by the Majority. The arbitrators were experienced lawyers qualified to practise New York law, and in making the findings which led to the Award, the Majority had (it is claimed) ignored or consciously disregarded basic principles of New York law concerning the enforceability of liquidated damages clauses, and the inadmissibility of parol evidence to vary or contradict the express terms of a written contract, in order to arrive at what the Majority considered to be the fair or equitable result. This, it was argued, goes beyond mere erroneous application of New York law, but amounts to the Majority impermissibly deciding the dispute ex aequo et bona or as amiable compositeur . Since the Tribunal is required under Article 28 to decide the dispute in accordance with New York law chosen by the parties, and cannot decide ex aequo et bona or as amiable compositeur without the parties’ authorization, the Tribunal had exceeded its mandate, and the Arbitration was not in accordance with the agreed arbitral procedure, such that the Award should be set aside. Amiable compositeur 9. Arbitrators may have power conferred upon them by so-called “equity clauses” to settle a dispute by determining it on the basis of what is “fair and reasonable”, rather than on the strict basis of the law (paragraph 3.192, Redfern and Hunter on International Arbitration , 6 th edition). Amiable compositeurs may, when authorized to do so, “decide in equity” which may mean applying the relevant rules of law to the dispute, but ignoring any rules that are purely formalistic, or rules which appear to operate harshly or unfairly on the facts of the particular case. Whatever this concept means, and whatever it empowers arbitrators to do, there is no dispute in this case that the parties in the Arbitration never authorized the Tribunal to decide as amiable compositeurs . 10. Section 9 of the Ordinance adopts Article 2A of the Model Law, and its emphasis on its international origin and general principles. Article 2A (1) states that in the interpretation of the Model Law, regard is to be had to its international origin and to the need to promote uniformity in its application and the observance of good faith. I agree with Mr Coleman that authorities from other Model Law jurisdictions can and should be taken into account when this Court seeks to interpret the Model Law and provisions of the Ordinance which adopt the Model Law. Of course, it has to be borne in mind that there may be differences in the applicable domestic law which may affect the outcome of the decisions. 11. Mr Coleman relies on the decision of the English court in B v A [2010] 2 CLC 1, to submit that “conscious disregard of the agreed governing law” is the relevant consideration in determining whether to set aside an award in the case of unauthorized amiable composition. He further relies on cases decided by the German and Canadian courts, which apply the Model Law, for the proposition that an arbitral tribunal exceeds its mandate where it acts as amiable compositeur without express authorization, rendering its award liable to be set aside under the Model Law. I agree that these are relevant and persuasive decisions for these propositions. 12. Mr Coleman accepts, of course, that mere errors of law made by the Tribunal cannot be relied upon by the Plaintiffs as a ground to set aside the Award. The real question for determination, in the context of the argument of amiable composition, is whether the errors of law contended by the Plaintiffs to have been made by the Majority amount to their “conscious disregard” of the agreed New York law, in order to reach the equitable or fair decision which the Majority intended to make. 13. On a review of the Award, it can be seen that the Tribunal had considered and referred to a host of authorities, including decisions of the Court of Appeals of New York (New York’s highest court), and of the Supreme Court. It cannot be said that it is plain from the Award itself, that the Tribunal or the Majority had totally disregarded or ignored the governing law. What the Plaintiffs seek to argue is that notwithstanding the references to New York law and the Majority’s purported legal analysis, the Majority had reached conclusions which are errors of law and these errors could not have been made but for the Majority’s conscious and deliberate decision to disregard the law. To this end, Mr Coleman relies on the fact that the legal principles involved in the analysis are so fundamental and well established, that no experienced US lawyer (such as the Majority) could have failed to correctly apply them, on not one but two basic points. In support of the Plaintiffs’ case, expert evidence on New York law was adduced by Hon Robert S Smith, a member of the New York bar and a former Associate Judge of the New York Court of Appeals (“ Judge Smith ”). 14. In Judge Smith’s opinion, the Majority was wrong in finding that the liquidated damages clause in the SPA is unenforceable under New York law as a penalty, when both the Plaintiffs and Y had agreed and acknowledged at the time they signed the SPA that the Deposit was a reasonable estimate of the Plaintiffs’ damage in the event of a material breach by Y. The Tribunal made no finding that such estimate was unreasonable at the time when the SPA was made, but the Majority wrongly took into consideration the fact that as a result of the breach, the Plaintiffs had suffered no actual damage. Secondly, Judge Smith is of the opinion that the Majority was wrong on trite New York law, by considering extrinsic evidence of an oral and collateral agreement between the Defendant and the Plaintiffs that the Deposit would be returned to the Defendant, thus overriding the express terms of the Escrow Agreement and the SPA, when the Tribunal had found that Y was not entitled to the Deposit under the SPA, and that the 2 conditions of clause 3.8 of the Escrow Agreement were not met for the Defendant to recover the Deposit. 15. On the Defendant’s part, it relies on the expert evidence of Hon Albert M Rosenblatt, member of the New York bar and another former Associate Judge of the New York Court of Appeals and the New York State Supreme Court (“ Judge Rosenblatt ”). On behalf of the Defendant, Mr Ho SC sought to demonstrate that the Tribunal had correctly applied New York law, but in my view, it is not necessary for this Court to be satisfied that the Majority had reached the right conclusions in their application of New York law to the dispute. It is trite that the Court does not review the merits of the dispute or the correctness of an award on an application to enforce, or set aside, an arbitral award. Even if the findings made by the Majority are clearly wrong in law, that is not a ground for the Award to be set aside, or for recognition of the Award to be refused ( Grand Pacific Holdings Ltd v Pacific China Holdings Ltd (in liq) (No 1) [2012] 4 HKLRD 1 ). The setting aside remedy under Article 34 of the Model Law is not an appeal. The Court is only concerned with the structural integrity of the arbitration process. 16. Mr Coleman does not dispute these basic principles. He accepts that the Plaintiffs must show that the circumstances of the case give rise to a clear inference that the Majority made its erroneous findings of law, in conscious disregard of New York law, and “intentionally reached a result contrary to New York law that comported with their own notions of justice and equity, and disguised this equitable decision making as a purported application of the law” (paragraphs 63 and 64 of Counsel’s skeleton argument). Whether there was a conscious disregard of New York law 17. The gravaman of the Plaintiffs’ case is that there was no genuine attempt on the Majority’s part to apply the agreed governing law. The facts of B v A are unique (where the dissenting arbitrator issued an opinion criticizing the majority of the Tribunal for consciously disregarding Spanish law in their reasoning), and the Plaintiffs accept that it would not be usual or expected, for those who decide as amiable compositeurs without the necessary express authorization, to openly declare their disregard of the applicable law, or their intent to decide on equity, as opposed to the applicable governing law. As Mr Coleman put it, the decision based purely on principles of equity and reasonableness may nevertheless “be cloaked in purported legal analysis”, such that the Court should look beyond the purported analysis to assess and infer that the governing law had been deliberately disregarded. He was quick to point out that an arbitrator’s departure from the core duty to decide the dispute in accordance with the agreed governing law may be for a “righteous” purpose, although it is nevertheless still an impropriety. 18. On behalf of the Defendant, Mr Ho highlighted the fact that the approach advocated by the Plaintiffs in this case necessitates an inference to be made by this Court that the Tribunal was intellectually dishonest, based purely on “inconsequential circumstances”, the bare assertions of the Plaintiffs and the purported expert evidence of Judge Smith. 19. In this respect, I bear in mind the caution made by Ribeiro PJ in the Court of Final Appeal’s decision in Nina Kung v Wang Dan Shin (2005) 8 HKCFAR 387 , in the context of drawing inferences of forgery (admittedly misconduct much more serious in nature). At paragraph 185 of the judgment, Ribeiro PJ stated: “Where, as in the present case, the court is invited to reach a conclusion of forgery as an inference to be drawn on the basis of circumstantial evidence, any such inference must be properly grounded in the primary facts found. The court guards against indulging in conjecture under the guise of drawing an inference where the primary evidence does not logically and reasonably justify the particular inference in question . As the High Court of Australia stated: Of course as far as logical consistency goes many hypotheses may be put which the evidence does not exclude positively. ... The difference between the criminal standard of proof in its application to circumstantial evidence and the civil is that in the former the facts must be such as to exclude reasonable hypotheses consistent with innocence, while in the latter you need only circumstances raising a more probable inference in favor of what is alleged. In questions of this sort, where direct proof is not available, it is enough if the circumstances appearing in evidence give rise to a reasonable and definite inference: they must do more than give rise to conflicting inferences of equal degrees of probability so that the choice between them is mere matter of conjecture ...” (Emphases added) 20. Mr Ho also relies on HKSAR v Lee Ming Tat & Securities and Futures Commission (2003) 6 HKCFAR 336 , where Sir Anthony Mason NPJ affirmed the need for a disciplined approach to the drawing of inferences, and in particular for inferences of serious misconduct, to be drawn only where such inferences are compelling, rather than on a mere balance of probabilities. 21. Mr Ho highlighted the fact that the Plaintiffs have accused the Tribunal not only of consciously disregarding New York law, and intentionally reaching a result contrary to New York law, but have accused the Majority of “disguising” their disregard of the proper governing law “through disingenuous citation of New York law”, and “deliberate distortion of the law”. These, it was pointed out, are serious attacks on the professional integrity of the Majority, when there is simply no primary evidence of facts which can be found to support any inference. 22. Whether or not the accusations made against the Majority are sufficiently serious to support the necessity for “compelling evidence” as required in the circumstances of Lee Ming Tat , it cannot be disputed that there must be sufficiently clear evidence from which the Court can logically and reasonably infer that the Majority of the Tribunal had consciously ignored New York law and deliberately failed to apply the principles set out in the cases decided by the US courts which are binding on them, with the intent to arrive at their conclusions which contradict the legal authorities. In my judgment, there is no evidence in this case which, on its own or read in the whole, can support such inference. 23. On a careful reading of the Award, and on a review of the US authorities to which the experts and Counsel have referred in this case, it appears to me that the Majority had considered the relevant decisions of the New York Court of Appeals, and had made a genuine effort to analyze these cases and to apply what the Majority understood the cases to establish. Rightly or wrongly, they considered the decisions in Truck Rent-A-Center, Inc v Puritan Farms 2 nd , Inc, 41 NY, 2d 420 (1977), JMD Holding Corp v Congress Financial Corp , 4 NY 3d 373 (2005), Parente v Drozd 171 AD 2d 847 (1991), Equitable Lumber Corp v IPA Land Dev Corp , 38 NY 2d 516 (1976), 172 Van Duzer Realty Corp v Globe Alumni Student Assistance Association, Inc , 24 NY 3d 528 (2014) and Wing Ming Props (USA) Ltd v Mott Operating Corp , 561 NYS 2d 337, 340 (Sup Ct NY Cnty 1990), affirmed, 568 NYS 2d 605 (1991), affirmed, 79 NY 2d 1021 (1992), in the context of the enforceability of liquidated damages clauses, and the admissibility of parol evidence. On reviewing the reported cases and the analyses set out in the Award, I cannot agree that the Majority had “distorted” the law, or the legal principles set out in the Opinions of the New York Court of Appeals, or any of the Opinions of the Court of Appeals in the cited cases (including Equitable Lumber ). If (as Judge Smith considers) the Majority have misunderstood the Opinions of the New York Court and erroneously applied the relevant legal principles, then the Majority can only be said to be wrong in law. If they have erroneously applied even the most basic legal principles, then they can only be said to be wrong in law, in its most basic aspects. Experienced lawyers and arbitrators may still make mistakes. It is unjustifiable to conclude, from these errors, that the Majority understood that they had made errors, but chose deliberately to ignore them. It is even more difficult to conclude, or to infer from the fact they had made these errors of law, that the Majority had deliberately made these errors for the purpose of arriving at what the Majority perceived, as amiable compositeurs , to be the fair result. 24. To the extent that Judge Smith expresses the opinion in his expert report that “the Tribunal majority understood that it was not following the law”, and that “the Tribunal majority, thinking the result compelled by New York law to be inequitable and unfair, intentionally put the law aside to reach what it considered a more just result”, such is simply his opinion on the state of mind or motives of the Majority. As Mr Ho submits (by reference to passages of the decision in Newmark Capital Ltd v Coffee Partners Ltd [2007] 1 HKLRD 718 ), this is not in the proper realm of admissible expert evidence on New York law, or how well established specified principles of New York law are. The proper ambit of expert opinion was also highlighted in the judgment of Gleeson NPJ in Fu Kor Kuen Patrick v HKSAR (2012) 15 HKCFAR 524 (at paras 49-51). Judge Smith’s opinion evidence on the Majority’s intention, purpose and state of mind is accordingly inadmissible. In any event, they remain Judge Smith’s opinions, and not this Court’s. 25. The Court should not speculate on the reasons or “motives” for the Tribunal’s decisions, nor second-guess the analyses or findings made by the Tribunal, whether on law or on facts, such as the Tribunal’s acceptance of the evidence of the factual witnesses. The Majority have set out in the Award their reasons for the findings they made and the Award they issued, including their order as to costs. The description of the Plaintiffs (in paragraphs 100 and 111 of the Award), of Y and the Defendant in the context of the background or inherent probabilities of the case, and even any views expressed by the Majority as to the equities or fairness of the case, such as the Plaintiffs’ perceived “windfall” from the resale, and the perceived unfairness to the Defendant as a victim of a 3 rd party’s fraud, cannot be said to be unusual in any form of judgment or award on the merits of the dispute, and should not be given either a hostile construction or as factors which can support an inference that the Majority would flout legal principles to reach a particular decision not justified by the governing law. 26. As Ribeiro PJ highlighted in Nina Kung v Wang Din Shin , there must be proper foundation for any inference to be drawn, and “it is not permissible merely to choose what may be considered to be the more likely of 2 guesses if neither is properly justified by the primary facts found”. If, as the Plaintiffs submit, the Majority had made errors of law in their findings on the enforceability of the liquidated damages clause and in considering parole evidence, they may simply have made these errors because they failed to understand the correct analyses of the binding New York authorities, and this in my judgment is just as equally probable as the Majority having made a conscious and deliberate choice to ignore the binding New York authorities, to come to a contrary conclusion in order to arrive at what the Majority perceived to be the fair result in the Arbitration. The latter inference involves a quantum leap which is not justified by a fair, objective reading of the Award. 27. Since the Plaintiffs have failed at the 1 st hurdle, and have not established the Majority’s conscious disregard of the agreed governing law which applies to the Arbitration, it is not necessary to decide whether or not the Tribunal had exceeded its mandate, such that there are any grounds for the Court to exercise its discretion under Article 34 and s 81 of the Ordinance to set aside the Award. Orders made 28. For the above reasons, I dismiss the Plaintiffs’ application to set aside the Award, and make an order nisi that the costs of the unsuccessful application (including any costs reserved) should be paid by the Plaintiffs to the Defendant on an indemnity basis with certificate for 2 counsel. (Mimmie Chan) Judge of the Court of First Instance High Court Mr Russell Coleman SC and Mr Val Chow, instructed by Morrison & Foerster, for the 1 st & 2 nd plaintiffs Mr Ambrose Ho SC and Mr Jean-Paul Wou, instructed by Deacons, for the defendant Look up this case on Lawcite Noteup",
  "length": 26492,
  "headers_seen": [
    "Introduction",
    "Amiable compositeur",
    "Whether there was a conscious disregard of New York law",
    "Orders made"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2016/1530",
  "query": "Model Law",
  "ts": "2025-10-16T10:53:23",
  "ok": true
}