{
  "title": "HO MIU HA FORMERLY T/A GREAT ENTERPRISE INTERNATIONAL CO. V. LI YEE HUNG | [2014] HKDC 1149 | HKLII",
  "court": null,
  "year": 2014,
  "date": null,
  "content": "HKLII Databases District Court [2014] HKDC 1149 HO MIU HA FORMERLY T/A GREAT ENTERPRISE INTERNATIONAL CO. V. LI YEE HUNG Judgment Information Date 15 Oct, 2014 Action No. DCCJ4193/2012 Neutral Cit. [2014] HKDC 1149 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History DCCJ4193/2012 DCCJ4193/2012 HO MIU HA formerly t/a GREAT ENTERPRISE INTERNATIONAL CO. v. LI YEE HUNG DCCJ 4193/2012 IN THE DISTRICT COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION CIVIL ACTION NO 4193 OF 2012 -------------------- BETWEEN HO MIU HA formerly trading as GREAT ENTERPRISE INTERNATIONAL CO. Plaintiff and LI YEE HUNG Defendant -------------------- Before: Deputy District Judge Amy Chan in Chambers (Open to Public) Date of Hearing: 3 October 2014 Date of Decision: 16 October 2014 -------------- DECISION --------------- 1. There are two applications before the court. Both are taken out by the defendant, namely:- (a) an application under Order 3 rule 5 for an extension of time to take out the Stay Summons (as defined below) under Order 12 rule 8 (“Time Extension Summons”); and (b) an application under Order 12 rule 8 for an order to stay the present proceeding on the ground of lis abili pendens that there are other proceedings pending between the defendant and the plaintiff in Guangdong Province in China (“the PRC proceedings”) (“Stay Summons”). BACKGROUND 2. It is helpful to begin with the background to this dispute before I turn to the two summonses which are before me. 3. The plaintiff and the defendant are mother and daughter. 4. The plaintiff set up her own business which includes the following companies (collectively as “the Companies”):- (i) New Creation Industrial Cooperation Limited (創 新 實 業 股 份 有 限 公 司) (“New Creation”); (ii) Great Enterprise International Company (宏 業 國 際 公 司)(“Great Enterprise”); (iii) Pung Yu Company (創 業 塑 料 五 金 制 品 (番 禺) 有 限 公 司). 5. On 7 January 2005, the plaintiff, the defendant together with plaintiff’s husband and son signed a Cooperation Agreement (“the Agreement”) in China. The defendant shall subject to the Agreement and be entitled to the rights stipulated therein which includes sharing of profit of the Companies. 6. Under clause 3 of the Agreement, in case of any assets of the Companies being liquidated, the defendant is entitled to 25% share thereof after deducting RMB$2.18 million which represented the capital investment of the plaintiff and her husband. 7. Under clause 4 of the Agreement, in case that the defendant competes with and diverts the business of the Companies, she would be abstained from her rights under the Agreement. 8. There is no dispute that all the shares and interests in Pung Yu Company, which held a piece of a land and the factory thereon, has been liquidated by the plaintiff in November 2011 when it was sold to one Madam He for RMB$5.2 million. 9. In 2004, the defendant established and operated two companies called Great Enterprise International Co. (宏業國際公司) (“the D’s GE”) and First Crown Enterprises Holdings Limited (展藝興業有限公司) (“FC”). The former bears the same name as one of the plaintiff’s Companies, Great Enterprise. 10. Great Enterprise was a company incorporated in Hong Kong, carrying on the business of trading. 11. It is contended by the plaintiff that the defendant using her businesses of D’s GE and FC to divert away the business opportunities of Great Enterprise, in particular from the Great Enterprise’s client Speidel Inc, causing substantial loss and damage to the plaintiff. By reasons that the defendant operated and established the D’s GE and FC, she was in breach of the Agreement . 12. The plaintiff further allegesthatthe defendant signeda Non-Disclosure Agreement with Zanif Advertising Promotion Ltd in her capacity as the person-in-charge of齊 粵 國 際 有 限 公 司 (“齊 粵”) and a tenancy agreement on behalf of New Creation after she had resigned from the Companies in October 2005. 齊 粵 is a company owned by the defendant’s husband. 13. On the other hand, the defendant’s case, in gist, is that the plaintiff had consented to the opening of FC and the D’s GE. However, she did not provide any substantive answer in response to the signing of the Non-Disclosure Agreement and the tenancy agreement on behalf of New Creation. The PRC proceedings 14. Since the defendant has acted in breach of the Agreement, the plaintiff refused to pay the defendant her share from the selling of the Pung Yu Company. 15. The PRC proceedings commenced on 31 October 2012 in which the defendant sued the plaintiff and Madam HE for her entitlement to the share of the proceeds arising. 16. The PRC proceedings have concluded and they are now pending the judgment. The present proceedings 17. About a month after the commencement of the PRC proceedings, on 4 December 2012, the plaintiff started the present proceedings against the defendant. 18. In short, the crux of the plaintiff’s case is the defendant has acted in breach of her duty as an employee as a sales manager when she was under the employment of Great Enterprise. The defendant has set up FC to compete with and divert the business of the Companies without the plaintiff’s consent. She was in breach of her duties of fidelity and good faith and best interest of the plaintiff; the duty not to make secret profits and not to canvass the plaintiff’s customers and induce them to become her own customers. TIME EXTENSION SUMMONS 19. The defendant contends that the court should stay the present proceedings on the ground that in respect of the same cause of action to which the proceedings relate, there are PRC proceedings pending between the defendant and the plaintiff. 20. However, the defendant has filed the acknowledgement of service on 14 December 2012 and her Defence on 3 January 2013 in the present proceedings. In that case, she is deemed to have submitted to the jurisdiction of the court. She failed to comply with Order 12 rule 8 in taking out an appropriate application to stay the proceeding in good time. Order 12 rule 8 of the Rules of the District Court reads as follows:- “(2) A defendant who wishes to argue that the Court should not exercise its jurisdiction in the proceedings on one or more of the grounds specified in paragraph (2A) or on any other ground shall also give notice of intention to defend the proceedings and shall, within the time limited for service of a defence , apply to the Court for – (a) ….. (b) an order staying the proceedings, or (c) ….. (2A) The grounds specified for the purposes of paragraph (2) are that – (a) …… (b) …… and (c) in respect of the same cause of action to which the proceedings relate, there are other proceedings pending between the defendant and the plaintiff in another court.” 21. The defendant accepts that the Stay Summons was taken out of time. Therefore she applies to extend the time to take out the stay proceedings. She explains her delay on the following reasons. Firstly, she has been acting in person all along until December 2013. Her then attention was drawn to the same subject matters which were heard before the PRC court. As a litigant in person, she was simply not aware of her right to take out any stay application on the ground of concurrent litigation in other competent jurisdiction. Secondly, her former legal adviser had been non-responsive to her. However, she rectified the situation immediately once she sought advice from her current solicitors. 22. Mr Poon, counsel for the defendant, submits that discretion should be exercised in favour of the defendant as adequate explanations has been given. The only prejudice the plaintiff might have suffered from the delay was extra legal costs which have been wasted in the interim period. However, such prejudice could be compensated by costs. 23. Miss Chak, counsel for the plaintiff, objects to the Time Extension Summons. She submits that there had been a substantial delay of more than one year after the defendant filed her Defence before taking out the Stay Summons on 9 January 2014. The justifications of the defendant ought to be rejected by the court. The plaintiff should not be made to bear the wrongs of the defendant and her lawyer. Miss Chak relies on SJH v RJH [2014] 4 HKLRD 308 and MGM Grand Paradise v Wong Sing Wa, HCA 2140/2011 (unreported, 21 May 2012) to support the proposition that no extension of time should be allowed by principle. 24. Mr Poon replies that both SJH and MGM are not directly applicable. Neither of these two cases the applicants had asked for any extension of time. The cases just illustrate that a jurisdictional challenge which has been made out of time should not succeed. The defendant does not dispute this principle of law. What the defendant is seeking in the present application is an extension of time, so that jurisdictional challenge could be brought within time. 25. In deciding whether an extension of time be granted in the absence of an early proper application under O 3 r 5, Mr Poon relies on Re Resource 1, (2000) HKCFAR 187. It was held by Bokhary PJ that:- “the power to extend time [under order 3 r 5] is conferred in very wide terms. Its purpose is to ensure that the legal consequences which ordinarily flow from non-compliance with time limits fixed by the rules do not apply in cases where an extension is appropriate. And in the context of an extension of time, there is no reason to differentiate between a deemed submission to the jurisdiction [Order 12 r 8(7)] and other legal consequences.” (p 203B to C) 26. The rule of O 3 r 5 confers the court with wide discretion to extend the time. In Hong Kong Civil Procedure 2014 under §3/5/2 at p.59, it provides that the court needs to balance the need for parties to observe procedural time limits and whether a party’s default could be compensated by an order of costs. In addressing these two factors, the court eschews rigidity and considers all relevant matters and the overall justice of the application. 27. On the issue of delay, the court shall consider all the circumstances as provided under Order 2 rule 5, which includes:- (a) the interests of the administration of justice; (b) whether the application for relief has been made promptly; (c) whether the failure to comply was intentional; (d) whether there is a good explanation for the failure to comply; (e) the extent to which the party in default has complied with other rules and court orders; (f) whether the failure to comply was caused by the party in default or his legal representative; (g) in the case where the party in default is not legally represented, whether he was unaware of the rule or court order, or if he was aware of it, whether he was able to comply with it without legal assistance; (h) whether the trial date or the likely trial date can still be met if relief is granted; (i) the effect which the failure to comply had on each party; and (j) the effect which the granting of relief would have on each party. 28. Having considered the whole circumstancesand the dicta of Re Resource 1 (supra), I am ready to accept Mr Poon’s submissions on the issue of delay stated above. Even if the application was out of time, I would exercise my wide discretion to extend the time to 9 January 2014 for taking out an application under Order 12 r 8. STAY SUMMONS 29. Since I have granted the time extension to take out the Stay Summons, that being the case, I would not consider the factor of delay. 30. Mr Poon relies on lis alibi pendens only to stay the present proceeding. He submits that the present proceedings fall into the classic category of lis alibi pendens . There is not only identity of parties but also identity of subject matter: see Linfield Ltd v Taoho Design Architects Ltd & Ors [2002] 2 HKC 204 . The Principle on lis alibi pendens 31. The proper test of lis alibi pendens is set out in the House of Lords judgment in The Abidin Daver [1984] 1 AC 398 , in which Lord Diplock stated at 411G to 412A that :- “Where a suit about a particular subject matter between a plaintiff and a defendant is already pending in a foreign court which is a natural and appropriate forum for the resolution of dispute between them, and the defendant in the foreign suit seeks to institute as plaintiff an action in England about the same matter to which the person who is plaintiff in the foreign suit is made defendant, then the additional inconvenience and expense which must result from allowing two sets of legal proceedings to be pursued concurrently in two different countries where the same facts will be in issue and the testimony of the same witnesses required, can only be justified if the would-be plaintiff can establish objectively by cogent evidence that there is some personal or judicial advantagethat would be available to him only in the English action that is of such importance that it would cause injustice to him to deprive him of it.” 32. In the application of the above principles, both counsel in the present case had referred to the court with authorities. They include but not limited to the followings: LN v SCCM , CACV 62/2013 (4 June 2013), unreported; Nucron Pharmaceuticals Limited v The New India Assurance Company Limited , HCCL 308/1998 (7 October 1999), unreported; LN v SCCM, CACV 62/2013 (4 June 2013), unreported; SJH v RJH (supra); MGM Grand Paradise Limited v Wong Sing Wa ,(supra) and Yantai Wanhua Polyurethanes Company Limited v Pur Products Limited , [2013] 1 HKLRD 590 . 33. I find that the authorities have been helpful in the sense that they enabled me to see how the principles of law were approached by the courts in other cases. However, in my view, each case must be decided upon its own facts. 34. In Hyundai Engineering & Construction Co Ltd v UBAF (Hong Kong) Ltd , [2012] 5 HKLRD 620 , DHCJ Lok has succinctly summarized the legal principles from a number of leading authorities [1] which apply where a litigant seeks a stay of proceedings pending concurrent foreign proceedings. It is held at paragraph 37 that: (1) the court must consider what would serve the ends of justice between the parties to the litigation and the administration of justice generally; (2) a stay should not cause an injustice to the plaintiff; (3) the applicant for stay must satisfy the court that continuing the proceedings would be unjust to him; and (4) where the plaintiff commences proceedings as of right, he should not be deprived of the right to continue those proceedings in the absence of very good reasons. Discussion 35. Mr Poon submits that the following considerations would support a stay:- (a) there is identity of subject matter. The basis of both proceedings against the defendant was the setting up an unauthorized competing business. Thus, the so-called new cause of action on breach of “employee’s duties” does not add anything new to the subject matter between parties; (b) the duplication of proceedings would only create the risk of inconsistent findings; (c) the courts in two jurisdictions may reach conflicting decisions; (d) the omission of the plaintiff to counterclaim in the PRC proceedings; and (e) the plaintiff’s claim in the present action is USD$4,360.8 whilst the defendant’s claim in the PRC proceedings is about $1.7 million. Substantial justice was done to all parties in the PRC proceedings. In view of the claim amount of two parties, it is not proportional to have parallel proceedings. The plaintiff should pursue her claim of USD$4,360.8 in China. 36. On the other hand, Miss Chak submits that the following considerations to demonstrate that the present action should not be stayed:- (a) the plaintiff commenced her claim as of right against the defendant for the damages caused by the defendant’s breach of fidelity/fiduciary duties when she was under employment with the plaintiff; (b) the plaintiff did not put forward any counterclaim in the PRC proceedings. The relief is only sought in the present proceedings as a result of the defendant’s breach of duties; (c) there is no identity of subject matter on all the issues in the two sets of proceedings. In the present proceedings, the breaches extended from the period of 2004 which was well before the signing of the Agreement in 2005. The plaintiff has indicated in the previous hearing before the Master that the statement of claim will be amended upon receiving further documents from the Customs and Excise Department. The breaches can be demonstrated by the following incidents which the plaintiff has explained in her affirmation dated 4 March 2014 that:- i. evidence in support that D’s GE carried out business with plaintiff’s client Speidel Inc before the signing of the Agreement; ii. a profits tax return for 2004/2005 shows that D’s GE has profits of $74,977; iii. the defendant signing a Non-Disclosure Agreement with Zanif Advertising Promotion Ltd in her capacity as the person-in-charge of 齊 粵(a company owned by the plaintiff’s husband) on 23 April 2004. It involved the production of the products similar to that of Great Enterprise. At that time, she was still under the employment of Great Enterprise; and iv. the defendant has signed a tenancy agreement on 15 October 2005 on behalf of New Creation without the consent of the plaintiff. It happened after her resignation with Great Enterprise. This matter has never been raised in the PRC proceedings. 37. In reply, Mr Poon contends that the court should not consider anything that happened before the signing of the Agreement. The court should only consider the case on the basis of the present amended statement of claim. Ought a stay be granted in the present proceedings? 38. Applying the legal principles mentioned above, I refuse the stay application. 39. First, the plaintiff commences the present proceedings as of right. The defendant has no right to deprive the plaintiff from the court which she has chosen in the absence of very good reasons: Linfield Ltd (supra) at §14 and The Abidin Daver (supra) at 409B . In this case, I do not find the defendant has very good reasons. I shall deal with this in more detail in the paragraphs below. 40. Secondly, the plaintiff did not counterclaim against the defendant in the PRC proceedings. In other words, she would be left with no claim against the defendant if the present proceedings are stayed. She should not be criticized for not bringing a counterclaim in the PRC proceedings. She has the right to choose a forum in which she preferred to litigate the matter. The pursuance of the claim in present proceedings is obviously a legitimate purpose of the plaintiff. 41. Thirdly, a stay would cause injustice to the plaintiff. According to the affirmation of the defendant’s PRC lawyer, he stated as follows: 根據內地的法律，即使何女士並沒有在內地訴訟，但何女士仍可就上述所示的李女士的違規事宜在內地展開 新的訴訟 ，向李女士追討上述第12段所示 [李女士的違規行為而導致的一切損失及訟費等提出反訴] 的損失。That means the plaintiff is required to bring fresh proceedings in the PRC in any event even if she is able to obtain a favourable result in the PRC proceedings. 42. Fourthly, the plaintiff has juridical advantage which derives from suing the defendant in Hong Kong. The plaintiff can effect execution on the defendant’s assets (if any) in Hong Kong: The Abidin Daver (supra). On the contrary, the plaintiff may encounter difficulty in the enforcement of the PRC judgment in this jurisdiction: see Oracle (China) Software Systems Co Ltd v Citic 21 CN (China) Technology Co Ltd and others , HCA 105/2012(31 January 2013), unreported per Mr Recorder A Ho at §44. 43. Fifthly, both proceedings are two separate and distinct claims between the parties. The issue in the present proceedings is primarily whether the defendant is in breach of the employee’s duty when she was working for the plaintiff in Great Enterprise. It is not premised on the Agreement. In my view, the plaintiff’s reference to the unauthorized competing business by the defendant in the PRC proceedings was in response to the defendant’s claim. Furthermore, the plaintiff has referred to a number of the defendant’s acts of wrongdoings happened before the signing of the Agreement in 2005. Some of them have never been raised in the PRC proceedings. According to Miss Chak, the intent of amendment to the Amended Statement of claim has already been raised in the previous hearing before Master Ho. 44. I reject Mr Poon’s proposition that the court should not consider those allegations not included in the Amended Statement of claim. The wrongdoings which happened before the Agreement was signed were stated clearly in the plaintiff’s affirmation. They are supported by documentary evidence. In fact, the defendant has made a reply in response in her own affirmation dated on 9 January 2014 and 22 August 2014. I see no prejudice against the defendant. Furthermore, I take notice of the underlying objectives under Order 1A rule 2(2). It provides that the primary aim in exercising powers of the court is to secure the just resolution of the disputes in accordance with the substantive rights of the parties. Therefore I find the wrongdoings happened before 2005 are relevant in the stay application. The issues of these wrongdoings are obviously not the subject matter in the PRC court. 45. Even if I am wrong in the ruling, there is identity of subject matters in the two proceedings. In any event, a stay is not automatically ordered if it can be shown that there is a legitimate purpose in proceeding with two sets of proceedings: see Linfield Ltd per Ma J(as he then was) endorsing the judgment of The Abidin Daver (supra) at 411G-412A. 46. Lastly, the defendant has failed to establish that continuing the present proceedings would cause an injustice to her. The fact that the PRC proceedings are underway does not assist the defendant’s application of stay. Up to this stage, there is no information if the trial result will be in her favour. In any event, the defendant has filed her pleadings and statements for the present proceedings. There is no evidence of unusual hardship might be caused to the defendant. The preparation for trial in the Hong Kong action would involve little extra time, effort and expense on her. 47. All in all, the whole factual matrix of the plaintiff’s claims tied in Hong Kong and had nothing or very little connection with the mainland. Both the plaintiff and the defendant are Hong Kong residents. Great Enterprise was incorporated in Hong Kong. FC and the D’s GE are Hong Kong companies. The alleged wrongdoings of the defendant all happened in Hong Kong. To redress the wrongs committed by the defendant in Hong Kong, the plaintiff must bring and continue the Hong Kong action. It has exclusive jurisdiction. In my view, I think it would be highly unsatisfactory for the plaintiff’s claims to be litigated in a different jurisdiction: see Intel Corporation v Via Technologies Inc & Anr ., HCA 4265/2001 (30 July 2002) at §17 per Sakhrani J. 48. The defendant fails to discharge the burden to show that the court should exercise its discretion to grant a stay. The application is therefore dismissed. COSTS 49. I make an order nisi that the defendant shall pay the plaintiff’s costs of both the Time Extension Summons and the Stay Summons, with certificate for counsel, to be taxed if not agreed. ( Amy Chan ) Deputy District Judge Miss Anny Chak, instructed by Lui & Law, for the plaintiff Mr Kevin HM Poon, instructed by Chui & Lau, for the defendant [1] see: Linfield Ltd v Taoho Design Architects Ltd [2002] 2 HKC 204 , 208A-I, per Ma J (as he then was), Intel Corp v Via Technologies Ltd [2002] 3 HKC 650 , 655B-656C, per Sakhrani J, and Ho Siu Pui v Yue Sheng Finance Ltd , unreported, HCA 3060/2001, 27 August 2002 at §§44-52, per Kwan J (as she then was), affirmed on appeal by the Court of Appeal in [2003] 1 HKC 621 Look up this case on Lawcite Noteup",
  "length": 23768,
  "headers_seen": [
    "BACKGROUND",
    "The PRC proceedings",
    "The present proceedings",
    "TIME EXTENSION SUMMONS",
    "STAY SUMMONS",
    "The Principle on lis alibi pendens",
    "Discussion",
    "Ought a stay be granted in the present proceedings?"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkdc/2014/1149",
  "query": "non-disclosure agreement",
  "ts": "2025-10-17T10:45:13",
  "ok": true
}