{
  "title": "WELTIME HONG KONG LTD. V. KEN FORWARD ENGINEERING LTD. | [2000] HKCFI 199 | HKLII",
  "court": null,
  "year": 2000,
  "date": "2025-10-19",
  "content": "HKLII Databases Court of First Instance [2000] HKCFI 199 WELTIME HONG KONG LTD. V. KEN FORWARD ENGINEERING LTD. Judgment Information Date 4 Dec, 2000 Action No. HCCT108/2000 Neutral Cit. [2000] HKCFI 199 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCCT108/2000 HCCT000108/2000 XCHRX WELTIME HONG KONG LTD. v. KEN FORWARD ENGINEERING LTD. HCCT000108/2000 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NOS.73, 97 AND 108 OF 2000 ------------------------ HCCT73/2000 IN THE MATTER OF The Arbitration Ordinance AND IN THE MATTER OF an arbitration ------------------------ BETWEEN WELTIME HONG KONG LIMITED Plaintiff AND KEN FORWARD ENGINEERING LTD Defendant ------------------------ AND HCCT97/2000 IN THE MATTER OF The Arbitration Ordinance AND IN THE MATTER OF an Arbitration Award dated 11 August 2000 given by Mr Daniel C. Lam ------------------------ BETWEEN HEALTHY SUN sLIMITED Plaintiff (Respondent in Arbitration) AND KEN FORWARD ENGINEERING LTD Defendant (Claimant in Arbitration) ------------------------ AND HCCT108/2000 IN THE MATTER OF The Arbitration Ordinance AND IN THE MATTER OF an Arbitration Award dated 6 September 2000 given by Ms W.M. Whittaker ------------------------ BETWEEN WELTIME HONG KONG LIMITED Plaintiff (Respondent in Arbitration) AND KEN FORWARD ENGINEERING LTD Defendant (Claimant in Arbitration) ------------------------ Coram : Hon Burrell J in Chambers Date of Hearing: 27 November 2000 Date of Decision: 5 December 2000 ------------------------- D E C I S I O N ------------------------- 1. There are four summonses before the court, only two of the four (the two substantial matters) have been argued and this decision only related to those two. They are applications by the plaintiff (who is the respondent in the arbitration proceedings between the same parties) for leave to appeal two arbitrator's interim awards which deal with an issue of jurisdiction. 2. There are two arbitrations under way. The claimant is the same in both (Ken Forward Engineering Ltd). The respondents are Weltime Hong Kong Limited and Healthy Sun Limited. The contract documents are the same in each case. 3. Two different arbitrators have been appointed. They have both been asked to make a ruling on a question of jurisdiction. They have both done so and made the same decision. The issue 4. The issue concerns whether or not the arbitrators have been validly appointed under the provisions of the arbitration clause in the contract, clause 35. The relevant part of clause 35 reads as follows : \"... such dispute or difference shall be and is hereby referred to the arbitration and final decision of a person to be agreed between the parties, or, failing agreement within fourteen days after either party has given to the other a written request to concur in the appointment of an Arbitrator, a person to be appointed on the request of either party by the President or Vice-President for the time being of The Hong Kong Institute of Architects co-jointly with the Chairman or Vice Chairman for the time being of the Royal Institute of Chartered Surveyors (Hong Kong Branch).\" 5. Thus the contract provides for the appointment of an arbitrator (a) by consent; or (b) if not by consent, by the Hong Kong Institute of Architects' President or Vice-President (\"HKIA\") co-jointly with the Royal Institute of Chartered Surveyors' (Hong Kong Branch) Chairman or Vice Chairman. Failing an appointment by (a) or (b), then the provisions of the Arbitration Ordinance , Cap.341 , namely section 12, would be applicable. 6. The problem which arose came about because on 1 September 1997, the Royal Institute of Chartered Surveyors (\"the RICSHK\") ceased to exist. The Hong Kong Institute of Surveyors (\"the HKIS\") which had been in existence since 1993 took over its functions. The problem in relation to each arbitration is similar but not identical because of the chronology of events. I therefore outline the problems separately. The \"Healthy Sun\" contract 7. This was entered into in 1995 using a standard form of contract which referred to the RICSHK. The arbitral issues arose in 1998 when the RICSHK had ceased to exist. The claimant failed to get the respondent's consent to the appointment of an arbitrator ((a) above) and ignored (b) above because there was no such body as the RICSHK at the time. It therefore went to the Hong Kong International Arbitration Centre (\"HKIAC\") under section 12 of Cap.341 and an arbitrator was appointed. 8. The respondent submitted to the arbitrator that he had not been validly appointed because the claimant should have applied to the HKIA co-jointly with the HKIS, as successor to the RICSHK before resorting to section 12. The learned arbitrator disagreed. The \"Weltime\" contract 9. This was entered into in about November 1997 after the RICSHK had ceased to exist. Nonetheless the standard form of contract which the parties used and which they both signed was a pre-1997 out of date form which did refer to the RICSHK in clause 35. Again, when the arbitral issues arose in 1998, the claimant went straight to the HKIAC for the appointment of an arbitrator, having failed to appoint one by consent under (a) above. (b) was again passed over because the claimant could not apply to a non-existent body. 10. When asked to rule on the matter, the learned arbitrator came to the same conclusion, namely that her appointment was valid. 11. Before setting out the relevant parts of the two interim awards which deal with the issues, it is useful to set out the chronology of events since 1998 (I only set out the Weltime chronology, although the Healthy Sun chronology is similar). 14 September 1998 - The claimant wrote to the respondent, seeking their consent to the appointment of an arbitrator. The respondent failed to reply. 29 September 1998 - (i.e. 14 days later) Claimant requested HKIAC to nominate an arbitrator. The request was copied to the respondent who did not reply and therefore did not complain. HKIAC proposed Ms W Whittaker as the arbitrator. The parties were invited to comment. The claimant approved the proposal. The respondent again remained silent. 3 November 1998 - HKIAC appointed Ms W Whittaker. 16 November 1998 - The arbitrator proposed a preliminary meeting, in writing. In fact, an adjournment was requested and agreed to, pending negotiations. 26 April 2000 - (19 months later) Negotiations having failed, the respondent wrote to the arbitrator informing her that a preliminary point would be taken, challenging the validity of her appointment. 12. I now set out the reasons given by each arbitrator when finding against the respondent on the preliminary point of jurisdiction. Weltime 13. On 6 September 2000, the interim award was published. The relevant part is as follows : \"22. Referring to S.12(2) of the Ordinance, the Respondent argued that no 'refusal' or 'failure to appoint' had occurred, no request having been made to those given power to appoint under the arbitration agreement, and the HKIAC's power to appoint could not arise until seven days after notice was served on them. The Respondent contended that either the reference in Clause 35 to RICS (HK Branch) should be deemed superfluous and any request for appointment made by the President/Vice-President of HKIA alone, or that the reference should read as being the Hong Kong Institute of Surveyors (HKIS). The latter was put forward on grounds that I should endeavour to give all words in the Contract some meaning and that the parties would have substituted HKIS for RICS (Hong Kong Branch), had they known of the latter's dissolution. 23. The Claimant submitted that strict compliance with Clause 35 would have resulted in a HKIAC appointment in any event. It also argued that dissolution of the RICS (HK Branch), should, for commercial interpretation be taken as an event frustrating the appoint mechanism agreed, and would render the need for an HKIAC appointment necessary under S.12(1) of the Ordinance. 24. I find that the dissolution of the RICS (HK Branch) was not a supervening event and cannot be held to have frustrated (in the legal sense) the appointment procedure dictated by Clause 35 of the Contract. 25. Clause 35 plainly calls for a co-joint appointment of an arbitrator by two persons. I understand the expression 'co-joint' as emphasising the need for two to participate. One of the two persons, the Chairman or Vice-Chairman for the time being of the RICS (HK Branch), did not exist following dissolution of that body, and I hold that an appointment by the President or Vice-President for the time being of HKIA acting alone would not satisfy the provisions of the arbitration agreement. 26. I am not persuaded that the parties would necessarily have substituted the President or Vice-President of the HKIS, had they been aware of the dissolution of RICS (HK Branch) during formation of the Contract. I therefore find that application to the HKIS, unless an agreed course of action, would not have been appropriate. 27. I find that under the circumstances Clause 35 was technically inoperable. An approach to the persons named in the arbitration agreement would have resulted in an HKIAC appointment in any event. On a commercial interpretation such an approach could be said to be frustrated in the ordinary sense, and it would have been a waste of time and money. 28. In applying to the HKIAC for an appointment, the matter of the RICS (HK Branch) dissolution was noted by the Claimant. Prior to my appointment, the HKIAC invited comments. The Respondent took no objection to the Claimant's application nor to my appointment, and must be held to have concurred in the process. It would appear that on a commercial interpretation, the Respondent had regard to the same considerations as expressed in Paragraph 27 above.\" Healthy Sun 14. On 11 August 2000, the Healthy Sun arbitrator, Mr Daniel Lam JP, published his interim award which stated : \"The Respondent suggested that the proper procedures would be either an appointment should be made by the President of the HKIA alone, or that the HKIS would substitute the RICSHKB in the agreement to arbitrate. The Claimant highlighted the words 'co-jointly' and stressed that the appointment must not be made by any President of the HKIA alone. The Claimant also pointed out that they requested the Respondent on the 16th March 2000 to concur on the appointment of an arbitrator, and they did not receive any response. The Claimant then went to the Hong Kong International Arbitration Centre (hereinafter referred to as the HKIAC) on the 18th April 2000 for an appointment, and the Respondent who were copied in made no response. Reading into the relevant Clause 35 of the Agreement, I am satisfied that the intention of the parties at the time of entering into the contract is to have the President of the HKIA co-jointly with the Chairman of the RICSHKB to make the appointment. The suggestion that one of these parties may make the appointment, in the default of the other party (for whatever reason), cannot be acceptable to me. On the 28th April 2000, the HKIAC wrote to both parties proposing to appoint me, Daniel C Lam, and yet there was no response from the Respondent. Then on the 17th May 2000 I, Daniel C Lam, was appointed. The Respondent relied on the strict compliance of the contract and that according to the Claimant, it would be the HKIAC making the appointment in any event. The Respondent also suggested that there are two commercial interpretations:- firstly that the RICSHKB is superfluous; or secondly that the RICSHKB should read as if it is HKIS ... ... The Claimant stated that their letter written on the 18th April 2000 addressed to the HKIAC requesting for the appointment of an arbitrator 'evinced an unequivocal intention' that the Claimant did not agree to substitute the HKIS for RICSHKB. The Claimant further pointed out that the Respondent never suggested HKIS throughout before the HKIAC appointed me, Daniel C Lam, as the Arbitrator, and the Respondent remained all the time in complete silence. The Respondent maintained that the reference to RICS should read as if it was HKIS. I am satisfied that HKIS made it categorically clear that unless by consent of both parties, they cannot substitute RICSHKB. The Claimant did confirm that they gave no consent on this. Although it may be argued that the Claimant could have first sought the consent of the Respondent to the substitution of RICSHKB by HKIS, this does not help to advance the present process. The Respondent were silent at the time of the appointment period and should not be allowed to rely on this procedural point to overthrow the appointment. I am satisfied that, in the circumstances, the Claimant had approached the HKIAC in accordance with the Arbitration Ordinance properly and the appointment was made properly, without causing any hardship on the Respondent who remained silent throughout that period.\" 15. It is against these findings which leave to appeal is sought. With the consent of the parties, I have decided that this is an appropriate case to deal with the question of leave and the substantive appeal together. The test to be applied in application for leave to appeal arbitrators' awards 16. In order to obtain leave, the plaintiff/respondent in arbitration must show : (1) In all the circumstances, the determination of the question of law could substantially affect the rights of either of the parties (section 23(4), Cap.341 ). (2) If it is at the top of the scale or spectrum, namely a \"one-off\" case or \"one-off\" event, then leave will only be granted if the arbitrator is so obviously wrong as to preclude the possibility that he might be right; or if he is \"plainly wrong\". (3) If it is at the bottom of the scale (such as in a commonly used standard form in regular use or a clause or circumstance which often arises), then it is still necessary to show a strong prima facie case of error. ( In re PT Dover Chemical Company v. Lee Chang Yung Chemical Industry Corporation [1990] 2 HKLR 257 ). 17. Mr Chain for the plaintiff submits that as the point in issue is one of pure construction, the PT Dover test has no application. He submits this court must decide simply if the arbitrators' decision on construction is right or wrong. If the arbitrator got it wrong, the appeal must succeed. 18. I do not agree with this initial approach. Whether the question of law being appealed is a point of \"pure construction\" or the interpretation of a term of a contract makes no difference. The fundamental principle that the onus is on the plaintiff to show at least a strong prima facie case that the arbitrator was wrong still applies. I do not accept that the reasoning behind the PT Dover test, for some reason, does not apply in this case. The fact remains that the parties agreed to an arbitration clause. That clause is but one in a lengthy contract document. All clauses, including the arbitration clause itself, may be subject to legal argument by the parties before the arbitrator. The threshold is a high one in this as in any other application for leave to appeal an award. 19. Moreover, the PT Dover test provides for a sliding scale. The issue before me is neither at the top nor the bottom of that scale. It is not at the bottom of the scale because it does not concern the interpretation of a clause which regulates the conduct of the parties which will regularly arise and be of importance to the industry generally. Neither is it at the top because it may not be a one-off situation which only concerns these parties. It is possible that the same situation will arise again where an arbitration issue arises post-1997 which contains a reference to the pre-1997 RICSHK. However, such a situation has not occurred in this court before and the likelihood of it arising again diminishes with the effuxion of time. I therefore judge the point to be towards the top of the scale. The plaintiff must, therefore, reach a threshold which is close to demonstrating that the arbitrators, both of them, could not possibly have been right. 20. That threshold has not been reached. Both arbitrators found favour with the tenable argument that as the RICSHK did not exist at the material time, the second limb of clause 35 ((b) above) could not be performed. In support of this approach, it is emphasized that the change from RICSHK to HKIS in September 1997 was not a change in name only in the sense that the same body carried on albeit under a different name. The HKIS was a different body which had co-existed with the RICSHK for four years prior to 1997. HKIS was patently not the body which the parties had agreed to approach in trying to appoint an arbitrator. It is unnecessary to repeat, for the purposes of individual analysis, each of the points referred to by the learned arbitrators. It is sufficient to say they are cogent, relevant and not plainly wrong. 21. The plaintiff's submission is premised on the contention that the parties must have intended to have the arbitrator selected by the HKIA and the successor to the RICSHK. This is an assumption which cannot be made. Moreover, even concerning the Weltime contract (which had been signed post the dissolution of the RICSHK, using an out of date version of the standard form of contract) the learned arbitrator determined, that clause 35 required an appointment by two bodies co-jointly. One of those bodies did not exist. The appointment mechanism did not provide for the appointment by the HKIA alone and the agreed co-joint appointment mechanism was impossible to perform. I reject the submission that this approach was plainly wrong. 22. Finally, the submission that the claimant should first of all have attempted to perform the contract by applying to a non-existent body is without merit. It is not possible to apply to a body which does not exist. Fortunately, this is not a situation whereby the contract becomes unworkable because of a term, the performance of which is impossible. Normally in such a situation a court would strive to give the words of such a clause some meaning so as to make the contract work. Here, however, the parties have section 12 of the Arbitration Ordinance , the application of which does result in the appointment of an arbitrator, whereas limb (b) of clause 35 does not. The parties chose to arbitrate their differences. In order to give effect to that choice, section 12 of Cap.341 has been applied properly. 23. In assessing the merits of the respondents' submissions, which were skillfully advanced by Mr Chain, some regard must be had to the fact that the point was first made some 19 months after the appointments were made and only after attempted settlement negotiations had broken down. Had his submissions succeeded, the only consequence would be that the parties go back to square one and start again. No dispute? 24. In respect of the Weltime contract, Mr Chain, for the plaintiff, make a separate additional submission. Although not specifically referred to in the application for leave to appeal, it is brought under the general argument that the arbitrator has no jurisdiction. 25. It is submitted that the matter referred to in the notice of arbitration (in the claimant's letter to the respondent dated 14 September 1998) is not a dispute which can be referred to arbitration. In short, the letter gives notice of two disputes : (a) a failure to make interim payments of $72,648,557 on architects certificates, and (b) loss and damage arising. 26. Mr Chain submits that interim certificates represent an estimated value of work done and as such are only of provisional validity. If, he submits, the contract comes to a premature end, the provisional validity of the certificates comes to an end. Then, clause 25 or 26 (depending on who terminated the contract) governs the parties' rights and liabilities. He submits that it was never in dispute that the interim payments were not made. Furthermore, once the contract is determined, the liability to pay on the interim certificates disappears because such disputes as there may be then arise under clause 25 or 26. 27. It is well settled that the definition of a dispute for arbitration purposes is very wide indeed. The simple definition is : \"There is a dispute until the defendant admits that the sum is due and payable.\" 28. A mere glance at the realities reveals an obvious dispute. The dispute is not whether or not the interim payments were actually made, it is common ground that they were not; the dispute concerns the reasons for and consequences of their admitted failure to pay. The arbitration notice defines the dispute as the loss and damage arising from the failure to pay. It is plainly arguable that the failure to pay creates a debt which is in dispute. It is true that after termination of the contract, the claimant's claim is for the value of the works completed and unpaid for. It is open to the claimant to rely on the architects certificates as prima facie evidence of the value of those works. It is for the arbitrator to decide the difference, if any, between the value of the works done and value of the certificates. In my judgment, the submission that the claimants are prevented from pursuing their claim simply because the respondents have admitted that the interim payments were never paid is misconceived. The respondents admit the certificates were never paid but they do not admit that the sum claimed is due and payable. If they did, they would have paid it. 29. On the issue of jurisdiction raised in the plaintiff's summons, concerning the validity of the arbitrators' appointments and the existence or otherwise of a dispute between Weltime and Ken Forward, I find in favour of the defendant (the claimant in arbitration) and dismiss the plaintiff's summons with costs. (M.P. Burrell) Judge of the Court of First Instance, High Court Representation: Mr Benjamin Chain, instructed by Messrs Sit, Fung, Kwong & Shum, for the Plaintiff Mr Jeevan Hingorani, instructed by Messrs Fung, Wong, Ng & Lam, for the Defendant Look up this case on Lawcite Noteup",
  "length": 22232,
  "headers_seen": [
    "The issue",
    "The \"Healthy Sun\" contract",
    "The \"Weltime\" contract",
    "Weltime",
    "Healthy Sun",
    "The test to be applied in application for leave to appeal arbitrators' awards",
    "No dispute?"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2000/199",
  "query": "HKIAC",
  "ts": "2025-10-17T10:44:49",
  "ok": true
}