{
  "title": "SOL INTERNATIONAL LTD. V. GUANGZHOU DONG-JUN REAL ESTATE INTEREST CO. LTD. | [1998] HKCA 516 | HKLII",
  "court": null,
  "year": 1998,
  "date": "2025-10-14",
  "content": "HKLII Databases Court of Appeal [1998] HKCA 516 SOL INTERNATIONAL LTD. V. GUANGZHOU DONG-JUN REAL ESTATE INTEREST CO. LTD. Judgment Information Date 5 Aug, 1998 Action No. CACV50/1998 Neutral Cit. [1998] HKCA 516 Parallel Cit. [1998] 2 HKLRD 637 [1998] 3 HKC 493 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History CACV50/1998 CACV000050/1998 SOL International Ltd. v. Guangzhou Dong-jun Real Estate Interest Co. Ltd. CACV000050/1998 1998, No. 50 (Civil) IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF APPEAL BETWEEN SOL International Limited Applicant (Respondent) AND Guangzhou Dong-jun Real Estate Interest Company Limited Respondent (Appellant) ---------------------- Coram : Hon. Mortimer, V.-P., Godfrey and Rogers, JJ.A. in court Date of hearing : 2 July 1998 Date of handing down judgment : 6 August 1998 ---------------------- J U D G M E N T ---------------------- Godfrey, J.A. : Introduction 1. The question with which we are presently concerned on this appeal is a question as to the jurisdiction of the court to entertain an application for leave to appeal against an arbitrator's award. The facts 2. By a contract dated 16 August 1995 and made between (1) Guangzhou Dong-jun Real Estate Interest Company Ltd. (\"the employer\") and (2) SOL International Ltd. (\"the contractor\"), the contractor agreed to carry out interior fitting work for the employer at a shopping arcade in Guangzhou, People's Republic of China. 3. The contract provided that any dispute between the parties that might arise from it should be referred to arbitration. A dispute (the details of which are for present purposes immaterial) did arise between the parties and on 6 September 1996 one LEUNG Hing-fung (\"the arbitrator\") was appointed to act as arbitrator. 4. On 25 October 1996, the arbitrator made, in writing, and by consent, an \"order for directions\". 5. This order provided (among other things) that save and except as therein mentioned the Domestic Arbitration Rules (1993 Edition) published by the Hong Kong International Arbitration Centre were to be adopted for the arbitration proceedings. (The savings and exceptions mentioned are immaterial.) 6. The arbitration was duly conducted in accordance with those Rules. 7. On 15 October 1997, the arbitrator made a final award (save as to costs) with which the contractor was dissatisfied. 8. On 23 January 1998, the contractor sought leave from Findlay, J. to appeal against the award and (in part) obtained such leave. 9. On 18 February 1998, the employer gave notice of its intention to move this court to set aside Findlay, J.'s order on grounds going to the court's jurisdiction to entertain the contractor's application for leave to appeal against the arbitrator's award, as to which jurisdiction it had taken no objection before Findlay, J. 10. On 3 March 1998, the contractor gave notice of its intention to support the judge's order in this court, asserting that judge did have jurisdiction to make his order; alternatively, that that the employer's conduct (in participating in the arbitration) gave rise to an estoppel against it, and that anyway the points now taken by the employer were not taken before the judge. 11. On 2 July 1998, these matters came before this court and we reserved judgment upon them. The legislative background 12. Before I turn to consider the employer's objection to the order of Findlay, J. I shall have to explain the legislative background against which it is formulated. 13. Arbitration in Hong Kong is regulated by the Arbitration Ordinance , Cap. 341 (\"the Ordinance\"). An important feature of the Ordinance is the distinction which it makes between domestic and international arbitration agreements. As appears from section 2 (the definition section), for the purposes of the Ordinance, an \"international arbitration agreement\" is an agreement pursuant to which an arbitration is, or would, if concluded, be international within the meaning of article 1(3) of the UNCITRAL Model Law. Article 1(3) reads as follows : \"1(3) An arbitration is international if: (a) the parties to an arbitration agreement have, at the time of the conclusion of that agreement, their places of business in different States; or (b) one of the following places is situated outside the State in which the parties have their places of business: (i) the place of arbitration if determined in, or pursuant to, the arbitration agreement; (ii) any place where a substantial part of the obligations of the commercial relationship is to be performed or the place with which the subject-matter of the dispute is most closely connected; or (c) the parties have expressly agreed that the subject-matter of the arbitration agreement relates to more than one country.\" 14. A \"domestic arbitration agreement\" is defined as an arbitration agreement that is not an international arbitration agreement. 15. Section 2AA of the Ordinance provides as follows : \"2AA Objective and principles of Ordinance (1) The object of this Ordinance is to facilitate the fair and speedy resolution of disputes by arbitration without unnecessary expense. (2) This Ordinance is based on the principles that - (a) subject to the observance of such safeguards as are necessary in the public interest, the parties to a dispute should be free to agree how the dispute should be resolved; and (b) the Court should interfere in the arbitration of a dispute only as expressly provided by this Ordinance.\" 16. Part IA of the Ordinance contains provisions applicable to domestic and international arbitration; Part II contains provisions relating to domestic arbitration; and Part IIA contains provisions relating to international arbitration. 17. The Ordinance provides for a fair degree of what is sometimes called \"party autonomy\". In particular, it provides that Part II, although concerned with domestic arbitrations, may in certain circumstances apply to an international arbitration agreement, and to an arbitration pursuant to an international arbitration agreement. The relevant provision is contained in section 2M, which reads as follows : \"2M. Application to international arbitration agreements This part [Part II] applies to an international arbitration agreement and to an arbitration pursuant to an international arbitration agreement if, but only if, the agreement provides or the parties to the reference agree in writing - (a) that this Part is to apply; or (b) that the agreement is, or is to be treated as, a domestic arbitration agreement; or (c) that a dispute is to be arbitrated as a domestic arbitration.\" The first question : Is section 2M satisfied? 18. Under the regime prescribed by the Ordinance for international arbitrations, the right of a party dissatisfied with an arbitrator's award to appeal to the court is much more severely circumscribed than it is in the case of domestic arbitrations. It may be assumed that, generally, in the case of an award made in an international arbitration, the court would have no jurisdiction to entertain an application such as the contractor's application here for leave to appeal against the arbitrator's award. On this footing, the first question is whether, the arbitration agreement here being (as it clearly is) an international arbitration agreement, the contractor can nevertheless bring itself within the regime prescribed by the Ordinance for domestic arbitrations, something it can do only if it can demonstrate that the conditions of section 2M are satisfied. 19. I would answer this question in the negative. 20. I am not satisfied that, here, the contractor and the employer can be said to have agreed in writing (a) that Part II of the Ordinance was to apply to the arbitration; or (b) that their agreement for arbitration was, or was to be treated as, a domestic arbitration agreement; or (c) that this dispute was to be arbitrated as a domestic arbitration. Certainly, the contractor cannot point to anything signed by the parties in this connection; but, for my part, I do not think this matters : cp. Excomm Ltd. v. Ahmed Abdul-Qawi Bamaodah (\"The St. Raphael\") [1985] 1 Lloyd's Law Reports 403 (see especially per Lloyd L.J. at p.409). In that case, it was held, or re-affirmed, that an unsigned document which recognised the existence of an arbitration agreement between the parties was enough to satisfy a requirement of \"a written agreement to submit present or future differences to arbitration\". But, in our case, all that the \"order for directions\" did was to record the agreement of the parties that the Rules therein mentioned should be adopted for the arbitration proceedings. I have not found the matter altogether easy, but in the end I have concluded that the agreement between the parties to adopt those Rules is not enough unequivocally to satisfy any one of the requirements (a), (b) or (c) mentioned in section 2M of the Ordinance. Unless the writing said to constitute the agreement between the parties does state, unequivocally, that they have agreed that Part II of the Ordinance shall apply; or that the agreement is, or is to be treated as, a domestic arbitration agreement; or that the dispute is to be arbitrated as a domestic arbitration, an international arbitration, in my judgment, remains an international arbitration, and is not converted, as it were, into a domestic arbitration, notwithstanding that, for the purposes of that international arbitration, a set of Rules labelled \"Domestic Arbitration Rules\" has been adopted. It is for these reasons that I would hold that the contractor here has not proved an agreement in writing between the parties sufficient to apply Part II of the Ordinance to their (international) arbitration agreement. (I should add for completeness that if the writing relied on had unequivocally recognised the existence of an agreement between the parties as to (a), (b) or (c) in section 2M, e.g. an agreement \"that the dispute is to be arbitrated as a domestic arbitration\", that, in my judgment, would have been good enough, by analogy with the reasoning in the case of \" The St. Raphael \" cited above; but as I see it that is not the case here.) The second question : estoppel? 21. If the conditions of section 2M have not been satisfied, and the court accordingly had no jurisdiction here to entertain the contractor's application for leave to appeal, reliance on an estoppel cannot assist the contractor. As Mortimer, J.A. pointed out in the (very similar) case of Ananda Non-Ferrous Metals Ltd. v. China Resources Metal and Minerals Co. Ltd. [1994] 1 HKC 204 , at p.210H : \"..... however flexible the doctrine of estoppel as between the parties is, it cannot confer jurisdiction on the court when the parties cannot achieve this result even by clear oral agreement. This would enable a party to establish the fact upon which the court's statutory and only jurisdiction depends, by showing that it would be unconscionable for the other party to deny it. This cannot be done. It would enlarge the scope of estoppel far beyond the equitable regulation of affairs as between the parties themselves which cannot be justified in principle or on authority.\" 22. I agree. 23. For the future, I hope we shall never again be faced with an argument that a jurisdiction which the court would not otherwise possess has been conferred on it or by estoppel or waiver; this is just as contrary to first principles as is the proposition that a jurisdiction which it would not otherwise possess can be conferred on the court by consent. The third question - a new point? 24. The point now taken by the employer in this court is a new point, not taken before the judge. But a point as to jurisdiction may be taken at any time and this new point being of that character we are entitled and indeed bound to entertain it. Conclusion 25. I would dismiss for want of jurisdiction the contractor's application for leave to appeal to the court against the arbitrator's award made in this international arbitration. As to costs, I would be minded in all the circumstances to make no order as to the costs of either party, both in this court and before the judge. Rogers, J.A. 26. I agree with the judgment of Godfrey J.A. and only wish to add this. 27. The requirements of sub-paragraphs (a) - (c) of Section 2M of the Arbitration Ordinance , Cap. 341 dictate that there must be some precision as to the nature of the agreement between the parties. This appears to me to be all the more so because Section 2AA(2)(b) requires the Court to interfere in the arbitration of a dispute only as expressly provided by the Ordinance itself. Assuming, for the purposes of the argument, that the order for directions made by the arbitrator constituted an agreement in writing, that agreement was simply that certain rules should apply. The agreement was not that part of the Ordinance should apply nor that the arbitration agreement should be treated as a domestic arbitration agreement nor that the dispute should be arbitrated as a domestic arbitration agreement, bringing in its chain all the consequences including \"interference\" by the Court under certain circumstances. 28. Section 2AC of the Ordinance includes a broad range of situations where an agreement will be considered to be in writing for the purposes of considering whether it is an arbitration agreement. Such a broad definition is in keeping with Section 2AA. In contrast, however, it would seem that a narrower interpretation may be appropriate in respect to Section 2M. For the purposes of this case, however, I do not consider it necessary for that to be decided. Mortimer, V.-P.: 29. I agree for the reasons already given that this appeal must be allowed. 30. There is no dispute that this agreement (when made) was an international arbitration agreement subject to the Arbitration Ordinance , Cap. 341 (the Ordinance). 31. The Ordinance provides different regimes for domestic and the international arbitrations. The most important difference between the two is that concerned in this case - a right of appeal is given in domestic arbitrations, but denied in international arbitrations. 32. The importance of certainty as to which regime applies is obvious. This is the purpose of Section 2M which must be strictly construed and applied. See in this context Section 2 AA(2)(b): \"the Court should interfere in the arbitration of a dispute only as expressly provided by this Ordinance.\" 33. In spite of valiant efforts, Mr. Russell Coleman, for the contractor, is not able to point to any agreement in writing which provides within Section 2M, that Part II of the Ordinance is to apply; or that the agreement is, or is to be treated as, a domestic arbitration agreement; or that the dispute is to be arbitrated as a domestic arbitration. 34. Further, the contractor cannot rely upon estoppel to found the court's jurisdiction. On this, I do not resile from anything I said in Ananda Non-Ferrous Metals Ltd. v. China Resources Metal and Minerals Co. Ltd. [1994] 1 HKC 204 . 35. The submission by Mr. Adrian Bell, (who did not appear below) upon which the appeal has succeeded goes to jurisdiction. Therefore it was necessary for this court to entertain the point although it was not taken before the judge. In these circumstances I also would make no order for costs both here and below. (Barry Mortimer) (Gerald Godfrey) (Anthony Rogers) Vice-President Justice of Appeal Justice of Appeal Representation: Mr. Adrian Bell & Mr. James Lee (M/s. Ng Lie Lai & Chan) for Appellant/ Respondent Mr. Russell Coleman (M/s. Sit Fung Kwong & Shum) for Respondent/Applicant Look up this case on Lawcite Noteup",
  "length": 15671,
  "headers_seen": [
    "Introduction",
    "The facts",
    "The legislative background",
    "The first question : Is section 2M satisfied?",
    "The second question : estoppel?",
    "The third question - a new point?",
    "Conclusion"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkca/1998/516",
  "query": "arbitration",
  "ts": "2025-10-14T11:20:55",
  "ok": true
}