{
  "title": "DALMOR SHIPPING CO LTD V. KAN'S MARITIME CORPORATION | [1997] HKCFI 305 | HKLII",
  "court": null,
  "year": 1997,
  "date": null,
  "content": "HKLII Databases Court of First Instance [1997] HKCFI 305 DALMOR SHIPPING CO LTD V. KAN'S MARITIME CORPORATION Judgment Information Date 8 Dec, 1997 Action No. HCAJ343/1997 Neutral Cit. [1997] HKCFI 305 Parallel Cit. [1998] 1 HKC 221 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCAJ343/1997 HCAJ000343/1997 DALMOR SHIPPING CO LTD v. KAN'S MARITIME CORPORATION HCAJ000343/1997 IN THE HIGH COURT OF THE HONG KONG SAR COURT OF FIRST INSTANCE ADMIRALTY JURISDICTION AJ Folio 343 of 1997 ----------------- Admiralty Action in Rem against the Ship \"BRITANNIA\" BETWEEN DALMOR SHIPPING CO. LTD. Plaintiff AND KAN'S MARITIME CORPORATION Defendant ----------------- Coram: The Hon. Mr. Justice Waung in Court Date of Hearing: 3 and 9 December 1997 Date of Delivery of Judgment: 9 December 1997 ----------------- JUDGMENT ----------------- 1. The ship Britannia (\"the Vessel\") owned by the Plaintiff (\"the Owners\") was demise chartered to the Defendant, a Taiwanese charterer (\"the Defendant\"). The Bareboat charterparty dated 1st November 1995 (\"the CP\") was for a period of 26 months. Daily Charter Hire in the amount of US$2,000 was payable every month in advance without deductions, set-off or transfer costs. By Clause 9(g) of the CP, it was provided that in default of payment beyond of a period of 10 running days, the Owners have the right to withdraw the Vessel from the service of the Defendant. The Vessel was delivered to the Defendant without crew pursuant to the CP as this was a bare boat charter. The Defendant therefore effectively has the full control and possession of the Vessel with its own crew under its direct order. The Defendant paid the first 19 instalments hire up to May 1997 and therefore defaulted in payment of hire. On the basis of loss of hire or income at US$60,000 per month, the Owners are now effectively out of pocket by some US$360,000. 2. But that is not the end of the problem for the Owners. The Owners gave notice of withdrawal of the Vessel the first time on 15th July 1997 and a second time on 12th September 1997. The Defendant however in addition to paying no hire, also refused to deliver the Vessel back to the Owners. It is in these circumstances that the Owners caused the Plaintiff's own ship, the Vessel to be arrested on the 4th of November 1997 pursuant to a Warrant of Arrest (\"1st Warrant\") granted by Findlay, J. as the Duty Judge. The Owners claimed in the In Rem Writ, possession of the Vessel and damages for detention of the Vessel. The response from the Defendant to the arrest of the Vessel, after some time, was to apply to the Court by Notice of Motion dated 26th November 1997:- (1) to set aside the arrest on the basis of material non-disclosure and a technical point that the 1st Warrant was issued and executed prior to the issue of the Writ and that therefore the Court had no jurisdiction to grant the 1st Warrant and (2) to stay the proceedings of the present Action in Hong Kong because of the arbitration between the Owners and the Defendant. What had happened is that pursuant to the arbitration clause in the CP, both the Owners and the Defendant had appointed arbitrator in London and the London arbitration under the CP effectively commenced in late November 1997. 3. When the Motion came on before me on the 28th November 1997, I gave directions for the filing of Affidavits and exchange of Skeleton Arguments for the 3rd December hearing of the Defendant's Motion and the Owners' application for inspection of the Vessel. At the hearing of the various applications on the 3rd of December 1997, because of the limited time available and the complexity of the many issues raised by the parties by their applications, it was resolved by me with the concurrence of Mr. Barlow for the Defendant and Mr. Kerr for the Owners, that:- (a) I should grant a new Warrant of Arrest immediately (\"2nd Warrant\") which will render the 1st Warrant debate merely of costs relevance; and (b) the matter of the inspection of the Vessel might be done by agreement if possible and if not by later application (this aspect was subsequently only partially resolved by agreement and eventually I granted on 5th December 1997 an Order for full inspection of the ship which was in full support of the original ship's inspection Direction made by the London Arbitrators dated 28th November 1997); and (c) the most urgent and fundamental difference between the parties should be determined first by the Court, namely the jurisdiction of the Admiralty Court to keep the Vessel under arrest when there is a pending London arbitration which normally would entail a mandatory stay of proceedings (\"Arrest Jurisdiction Point\"). 4. The hearing on the 3rd of December on the Arrest Jurisdiction Point however was most unsatisfactory because:- (1) the Notice of Motion did not properly reflect this Arrest Jurisdiction Point and there was no indication in the Defendant's Notice of Motion on what legal basis this point was advanced by the Defendant; (2) the parties were only last minute made aware of the substantial amendments to the Arbitration Ordinance which came into force in late June 1997; (3) the parties had not properly prepared for such arguments on the Arrest Jurisdiction Point and in fact the Skeleton Arguments of Mr. Kerr dated 2nd December 1997 showed no trace of any mention of this fundamental point of Mr. Barlow. 5. Much of the time during the hearing on the 3rd December 1997 was spent on the difference between the Arbitration Ordinance before its June 1997 amendments and the new Arbitration Ordinance and the possible effect it might have on the powers of arrest of the Court in relation to this non Model Law foreign arbitration. The issues raised by the parties at the rambling hearing on the 3rd December were amongst others:- (i) whether, notwithstanding a mandatory stay of proceedings, under the new Arbitration Ordinance there was power of the Court under Section 2GC of the new Ordinance to arrest or maintain the arrest of the Vessel; and (ii) whether if there was no such power under (i) above, the Court has inherent power, notwithstanding the mandatory stay of proceedings, to arrest or maintain the arrest of the Vessel. In support of the rival contentions, authorities such as The Lady Muriel [1995] 2 HKC 320 and Channel Tunnel Group v Balfour Beatty Construction [1993] A.C. 334 were cited to the Court. At the end of that hearing because of the very unsatisfactory nature of the submissions presented to the Court, I asked Mr. Barlow and Mr. Kerr to submit to me their considered further written Submissions and I reserved judgment. 6. Mr. Kerr's Further Submission dated 4th December 1997 was received by my Clerk on 6th December 1997 but Mr. Barlow's further submission by way of Summary of Arguments of Counsel for the Defendant was not received until late in the afternoon of the 8th December 1997 and that was after repeated chasing by my Clerk. In the meantime, over the weekend my own research had revealed two most relevant authorities directly on the power and jurisdiction of the Court to maintain arrest of a ship, notwithstanding the mandatory stay of proceedings. The two authorities (which were not cited to me at the hearing on 3rd December 1997) are:- The Tuyuti [1984] 1 Q.B. 839; The Bazias 3 [1993] Q.B. 673. As I considered these two authorities to be directly relevant to the Arrest Jurisdiction Point, I caused the Defendant's application to set aside the 2nd Warrant to be relisted for argument on the 9th December 1997. But events however have moved rapidly against the Defendant. It would seem that the Defendant not only had not paid the Owners or the crew on board the Vessel but also possibly has not paid the Defendant's Solicitors, Messrs Sinclair Roche and Temperley, who are applying today to the Court to cease to act for the Defendant. Mr. Barlow as Counsel for the Defendant also wrote to the Court late in the afternoon of the 8th December 1997 to say that he has no further instructions to appear for the Defendant. 7. At this afternoon's hearing on the 9th of December 1997, I only received the assistance of Mr. Davidson of Solicitors for the Owners. At the conclusion of today's further hearing, I come to the clear view that the simple answer to the Arrest Jurisdiction Point is to be found primarily in The Tuyuti and secondarily in The Bazias 3. In my view , the various submissions painfully argued by Mr. Barlow and Mr. Kerr on the 3rd of December 1997 are superficial, of marginal relevance and not directly on the point. I meant no disrespect by making no further reference to their submissions and I will confine myself to a consideration of the analysis of the legal principle as revealed in The Tuyuti and The Bazias 3. 8. In The Tuyuti , the shipowners applied for a mandatory stay of the cargo owners Admiralty Action because of the arbitration and for a setting aside of the warrant of arrest. The Admiralty Judge, Mr. Justice Sheen granted the application to the shipowners and set aside the warrant of arrest but the Court of Appeal reversed the order and held that where it was shown that the arbitration award might not be satisfied by the shipowners, then the security available in the action in rem could be ordered to stand, so as to remain available to enable a plaintiff to pursue his action in rem and that there was nothing in the Arbitration Act of 1975 to oblige the English Court to order the ship's release. In his powerful judgment, Lord Justice Robert Goff (as he then was) analyzed the development of the law on the matter of the inter relationship between detention of vessel and arbitration stay and held that the principle advanced by Brandon, J. (as he then was) in The Rena K [1979] Q.B. 377 was well founded. The essence of The Rena K principle can be summarised as being security in the detention of the ship is justified not for an arbitration award but for the judgment in the action in rem itself, if the stay of the action should subsequently be lifted after failure by the defendants to satisfy the award in the arbitration. Lord Justice Robert Goff accepted The Rena K principle at page 850C-D and he said at page 850E that:- \"If the principle in The Rena K is well-founded ...... the effect must be that a warrant of arrest already issued but not executed will not be stayed and that security already obtained by the execution of the warrant of arrest or otherwise will not be released.\" The Tuyuti was decided before the coming into force of section 26 of the Civil Jurisdiction and Judgments Act 1982. 9. The Bazias 3 (with similar facts of mandatory arbitration stay and disputed arrest) was decided after section 26 of the Civil Jurisdiction and Judgments Act 1982 came into force but the section made no difference to the Admiralty Court's jurisdiction to issue the Warrant of arrest or to maintain the arrest of a ship in the face of mandatory stay of proceedings. Another former Judge of the Commercial Court, Lord Justice Lloyd (as he then was) in The Bazias 3 expressed the view that what section 26 of the 1982 Act did, was to take away the investigation sometimes necessitated by The Rena K test of showing that the arrest should be maintained because of the likelihood that the defendant not satisfying the arbitration award. The Court accepted that section 26 was to assimilate the three classes of claims, namely in rem actions, arbitration awards and foreign judgments. The Court of Appeal affirmed the correctness of The Rena K and The Tuyuti and held that the Court has jurisdiction to retain the arrest of the ship notwithstanding the mandatory stay of proceedings. The Court of Appeal also went on to hold that the usual Admiralty practice therefore applied for the release of a ship, namely on provision of sufficient security. 10. In my judgment, the obviously correct analysis in The Rena K , The Tuyuti and The Bazias 3 afford high and good authority against Mr. Barlow's submission that the Admiralty Court has no jurisdiction to maintain the arrest of the Vessel in the face of the mandatory stay of proceedings under the Arbitration Ordinance . I accept of course that it is not legitimate if the arrest was to provide security for the possible foreign arbitration award but it is perfectly legitimate and proper if the arrest is for the purpose of this Action when the stay might be lifted because of the Defendant's failure to honour the arbitration award or to redeliver the Vessel back to the Owners. This is precisely the situation here. We have a Defendant with no known financial assets, which has not paid either hire, or its crew or now possibly its lawyers and which through its Counsel declined the Court's invitation to put up security and made them known its desire to sail the ship into the sunset without putting up a single cent of security. In these circumstances, the law is here to protect the Plaintiff Owners and not to give a license to the Defendant freely to sail away the Vessel. 11. I have no doubt that the law does not prohibit any arrest of a ship in Admiralty notwithstanding the mandatory stay of proceedings. In my view, what is lost sight of in this case by both Mr. Barlow and to a certain extent by Mr. Kerr is that the jurisdiction of the Admiralty Action in Rem is a statutory creation (section 12A and section 12B(2) and (4) of the Supreme Court Ordinance ) and that nothing can lightly take away such statutory right. In a situation of mandatory stay of proceedings for arbitration, neither the pre June 1997 Arbitration Ordinance nor the amended new Arbitration Ordinance , compels the Court to release an arrested ship or takes away the power of the Court to arrest a ship or to maintain the arrest of the ship. 12. I therefore conclude that there is no merit whatever in Mr. Barlow's Arrest Jurisdiction Point. The Motion of the Defendant on this Point and on paragraph 1,2,4 and 5 of the Notice of Motion must be dismissed. The Plaintiff is to have forthwith the costs relating to such applicaton except in respect of paragraph 1, which by agreement of the parties is reserved. William Waung Judge of the Court ofFirst Instance High Court Representation: Mr. Barrie Barlow for the Defendant instructed by Messrs Sinclair Roche & Temperley Mr. John Kerr for the Plaintiff instructed by Messrs. Holman Fenwick & Willan Look up this case on Lawcite Noteup",
  "length": 14424,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/1997/305",
  "query": "stay of proceedings",
  "ts": "2025-10-17T10:45:47",
  "ok": true
}