{
  "title": "MIKE GHIAS AND ANOTHER V. SIRNAOMICS LTD AND ANOTHER | [2025] HKCFI 4284 | HKLII",
  "court": null,
  "year": 2025,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2025] HKCFI 4284 MIKE GHIAS AND ANOTHER V. SIRNAOMICS LTD AND ANOTHER Judgment Information Date 18 Sep, 2025 Action No. HCMP41/2025 Neutral Cit. [2025] HKCFI 4284 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCMP41/2025 html PUBLIC \"-//W3C//DTD XHTML 1.0 Transitional//EN\" \"http://www.w3.org/TR/html4/loose.dtd\" HCMP41/2025 MIKE GHIAS AND ANOTHER v. SIRNAOMICS LTD AND ANOTHER HCMP 41/2025 [2025] HKCFI 4284 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE MISCELLANEOUS PROCEEDINGS NO 41 OF 2025 ________________ IN THE MATTER of Sirnaomics Limited and IN THE MATTER of Section 724 of the Companies Ordinance ( Cap. 622 ) ________________ BETWEEN MIKE GHIAS 1 st Petitioner ASGHAR GHIAS 2 nd Petitioner and SIRNAOMICS LIMITED 1 st Respondent DR. YANG LU alias PATRICK LU 2 nd Respondent ________________ Before: Deputy High Court Judge Gary CC Lam in Chambers (Open to public) Date of Hearing: 20 August 2025 Date of Decision: 19 September 2025 _______________ D E C I S I O N _______________ I. INTRODUCTION 1. Before me are:- (1) An application by summons filed by the 1 st Respondent on 3 April 2025 pursuant to section 20 of the Arbitration Ordinance ( Cap. 609 ) for an order of stay of the present proceeding in favour of arbitration; and (2) Another application by summons filed by the 2 nd Respondent on 14 February 2025 pursuant to section 20 of the Arbitration Ordinance ( Cap. 609 ) for an order of stay of the present proceeding in favour of arbitration. 2. For convenience, I shall refer to their applications for stay as the “ Applications for Stay ”. II. PARTIES 3. The 1 st Respondent (the “ Company ”) was a Cayman Islands company. Its registered office is in Cayman Islands. At the material times, it was a holding company and a listing vehicle for its subsidiaries (together, the “ Group ”), listed on the Main Board of the Hong Kong Stock Exchange (“ HKEx ”) since 30 December 2021 with principal place of business in Hong Kong at Hopewell Centre, Wanchai. The Group’s principal business has been that of an RNA therapeutics biopharmaceutical company. The Group has presence both in the People’s Republic of China and the United States (the “ US ”). 4. The 2 nd Respondent (“ Patrick ”) is the founder of the Group and the President and the Chairman of the Board of Directors. He also was the Chief Executive Officer of the Group until 5 November 2024, when he was re-designated as Chief Scientific Officer and a Non-Executive Director. On 5 February 2025, he resigned as Chief Scientific Offer, Non-Executive Director and authorised representative. 5. In the Group is Sirnaomics, Inc (“ Sirnaomics USA ”). It was founded by Patrick and was the first company in the Group. It was the Group’s ultimate parent company until restructuring in January 2021 (the “ Restructuring ”). 6. The 1 st Petitioner (“ Mike ”) and the 2 nd Petitioner (“ Asghar ”) (collectively, the “ Petitioners ”) are brothers. Both of them are citizens of the US. In January 2021, Mike and Asghar became registered shareholders of 1,250,000 and 398,000 ordinary shares of the Company. On 27 December 2023, the 2 nd Respondent transferred 110,000 ordinary shares of the Company to Asghar. As at 8 January 2025, the Petitioners jointly hold 1,758,000 issued ordinary shares of the Company, representing approximately 1.67% of the entire issued ordinary share capital. III. BACKGROUND 7. In or around September 2020, Sirnaomics USA started to explore the possibility of an initial public offering to raise equity finance (“ Listing ”). In October 2020, Sirnaomics USA commenced the Restructuring in anticipation of the Listing. This included the incorporation of the Company on 15 October 2020, and transfer of the shares in Sirnaomics USA held by its existing shareholders (including Mike and Asghar) to the Company in exchange for shares in the Company in January 2021. As a result, Mike and Asghar held respectively 1,250,000 and 398,000 ordinary shares (the “ Shares ”) in the Company. No physical share certificates were issued at the time. 8. The exchange of shares took place pursuant to a Share Exchange Agreement dated 1 January 2021 (the “ Share Exchange Agreement ”) entered into by the Company, Sirnaomics USA, the Petitioners and the other shareholders. It provided that:- “ RECITALS F. Stockholders desire to exchange their securities in Sirnaomics USA for similar securities in Sirnaomics Cayman [that is, the Company], and Sirnaomics Cayman has agreed to issue to Stockholders similar securities in Sirnaomics Cayman in connection with the exchange, upon the terms and conditions in this Agreement G. Following the exchange, Stockholders will own all of the outstanding securities in Sirnaomics Cayman, and Sirnaomics Cayman will own all of the outstanding securities in Sirnaomics USA. J. As part of the exchange contemplated by this Agreement, Sirnaomics Cayman and Stockholders will execute and deliver the Members’ Agreement, substantially in the form attached hereto as Exhibit B (‘Members’ Agreement’), by which Sirnaomics Cayman and Stockholders will set forth their rights and obligations with respect to the securities of Sirnaomics Cayman. NOW, THEREFORE, the parties agree as follows: 1. Exchange of Shares 1.1 Exchange . On the terms and subject to the conditions in this Agreement, at the Closing Date (as defined below), (i) Stockholders will assign, contribute, convey, and transfer to Sirnaomics Cayman, and Sirnaomics Cayman will accept and acquire from Stockholders, free and clear of (other than applicable securities laws) of any limitations, restrictions, taxes, charges, encumbrances, liens, pledges, security interests, options, warrants, purchase rights, contracts, commitments, equities, claims, and demands of any kind, nature, or description, the securities of Sirnaomics USA, in the individual amounts set forth on Schedule A, and (ii) in exchange for the transfer of such securities by Stockholders to Sirnaomics Cayman, Sirnaomics Cayman will issue to Stockholders, and Stockholders will accept and acquire from Sirnaomics Cayman, the securities of Sirnaomics Cayman, in the individual amounts set forth on Schedule A (‘Exchange’). Upon completion of the Exchange, all of the securities of Sirnaomics USA will be owned by Sirnaomics Cayman. 1.2 Closing Date . The closing of the Exchange shall occur on the date and time determined by Sirnaomics Cayman (‘Closing Date’). At or before the Closing Date, each Stockholder shall execute and deliver to Sirnaomics Cayman, in form and substance reasonably satisfactory to Sirnaomics Cayman, certificates, if any, evidencing such Stockholder’s securities in Sirnaomics USA as set forth on Schedule A, together with stock powers duly for such certificates to allow such certificates to be registered in the name of Sirnaomics Cayman substantially in the form attached hereto as Exhibit A. At or before the Closing Date, each Stockholder and Sirnaomics Cayman shall execute and deliver the Members’ Agreement, substantially in the form attached hereto as Exhibit B. As soon as possible after the Closing Date, Sirnaomics Cayman shall deliver to each Stockholder evidence of the securities of Sirnaomics Cayman as set forth on Schedule A, including the applicable Preferred Share Purchase Warrant substantially in the form attached hereto as Exhibit C. 3. Representations and Warranties of Sirnaomics USA and Sirnaomics Cayman . Sirnaomics USA and Sirnaomics Cayman each, severally, and not jointly, hereby represent and warrant to the other and to Stockholders, all of which representations and warranties are complete, correct, and true in all respects as of the date hereof and will be as of the Closing Date , as follows: (c) Valid Issuances . Its securities to be transferred by and to Stockholders pursuant to the Exchange and for the consideration set forth in this Agreement, will be validly issued, fully paid, and nonassessable, and will be transferred by or to Stockholders, free and clear of (other than applicable securities laws) of any limitations, restrictions, taxes, charges, encumbrances, liens, pledges, security interests, options, warrants, purchase rights, contracts, commitments, equities, claims, and demands of any kind, nature, or description. 4. Survival of Representations and Warranties . None of the representations and warranties of Sirnaomics USA, Sirnaomics Cayman, or the Stockholders in this Agreement shall survive the Closing Date, except that those representations and warranties in Section 2(a), (b), and (c) and Section 3(b) and (c) shall survive until the latest date permitted by applicable law. Except as set forth specifically in the preceding sentence, no other representation or warranty of any party in this Agreement shall survive the Closing Date, and no party will have any rights or remedies after the Closing Date with respect to any misrepresentation of or inaccuracy in any such representation or warranty. 11. Governing Law . This Agreement shall be governed by, and shall be construed in accordance with, the laws of Hong Kong. 12. Dispute Resolution . For thirty (30) days after the commencement in writing by any party hereto of the dispute resolution process in this Section 12 the parties shall consult diligently and in good faith to resolve any dispute, controversy, difference, or claim arising out of or relating to this Agreement, including the existence, validity, interpretation, performance, breach, or termination thereof or any dispute regarding non-contractual obligations arising out of or relating to this Agreement (‘Dispute’) . Thereafter, any party hereto may submit the Dispute to final and binding arbitration administered by Hong Kong International Arbitration Centre (‘HKIAC’) under HKIAC Administered Arbitration Rules in force when the Notice of Arbitration is submitted. The law of this arbitration clause shall be Hong Kong law. The seat of arbitration shall be Hong Kong…” (original underline and emphasis added) 9. I shall refer to Clause 12 of the Share Exchange Agreement as the “ Arbitration Clause under the Share Exchange Agreement ”. 10. Further, subsequently, the parties to the Share Exchange Agreement entered into a Members Agreement dated 21 January 2021 (the “ Members’ Agreement ”). It provided that:- “ RECITALS B. The Company, the Investors, the Ordinary Holders, and Sirnaomics USA are parties to the Share Exchange Agreement, dated January 1, 2021 (‘Share Exchange Agreement’). C. Pursuant to the Share Exchange Agreement, the Company, the Investors, and the Ordinary Holders agreed to a restructuring by which, as of the Closing Date (as defined in the Share Exchange Agreement), each stockholder in Sirnaomics US contributes such stockholder’s securities in Sirnaomics US to the Company in exchange for Shares in the Company. E. The Company, the Investors, and the Ordinary Holders desire to enter into this Agreement in order to set forth their rights and obligations with respect to the Shares held by them. NOW, THEREFORE, the parties agree as follows: SECTION III TRANSFER RESTRICTIONS 3.1 General . 3.1.2 Lock-Up Agreement . In connection with an IPO, and upon request of the Company or the underwriters managing any underwritten IPO, each Key Holder [including the Petitioners] agrees not to sell, make any short sale of, loan, grant any option for the purchase of, or otherwise dispose of any securities of the Company, however or whenever acquired (other than those included in the registration), without the prior written consent of the Company or such underwriters, as the case may be, for the period commencing from the 28 th day prior to the first submission of a listing application to The Stock Exchange of Hong Kong Limited in connection with an IPO and ending on the date of consummation of such IPO; and (b) for such period of time (not to exceed 180 days but subject to such extension or extensions as may be required by the underwriters…) from the effective date of such registration as may be requested by the Company or such managing underwriters and to execute an agreement reflecting the foregoing as may be requested by the underwriters at the time of the IPO. 3.6 Termination . This Section 3 shall terminate and be of no further force or effect upon the earliest to occur of (a) immediately prior to the consummation of an IPO; (b) the consummation of a Deemed Liquidation Event; or (c) termination of this Agreement in accordance with Section 8.3. SECTION VI OTHER COVENANTS, REPRESENTATIONS, AND WARRANTIES 6.7 Legend . Each certificate, instrument, or book entry representing Shares shall be notated with a legend substantially in the following form: THE SALE, PLEDGE, HYPOTHECATION, OR TRANSFER OF THE SECURITIES REPRESENTED HEREBY IS SUBJECT TO, AND IN CERTAIN CASES PROHIBITED BY, THE TERMS AND CONDITIONS OF A MEMBERS’ AGREEMENT, AS AMENDED, BY AND AMONG THE COMPANY AND CERTAIN HOLDERS OF SHARES OF THE COMPANY. COPIES OF THE MEMBERS’ AGREEMETN MAY BE OBTAINED UPON WRITTEN REQUEST TO THE SECRETARY OF THE COMPANY. THE SECURITIES REPRESENTED HEREBY HAVE BEEN ACQUIRED FOR INVESTMENT AND HAVE NOT BEEN REGISTERED UNDER APPLICABLE SECURITIES LAWS. SUCH SECURITIES MAY NOT BE SOLD, PLEDGED, OR TRANSFERRED IN ABSENCE OF SUCH REGISTRATION OR A VALID EXEMPTION FROM REGISTRATION AND PROSPECTUS DELIVERY REQUIREMENTS OF SUCH LAWS. THE SECURITIES REPRESENTED HEREBY ARE SUBJECT TO THE MEMBERS’ AGREEMETN. BY ACCEPTING AN INTEREST IN SUCH SECURITIES, THE PERSON ACCEPTING SUCH INTEREST SHALL BE DEEMED TO AGREE TO AND SHALL BECOME BOUND BY THE MEMBERS’ AGREEMENT, INCLUDING CERTAIN RESTRICTIONS ON TRANSFER AND OWNERSHIP SET FORTH THEREIN. Each Key Holder agrees that the Company may make a notation in its record and may instruct its transfer agent to impose transfer restrictions on the Shares notated with the above legend to enforce this Agreement, and the Company agrees to promptly do so. The legend shall be removed upon termination of this Agreement at the request of the holder . SECTION VIII MISCELLANOUS 8.3 Consent Required to Amend, Terminate or Waive . This Agreement may be amended or terminated, and the observance of any term hereof may be waived… only with the consent of (i) the Company, (ii) the Requisite Preferred Holders, and (iii) holders of at least fifty percent (50%) of the then outstanding Ordinary Shares…. Notwithstanding the foregoing, this Agreement shall cease to be in effect upon the earlier to occur of (a) the consummation of an IPO , (b) the date on which the Company goes into liquidation or dissolution or any property or assets of the Company are placed in the hands of a receiver, trust custodian or liquidator or a winding up order in respect of the Company is issued, and (c) with respect to any holder of shares or securities of the Company, upon such holder ceasing to own any such shares or securities of the Company. 8.8 Governing Law . This Agreement shall be governed by, and shall be construed in accordance with, the laws of Hong Kong. 8.9 Dispute Resolution . For thirty (30) days after the commencement in writing by any party hereto of the dispute resolution process in this Section 8.9, the parties shall consult diligently and in good faith to resolve any dispute, controversy, difference, or claim arising out of or relating to this Agreement, including the existence, validity, interpretation, performance, breach, or termination thereof or any dispute regarding non-contractual obligations arising out of or relating to this Agreement (‘Dispute’) . Thereafter, any party hereto may submit the Dispute to final and binding arbitration administered by Hong Kong International Arbitration Centre (‘HKIAC’) under HKIAC Administered Arbitration Rules in force when the Notice of Arbitration is submitted. The law of this arbitration clause shall be Hong Kong law. The seat of arbitration shall be Hong Kong…” (original underline and emphasis added) 11. I shall refer to Clause 8.9 of the Share Exchange Agreement as the “ Arbitration Clause under the Members’ Agreement ”. 12. I pause here to note that while Ms Jasmine Cheung (leading Mr Billy Liu), counsel for the Company, is right in saying that there was no expiry clause for clause 6.7, it, however, provides that the legend shall be removed upon the termination of the Members’ Agreement at the holder’s request. 13. On 20 December 2021, the Company made an initial public offering in Hong Kong, offering a total of 7,540,000 shares in a global offering against an existing 80,526,780 shares in issue. On 30 December 2021, the Company completed the Listing, or in the phrase used in the Share Exchange Agreement and the Members’ Agreement, “ consummation of an IPO ”, and its shares began trading on HKEx. 14. On 15 June 2022, about 6 months after the “consummation of the IPO”, each of Mike and Asghar was issued a physical share certificate (the “ Share Certificates ”) in respect of their Shares in the Company respectively. Each of the Share Certificates contained the following restrictive legend (the “ Restrictive Legend ”):- “THE SALE, PLEDGE, HYPOTHECATION, OR TRANSFER OF THE SECURITIES REPRESENTED HEREBY IS SUBJECT TO THE APPROVAL OF THE COMPANY. THESE SECURITIES HAVE BEEN ACQUIRED FOR INVESTMENT AND HAVE NOT BEEN REGISTERED UNDER APPLICABLE SECURITIES LAWS. IN ADDITION, THEY MAY NOT BE SOLD, PLEDGED, OR TRANSFERRED IN ABSENCE OF REGISTRATION UNDER SUCH LAWS OR A VALID EXEMPTION FROM THE REGISTRATION, PROSPECTUS, AND OTHER REQUIREMENTS OF SUCH LAWS.” 15. In other words, any transfer of the Shares would require the approval of the Company. 16. Between June 2022 and March 2025, the Petitioners (through their US lawyers and Hong Kong lawyers) wrote to the Company (through its US lawyers) demanding the removal of the Restrictive Legend and free transferability of the Shares on the HKEx or anywhere as other shares of the Company. The Company has still failed and/or refused to remove the Restrictive Legend and allow free transferability of the Shares. Patrick and the Company specifically highlights a letter dated 11 January 2024 issued by the Petitioners’ solicitors in Hong Kong. In that letter, it was stated that the imposition of the Restrictive Legend was “in violation” of the Share Exchange Agreement and the Members’ Agreement and that the third-day period in the Arbitration Clause in the Share Exchange Agreement and the Arbitration Clause in the Members’ Agreement had expired and would still explore the possibility of consultation and resolution within the next 30 days. It is fair for me to say that the Petitioners’ complaints and demands in the correspondence were all based on the Share Exchange Agreement and the Members’ Agreement. 17. As at 7 February 2024, all of the Company’s shares were registered on the Hong Kong Register except for the Shares, which remained on the Cayman Register. IV. PROCEEDINGS IN THE US 18. On 26 August 2022, the Petitioners filed a lawsuit against Sirnaomics USA and the Company in the Circuit Court of Montgomery County, Maryland (the “ Maryland State Action ”). In the Amended Complaint dated 29 March 2023 filed therein (the “ Amended Complaint ”), the Petitioners sought judgment for:- “(i) rescission of the Share Exchange Agreement and other documents relating to the Restructuring and/or the IPO; (ii) related restitutionary equitable damages in an amount that exceeds $75,000,000; (iii) pre- and post-judgment interest… and (iv) such other and further relief as this Court deems just and appropriate.” 19. There are three counts (that is, causes of action) in the Amended Complaint. For Count I, §§22 and 33 of the Amended Complaint captured the gist:- “22. Sirnaomics, however, did not. Instead, in or about June of 2022, having induced Mike and Asghar to both provide their consent and surrender their Sirnaomics, Inc. shares, and as a result having now achieved the IPO for which Sirnaomics needed their shares, Sirnaomics asserted unlawful dominion and control over Mike’s and Asghar’s shares. Specifically, among other things, Sirnaomics purported to issue stock certificates in Sirnaomics Ltd. to each of Mike and Asghar containing the following restrictive legend (the ‘ Unauthorized Restrictions ’) [that is, the Restrictive Legend]… 33. Despite its agreement, however, Sirnaomics has failed and refused, and continues to fail and refuse, to perform its obligations under the Share Exchange Agreement. Among other things, Sirnaomics has failed and refused, and continues to fail and refuse, to issue to either of Mike’s or Asghar’s shares in Sirnaomics Ltd. that are substantially the same as their shares in Sirnaomics, Inc. Moreover, Sirnaomics unilaterally has purported to place Unauthorized Restrictions upon Mike’s and Asghar’s shares… Sirnaomics therefore materially has breached the Share Exchange Agreement.” 20. Count II is misrepresentations made outside the Share Exchange Agreement and Count III, related to Count II, is fraudulent inducement. 21. It is fair for me to say that the Amended Complaint was based on the Share Exchange Agreement and the Members’ Agreement, and the representations allegedly made to induce the Petitioners to enter into the Share Exchange Agreement and the Members’ Agreement. 22. On 13 January 2023, the Company filed a Motion to Compel Arbitration, referring to the Arbitration Clause under the Share Exchange Agreement. 23. On 30 January 2023, the Petitioners filed Opposition to the Defendants’ Motion to Compel Arbitration, averring that the Company had waived the right to arbitrate and had not diligently and in good faith referred the matter to arbitration. 24. On 6 February 2023, the Company filed a Memorandum of Law in support of the Defendants’ Motion to Compel Arbitration, and reiterated that the US Court should stay the matter in favour of arbitration. 25. In May 2023, the hearing took place. On 31 May 2023, the Circuit Court for Montgomery County made an Order Granting Motion to Compel Arbitration, ordering that “this matter shall be stayed during the pendency and completion of the arbitration”. On 8 June 2023, the Circuit Court for Montgomery County made an Order for Binding Arbitration, removing the case from the trial calendar and closing the case on the ground that parties had agreed to a binding arbitration. V. PETITIONERS’ CLAIM 26. In the Amended Petition, the Petitioners start with the following provisions. 27. First, the Listing Rules:- “1.01. ‘Eligible Shares’ means an issue of securities which is from time to time accepted as eligible by Hong Kong Securities Clearing Company Limited (‘ HKSCC ’) for deposit, clearance and settlement in the Central Clearing and Settlement System (‘ CCASS ’), in accordance with the General Rules of HKSCC, and where the context so requires shall include any particular security or securities of such an issue. 8.13. The securities for which listing is sought must be freely transferable… 8.13A(5). An issuer shall ensure, so far as it is able, that its securities remain Eligible Securities. 8.19. Where application for listing is made in respect of any class of securities: (1) if none of the securities of that class are already listed, the application must relate to all securities of that class issued or proposed to be issued; or (2) if some of the securities of that class are already listed, the application must relate to all further securities of that class issued or proposed to be issued. 19.05(3)(a) …in the case of registered securities (other than those transferable by endorsement and delivery), provision must be made for a register of holders to be maintained in Hong Kong, or such other place as the Exchange may agree, and for transfers to be registered locally… 19.05(4) … unless the Exchange otherwise agrees only securities registered on the Hong Kong register may be traded on the Exchange. In the case of depositary receipts, an issuer is only required to ensure that the depositary maintains a register of holders of the depositary receipts in Hong Kong in order for the depositary receipts to be traded in Hong Kong.” 28. Second, Clause 4.14 of the Guide to Eligibility and Admission of Securities to the Central Clearing and Settlement System (the “ CCASS Guide ”), which is in effect included by Rule 1.01 of the Listing Rule into the definition of “Eligible Shares”:- “4.14 Transferability Eligible Securities accepted in CCASS must be freely transferable or deliverable. … HKSCC deems securities not to be freely transferable or deliverable if registration of their transfer is subject to restrictions…” 29. Based on the above rules, the Petitioners claim at §36 of the Amended Petition that:- “As pleaded above, the Company was incorporated specifically to act as a listing vehicle of the Group on the HKEx. In the premises, it was a fundamental tripartite understanding and/or agreement between the Company’s shareholders inter se as well as the shareholders and the Company that the free transferability of the Company’s shares would be maintained in accordance with the Listing Rules (‘ Tripartite Understanding ’).” 30. The Petitioners further claim at §39 of the Amended Petition that there is an implied term in the Articles of Association of the Company that the power conferred by Article 3.2 thereof (the “ Share Restrictions Clause ”) upon the Company’s board to determine restrictions on the transferability is subject to the rules on free transferability of the shares under the Listing Rules. 31. Similarly, the Petitioners claim at §48 of the Amended Petition that there is an implied term that the power conferred by Article 4.3 (the “ Share Register Clause ”) on the Board to transfer shares on the principal register to branch register in its absolute discretion is subject to the Listing Rules, the combined effect of which is that the Company must permit its shares to be transferred from the Cayman Register to the Hong Kong Register to enable them to be traded on the HKEx. 32. The Petitioners claim that the imposition of the Restrictive Legend and the Company’s failure or refusal to transfer the Shares onto the Hong Kong Register constitutes continuing breach of the Listing Rules, the Tripartite Understanding and the implied terms. 33. In addition, the Petitioner claims that in imposing the Restrictive Legend and in failing or refusing to transfer the Shares onto the Hong Kong Register, the Company breached its duty in Braganza v BP Shipping Ltd and Anor [2015] 1 WLR 1661 to exercise its discretion under the Share Restrictions Clause in good faith, rationally and for proper purposes, not arbitrarily or capriciously or in a manner which is not bona fide (the “ Braganza Duty ”). 34. As against Patrick, the Petitioners claim that Patrick procured or caused the Board to breach the Listing Rules, the Tripartite Understanding and the implied terms as well as the Braganza Duty as mentioned above. They also claim that Patrick himself breached his director duties to the Company. 35. The Petitioners claim that as a result of the breaches, they have been unfairly prejudiced. The Petitioners seek the following relief in the Amended Petition:- “(1) Damages to be assessed… (2) An order that the existing Share Certificates in respect of the 1,648,000 Shares [that is, the Shares] be cancelled and new share certificates be issued by the Company in respect of the said shares without the imposition of the Restrictive Legend; (3) Further and/or alternatively, an order that Patrick do procure the Company to cancel the existing Share Certificates in respect of the 1,648,000 Shares and issue new share certificates in respect of the said shares without the imposition of the Restrictive Legend; (4) An order that the 1,648,000 Shares be transferred from the Cayman Register to the Hong Kong Register and that all other necessary steps are taken by the Company to enable the said shares to be traded on the HKEx; (5) Further and/or alternatively, an order that Patrick do procure the Company to transfer the 1,648,000 Shares from the Cayman Register to the Hong Kong Register and take all other necessary steps to enable the said shares to be traded on the HKEx; (6) An order that the Company and Patrick do cease and desist from taking any further action to interfere with the free transferability and/or tradability of the 1,648,000 Shares whether on HKEx or through private sale or otherwise; (6A) Further and/or alternatively, an order that Patrick do purchase the 1,648,000 Shares from the Petitioners at a fair value… (7) Such other orders…” 36. On 9 January 2025, they filed the Petition herein. On 14 February 2025, Patrick filed the Summons to stay the proceedings under section 20 of the Arbitration Ordinance . On 3 April 2025, the Company also filed the Summons to stay the proceedings under section 20 of the Arbitration Ordinance . VI. COMPANY’S AND PATRICK’S SKELETAL DEFENCE AND GROUNDS FOR THE APPLICATIONS FOR STAY 37. Since both the Company and Patrick are seeking to stay the present proceedings in favour of an arbitration, understandably, their defence is skeletal only. They have two defences:- (1) The Company was entitled to impose the Restrictive Legend pursuant to Clause 6.7 of the Shareholders’ Agreement; and (2) In breach of Clause 3.1.2 of the Members’ Agreement, the Petitioners failed or refused to enter into a lock-up agreement. Such breach of contract would be a matter taking into account to assess whether they come to court with clean hands and/or whether there was any unfairness in the prejudice, if any. 38. Based on the defences, the Company and Patrick take the position that the dispute is a dispute under the Arbitration Clause under the Share Exchange Agreement and/or the Arbitration Clause under the Members’ Agreement, and therefore, the proceedings herein should be stayed in favour of arbitration as agreed by the parties. VII. LEGAL PRINCIPLES IN RELATION TO SECTION 20 OF THE ARBITRATION ORDINANCE 39. In an application under section 20 of the Arbitration Ordinance , the applicant carries the burden to demonstrate a prima facie case that the parties were bound by an arbitration clause. Further, unless the point is clear, the Court should not attempt to resolve the issue and the matter should be stayed in favour of arbitration, as it is for the tribunal to determine first on its jurisdiction: see Kinli Civil Engineering Ltd v Geotech Engineering Ltd [2021] HKCFI 2503 at §6 per Mimmie Chan J. 40. The Court has to ask the following four questions:- (1) Is the arbitration clause an arbitration agreement? (2) Is the arbitration agreement null and void, inoperative or incapable of being performed? (3) Is there in reality a dispute or difference between the parties? (4) Is the dispute or difference between the parties within the ambit of the arbitration agreement? See Dickson Holdings Enterprise Co Ltd v Moravia CV [2019] 3 HKLRD 210 at §§30 and 33 per G Lam (as he then was). 41. The parties do not have dispute on questions (1), (2) and (3). The only question I have to answer is question (4). To answer this question a two-stage approach is adopted:- (1) To identify the substance of the matter or dispute between the parties; and (2) To determine whether or not that matter or dispute are covered by the arbitration agreement. See Dickson Holdings Enterprise Co Ltd v Moravia CV , supra at §31. 42. Section 20 of the Arbitration Ordinance is modelled on Article 8 of the UNCITRAL Model Law. It is, in my view, important to have regard to jurisprudence in other countries or regions adopting the Model Law or similar provisions to promote legal certainty or uniformity in the jurisprudence relating to international arbitration. I note that the same approach has been adopted by the Privy Council in FamilyMart China Holding Co Ltd v Ting Chuan (Cayman Islands) Holdings Corp. [2023] 2 248 CLC at §28 and the UK Supreme Court in Republic of Mozambique v Privinvest Shipbuilding SAL (Holding) and others [2023] Bus LR at 1359 at §§54-55. These two decisions, both handed down on 20 September 2023, are, with respect, enlightening on how the Court should identify the matter or dispute, given that the Privy Council and the UK Supreme Court there extensively reviewed the international jurisprudence (including Hong Kong, Singapore, Australia, and of course UK) on this question. 43. Lord Hodge, delivering the judgment of the Privy Council in FamilyMart , had the following to say:- “59. The court must ascertain the substance of the dispute or disputes between the parties. This involves looking at the claimant’s pleadings but not being overly respectful to the formulations in those pleadings which may be aimed at avoiding a reference to arbitration. It involves also a consideration of the defenes , if any, which may be skeletal as the defendant seeks a reference to arbitration, and the court should also take into account all reasonably foreseeable defences to the claim or part of the claim. 60. Secondly… the Board considers that section 4 of the FAAEA [equivalent of section 20 of the Arbitration Ordinance ] allows a pro tanto stay of legal proceedings. 61. Thirdly… a ‘matter’ is a substantial issue that is legally relevant to a claim or a defence , or foreseeable defence, in the legal proceedings, and is susceptible to be determined by an arbitrator as a discrete dispute . If the ‘matter’ is not an essential element of the claim or of a relevant defence, it is not a matter in respect of which the legal proceedings are brought … [A] ‘matter’ requiring a stay does not extend to an issue that is peripheral or tangential to the subject matter of the legal proceedings … [A] ‘matter’ is something more than a mere issue or question that might fall for decision in the court proceedings or in the arbitral proceedings . 62… 63… 64. No judicial formula encapsulating the meaning of ‘matter’ should be treated as if it were a statutory text . A court facing an application for a stay under section 4 of the FAAEA should approach the question in a practical and common-sense way . The court must respect the agreement of the parties to arbitrate their disputes. An agreement to arbitrate a dispute is an agreement not to resolve that dispute in court proceedings. Thus, any substantial matter in the legal proceedings, which is relevant to the claim or foreseeable defence, and which is within the scope of the arbitration agreement, will give rise to a mandatory stay of the legal proceedings pro tanto on the application of one of the parties… the court could refuse an otherwise mandatory stay if the applicant has no real or proper purpose for seeking the stay. That could include not only an application for a stay in relation to issues that were peripheral to the legal proceedings but also an application that amounted to an abuse of process… 65. Fourthly, the exercise involving a judicial evaluation of the substance and relevance of the ‘matter’ entails a matter of judgment and the application of common sense . It is not a mechanistic exercise . It is not sufficient merely to identify that an issue is capable of constituting a dispute or difference within the scope of an arbitration without carrying out an evaluation of whether the issue is reasonably substantial and whether it is relevant to the outcome of the legal proceedings of which a part seeks a stay… 66. The approach to the word ‘matter’… set out in paras 61-65 above may involve the fragmentation of the parties’ disputes with some matters being determined by an arbitral panel and other matters being resolved by the court. Such fragmentation may on occasion be inconvenient to one or more of the parties to the court proceedings. Rational businesspeople may as a general rule prefer that their disputes are determined in the same forum : see Lord Hoffmann in Fiona Trust & Holdings Corp v Privalov [2007] UKHL 40 ; [2007] 2 CLC 553, paras 5-8. An arbitration agreement may be interpreted generously to achieve that end if the court can ascertain that as the parties’ commercial purpose and the wording of the agreement can bear that meaning . But, where, on a proper interpretation of the arbitration agreement , the parties have contracted to refer to arbitration disputes which do not extend to all the matters raised in the legal proceedings , giving effect to the parties’ contract will involve fragmentation of the disputes . The disadvantages caused by such fragmentation can be mitigated by effective case management by both the court and the arbitral panel.” (emphasis added) 44. In Republic of Mozambique v Privinvest Shipbuilding SAL (Holding) and others , supra , at §§73-77 Lord Hodge gave a speech in this respect essentially the same as §§59-65 in FamilyMart quoted above. For the sake of completeness, I should mention that at §78, Lord Hodge made a point apparently not articulated so clearly in FamilyMart (if at all), which concerns the second stage:- “78. The existing jurisprudence also supports a fifth point. There may not yet be a consensus on this matter, but common sense lends further support. When turning to the second stage of the analysis… namely, whether the matter falls within the scope of the arbitration agreement on its true construction, the court must have regard not only to the true nature of the matter but also to the context in which the matter arises in the legal proceedings .” (emphasis added) 45. With respect, I adopt the above paragraphs in FamilyMart and Republic of Mozambique v Privinvest Shipbuilding SAL (Holding) and others , supra , as well-reasoned, of common-sense, well supported by international jurisprudence and, equally importantly, promoting legal certainty and uniformity in the international jurisprudence. 46. I add that as much as the Court should not be overly respectful to the formulation of the plaintiff or the petitioner’s claim which may be aimed at avoiding a reference to arbitration ( FamilyMart at §59), the Court should also not be overly respectful to the formulation of the defendant or respondent’s defence which may be aimed at avoiding adjudication by court. The overarching consideration is, in my view, what is the true substance of the matter of dispute. 47. I shall now apply the legal principles above to the present case. VIII. WHAT IS THE SUBSTANCE OF MATTER OR DISPUTE? 48. The first defence of the Company and Patrick, as mentioned above, is that the Restrictive Legend was imposed pursuant to Clause 6.7 of the Members’ Agreement. 49. In the present case, it is the Petitioners’ own case that the Shares were transferred to them in or around January 2021 as a result of the Exchange: see §§22-23 of the Amended Petition. There is no averment or any suggestion that the Shares were subsequently replaced, whether prior to or subsequent to the Listing. Therefore, the Shares were transferred to the Petitioners pursuant to Clause 1.1 of the Share Exchange Agreement (see §8 above). 50. Mr Charlie Liu, counsel for Patrick, refers me to Clause 1.2 (see §8 above), which provided that the Company should deliver share certificates evidencing the Shares as soon as possible after the closing date. He submits that the Share Certificates in question were issued thereunder. I agree, on the Petitioners’ case that the Shares were issued as a result of the Exchange, without any averment or suggestion that the Shares were subsequently replaced. There is no complaint about delay in issuing the Share Certificates. Nor is there any allegation from the Petitioners that they had abandoned the right to be issued share certificates in respect of the Shares under the Share Exchange Agreement. 51. The Petitioners’ members’ rights on the Shares were subject to the Members’ Agreement. Clause 6.7 of the Members’ Agreement (see §10 above) entitled the Company to add a restrictive legend. Although the Restrictive Legend is not identical to the legend set out under Clause 6.7 of the Members’ Agreement, in my view, there is at least a prima facie case that the two are substantially the same – “substantially” is sufficient for the purpose of Clause 6.7. It follows that there is at least a prima facie case that the Restrictive Legend was imposed pursuant to Clause 6.7. 52. In response, Mr Lai Chun Ho (leading Mr Lim Han Sheng), counsel for the Petitioners, submits, in essence, that:- (1) Their claim does not rely on the Share Exchange Agreement or the Members’ Agreement. Their claim relies on breach of the Tripartite Understanding, the implied terms in the Articles of Association and/or the Braganza Duty. (2) Even assuming that there are parallel bases for their claim under the Share Exchange Agreement or the Members’ Agreement, the Petitioners’ rights under the Tripartite Understanding, the implied terms in the Articles of Association and/or the Braganza Duty are independent of those under the Share Exchange Agreement or the Members’ Agreement. Mr Lai relies on §40 of Dickson Holdings Enterprise Co Ltd v Moravia CV , supra . (3) The Share Exchange Agreement at most provided the background of how the Petitioners obtained the Shares. It is not relevant to the substance of the dispute. (4) The Members’ Agreement had expired upon the IPO and the Share Certificates were issued more than 6 months after the IPO. Under Clause 6.7, the Petitioners were entitled to have any legend added pursuant thereto removed. Therefore, it is also not relevant to the substance of the dispute. (5) At most, the Share Exchange Agreement and the Members’ Agreement are only peripheral or tangential only, not legally relevant to the Petitioners’ claim or defence. 53. In my view, first, while the Petitioners formulate their claim on breach of the Tripartite Understanding, the implied terms in the Articles of Association and/or the Braganza Duty, I should not be “overly respectful to the formulation”. Applying common sense, given that the Shares were the shares transferred to the Petitioners before the Listing but just that the Share Certificates in respect of the Shares were issued after the Listing, the Share Certificates were, in my judgment, governed by the Share Exchange Agreement and the Members’ Agreement. 54. Attempting to approach the matter with common sense and from a practical point of view, during the hearing, I asked Ms Cheung why the Petitioners would be bothered about the Shares issued prior to the Listing and pointed out to her that the Petitioners are concerned with the transferability of the Shares now they hold in their hand. Ms Cheung’s strongest answer, in my view, is that Clause 6.7 of the Members’ Agreement entitled the Company to add the Restrictive Legend and there is no clause in the Members’ Agreement that specifically terminated Clause 6.7. In response, Mr Lai points out that under Clause 6.7, the Company is obliged to remove the legend upon request. 55. It is here, in my view, that even approaching the matter with common sense and from a practical point of view, the Petitioners would still have to rely on Clause 6.7 of the Members’ Agreement to say that the Restrictive Legend should be removed. This is because at least prima facie, the Restrictive Legend was added pursuant to Clause 6.7. The Company (and Patrick) may or may not have any good reason to refuse the removal, and the Petitioners may or may rely on the very same grounds in the Amended Petition to say that the Company (and Patrick) had no reason to refuse to remove, or had every reason to remove, the Restrictive Legend. Whatever the grounds would be, prima facie, the basis for removal (or non-removal, if there is any basis) would be Clause 6.7. For this reason, I reject Mr Lai’s submissions that the Petitioners’ claim in the Amended Petition is independent of the Members’ Agreement, and that the Members’ Agreement is not legally relevant to the substance of the matter or dispute between the parties. 56. For the reason that Clause 6.7 would be the basis for the removal or non-removal, I also disagree with Mr Lai’s submissions that any legal relevance or connection with the Members’ Agreement would be “peripheral” or “tangential” only such that the matter should not be referred to arbitration. If the matter proceeds to trial, the Court could not brush aside Clause 6.7 as legally irrelevant or background only, given that the Shares were governed by the Members’ Agreement. I would agree that the Members’ Agreement would be “peripheral” or “tangential” if the Shares were not the shares transferred under the Exchange but shares transferred or issued post-Listing, because the basis for removal of the Restrictive Legend would likely no longer be Clause 6.7, which appears to govern only shares transferred under the Exchange. However, this is not the case here. 57. For the above reasons, I find that the true substance of the Petitioners’ claim is enforcement of Clause 6.7 of the Members’ Agreement. Based on the pre-petition correspondence and the Maryland State Action, where the Petitioners’ claim was based on the Share Exchange Agreement and the Members’ Agreement, I also find that the Petitioner’s formulation of the claim in the Amended Petition is aimed at avoiding reference to arbitration. 58. It remains for me to say that no matter how strong the Petitioners’ claim in the Amended Petition may appear (for the avoidance of doubt, I do not express any view on the merits here), if the parties agreed that the dispute should be referred to arbitration, the strong merits itself is no reason for departing from the agreement. 59. The above is sufficient for me to allow the Applications for Stay. I should only briefly mention the Company’s another defence, namely, the Petitioners breached Clause 3.1.2 of the Members’ Agreement by failing or refusing to enter into a lock-up agreement pursuant thereto. The evidence in support of this defence is just §11 of the Affirmation of Tse Shek Ho filed on behalf of the Company:- “Further, Section 3.1.2 (Lock-Up Agreement) (p.10) of the Members’ Agreement required ‘Key Holders’ to enter into lock-up agreements upon request of the Company or the underwriters managing any underwritten IPO. The Company’s case is that the Petitioners had breach this clause in refusing to enter into a lock-up agreement as requested, and this was one of the reasons why the Company did not remove the Restrictive Legend from the Petitioners shares.” 60. There is no evidence of any demand for entering into a lock-up agreement. The evidence, or more accurately, the mere allegation that there was a refusal, is, in my view, not sufficient to sustain any allegation of breach of Clause 3.1.2. While the defence at this stage is expected to be skeletal, the evidence filed to explain the defence skeletally should, in my view, be sufficient for the Court to appreciate the defence. Here, the Company fails that. 61. In any event, despite Ms Cheung’s efforts to persuade me, I am unable to see how the breach of the lock-up agreement would amount to coming to the Court without clean hands and/or rendering the conduct in question not unfair. In my view, the defence is a typical example where the Court should also not be overly respectful to the defence formulated in a way to bring the dispute within the arbitration clause. 62. Lastly, on the above reason, the basis for reference to arbitration is the Members’ Agreement, not the Share Exchange Agreement. The Share Exchange Agreement only provides the background relating to the genesis of the Shares. It is, in my view, peripheral and tangential only. IX. CONCLUSION 63. In the premises, I allow the Applications for Stay on the following terms:- “All further proceedings in the proceedings herein, against the 1 st and 2 nd Respondents, shall be stayed pursuant to section 20 of the Arbitration Ordinance in favour of arbitration on the ground that the parties are bound by the Members Agreement to resolve the dispute in the proceedings herein to refer to arbitration.” 64. I order that the Petitioners shall pay the Company costs summarily assessed at HK$300,000 with certificate for two counsel, and Patrick costs summarily assessed at HK$220,000. 65. I thank the Petitioners’ counsel (Mr Lai and Mr Lim), the Company’s counsel (Ms Cheung and Mr Liu) and Patrick’s counsel (Mr Liu) for their assistance. (Gary CC Lam) Deputy High Court Judge Mr Lai Chun Ho, leading Mr Lim Han Sheng, instructed by Akin Gump Strauss Hauer & Feld, for the 1 st and 2 nd Petitioners Ms Jasmine Cheung, leading Mr Billy Liu, instructed by Joseph S.C. Chan & Co., for the 1 st Respondent Mr Charlie Liu, instructed by Sun Lawyers LLP, for the 2 nd Respondent Look up this case on Lawcite Noteup",
  "length": 48768,
  "headers_seen": [
    "I. INTRODUCTION",
    "II. PARTIES",
    "III. BACKGROUND",
    "IV. PROCEEDINGS IN THE US",
    "V. PETITIONERS’ CLAIM",
    "VI. COMPANY’S AND PATRICK’S SKELETAL DEFENCE AND GROUNDS FOR THE APPLICATIONS FOR STAY",
    "VII. LEGAL PRINCIPLES IN RELATION TO SECTION 20 OF THE ARBITRATION ORDINANCE",
    "VIII. WHAT IS THE SUBSTANCE OF MATTER OR DISPUTE?"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2025/4284",
  "query": "seat of arbitration",
  "ts": "2025-10-16T10:49:41",
  "ok": true
}