{
  "title": "YEUNG MAN SEK EDMOND V. GOOGLE (HONG KONG)LTD | [2014] HKDC 274 | HKLII",
  "court": null,
  "year": 2014,
  "date": null,
  "content": "HKLII Databases District Court [2014] HKDC 274 YEUNG MAN SEK EDMOND V. GOOGLE (HONG KONG)LTD Judgment Information Date 18 Mar, 2014 Action No. DCCJ4322/2013 Neutral Cit. [2014] HKDC 274 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History DCCJ4322/2013 DCCJ4322/2013 YEUNG MAN SEK EDMOND v. GOOGLE (HONG KONG)LTD DCCJ4322/2013 IN THE DISTRICT COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION CIVIL ACTION NO 4322 OF 2013 -------------------- BETWEEN 楊敏碩 (YEUNG MAN SEK EDMOND) Plaintiff and GOOGLE (HONG KONG) LIMITED Defendant -------------------- Before : Deputy District Judge Mak in Chambers Date of Hearing : 20 February 2014 Date of Decision : 19 March 2014 -------------------- DECISION -------------------- Introduction 1. This is an application by the defendant to strike out the statement of claim under Order 18 Rule 19 of the Rules of District Court. The statement of claim 2. In the statement of claim, which was written in Chinese, the plaintiff alleged that the defendant by using the search engine of google.com.hk (“the domain name”), as an agent, knowingly published and assisted a third party in the intentional and malicious publication of libel or slander. 3. Paragraph 2 of the statement of claim stated that on 5 May 2011, the defendant by using the search engine of google.com.hk included therein, maliciously published as an agent or assisted a third party in the malicious publication of 5 defamatory websites together with 1 malicious photograph. 4. Paragraph 5 of the statement of claim stated that on 23 August 2011, the defendant by using the search engine of google.com.hk included therein, maliciously published as an agent or assisted a third party in the malicious publication of 11 defamatory websites together with 3 indecent photographs and 1 malicious photograph. 5. None of the alleged defamatory words was set out in the statement of claim. Legal principles on striking out 6. To exercise the court’s power under this rule, the claim must be obviously unsustainable, the pleadings unarguably bad and it must be impossible, not just improbable, for the claim to succeed before the court will strike it out: 18/19/4 Hong Kong Civil Procedure 2014. 7. The term “an abuse of the process of the court” connotes that the process of the court must be used bona fide and properly and must not be abused. The court will prevent the improper use of its machinery: 18/19/10 Hong Kong Civil Procedure 2014. Relevant law of defamation 8. To maintain an action for libel or slander, the words complained of must have been published. In order to constitute publication, the matter must be published by the defendant to a third party. See Gatley on Libel and Slander , 12th Ed. at 6.1. 9. The Court of Final Appeal in Oriental Press Group Ltd & anor v Feavaworks Solutions Ltd [2003] 5 HKC 253 held that the provider of a discussion forum was a subordinate publisher and not the first or main publisher of the defamatory postings. As such, it can invoke the innocent dissemination defence as subordinate publisher. 10. In Metropolitan International Schools Ltd (trading as Skillstrain and/or Train2Game) v Designtechnica Corpn (trading as Digital Trends) and others [2011] 1 WLR 1743 , which is a case involving Google Inc as the operator of an Internet search engine, held that since a search carried out by a user of the search engine was performed automatically in accordance with a computer program and involved no input by any officer or employee of the third defendant (ie Google Inc), and since the third defendant played no role in formulating the search terms and could not prevent the “snippet” appearing in response to the user’s request unless it had taken some positive steps in advance, the third defendant could not be characterised as a publisher at common law but was merely a facilitator. Discussion 11. The central issue of this application is whether the defendant is the proper party to sue. 12. Paragraph 3 of the plaintiff’s affirmation argued that the defendant, being the registrant of the domain name, is the administrator of the search engine. He alleges that the defendant by using the search engine linked the general public to those defamatory websites. He defines the defendant as the “defamation agent”（誹謗代理人）of Google Inc. Whether the defendant is the administrator of the search engine? 13. There is no dispute that the defendant is the registrant of the domain name. The plaintiff argued that the administrator of the search engine and the registrant of the domain name is one and the same company. 14. The Competition Counsel, Asia-Pacific Economic Cooperation of Google Inc, Madam Wang Margaret Hsiao-Hui (“Madam Wang”) in her affirmation pointed out that the Annex 1 produced by the plaintiff in his affirmation was incomplete. That document appears to be obtained from the “WHOIS” search enquiry services provided by the website of the Hong Kong Internet Registration Corporation Limited (the “HKIRC”). According to a copy of the complete search result produced by the defendant, it can be seen that the defendant is the “registrant contact” of the domain name, whereas both the “administrative contact” and the “technical contact” is Google Inc. 15. Madam Wang explained that the defendant was named as the registrant of the domain name because paragraph 3.6 of the HKIRC’s Domain Name Registration Policies, Procedures and Guidelines .hk and .香港domain names (“the guidelines”), imposes the restriction that only commercial entities registered in HKSAR are eligible to register a domain name ending with “com.hk”. 16. Paragraph 3.6 of the guidelines reads:- “Commercial entities registered in HKSAR are eligible to register a com.hk English Domain Name and/or 公司.香港 Chinese Domain Name” 17. For this reason, Google Inc decided to use the defendant’s name as the registrant of the domain name. 18. However, Google Inc is responsible for the operation, the maintenance and the running of the website at any time. Therefore, the contact details of Google Inc were given under “administrative contact information” and “technical contact information” instead of those of the defendant. 19. Further, the email account of dns-admin@google.com, which belongs to Google Inc, was given under “registrant contact information”, “administrative contact information” and “technical contact information”. The reason being Google Inc is the actual point of contact in relation to the domain name. 20. Lastly, Madam Wang drew this court’s attention to the Terms of Service of the website, which clearly states that the products and services at the website are provided by Google Inc. 21. From the information given by the defendant, I think it is quite clear that the registrant of the domain name is not the same company which is responsible for the running of the website. 22. Due to the restriction imposed by the guidelines, the registrant of the domain name must be a Hong Kong company. However, Google Inc’s email address of dns-admin@google.com was given at the “registrant contact information”, “administrative contact information” and “technical contact information” columns. Obviously, it was intended that in relation to operation, maintenance and running of the website, Google Inc is the responsible company. 23. I am satisfied that the defendant is not the administrator of the search engine. The defendant is merely the registrant of the domain name of google.com.hk only. The administrator of the search engine is Google Inc. Defamation agent（誹謗代理人） 24. This term must be theplaintiff’s own invention . It is not known in law. The meaning of it is therefore not entirely clear. 25. From the affirmation of the plaintiff, it seems the plaintiff is saying that the defendant, being the registrant of the domain name, must have the ability to manage and control the running of the search engine. The defendant, by allowing the search engine to link the general public to the defamatory websites, is regarded as the “defamation agent” of Google Inc. 26. To succeed in his claim against the defendant, he must establish that the defendant had published the defamatory words to a third party. 27. The defendant in this case is neither the provider of a discussion forum as in the case of Oriental Press Group nor the operator of a search engine as in the case of Metropolitan International Schools . 28. There is no way that the plaintiff can possibly prove that the defendant did publish the defamatory words. The defendant is not even a “facilitator” in the Metropolitan International Schools sense. 29. In my view, the plaintiff’s claim is plainly and obviously unsustainable. It is an abuse of the process of the court which must be prevented. Conclusion and Order 30. For the above reasons, the plaintiff’s statement of claim is struck out and the plaintiff’s claim is dismissed. Costs 31. Costs shall follow the event. I order the plaintiff shall pay the costs of this action including this application to the defendant with Certificate for Counsel. 32. By summary assessment, I order the plaintiff do pay the defendant costs in the sum of $87,682. ( Brian Mak ) Deputy District Judge The plaintiff appeared in person Ms Queenie Lau, instructed by Deacons, for the defendant Look up this case on Lawcite Noteup",
  "length": 9308,
  "headers_seen": [
    "Introduction",
    "The statement of claim",
    "Legal principles on striking out",
    "Relevant law of defamation",
    "Discussion",
    "Whether the defendant is the administrator of the search engine?",
    "Defamation agent（誹謗代理人）",
    "Conclusion and Order"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkdc/2014/274",
  "query": "domain name",
  "ts": "2025-10-17T10:43:47",
  "ok": true
}