{
  "title": "GRANDEUR ELECTRICAL CO LTD V. CHEUNG KEE FUNG CHEUNG CONSTRUCTION CO LTD | [2005] HKDC 271 | HKLII",
  "court": null,
  "year": 2005,
  "date": null,
  "content": "HKLII Databases District Court [2005] HKDC 271 GRANDEUR ELECTRICAL CO LTD V. CHEUNG KEE FUNG CHEUNG CONSTRUCTION CO LTD Judgment Information Date 20 Dec, 2005 Action No. DCCJ6782/2004 Neutral Cit. [2005] HKDC 271 Download MS Word Judgment Reading Options Translation Toggle Highlight Appeal History DCCJ6782/2004 DCCJ006782/2004 GRANDEUR ELECTRICAL CO LTD v. CHEUNG KEE FUNG CHEUNG CONSTRUCTION CO LTD DCCJ6782/2004 IN THE DISTRICT COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION CIVIL ACTION NO. 6782 OF 2004 -------------------- BETWEEN GRANDEUR ELECTRICAL COMPANY LIMITED Plaintiff and CHEUNG KEE FUNG CHEUNG CONSTRUCTION COMPANY LIMITED Defendant -------------------- Coram : Her Honour Judge H.C. Wong in Chambers Dates of Hearing : 7 th and 22 nd November 2005 Date of Handing Down Decision : 21 st December 2005 ________________ DECISION ________________ 1. The Plaintiff applies to lift the order of interim stay of proceedings of 26 July 2005 by a summons of 7 September 2005 for the purpose of restoring these proceedings. 2. The Defendant opposes the application claiming that by the consent summons filed in Court on 26 January 2005, the parties had agreed to the resolution of their dispute under Clause NS 11 of the agreement between the parties. The Defendant alleged that the stay of proceedings was a permanent one not capable of being revived. Background 3. The Defendant Cheung Kee Fung Cheung Construction Co. Ltd. (“CKFC”) was the main contractor of a construction project (“the project”) of the Hong Kong Housing Authority (“HKHA”) under a construction contract no. 87 of 1997 at Tung Chung Area 30 Phase 3 (“the main contract”). The Defendant CKFC entered into a sub-contract for electrical works with the Plaintiff in respect of the project on 4 March 1999 (“the sub-contract”). 4. The Plaintiff Grandeur Electrical Co. Ltd. (“GEC”) received periodical payments upon the certification of the surveyor for work completed under the sub-contract and periodical invoices submitted to CKFC. It is the Plaintiff’s pleaded case that it had duly performed the sub-contract works and variations authorised under the sub-contract. The main contract was also certified as practically completed by the surveyor of the main contract on 27 May 2004. 5. It is the Plaintiff’s pleaded case that CKFC had breached sub-clauses (1) & (3) of Clause NS10 of the Special Conditions of the sub-contract by failing to pay the Plaintiff ‘GEC’ the sum of $994,000 under two invoices nos. 321 and 349 dated 15 March 2001 and 31 March 2004 respectively. 6. A notice of dispute was issued by GEC under Clause NS 11 (3) of the Special Conditions of the sub-contract on 26 June 2004 and served on the HKHA (the Contract Manager under the sub-contract) for the disputed sum of $994,000 requesting the Contract Manager’s decision on the dispute between the parties. 7. On 28 December 2004, GEC commenced these proceedings by issuing a Writ of Summons together with a Statement of Claim in the District Court against CKCF. Undisputed Facts 8. On 19 January 2005, CKCF through its solicitors Messrs. Sidley Austin Brown and Wood wrote to the solicitors acting on behalf of GEC, Messrs. Tang, Lai and Leung, a letter in the following:- “Dear Sirs, DCCJ NO. 6782 of 2004 Cheung Kee Fung Cheung Construction Company Limited ats Grandeur Electrical Company Limited (“the Action”) We act for Cheung Kee Fung Cheung Construction Company Limited and refer to your client’s Writ of Summons dated 28 December 2004 in the Action. We have been instructed that the sub-contract between our client and your client contained a clause whereby the parties have agreed to refer disputes arising under the sub-contract to the Contract Manager for determination, and thereafter either party may within 28 days of the Contract Manager’s decision or his notice of inability to make a decision refer the dispute to arbitration. Your attention is drawn to Clause NS11 of the Special Conditions of the sub-contract. In view of the above, your client is invited to consent to a general stay of all proceedings in the Action pending the disputes between our client and your client being resolved pursuant to the mechanism for dispute resolution under the sub-contract. As the deadline for our client to file and serve a defence in the Action is 24 January 2005, we should be grateful if you would let us hear from you as to whether your client is agreeable to the aforesaid stay of proceedings by close of business on 20 January 2005. Unless we hear from you favourably by the stipulated deadline an application will be made to the court for a stay of proceedings pursuant to section 6 of the Arbitration Ordinance without further reference to you. Our client will seek to recover its costs for making such an application against your client.” 9. To which GEC’s solicitors replied on 20 January 2005:- “Dear Sirs, Re : DCCJ No. 6782 of 2004 (“the Action”) We refer to your letter dated 19 th January 2004. We are taking our client’s instructions in respect of your client’s proposed general stay of proceedings of the Action and will revert to you in the next few days. In the meantime, please withhold your client’s intended application pending our reply. Yours faithfully,” 10. On 24 January 2005, GEC’s solicitors wrote to Messrs. Sidley Austin Brown & Wood the following letter:- “Dear Sirs, Re : DCCJ No. 6782 of 2004 (“the Action”) We refer to our letter of 20 th January 2005 and your letter dated 20 th January 2005. We are instructed that our client principally agrees to stay of proceedings in the following terms:- 1. liberty for the parties to apply; 2. there be no order as to costs; 3. your client is entitled to file its defence, if any, within 14 days of the restoration of the captioned proceedings. Please take instructions and revert to us if your client is agreeable with the aforesaid as soon as practicable. Yours faithfully,” 11. By a letter of the same date, Messrs. Sidley Austin Brown & Wood replied:- “Dear Sirs, DCCJ NO. 6782 of 2004 Cheung Kee Fung Cheung Construction Company Limited ats Grandeur Electrical Company Limited (“the Action”) Thank you for your letter to us dated 24 January 2005 as regards a stay of the Action. Paragraphs 1 and 2 of your letter are agreeable to our client. However, our client will not be required to file a Defence if the parties agree for their disputes to be resolved in accordance with NS11 of the Special Conditions to the Sub-contract dated 4 March 1999. Paragraph 3 of your letter is therefore not required. Please let us have a consent summons for our endorsement in respect of the above by 3:30 pm this afternoon, failing which the client will proceed with its application to the court for a stay of the Action. We look forward to hearing from you. Yours faithfully, Alfred Wu/Malcolm Chin Sidley Austin Brown & Wood” 12. On the same day, GEC’s solicitors sent a draft Consent Summons for CKFC’s approval to Messrs. Sidley Austin Brown & Wood. The terms are the same as set out in their earlier letter of the same date with the exception of the 3 rd paragraph of the earlier draft. 13. The consent summons was filed in Court on 26 January 2005, however, Master Ko of the Registry at the District Court raised requisitions on the Consent Summons of Messrs. Tang Lai and Leung, GEC’s solicitor on record, with the following remarks:- “ 1. The intended solicitors for the Defendant should file a “notice to act” before the court considers the consent summons. 2. Parties may consider filing a consent order if applicable (see O. 42, r. 5 A of RDC).” 14. The Defendant’s solicitors filed a notice to act on 1 February 2005. The Contract Manager’s decision was issued informing the parties that it was not able to reach a decision on the dispute on 24 May 2005. 15. On 22 July 2005, the Plaintiff’s solicitors wrote to the Defendant’s solicitors informing them that the Plaintiff intended to proceed with the court proceedings and requested the Defendant to file a defence within 14 days. 16. The Defendant’s solicitors wrote to the Registry making enquiries as to whether the Consent Summons had been made an order on 26 July 2005. Upon the enquiries by the Defendant’s solicitor, Registrar Yu allowed the terms on the Consent Summons filed on 26 January 2005. Consequently, the Plaintiff filed a summons to lift the stay on 7 September 2005. The terms of Clause NS11 17. “NS11 Clause 29 of the Conditions of Sub-contract is substituted by the following:- (1) If any dispute or difference of any kind whatsoever arises between the Contractor and the Sub-contractor in connection with or arising out of the Sub-contract or the carrying out of the Sub-contract Works including any dispute as to any decision, opinion, instruction, order, direction or certificate of the Contract Manager or certificate or valuation by the Surveyor whether during the progress of the Sub-contract Works or after their completion and whether before or after the determination, abandonment or breach of the Sub-contract, it shall be settled in accordance with the following provisions. (2) For the purpose of this Clause a dispute shall be deemed to arise when one party serves on the Contract Manager a notice in writing (hereinafter called the Notice of Dispute) defining the dispute and requesting a decision by the Contract Manager under this Conditions of Contract. Provided that no Notice of Dispute may be served unless the party wishing to do so has first taken steps or invoked procedures if any are available elsewhere in the Sub-contract in connection with the subject matter of such dispute and the other party or the Contract Manager or the Surveyor as the case may be has:- (a) taken such steps as may be required or (b) been allowed a reasonable time to take any such steps. (3) Within 60 days of receiving a Notice of Dispute, the Contract Manager shall either give, in writing, his decision on the dispute or state, in writing, his inability to make a decision on the dispute. (4) Unless the Sub-contract has already been determined or abandoned the Sub-contractor shall in every case continue to proceed with the Sub-contract Works with all due diligence and the Contractor and the Sub-contractor shall both give effect forthwith to every such decision of the Contract Manager. Such decisions shall be final and binding upon the Contractor and the Sub-contractor unless and until as hereinafter provided either:- (a) the parties agree otherwise, or (b) the decision of the Contract Manager is revised by an arbitrator and an award made and published. (5) In relation to any Notice of Dispute given under sub-clause (2) of this Clause either party may within 28 days of the Contract Manager’s decision or his notice of inability to make a decision, provided no Notice to Refer to Arbitration under sub-clause (6) of this Clause has been served, serve on the other party a Mediation Request Notice, requesting that the Dispute be referred to mediation in accordance with and subject to the Hong Kong Government Mediation Rules issued as Appendix 1 to Works Branch Technical Circular 11/91 dated 27 May 1991. The other party shall, within 28 days of receipt of a Mediation Request Notice, reply in writing either agreeing to or rejecting mediation. (6) The Contractor or Sub-contractor, by serving a written Notice to Refer to Arbitration within the time limits set out in (a) or (b) of this sub-clause, may require the dispute to be referred to arbitration in accordance with and subject to the provisions of the Arbitration Ordinance or any statutory modification thereof for the time being in force and any reference shall be deemed to be a submission to arbitration within the meaning of such Ordinance. (a) Within 28 days of receipt of the Contract Manager’s decision or his notice of inability to make a decision in respect to a Notice of Dispute. (b) Within 28 days of either a rejection to mediate or the failure of the other party to reply to a Mediation Request Notice within the prescribed time limit or the failure of mediation requested in accordance with sub-clause (5) of this Clause. Failure of mediation shall be taken to be the earliest of 90 days after the production of a mediator’s report under Rule 15 of the Hong Kong Government Mediation Rules or immediately upon abandonment of the mediation by the mediator or immediately upon both parties agreeing in writing that mediation has failed.” 18. It is the submission of the Plaintiff’s Counsel, Mr. Khaw, that the dispute resolution provisions under Clause NS11 of the special conditions of the sub-contract have no effect in compelling the parties to refer disputes to arbitration. The provisions do not amount to an arbitration agreement because Clause NS11 only confers an option to either party to refer disputes to arbitration or mediation following the decision or inability to make a decision of the Contract Manager. 19. Mr. Khaw submitted that when the ‘stay’ agreement was reached, the parties had only confirmed to an agreement to refer the dispute to the Contract Manager for decision and a stay pending the decision of the Contract Manager. No agreement to refer the matter to arbitration had been reached and that the option under Clause NS11 (6) was never exercised. After the Contract Manager confirmed it was not able to make a decision on the dispute, the temporary stay of proceedings should be lifted. 20. Mr. Wu, Counsel for the Defendant, submitted that there was an agreement between the parties to refer all disputes to arbitration under Clause NS11 and the Arbitration Ordinance . Even if the parties had not reached the ‘stay’ agreement, the Defendant’s application for a mandatory stay of proceedings would have been granted by Court pursuant to the Arbitration Ordinance . Furthermore, under Clause NS11, once one of the parties opted for arbitration to resolve the dispute, the other party is obliged to agree. The parties in the present case, having agreed by consent summons to stay the proceedings expressed unequivocally the option for arbitration. Mr. Wu argued that by virtue of Clause NS11 and the Arbitration Ordinance , a stay of the Action must be a permanent one and the Action in any event was commenced in breach of Clause NS11. The Thorn Security Decision 21. Mr. Khaw argued that the Defendant’s submission that Clause NS11 has the effect of requiring all disputes under the sub-contract to arbitration is flawed and the argument that the Court would have allowed a mandatory stay to the Defendant under Section 6 of the Arbitration Ordinance is a blatant disregard to the Court of Appeal’s decision in the case of Thorn Security (Hong Kong) Limited v. Cheung Kee Fung Cheung Construction Company Limited [2005] 1 HKC 252 (‘the Thorn Security decision’). 22. The defendant in the Thorn Security case is the same defendant in the present proceedings. The sub-contract in the Thorn Security case was similar to the sub-contract in the present proceedings. The Defendant was the main contractor of HKHA of the same project in the Thorn Security case. Thorn Security was one of the Defendant’s sub-contractors who signed a similar contract as the one the Plaintiff signed in these proceedings. Clause NS11 in the Thorn Security case as seen in the case report is identical to Cl. NS11 in the present case. For this reason, Mr. Khaw submitted that the Court of Appeal’s decision in Thorn Security case is directly applicable in the present proceedings. 23. In the Thorn Security case, Thorn wrote a letter to HKHA, the Contract Manager, headed ‘Notice of Dispute’ in April 2002, requesting a decision under Clause NS11 (3). In June 2002, HKHA replied by letter deciding in Thorn’s favour. Thorn took no steps to involve Clause NS11 further. In December 2002, Thorn issued proceedings to recover default interest which the HKHA had allowed in its decision in June 2002. CKFC took out a summons for a stay of proceedings to arbitration. The judge allowed the stay of proceedings. On appeal to the Court of Appeal, the Court of Appeal held that HKHA’s letter was a ‘decision’ within the meaning of Clause NS11 (3). The Court of Appeal further held that there was no arbitration agreement for reasons that:- “ (i) Clause NS11 (6) was expressed not in mandatory terms but as an option. It stated only that either party ‘may’ require the dispute to be referred to arbitration. Furthermore, arbitration had to be invoked within 28 days of receipt of the Contract Manager’s decision on a Notice of Dispute (at 259G). (ii) The decision made by HKHA under Clause NS11 (2) and (3) was ‘final and binding’ upon the parties unless and until the procedure contained in Clause NS11 (6) was invoked in accordance with the 28-day time limit (at 259H-I). It was not the plain meaning of cl NS11 that the final and binding effect of the Contract Manager’s decision was subject to there being an arbitral award under cl NS11 (6) and that nothing was enforceable without such an award (at 260A-B).” 24. In her judgment Le Pichon JA considered Clause NS111 of the sub-contract and held in p. 259-260:- “ 10. At the heart of this appeal is whether Special Condition 11 was an arbitration agreement. Did the provisions require disputes or differences to be resolved by arbitration or did it merely confer an option on the parties to arbitrate? The judge ruled that the clause was an arbitration agreement and it is this ruling that was challenged. 11. Subclause (1) of Special Condition 11 mandates that all disputes or differences ‘be settled in accordance with the following provisions’. There was no reference to arbitration or to the settlement of disputes or differences by arbitration. One therefore has to read the remaining provisions to see what steps had to be taken for the resolution of disputes. 12. The first step to be taken to initiate the process is the service of a Notice of Dispute (which must be in writing) by either party to the contract manager. Under sub-cl (2), this notice defines the dispute and requests a decision by the contract manager who, under sub-cl (3) is required, within 60 days of receiving a Notice of Dispute, to give his written decision on the dispute or state, in writing, his inability to make such a decision. This first part is thus self-contained, with its own time-frame. 13. Subclause (4) enjoins the parties to ‘give effect forthwith’ to every decision of the contract manager rendered under sub-clause (3) and provides that ‘such decisions shall be final and binding’ on the parties unless and until ‘as hereinafter provided’ which was the happening of one of two events, namely, either the parties agree otherwise, or, the decision of the contract manager is revised by an arbitrator and an award made and published. The two events contemplated by sub-clause (4) form the subject matter of sub-cl (5) and (6). Subclause (5) which deals with mediation is not relevant for present purposes. 14. The procedure for invoking sub-clause (6) is by service of a written Notice to Refer to Arbitration. The first matter to note is the wording used, viz that the contractor or subcontractor ‘may require the dispute to be referred to arbitration’. It is not expressed in mandatory terms: rather, it is framed as an option. Moreover, there is a time limit stipulated for invoking this procedure: under para (a), that has to be done within 28 days of receipt of the contract manager’s decision or his notice of inability to make a decision in respect to a Notice of Dispute. 15. In my view, sub-cl (4) and (6) read together provide the second part of the framework devised by the parties for the resolution of disputes and differences between them. The decision made by the contract manager under the first part i.e. sub-cl (2) and (3) is ‘final and binding’ upon the parties unless and until the procedure contained in sub-cl (6) is invoked in accordance with its terms, namely, within the time limit stipulated. 16. It was argued that assuming the letter of 7 June were a decision for the purposes of sub-cl (3) of Special Condition 11 and in the event of the defendant refusing to pay the amount found due, on a proper construction of Special Condition 11, the plaintiff must go to arbitration and obtain an arbitral award before any question of enforcement could arise. Miss Cruden submitted that the effect of sub-cl (6) is that the parties must refer to arbitration and that the provision in sub-cl (4) that the decision of the contract manager is ‘final and binding’ is subject to there being an arbitral award made under sub-cl (6) so that nothing is enforceable without such an award. That, to my mind, is not the plain meaning of Special Condition 11 when read a whole. I cannot agree that whenever the word ‘arbitration’ is mentioned in any provision, it necessarily has to be interpreted as meaning an arbitration agreement. There is no bar that I can see to parties agreeing to an option to arbitrate which is exercisable only within certain time limits without necessarily creating an arbitration agreement. In such a situation, the option must be exercised in accordance with its terms. 17. In my view, the argument that nothing is final and binding absent an arbitral award frustrates the clear purpose of the provisions contained in Special Condition 11. The dispute resolution mechanism agreed to by the parties provides an efficient means for achieving finality. The parties agreed to be bound by the decisions of the contract manager which are to be final and binding unless the option to arbitrate is invoked within the time limits stated. That is a commercial arrangement that is readily comprehensible to render finality to disputes and at the same time maintaining some flexibility by giving either party an option to elect to arbitrate if it were dissatisfied with the decision of the contract manager. But in such a case, the conditions for exercising the option must be strictly complied with. 18. As it is my view that there was no arbitration agreement, the authorities relating to the effect of a time bar in the context of arbitrations are beside the point and need not be addressed.” 25. Based on the Court of Appeal’s decision which is binding on this Court, I accept Mr. Khaw’s submission that Clause NS11 gave the parties an option to arbitrate. Procedures under Clause NS11 must be followed should the parties wish to resolve the dispute by arbitration and sub-clause (6) have to be invoked in order to exercise the option to arbitrate under Clause NS11. 26. In the light of Le Pichon J.A.’s judgment, I cannot agree with Mr. Wu’s submission that these proceedings were wrongly issued or was premature. Neither do I accept that by agreeing to the consent summons, the Plaintiff had opted or agreed to arbitrate. 27. Mr. Wu argued that the Thorn Security decision does not propose that Clause NS11 (6) confers on the parties an option to refer disputes to either arbitration or litigation. He relied on the judgment of Ma J (as he then was) in Tommy C.P. Sze & Co. v. Li & Fung (Trading) Ltd. [2003] 1 HKC 418 referring to p. 429 – 430 of the judgment. “33. In my judgment, care is required when considering cases like Pinnock and Hardwick Game Farm. Whatever may have been held to be the right conclusion in these cases, this does not necessarily or readily become applicable in all other cases: (1) The wording of the clause in question in any given case will be different. (2) More important, as a matter of construction of contracts, the context in which contractual clauses have been construed by the courts in previous cases must also be considered. Most of the time, the relevant context perhaps does not change. However, Pinnock and, to an extent, Hardwick Game Farm, were decided at a time when the English courts still somewhat jealously guarded the right of citizens to have access to the courts.” 28. Ma J. in his judgment at p. 425E - F further held:- “An agreement which does not compel parties to have disputes or differences resolved by arbitration is not an arbitration agreement for present purposes. Where, for example, an option is given to the parties to go to arbitration if they so choose but with litigation in the courts being an available option as well, this is not truly an arbitration agreement. There must be its element of compulsion in the agreement between the parties that any disputes or differences must be arbitration. Thus, the logical starting point of all applications for a stay must be: Is the clause in question an arbitration agreement? (Question1) If the answer is No, a stay will not be granted.” 29. Clearly, one should look at the contractual clauses and consider the construction by the courts in previous cases. In the present action, Le Pichon J.A.’s construction of the same clause NS11 in the sub-contract must be the only construction acceptable and is binding on this Court. 30. Mr. Wu argued that the Thorn Security decision is merely authority for the proposition that the option to refer disputes to arbitration would be spent upon the time limit for exercising the option expiring. That the only role played by the Court in these circumstances was to enforce the ‘final and binding’ decision of the Contract Manager. 31. The aforesaid was indeed the outcome of the Thorn Security case so far as the two parties in that case were concerned. However, those were not the only issues construed by the Court of Appeal in Thorn Security: Le Pichon J.A. held in paragraph 14 of her judgment that Clause NS11 (6) is not expressed in mandatory terms, but is framed as an option which has to be exercised within 28 days of the contract manager’s decision or his inability to make a decision in respect to a notice of dispute. 32. In para. 16 at p. 260 C – E of the judgment, Le Pichon L.J. held:- “I cannot agree that whenever the word ‘arbitration’ is mentioned in any provision, it necessarily has to be interpreted as meaning an arbitration agreement. There is no bar that I can see to parties agreeing to an option to arbitrate which is exercisable only within certain time limits without necessarily creating an arbitration agreement. In such a situation, the option must be exercised in accordance with its terms.” 33. In order to effectively exercise the option to refer to arbitration under Clause NS11 (6), either party to the sub-contract is required to serve a written ‘Notice to Refer to Arbitration” within 28 days of receipt of the Contract Manager’s notice of inability to make a decision. In the present case, neither party exercised the option and no notice to refer to arbitration was served within the time limit. It follows that there was no agreement to refer to arbitration for neither party had exercised the option to refer to arbitration similar to the Thorn Security case, where after the Contract Manager’s decision, CKFC failed to exercise the option to refer to arbitration within 28 days. Therefore, there was no arbitration agreement. 34. It was argued by Mr. Wu that by agreeing to the Consent Summons which was filed into Court with the marginal notes referring to S. 6 of the Arbitration Ordinance , the parties have indicated there was an agreement to go to arbitration. From the correspondences exchanged by the parties, this was not expressed or indicated. This is also denied by the Plaintiff who claimed there was an agreement only to stay the Court proceedings pending a decision from the Contract Manager. In any event, following the Thorn Security decision, the only way the option to refer to arbitration can be exercised under Clause NS11 (6) was to serve a written ‘Notice to Refer to Arbitration’ within 28 days of the Contract Manager’s decision or inability to make a decision. No notice was served within time, no arbitration agreement followed. 35. On the same basis, the stay could not have been intended as a permanent one that cannot be lifted. On the Plaintiff’s part, it had in the original draft of the Consent Summons included the paragraph for the Defendant to file a defence within 14 days. Thus anticipating the action may have to continue. Clause NS11 contains procedure for dispute resolution by referring the dispute to the Contract Manager for decision. It further contains provisions for the procedure for the option to go to mediation or arbitration and the time frame for doing so. It does not make arbitration or mediation mandatory. They were merely options opened to the parties. 36. Furthermore, I do not agree with Mr. Wu that had the Defendant applied for a stay, the Court would have granted the stay. For reasons explained above and on the authority of the Thorn Security decision, it does not necessarily mean arbitration would follow. 37. In conclusion, I am satisfied the Plaintiff has the right not to exercise the option to refer the dispute to arbitration and since the Defendant did not exercise the option within time, the Plaintiff is entitled to apply for the stay of these proceedings to be lifted. I therefore grant an order in terms of paras. 1 – 3 of the Plaintiff’s summons. 38. Costs nisi: costs of the application and the hearing be to the Plaintiff to be taxed if not agreed with certificate for Counsel. H.C. Wong District Court Judge Parties: Mr. Richard Khaw instructed by Messrs. Tang, Lai & Leung for the Plaintiff. Mr. Alfred Wu of Messrs. Sidley Austin Brown & Wood for the Defendant. Defendant's appeal to Court of Appeal allowed. Please refer to CACV100/2006 dated 25 July 2006 Look up this case on Lawcite Noteup",
  "length": 29556,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkdc/2005/271",
  "query": "stay of proceedings",
  "ts": "2025-10-14T11:23:14",
  "ok": true
}