{
  "title": "KZ V. KY | [2024] HKCFI 1880 | HKLII",
  "court": null,
  "year": 2024,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2024] HKCFI 1880 KZ V. KY Judgment Information Date 18 Jul, 2024 Action No. HCCT41/2019 Neutral Cit. [2024] HKCFI 1880 Parallel Cit. [2024] 5 HKC 578 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCCT41/2019 HCCT41A/2019 KZ v. KY HCCT 41/2019 [2024] HKCFI 1880 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO 41 OF 2019 ____________________ IN THE MATTER of the Enforcement of Mainland Arbitral Award in Hong Kong and IN THE MATTER of Sections 84 and 92 of the Arbitration Ordinance ( Cap.609 ) and pursuant to Order 73 , Rules 3, 6, 7 and 10 of the Rules of High Court ( Cap.4A ) ____________________ BETWEEN KZ Applicant and KY Respondent ____________________ Before: Hon Mimmie Chan J in Chambers Date of Hearing: 24 April 2024 Date of Decision: 19 July 2024 _____________ D E C I S I O N _____________ Background 1. By order made on 10 September 2019 (“ Enforcement Order ”), this Court granted leave to the Applicant to enforce an arbitral award issued by the Xiamen Arbitration Commission on 29 May 2019 (“ Award ”) as a judgment or order of this Court. The Award was made in an arbitration initiated by the Applicant against the Respondent on the Mainland (“ Arbitration ”), pursuant to a Share Entrustment Agreement made between the Applicant and the Respondent on 25 January 2013 (“ Share Entrustment Agreement ”). In the Arbitration, the Applicant claimed that he had entrusted the Respondent to hold shares in various companies on his behalf, and that the Respondent had acted in breach of such Share Entrustment Agreement by failing to transfer the shares back to the Applicant. 2. Under the Award, the tribunal declared that 62.68% of the shares of Fuma International Limited (a company incorporated in Hong Kong), held in the name of the Respondent, were owned by the Applicant and that the Respondent should transfer the shares to the Applicant. 3. The Enforcement Order stated that the Respondent may apply to set aside the order within 14 days after service on him. The Court also gave leave for service of the order on the Respondent at his specified addresses in Fujian and Xiamen. 4. According to the letter from the Fujian Court and the Return Forms attached, which were received by the Registrar of the High Court on 14 May 2020, the Enforcement Order had been duly served on the Respondent on 20 March 2020 , at an address in Fujian on the Mainland. 5. It was only on 11 December 2023 that the Respondent applied by his summons for an extension of time to set aside the Enforcement Order (“ Summons ”). The grounds for the setting aside were not specified in the Summons, but in the affirmation made by the Respondent on 10 December 2023 and filed in support of the Summons, it was stated that he relied on 3 grounds for his application. The first ground as stated was that the Award is in respect of a matter which is not capable of settlement by arbitration, that it dealt with a dispute not falling within the terms of the submission to arbitration, or contains decisions on matters beyond the scope of the submission, or it would be contrary to public policy to enforce the Award. 6. The second ground asserted was that the Award infringed or affected the rights of a third party, Mr Mak, who had already commenced proceedings on the Mainland against the Applicant and the Respondent. 7. The third ground asserted was that the application for extension of time would not cause any prejudice to the Applicant. 8. Enforcement of a Mainland arbitral award can only be refused on the grounds set out in section 95 of the Arbitration Ordinance (“ Ordinance ”). The second and third grounds asserted by the Respondent cannot by themselves constitute grounds for the Court to refuse enforcement of the Award. The third ground can only be treated as a matter to be included in the Court’s consideration of whether extension of time should be granted to the Respondent to set aside the Award, or in the exercise of the Court’s discretion as to whether to allow or refuse enforcement of an award. The Disputes 9. The Applicant and the Respondent are in fact brothers. They are members of the Ke family comprising the Father, the Mother, 2 sisters and 4 brothers. The Mother died in November 2015, and the Father died in March 2016. 10. The Respondent claims that the Father was the founder of 6 companies of the family (“ Family Companies ”): Fujian Fuma Enterprise Group Co Ltd; Fuma International Limited (“ F International ”), Blooming International Group Limited (“ Blooming ”)), Chengdu Fuma Food Limited Company, Shandong Focus Garments Co Ltd and Fuma Mimi (Fujian) Food Industry Limited Company (“ F Mimi ”). F International and Blooming are companies incorporated in Hong Kong, whereas the others are all Mainland companies. 11. The Applicant claims that he and all the other siblings were the co-founders and shareholders of the Family Companies. 12. According to the Applicant, the co-founders and shareholders decided in 2013 to restructure the assets of all the Family Companies (“ Restructuring ”). This was before the parents’ death. There is no dispute that on 25 January 2013, the Share Entrustment Agreement was made between the Applicant and the Respondent. On the Applicant’s case, he entrusted the Respondent to hold his shares in the Family Companies for his benefit until the conclusion of the Restructuring, and to enable the Respondent to represent the Applicant in such process. The Applicant claims that it was understood that the shares of the Family Companies transferred would be returned to him after the Restructuring was completed. 13. In February 2013, the Ke siblings entered into a Restructuring Agreement in respect of all the Family Companies (“ Restructuring Agreement ”). The Applicant, the Respondent and Ke Baozhi formed Group 1, the other siblings (Ke Shengzhi, Ke Yongjian and Ke Yongkai) formed Group 2, and the shareholding and assets of the Family Companies were divided into two packages, for division between the two Groups. The Restructuring Agreement stipulated the percentages of the shareholders’ equity to be received by each shareholder. The agreed percentages were as follows: Name of shareholder Percentage Group One KY (the Respondent) 15.42% KZ (the Applicant) 27.71% Ke Baozhi 1.08% Group Two Ke Shengzhi 1.41% Ke Yongjian 18.89% Ke Yongkai 35.49% 14. By drawing lots, Group 1 received Package 2 which amounted to 44.21% of the assets of all the Family Companies. Based on the percentages stated in the Restructuring Agreement, the Applicant claims that he owns 27.71% of the 44.21% assets of the Family Companies. 15. The assets of Package 2 include the 100% shareholding of F International, and by virtue of the Restructuring, the Applicant claims that he owns 62.68% (being his share of 27.71% of the total of Group 1’s share of the assets of the Family Companies) of the shares of F International. 16. Under the Share Entrustment Agreement made between the Applicant and the Respondent, the Applicant entrusted the Respondent to hold the shares in the Family Companies together with all rights in the shares for the Applicant, with the understanding that the shares would be transferred back to the Applicant upon the completion of the Restructuring. 17. In the Arbitration, the Applicant claims that the Respondent was in breach of the Share Entrustment Agreement and that the Applicant was entitled to terminate same. He also claims that he was entitled to seek the transfer of the shares in F International which were recorded to be registered in the name of the Respondent, and which were held by the Respondent on his behalf. These claims were denied by the Respondent, who claimed in the Arbitration that the Share Entrustment Agreement was invalid, that the Applicant did not have any separable rights in the shares in F International, and that even if the Share Entrustment Agreement was valid, the conditions for termination of the entrustment had not been fulfilled and should continue. 18. In the Award, the tribunal accepted that the Restructuring contemplated under the Share Entrustment Agreement and the Restructuring Agreement had been completed, that the Applicant was entitled to 62.68% of the shares in F International, and that he was entitled to terminate the Share Entrustment Agreement and to have 62.68% of the shares in F International transferred from the Respondent into his name. 19. The Respondent applied to the Xiamen Intermediate People’s Court to set aside the Award, on the ground that the Award contained matters beyond the scope of the arbitration agreement contained in the Share Entrustment Agreement, and that the Arbitration was conducted contrary to the agreed procedure or the procedure prescribed by law. That application was dismissed by the Xiamen Court on 23 August 2019. 20. Since then, various proceedings had been commenced in Hong Kong for enforcement of the Award, including proceedings instituted by the Applicant to seek registration of the transfer of the shares in F International into his name, and for a general meeting of F International to be convened by the directors. 21. In July 2023, the Respondent commenced HCA 1193/2023 against the Applicant, claiming that the Applicant was in breach of the Share Entrustment Agreement and the Restructuring Agreement by disputing the Respondent’s 62.68% shareholding in F International, that the assets which were the subject of the Share Entrustment Agreement and the Restructuring Agreement related to the succession of the Ke family, and that the Respondent had infringed his rights as a shareholder of F International. 22. There have also been proceedings commenced on the Mainland. These include an action instituted by the Respondent against the Applicant and his other siblings, whereby the Respondent claims that the shares in F International and Blooming were assets forming part of the estate of the Father and the Mother, and that the Respondent had a one-sixth share in the estate (“ Mainland Succession Action ”). 23. The Respondent’s claims made in the Mainland Succession Action were in fact dismissed by the Mainland Fujian Court on 24 November 2023. He appealed against the dismissal in December 2023, and judgment is pending on the appeal. 24. The Respondent highlighted the fact that proceedings had also been commenced by Mak on the Mainland in July 2023 (“ Mak Action ”), who claimed against the Applicant and the Respondent, on the basis that he was the owner of one share in F International and had a prior right to purchase the Respondent’s 62.68% shareholding in F International. Citing the PRC Company Law, Mak claims that a shareholder seeking to transfer his shares to a party other than an existing shareholder should seek the consent of shareholders holding more than 50% of the shares of the company. The Mak Action was heard in March 2024, and the parties are awaiting judgment. The application for extension of time 25. In dealing with the Respondent’s application for extension of time, the relevant principles are set out in the Court of Final Appeal’s decision in Astro Nusantara International BV & ors v PT Ayunda Prima Mitra [2018] HKCFA 12 . The Court is to look at all relevant matters and consider the overall justice of the case, the relevant factors including (but not restricted to) the length of the delay, whether the party who had permitted the time limit to expire was acting reasonably in the circumstances, whether the other side had contributed to the delay, whether the respondent to the application for time would by reason of the delay suffer irremediable prejudice in addition to the mere loss of time, and the strength of the application. The Court of Final Appeal emphasized that the Terna Bahrain approach of promoting the importance of certain factors, and according to others a secondary status, is not correct. Delay and reasons for delay 26. As highlighted by the Applicant, the Respondent’s application to set aside is 44 months out of time. This is significant delay, bearing in mind the yardstick of 14 days provided for in the Enforcement Order. 27. The Respondent’s explanation for this delay is set out in his affirmation filed on 11 December 2023. He referred to the fact that the Enforcement Order was made ex parte , without notice to him and without his knowledge, and that it was only in mid-March 2023 that he learned of the Enforcement Order and the separate Order granted by the Court on 12 July 2021, under which the Applicant’s solicitors were authorized to execute the instrument of transfer and the board resolution approving the transfer of shares. 28. I find the Respondent’s excuse disingenuous, in all the circumstances of the case. Given the history of the proceedings and all the steps taken by the Respondent in 2023, it is unbelievable that he was not aware of the effect of the Award by virtue of the Enforcement Order made in September 2019. His failure to apply to set aside the Enforcement Order before the issue of the Summons in December 2023 must have been a conscious and deliberate choice. 29. According to the Return Forms of the Fujian Court which were sent to and received by the Registrar of the High Court on 14 May 2020, the Enforcement Order was personally delivered to the Respondent on 20 March 2020. The notes made on the Return Form were that the Respondent was emotional or agitated, but that the documents were left with the Respondent after the process server had informed the Respondent of the nature of the litigation to which the documents related. 30. The Respondent did not in his evidence dispute receipt of the documents which were served on him in March 2020. His claim is that he only had knowledge of the Court orders in mid-March 2023, and Counsel sought to explain that the Respondent had not known the contents of the documents served on him. This is hardly an acceptable explanation. If the Respondent chose to ignore the documents which were served on him, particularly when it had been pointed out to him that the documents related to legal proceedings, and if he decided on his own accord not to find out the contents, meaning and effect of the documents, then he only has himself and no one else to blame. 31. Despite his admission that he had learnt of the Enforcement Order in March 2023, the Respondent failed to take action until nearly 10 months later, in December 2023. There is no good explanation for this, apart from the Respondent’s assertion that this was during the time of the pandemic, and he had not been able in this interim to look for suitable lawyers on the Mainland and in Hong Kong to deal with the matter, until May 2023. As correctly pointed out by the Applicant, this is contradicted by the fact that by 14 April 2023 at the latest, the Respondent had been able to instruct lawyers in Hong Kong to act for F International, which he controlled at the material time as director, as evidenced by the records of representation in HCMP 337/2023, which were the proceedings commenced by the Applicant against F International for a general meeting to be convened. 32. It is clear that from March 2023 to December 2023, instead of taking any action in relation to the Enforcement Order, the Respondent chose to make efforts to start other proceedings in relation to his alleged interests in the shares of F International and Blooming, including the commencement of HCA 1193 in Hong Kong and the Succession Action on the Mainland, and to focus on those and other administrative proceedings involving F Mimi on the Mainland. That was his choice, not to take action to set aside the Enforcement Order until December 2023. 33. In my view, there is no good reason at all for the significant delay in the application to set aside the Enforcement Order. 34. Nor can I see that the Applicant in this case has in any way contributed to the Respondent’s delay in the application. Merits of the intended application to set aside 35. I do not consider that there are merits in the grounds sought to be relied upon by the Respondent to oppose enforcement of the Award. 36. The essential thrust of the Respondent’s case, as argued at the hearing, is that the dispute over the Applicant’s alleged interests in the shares of F International is in fact a dispute over succession issues arising in respect of the estate of the siblings’ parents, and in particular the estate of Father, as the Family Companies were all said to have been founded by Father, and form part of his estate upon his death, to be shared amongst the Ke siblings. The Respondent so claims in the Mainland Succession Action, and maintains that he has a one-sixth share in the estate, which includes the shareholding in F International as well as Blooming. Being a succession dispute, the Respondent claims that under the PRC Succession Law, if any of the heirs to the estate do not recognize the Restructuring Agreement, and request the matter to be dealt with in accordance with legal succession as prescribed by law, then by virtue of Article 5 of the Succession Law, the matter would be handled in accordance with legal succession. Hence, the Respondent’s submission is that the subject matter of the dispute between the Applicant and the Respondent in relation to the shareholding in F International is not arbitrable. 37. Even on the face of the expert opinion relied upon by the Respondent, the mere fact that the disputes as to the shareholding in the Family Companies (including F International) should be considered and dealt with under the PRC Succession Law does not mean, and the expert has not explained why, it must only be dealt with by the Mainland Court, and cannot be arbitrated and decided by the tribunal in accordance with the Succession Law. 38. Second and more pertinently, the Mainland Court already decided this issue against the Respondent in the Mainland Succession Action. In the judgment handed down on 24 November 2023, the Mainland Court held that F International and Blooming were part of the assets of the Ke family, but that the siblings had already agreed on the restructuring of the assets of the Family Companies by virtue of the Restructuring Agreement, which had been signed by the Mother with her knowledge and agreement to the Restructuring, and before the Father’s death. The Court pointed out that under and by virtue of the Restructuring Agreement, F International and Blooming had already been “severed” from the assets of the estate, and the Restructuring Agreement had been implemented and performed for nearly 10 years, such that the companies no longer constituted the estate of either Mother or Father. 39. Thirdly, the Applicant never raised the non-arbitrability of the dispute in either the Arbitration, or before the Mainland Court in the Mainland Succession. 40. As the underlying Share Entrustment Agreement and the Arbitration which was held on the Mainland are governed by PRC law, this Court gives due regard and weight ( Gao Haiyan v Keeneye Holdings Ltd [2012] 1 HKLRD 627 , para 102) to the Xiamen Court’s findings and dismissal of the application to set aside the Award on the grounds of procedure and the alleged failure to comply with PRC law, and to the Fujian Court’s judgment for the dismissal of the Mainland Succession Action. The Mainland Court’s decision is evidence of the applicable Mainland law, and whether there is breach of such law. According to the Xiamen Court, there was no breach of the law on the procedure and scope of the submission to the Arbitration. According to the Fujian Court, the shares in F International and Blooming do not constitute assets of the estate of Father or Mother. 41. Although there is an appeal against the judgment of the Fujian Court of November 2023, and the Respondent focused on the fact that by accepting and deciding the dispute in the Mainland Succession Action, the nature of the dispute has been accepted and “characterized” by the Fujian Court as one which concerned the “succession” of the assets or estate of Father and Mother - irrespective of the outcome of the appeal, I do not find the Respondent’s argument as to the subject matter of the dispute being non-arbitrable to be persuasive at all. There is in fact nothing in the Fujian Court’s judgment of 24 November 2023 which holds or can be inferred to mean that the dispute as to the shareholding in F International is not arbitrable. Nor was any such contention made by the Respondent to the Mainland Courts. It is pertinent to note that the Fujian Court was made aware of the fact that the dispute had been referred to arbitration, and that the claims made by the Respondent in the Arbitration had been dismissed by the tribunal. 42. The Respondent likewise did not claim in the Arbitration that the subject matter of the dispute between the Applicant and himself, as to the interests in and ownership of the shares in F International, was not arbitrable. If it was indeed non-arbitrable, this affected the fundamental question of the jurisdiction of the tribunal in the Arbitration over the claims made by the Applicant. Throughout the Arbitration, the Respondent never suggested that the tribunal did not have jurisdiction, or that the subject matter submitted to the tribunal was not capable of arbitration by virtue of the Succession Law, or otherwise. Nor did the Respondent claim, in his application to the Xiamen Court to set aside the Award, that the dispute was not arbitrable under the PRC Succession Law. 43. This is not a question of the Respondent’s choice of remedies, and not a matter of depriving the Respondent of his right to challenge the Award at the enforcement stage in Hong Kong, even if he had chosen not to apply to the supervisory court on the Mainland. He did make an application to the Mainland Court to set aside Award, but did not claim that the dispute was non-arbitrable under the applicable PRC Succession Law. 44. The issue is that in these circumstances, the Respondent should be treated to have waived, or be estopped from objecting to the arbitrability of the dispute and to the jurisdiction of the tribunal, when it was open to him to make such challenge or objection but he had failed to make the application, either to the tribunal or to the supervisory court, and has thereby deprived the tribunal of the opportunity to consider the question of its jurisdiction and of the arbitrability of the dispute. This is in breach of the Applicant’s duty of good faith in the conduct of the Arbitration ( Hebei Import & Export Corp v Polytek Engineering Co Ltd (1999) to HKCFAR 111). As the Court of Final Appeal pointed out in Hebei , it is also a matter which would justify the court of enforcement in enforcing the award. 45. This Court can conclude that there is little if any merit in the Respondent’s claim that the dispute is not arbitrable under Mainland law. 46. The Respondent has not claimed or argued that the dispute is not arbitrable under Hong Kong law. He only relies on his PRC law expert’s opinion that if the tribunal had accepted the case and made the Award in breach of the Succession Law, then it was open to the Respondent to oppose enforcement of the Award in accordance with Hong Kong law. Needless to say, the PRC law expert is not qualified to give opinion on Hong Kong law, and the Respondent has not cited any case or authority to support the claim that the subject matter of the dispute in the Arbitration is not arbitrable under Hong Kong law. 47. The Award determined the rights and obligations of the Applicant and the Respondent as parties to the Share Entrustment Agreement, and is binding on them as to the ownership of the shares in F International. I do not consider that the Award lacks utility to render the subject matter of the dispute non-arbitrable (a matter considered by the Court in Sterling v Rand [2020] All ER (Comm) 934). 48. The only remaining claim made is that the Award affects the interests of third parties, and should not be enforced as such. In this regard, Counsel for the Respondent relies on the decisions of the English Court in Fulham Football Club (1987) Ltd v Richards & Anor [2012] 2 WLR 1008 and in Sodzawiczny v McNally [2022] 1 CLC 348. In my judgment, neither of these cases can assist the Respondent. 49. Fulham Football Club is a case on whether unfair prejudice disputes between shareholders of a company are arbitrable. The English Court of Appeal in fact decided that the determination of whether there had been unfair prejudice is capable of being decided by an arbitrator, as a dispute between members of a company or between shareholders and the board about alleged breaches of the articles of association or a shareholders agreement is essentially a contractual dispute, which does not necessarily engage the rights of creditors or impinge on any statutory safeguards imposed for the benefit of third parties. In its judgment, the Court of Appeal distinguished the unfair prejudice petition against the company in the case from proceedings in which the question for determination is whether a company should be wound up, which is within the exclusive jurisdiction of the Court, and the discretion as to whether or not to make the winding up order is for the Court, and not the arbitrator, to exercise. The Court further found that the case did not involve the exercise of any statutory power to intervene in and set aside transactions (eg as fraudulent preferences), which rights are vested in the liquidator appointed under the relevant insolvency acts, and are for the benefit of the creditors as a whole, and cannot be overridden by a contract entered into by a company prior to its liquidation. 50. In his judgment, Patten LJ referred to the decision of the Singapore Court of Appeal in Larsen Oil and Gas Pte Ltd v Petroprod Ltd [2011] 3 SLR 414 , where an arbitration clause in a management agreement was relied upon as the basis of an application for stay of proceedings brought by a liquidator for recovery of payments said to constitute preferences or transactions at an undervalue. In Larsen Oil , VK Rajah JA made the following pertinent observations, at paras 44-46 of the judgment: “The concept of non-arbitrability is a cornerstone of the process of arbitration. It allows the courts to refuse to enforce an otherwise valid arbitration agreement on policy grounds. That said, we accept that there is ordinarily a presumption of arbitrability where the words of an arbitration clause are wide enough to embrace a dispute, unless it is shown that Parliament intended to preclude the use of arbitration for the particular type of dispute in question (as evidenced by the statute’s text or legislative history), or that there is an inherent conflict between arbitration and the public policy considerations involved in that particular type of dispute.” 51. As illustrated by the judgments in Fulham and Larsen Oil , therefore, unless the dispute in question is governed by the operation of some statutory regime which reserves jurisdiction and power to the courts, the true basis of finding that a matter is not arbitrable is public policy in that it would be contrary to public policy to enforce an arbitration agreement for the particular type of dispute. The insolvency regime is aimed primarily to seek recovery for the benefit of the general body of creditors of a company as a whole, as a matter of public policy. In Fulham , the Court considered that it would still be open to an arbitrator to decide whether the complaint of unfair prejudice was made out, and whether it would be appropriate for winding up proceedings to take place, or whether some lesser remedy should be granted. The Court also expressly pointed out that if the relief sought is of a kind which may affect other members who are not parties to the existing reference, there was no reason in principle why their views could not be canvassed by the arbitrators before deciding whether to make an award in those terms. 52. I cannot agree that Fulham is authority for the general proposition that when an award affects a third party, then it follows that the subject matter of the dispute in the arbitration must be non-arbitrable, or that the award must not be enforced. The facts of the present case do not give rise to the need for the Court to exercise any statutory power or other function reserved to the Court, or designed for the protection of any group of third parties in the interests of the public. The dispute over the shares in F International concerns purely contractual rights between the Applicant and the Respondent. There is nothing against public policy interests to enforce the arbitration agreement for such a contractual dispute. 53. In Sodzawiczny v McNally , the Court found simply that it is open to the court faced with an application for leave to enforce an award to decide whether third party interests provide a reason not to allow enforcement. The case concerned a declaration made by the tribunal that the claimant was the ultimate beneficial owner of property acquired by the defendant and that the defendant held the powers or interests which he had in the property on trust for the claimant. The Court observed that an order for enforcement may be refused where it would “improperly affect the rights and obligations of those who were not parties to the arbitration agreement”, and that this would include cases in which injunctive or specific performance are refused because of the existence of a prior third party right and the impact an order of specific performance or injunctive relief would have on third parties (citing Snell’s Equity ). 54. Counsel for the Respondents also rely on the principle that equitable remedies such as specific performance would not be ordered by the Court if such an order is prejudicial to third parties, or if it interferes with the rights of third parties ( Snell’s Equity , 34 th edition, paragraph 17-035, 17-048; and Sterling v Rand [2020] 1 All ER (Comm) 934. 55. On the facts of this case, I am simply not satisfied that the Award and the relief granted thereunder for the Respondent to transfer the 62.68% (6,268 shares) of F International to the Applicant affects the rights of the alleged third-party, Mak, who holds one share in F International. 56. According to the register of members of F International, as at 5 August 2022, the one share held by Mak was transferred to him from the Respondent in 2017 and was recorded to be held by Mak as trustee of the Respondent. His one share in F International amounts only to 0.01% of the total shareholding of F International (and not 1% as the Respondent claims). Mak’s shareholding is referred to in the Award. 57. The assertion made that Mak is allegedly affected or prejudiced by the declaration made in the Award is on the basis of an unparticularized oral agreement made between the Respondent and Mak, whereby the Respondent had agreed with Mak that if he should transfer his shares in F International, he would offer same to Mak by way of priority. Mak claims that he had never consented to the Respondent’s transfer of his shares in F International to the Applicant. 58. First and foremost, the Declaration made in the Award was for the transfer of the 6,268 shares in F International held in the Respondent’s name (amounting to 62.68% of the total shareholding). These do not include Mak’s one share - irrespective of whether or not Mak’s share was at all material times held by him on trust for the Respondent. 59. Secondly, the Award does not even bind Mak, who is still entitled to assert any rights he may have to the shares in F International. 60. Thirdly, Mak’s alleged preemptive right in respect of the Respondent’s shareholding arises under an oral agreement made between Mak and the Respondent. If Mak claims that the Respondent was in breach of the oral agreement between them, it is open to Mak to make such claims, and to commence such proceedings as he may be entitled against the Respondent, to seek any appropriate remedy. 61. The Respondent’s case is simply that according to his PRC law expert, if Mak is successful in the Mak Action on the Mainland, Mak can apply to the Hong Kong Court for non-enforcement of the Award. The PRC law expert is of course not qualified to express such an opinion, which is a matter of Hong Kong law. 62. Further, as Counsel for the Applicant correctly pointed out, neither Mak nor the Respondent is seeking to rely on the Articles of Association of F International, to claim that they confer on Mak or recognize any right Mak may have in respect of the 6,268 shares in F International which are sought to be transferred from the Respondent to the Applicant, and/or that the Applicant is bound in any way by the Articles to recognize Mak’s purported interests. Mak only relies on his alleged rights under the PRC Company Law, which requires the consent of more than 50% of the shareholders before any shares can be transferred from a shareholder to a party not already a shareholder of the company. F International is a company incorporated under the laws of Hong Kong, and Hong Kong law governs the company. There is no evidence as to how the PRC Company Law can apply to either F International, or the Applicant and the Respondent as shareholders of the Hong Kong company. 63. In summary, I fail to see how the declaration in the Award can affect any recognizable right of Mak, to constitute a good reason for the Court not to enforce the Award in Hong Kong as a matter of public policy, or for any other valid reason. Apart from Mak, no other sibling claims that his/her rights are affected or prejudiced by the Award. This is not a case in which the Award can be seen to improperly affect the rights and obligations of third parties who were not privy to the arbitration agreement and the Arbitration. 64. On my view of the Award and its effect, it is simply not necessary to deal with the Applicant’s argument, that Mak is acting in concert with the Respondent to frustrate the transfer and registration of the Respondent’s shares in F International. 65. Finally, there is nothing in the evidence relied upon by the Respondent which can justify refusal of enforcement of the Award, and the equitable remedy contained therein, on the ground of the alleged “unclean hands” or conduct of the Applicant. Disposition 66. Having given consideration to the substantial delay, the lack of justification for the delay, the lack of merits of the intended application to set aside the Enforcement Order, and the prejudice to the Applicant who has obtained a final and binding Award and been deprived of the fruits of the Award, I refuse leave to extend time for the Respondent to set aside the Enforcement Order. 67. The Respondent’s summons is dismissed, with costs on indemnity basis with certificate for Counsel. (Mimmie Chan) Judge of the Court of First Instance High Court Mr Ernest Ng and Ms Nicole Chui, instructed by Alvan Liu & Partners, for the applicant Ms Chantel Lin, instructed by KY Woo & Co, for the respondent Look up this case on Lawcite Noteup",
  "length": 35262,
  "headers_seen": [
    "Background",
    "The Disputes",
    "The application for extension of time",
    "Delay and reasons for delay",
    "Merits of the intended application to set aside",
    "Disposition"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2024/1880",
  "query": "set aside award",
  "ts": "2025-10-16T10:43:37",
  "ok": true
}