{
  "title": "YCKS V. MPKC | [2018] HKFC 57 | HKLII",
  "court": null,
  "year": 2018,
  "date": null,
  "content": "HKLII Databases Family Court [2018] HKFC 57 YCKS V. MPKC Judgment Information Date 26 Apr, 2018 Action No. FCMC8480/2015 Neutral Cit. [2018] HKFC 57 Download MS Word Judgment Corrigendum Reading Options Translation Toggle Highlight Case History FCMC8480/2015 FCMC 8480 / 2015 [2018] HKFC 57 IN THE DISTRICT COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION MATRIMONIAL CAUSES NUMBER 8480 OF 2015 ---------------------------- BETWEEN YCKS Petitioner and MPKC Respondent ---------------------------- Coram: Deputy District Judge J. CHOW in Chambers (Not Open to Public) Dates of Hearing: 20 April 2018 Date of Handing Down Judgment: 27 April 2018 ________________________ CORRIGENDUM ________________________ Please note that: Line 2 of paragraph 43 on page 6 should read as “17 April 2018”, instead of “14 July 2018”. Line 10 of paragraph 45 on page 6 should read as “the mother taking out loans”, instead of “the father taking out loans”. Line 5 of paragraph 62(ii) on page 12 should read as “April 2018” instead of “April 2017”. Dated the 3 rd day of May 2018 (Cecilia CHEUNG) Clerk to Deputy District Judge J.CHOW FCMC8480A/2015 YCKS v. MPKC FCMC 8480 / 2015 [2018] HKFC 57 IN THE DISTRICT COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION MATRIMONIAL CAUSES NUMBER 8480 OF 2015 ---------------------------- BETWEEN YCKS Petitioner and MPKC Respondent ---------------------------- Coram : Deputy District Judge J. Chow in Chambers (Not Open to Public) Date of Hearing : 20 April 2018 Date of Judgment : 27 April 2018 ----------------------- Judgment (Variation of Maintenance Pending Suit) ----------------------- Introduction 1. The issue in this judgment is variation of maintenance pending suit. Background 2. The Petitioner (“the mother”) took out a summons on 20 October 2016 to vary the maintenance pending suit granted in the Order of H.H. Judge Bruno Chan (as he then was) dated 20May 2016 (the “MPS Order”). 3. In the MPS Order, the father was ordered to pay maintenance pending suit at HK$4,800 for the mother and HKHK$35,200 for four children of the family. It was further ordered in paragraph 2 thereof, such order was made on an ex-parte basis without prejudice to the father’s right to oppose or to apply to set aside the MPS Order at a later date. 4. The father took out a summons for variation on 28 June 2016, in that he sought an order to vary the MPS Order to a reasonable sum. In the hearing on 30 June 2016, both the mother and the father’s summonses be adjourned sine die, with liberty to restore. On 28 November 2017, the mother took out another summons to restore the summons filed on 20 October 2016. On 13 December 2017, I so directed the mother to proceed with the said summons. The father made no application to restore his summons. 5. The mother is now seeking an upwards variation of maintenance pending suit to an aggregate sum of HK$92,000 in either (i) the father to pay the mother HK$92,000 or (ii) the father do pay the mother a further sum of HK$52,000 (being rental payment of HK$12,000 and HK$40,000 school fees of the four children of the family). 6. The father opposed. He submitted he has been unemployed for 5 years. He has no means to pay. The legal principles 7. The applicable legal provisions for maintenance pending suit can be found in section 3 of the Matrimonial Proceedings and Properties Ordinance, Cap 192 (“Cap 192”), the governing principle is that the Court shall make such order as it considers reasonable in all circumstances by adopting a “broad-brush” approach. In HJFG v KCY [2012] 1 HKLRD 95, Hartmann JA (as he then was) at paragraphs 37-38 of the judgment, gave a succinct summary of the law in this area: “37. The principles that have emerged over time to guide judges in matters of interim maintenance have been fashioned in the main to ensure fairness. This is well illustrated in the judgment of Nicholas Mostyn QC, sitting then as a deputy High Court judge, in TL v ML and Others ( Ancillary Relief: Claim against Assets of Extended Family ) [2006] 1 FLR 1263, at 1289, in which, having looked at earlier authorities, he derived the following principles that speak specifically to fairness or are based on the need to ensure it. For present purposes, it is sufficient to cite the relevant principles without citing the judge’s reference to the source of those principles: i. The sole criterion to be applied in determining the application is ‘reasonableness’, whichis synonymous with ‘fairness’. ii. A very important factor in determining fairness is the marital standard of living. This is not to say that the exercise is merely to replicate that standard. iii. In every maintenance pending suit application there should be a specific maintenance pending suit budget which excludes capital or long-term expenditure, more aptly to be considered on a final hearing. That budget should be examined critically in every case to exclude forensic exaggeration. iv. Where the affidavit or form E disclosure by the payer is obviously deficient, the court should not hesitate to make robust assumptions about his ability to pay. The court is not confined to the mere say-so of the payer as to the extent of his income or resources. In such a situation, the court should err in favour of the payee. 38. Finally, it is to be noted that in applications for interim maintenance, when the amount to be paid is for a limited period only and not all of the evidence is necessarily before the court, it is not appropriate, nor indeed in most cases possible, for the court to conduct a detailed investigation into the finances of the parties. While, in order to determine what is or is not reasonable, some analysis is always required, that analysis can be conducted on a ‘broad brush’ basis.” 39. In C v L (unrep, FCMC 13605/2013, 10 December 2014), HHJ Melloy summarized the law on interim maintenance in paragraph 5 of her decision: “The law is well known and not in dispute. Section 3 MPPO Cap192 states that the only governing principle is that the court shall make such order as it considers reasonable in all of the circumstances of the case. Consequently applications such as these are approached on a broad-brush basis. A detailed examination of the parties’ means may be examined at a later date at a full ancillary relief hearing if there is no agreement in the meantime, when there is then every opportunity to achieve fairness by means of set off. In other words, if there is any overpayment or underpayment that can normally be rectified at a final ancillary relief hearing. Applications for interim maintenance for a child under section 5 of the same ordinance are approached in exactly the same way as a maintenance pending suit application under section 3. It is interim maintenance that we are concerned with here.” 40. For variation of interim maintenance, section 11(7) of Cap 192 states, “In exercising the powers conferred by this section the court shall have regard to all the circumstances of the case, including any change in any of the matters to which the court was required to have regard when making the order to which the application relates…” 41. The principles in AEM v. VMF (CACV 261/2011), the Court shall also consider the current financial means and circumstance of the parties. The modern approach as required by section 11(7) is for the Court to consider all circumstances of the cases. The Court is not required to proceed from the starting point of the original order but look at the matter afresh. New documentary evidence 42. Mr. Pickavant, solicitor for the mother submitted, he would rely on new documents, mostly letters sent to the father from banks. For reason she has only discovered them at the matrimonial home recently, she applied to confirm those by oral evidence. The father raised no objection. I aware in usual maintenance pending suit (or variation) hearings, the Court is not required to take evidence as such, nevertheless, I see the evidence would assist in this application, I allowed both the mother and father to testify. The current needs of the mother and the children of the family 43. The mother updated the monthly expenses of herself and the 4 children in paragraph 18 of her 8 th Affirmation filed on 14 July 2018. The mother has set out the current monthly expenses of herself and the children in Form E. The general expenses in sum of HK$32,500; personal expenses in sum of HK$7,000; and children expenses in sum of HK$93,510. The aggregate monthly expenses are therefore HK$133,010. The mother produced her bank statements from January 2016 until March 2018. The latest current balance of the mother’s personal account was HK$15,544.66. 44. The mother deposed in her affirmation that she is running out of means to meet daily expenses. She complained the father did not pay promptly as ordered by the MPS Order. She was unable to pay the school fees of all four children. At time of this hearing, the one child of the family was out of school because she could not settle the school fees on time. 45. The mother has set out a current record of payments under the MPS Order by the father to-date. The father had fully paid the said maintenance in the sum of HK$40,000 in addition to the rent and school fees until June 2017. Since around August 2017, the father has continuously and unilaterally reduced the maintenance provided for the benefit of the mother and the children. That is, that all four children have been suspended from school and three of them were expelled as a direct result of the father’s non-payment of maintenance under the MPS Order. Until today, the youngest child does not attend school whereas the other three were only able to return to school upon the father taking out loans. 46. The mother mostly adopted her affirmation and to tender new documentary evidence. The father’s opposition 47. The father testified his inability to pay the maintenance pending suit as ordered and had objected to an upwards variation. The father stated that he is willing to pay the mother and his four children maintenance pending suit in sum of HK$32,000, which is the exact amount of the rental income of his property in Lamma Island. 48. The father explained, he was unemployed for 5 years. He was living on savings and loans. He complained the mother was not aware of the financial crisis and had continued to demand for maintenance of herself and four children of the family. He criticized the mother has earning capacity but refused to work. The father claimed he has proposed to the mother to relocate 4 children of the family to England where expenses on education could be reduced substantively. The mother refused to discuss the matter and he was unable to plan ahead. The Court’s view 49. Applying the legal principles stated above, both the application and variation of maintenance pending suit shall be assessed on a broad brush manner without detail investigation of parties financial means as in an ancillary relief trial. 50. I accept the mother and the children’s needs. The mother has minimal amount of saving left in her bank account, she could not meet the daily needs of herself and the 4 children of the family. The MPS order plus rent and school fees are necessary and appropriate. As at the hearing, without the means to pay school fees, one of the children cannot attend school. The mother was being asked why she did not return to the workforce when she had a domestic maid at home. I agree with the mother that it would be difficult for one adult to look after 4 children without assistance, especially when she need to take one of the children to see the doctor and someone has to take care of the other 3 children at home. Without going into details, I share the same view of the mother. 51. Mr. Pickavant submitted, in comparison, the father has sufficient means, assets and income streams. The father is engaged in business ventures in vegetation where inklings existed he is more a businessman. 52. The father updated the information in his Form E whilst giving evidence. He said, his current expenses had largely reduced to HK$25,000 per month when he was currently living in his brother’s home. He has to live on personal loans. His savings in banks plunged; stocks and securities sold. Only HK$70,000 was left with the “Interactive Brokers Group”. He has no other income apart from HK$32,000 rental income from the Lamma property. 53. Nevertheless, the documentary evidence revealed the father is the principal or sole beneficiary of premium insurance plans and mandatory provident fund with Fidelity and AIA. He has been paying premiums and was able to maintain them. The father explained the redemption value of the policy or fund would be minimal and disproportionate to benefits. He preferred to maintain them. 54. I am in line with the mother. Letting alone the insurance plans or mandatory provident fund (I agree with the father it might not be wise to redeem them at this stage), the father is capable to pay maintenance pending suit to both the mother and the 4 children. The timeline of premium payments is telling in that they overlap with the father’s default to repeatedly reduce the maintenance of the mother and the children. I see there is also a statement of the father’s pension scheme with Legal & General, the father agreed there is still some £6,000 in there. Without regard whether those schemes are capable or worth to be realised at this moment, the father has assets. 55. The mother further argued, father failed to disclose his financial means. The father’s financial disclosure in his Form E filed on 12 January 2016 was materially deficient. The father had failed to disclose bank statements in relation to numerous financial holdings or interests. The father, in his most recent financial disclosure, appears to have received HK$260,280 in both HSBC and Standard Chartered Bank between 27July 2017 and 21 January 2018 from an undisclosed source. The father explained the HK$32,000 were rental payment from his property, he could not explain the other income source. 56. In the father’s Form E, he stated he would apply for bank statements from Citibank (United Kingdom), NatWest Bank (United Kingdom) and Lloyds Bank (United Kingdom), nevertheless, the father has never disclosed any of such after the filing of Form E. I take into account the father was being ousted from the matrimonial home and might be unable to have access to those statements. Yet, I see no reason he did not attempt to retrieve at least some of those directly from the banks by himself. In fact, the father admitted, his priority in this matrimonial proceedings is to reconnect with his four children, not to fulfil his duty to disclose documents for ancillary relief applications. Ancillary relief is also a vital part in matrimonial proceedings. The conduct of the father, as at this stage, has blatantly failed to disclose relevant materials as required in Form E. 57. The father is also being criticized of dissipating family assets. In the father’s bank statement of China Construction Bank (Asia) dated 31 March 2014, the father has HK$4 million in there. The deposit was withdrawn and was left with some $2.8 million in 30 April 2014. The father said he has been transferring monies between banks, so as to accrue higher interest rate for fixed deposit. The father further claimed there were double accounting of sums. I was not required to embark on detailed financial investigation of the financial position of the father, but at least, there is no evidence to verify the flow of monies. 58. The father even admitted, he had failed to settle the maintenance pending suit (or any outstanding amount due) when he has given two cheques of tax refund around HK$90,000 by the mother by the end 2017. The father deposited the cheques into his Standard Chartered Bank account and such sums have been reflected in both the statements in October and November 2017. At that time, he has stopped paying 4 children’s school fees for some 3 months. The father preferred to settle his bills to paying school fess for his children. 59. It was decided in HJFG v KCY , “where the affidavit or form E disclosure by the payer is obviously deficient, the court should not hesitate to make robust assumptions about his ability to pay. The court is not confined to the mere say-so of the payer as to the extent of his income or resources. In such a situation, the court should err in favour of the payee”. I am of the view that this is exactly on point, bearing all these in mind, I am not satisfied the father could explain satisfactorily of how he could sustain his monthly expenses if he was unemployed for the past 5 years. Allegedly he said he has been looking for jobs but all attempts were unsuccessful. He claimed he has reduced his expectation of seeking an employment in the range of HK$30,000 per month. The father was also unable to explain the whereabouts of funds transferred between banks. He has assets with financial institutions in both Hong Kong and England. He has means to pay. 60. At this stage, in light of the father’s deficient Form E and non-disclosure of financial assets. Adopting a broad-brush approach in applications for maintenance pending suit, I should err in favour of the mother. I aware the father has at times failed to pay rent and school fees of the 4 children of the family even he has means to do so. In light of reasonableness and fairness, I find it is appropriate to vary the MPS Order to the extent that the father should pay HK$12,000 rent to the mother and HK$40,000 school fees in additional to the MPS Order. 61. I aware the father was in default of the satisfaction of the MPS Order intermittently and had ceased to pay school fees since July 2017. For maintenance pending suit, any underpayment or overpayment can normally be rectified at a final ancillary relief hearing, I have no reason not to backdate the variation of maintenance pending suit on school fees to July 2017. Conclusion 62. I make the following orders: (i) The order dated 20 May 2016 be varied to the extent that the Respondent (the father) do pay to the Petitioner (the mother) a further sum of HK$52,000 in additional to HK$40,000 as ordered in such order, representing monthly rental payment of the matrimonial home (HK$12,000) and monthly school fees of the 4 children of the family (HK$40,000) as maintenance pending suit. (ii) The payment of HK$40,000 being school fees of the 4 children of the family be backdated to 1July 2017. The Respondent (the father) do pay the Petitioner (the mother) the sum of HK$400,000 (HK$40,000 x 10 months, from July 2017 to April 2017) being the backdated sum after variation within 28 days hereof. (iii) The total payment of HK$92,000, being (a) HK$40,000 as ordered in the Order dated 20 May 2016, (b) first payment of further sum of HK$52,000 shall be paid on the 1 st day of May 2018 and subsequent payments on the 1 st day of each succeeding month, until further order of the court. (iv) Both the backdated sum of HK$400,000; the first and subsequent payments shall be credited directly into the Petitioner’s (the mother’s) designated bank account. (v) Penal notice be endorsed. Personal service on the Respondent (father) is required. (vi) The costs of both the mother’s summonses filed on 20 October 2016 and 28 November 2017 be reserved. (vii) The Petitioner’s (the mother’s) own costs be taxed in accordance with the Legal Aid Regulations. ( J. Chow) Deputy District Judge Mr John Pickavant of Messrs J M. Pickavant & Co, appeared for the Petitioner The Respondent appeared in person Look up this case on Lawcite Noteup",
  "length": 19652,
  "headers_seen": [
    "Introduction",
    "Background",
    "The legal principles",
    "New documentary evidence",
    "The current needs of the mother and the children of the family",
    "The father’s opposition",
    "The Court’s view",
    "Conclusion"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkfc/2018/57",
  "query": "maintenance pending suit",
  "ts": "2025-10-16T12:10:55",
  "ok": true
}