{
  "title": "FOUR SEAS UNION（HOLDINGS）LTD. T/A FOUR SEAS UNION CONSTRUCTION CO. V. HONG KONG & MACAU SCENT ON ENGINEERING & CONSTRUCTION LTD. | [2003] HKCFI 687 | HKLII",
  "court": null,
  "year": 2003,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2003] HKCFI 687 FOUR SEAS UNION（HOLDINGS）LTD. T/A FOUR SEAS UNION CONSTRUCTION CO. V. HONG KONG & MACAU SCENT ON ENGINEERING & CONSTRUCTION LTD. Judgment Information Date 20 Feb, 2003 Action No. HCCT17/2002 Neutral Cit. [2003] HKCFI 687 Parallel Cit. [2003] 1 HKLRD 653 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCCT17/2002 HCCT000017/2002 FOUR SEAS UNION（HOLDINGS）LTD. t/a FOUR SEAS UNION CONSTRUCTION CO. v. HONG KONG & MACAU SCENT ON ENGINEERING & CONSTRUCTION LTD. HCCT000017/2002 HCCT17/2002 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO. 17 OF 2002 --------------------- BETWEEN FOUR SEAS UNION（HOLDINGS）LIMITED Trading as FOUR SEAS UNION CONSTRUCTION CO. Plaintiff AND HONG KONG & MACAU SCENT ON ENGINEERING & CONSTRUCTION LIMITED Defendant --------------------- Coram: Hon Burrell J in Court Dates of Hearing: 22, 23, 27 and 28 January 2003 Date of Handing Down Judgment: 21 February 2003 ------------------------ J U D G M E N T ------------------------ 1. Both parties to this dispute are construction companies. The works in question were at Tai O in Lantau. The defendant was a Group B Roads and Drainage contractor on the HKSAR Government List of Contractors for Public Works. The plaintiff was not on the government list. By an arrangement made between them the plaintiff prepared a tender for the government project (with some discussion with the defendant). The tender was successful. The original plan was that the plaintiff would carry out the works and the defendant would receive 4% of the contract payments as a management fee. It had no other input into the project. The plaintiff commenced works on 1 March 2001. However, they ceased work at the end of May 2001 because the parties were unable to agree the terms upon which the contract between them should be signed. 2. The first task is to decide whether any contract or agreement existed between them. If so, the terms of that contract will determine the amount the plaintiff should be paid for works done under the contract. If not, it is agreed that the plaintiff's claim should be assessed on a quantum meruit basis. There are no fewer than six different quantifications of the claim for the court to consider. They are : (i) The plaintiff's claim as pleaded. (ii) The defendant's assessment of a reasonable value of work done as pleaded. (iii) The plaintiff's expert's (Mr J.P. Battersby) calculation based on the alleged contractual bills of quantities. (iv) Mr Battersby's calculation based on quantum meruit. (v) & (vi) The defendant's expert's (Mr J.B. Molloy) similar alternative calculations. 3. The court's task is twofold. Firstly, to decide whether or not there was a contract and, secondly, to carry out the appropriate quantum exercise based on the answer to the first question. 4. Before I embark on those tasks I should record one unusual feature of this case. Near the conclusion of the factual witnesses' evidence, the defendant's managing director, Mr Tsui Ho Yon, innocently and inadvertently revealed that the defendant had made a payment into court, which the plaintiff had rejected. He also revealed the amount of the payment in. As a result both counsel, Ms Liza Yip, for the plaintiff and Mr A. Houghton for the defendant, asked for some time to consider their positions and at the same time, use their best endeavours to reach a settlement. In the event, they were unable to reach a settlement and also disagreed as to the future conduct of the trial arising out of the evidence relating to the payment into court. Ms Yip asked for a new trial before a new judge with the cost wasted ordered to the plaintiff. Mr Houghton asked this court to continue the trial to a conclusion. With some reservations I exercised my discretion in favour of the defendant's application and continued. The court's findings on quantum, hereafter, have been made without any consideration to the fact of or the amount of the payment in. LIABILITY 5. The issue under the heading of liability is whether or not the defendant is liable to the plaintiff on a contractual basis or on a quantum meruit basis. Having considered the evidence, the submissions and the pleadings it seems clear that the plaintiff has failed to prove the existence of any binding agreement between the parties. Such pointers as they may be, as advanced by Ms Yip, that a contract could be inferred by conduct and negotiations, are heavily outweighed by the combined effect of the following matter : (i) That a contract could or should be inferred is not pleaded in the Statement of Claim. The Statement of Claim contains the following passages : Paragraph 8 - \"despite the fact that the sub-contract agreement ... had not been concluded yet\" Paragraph 10 - \"the plaintiff would be paid by the defendant under the contemplated sub-contract which the plaintiff and the defendant expected to materalize in due course\" Paragraph 13 - \"The sub-contract agreement had not been signed by either party because several matters collateral to the sub-contract agreement were still subject to disagreement\" Paragraph 14 - \"On or about May 22 2001, the negotiation between the plaintiff and the defendant in respect of the aforesaid collateral matters failed. As a result, the plaintiff ceased working on or about 29 May 2001\". (ii) The evidence of the plaintiff's manager director (and sole witness) Mr Fai Kar Sun confirms that there were on-going discussions and negotiations about the terms of the proposed contract. For example, in early March Mr Fai proposed amendments to the clauses on payment and arbitration. At the end of March Mr Fai proposed \"further amendments\" and also wanted to substitute a new party, namely \"Prosperous Construction Ltd\" in place of Four Seas. In mid April the terms concerning site clearance, traffic flow, land transport for the engineer and insurance, were still under discussion. (iii) Most significantly however, the negotiations were plainly floundering on the requirement that the plaintiff enter into an on-demand performance bond or personal guarantee from Mr Fai. The evidence concerning this issue from Mr Fai for the plaintiff and Mr Tsui for the defendant is stark in its contrast. Mr Tsui stated that such a requirement had been made at the outset whereas Mr Fai said it only came up in about mid April, for the first time, well after the work had commenced. Mr Fai said it was an after thought, it was unfair and he could not agree to it. Mr Tsui however pointed out that such a provision would automatically and necessarily be required. The tender was in the defendant's name, their reputation was on the line, it was they who would be liable to liquidated damages if things went wrong. The plaintiff was a small, unlisted company who would not have been engaged without some security such as a bond or a guarantee. The defendant's version commend itself to the court. I find that the plaintiff did not prove to the required standard that the issue of a performance bond was only raised towards the end of the negotiations. 6. In view of all the above, I proceed to the quantum issue on the basis of quantum meruit. QUANTUM 7. Mr Battersby for the plaintiff and Mr Molloy for the defendant have embarked on this exercise differently. 8. Mr Battersby offers two methods, within the quantum meruit exercise. His \"pure\" quantum meruit method is to calculate the plaintiff's actual costs and then add a percentage for head office overheads and profit. This method produces a final figure of $1,610,776. Alternatively, and more generously to the plaintiff, he has used the bills of quantities as a reasonable starting point. He has carried out this exercise on the basis that there was a measure of agreement about rates and quantities which would have formed the basis of a contract, had agreement been reached. Accordingly, the figures produced on a pro rata basis for the plaintiff's past performance, may be regarded on a fair reflection of the work they did. 9. I reject this more generous alternative approach for a number of reasons : (i) The BQ rates are, in part, artificial. For example, it was accepted in evidence that when preparing the tender the quotation was \"front loaded\" so that early stage payments would be higher than a true reflection of work done up to then, so as to ease the cash flow situation. (ii) The above artificiality resulted in some wildly different figures within certain items. For example, the BQ valuation for traffic flow was $342,000 whereas the \"pure\" quantum meruit figure was $900. The general site clearance was $807,500 under BQ and $10,398 under \"pure\" quantum meruit. Thus it would be highly dangerous to attach, as a general principle, the word \"reasonable\" to the BQ figures so as to use them as a guide when assessing the quantum meruit figures. (iii) If the BQ figures were taken as a guide to reasonableness, it would produce an unrealistically high percentage of final profit. It would be about 30% higher than the final \"pure\" quantum meruit figure which, itself, had added 15% profit for head office overheads and profit. (iv) This danger has been noted in cases and textbooks. Goff J in British Steel v. Cleveland Bridge [1984] 1 All ER at p.511 stated : \"In my judgment, the true analysis of the situation is simply this. Both parties confidently expected a formal contract to eventuate. In these circumstances, to expedite performance under that anticipated contract, one requested the other to commence the contract work, and the other complied with that request. If thereafter, as anticipated, a contract was entered into, the work done as requested will be treated as having been performed under that contract; if, contrary to their expectation, no contract was entered into, then the performance of the work is not referable to any contract the terms of which can be ascertained, as the law simply imposes an obligation on the party who made the request to pay a reasonable sum for such work as has been done pursuant to that request, such an obligation sounding in quasi contract or, as we now say, in restitution.\" 10. Keating on Building Contracts deals with the matter in the following way : \"The courts have laid down no rules limiting the way in which a reasonable sum is to be assessed. Where a quantum meruit is recoverable for work done outside a contract, it is wrong to regard the work as though it had to any extent been performed under the contract. The contractor should be paid at a fair commercial rate for the work done. Where a quantum meruit is recoverable for work done pursuant to a void contract, it is wrong in principle to apply the provisions of the void contract to the assessment of the quantum meruit ... Useful evidence in any particular case may include abortive negotiations as to price, prices in a related contract, a calculation based on the net cost of labour and materials used plus a sum for overheads and profit, measurement of work done and materials supplied, and the option of quantity surveyors, experienced builders or other experts as to a reasonable sum.\" 11. For the purpose of this case therefore, of Mr Battersby's two methods I will consider only his \"costs plus\" basis of calculating a reasonable sum. 12. Mr Molloy, on the other hand, has, on a number of occasions, made subjective assessments. His general approach is more rigid. He has strictly allowed nothing unless there is an acceptable document in support. He has made discounts, where appropriate, because there was evidence that the plaintiff had other projects on-going at the same time. He has disallowed invoices where he was not satisfied that they related to this particular project and has substantially reduced the payments in respect of salaries and wages where he considered that the individual involved would not have been solely engaged on the project. Whilst the basis of his approach is understood, it seems to me that it pares the plaintiff's entitlement to the bone. His original final figure of a reasonable payment to the plaintiff was $176,454 for three months work. His revised assessment, dated 20 January 2003, the first day of the trial, was $399,226. The increase was because he had had sight of more documents in support of various claims. The defendant, in its pleaded defence, admits a figure of $663,200 is due and payable. 13. In my judgment, Mr Battersby's approach is preferable. It is a consistent method applied to every item. He accepts the documents, invoices, daily records and so on \"at face value\" and that they apply to this project. I consider this to be a sensible and fair starting point. Both experts agree that whatever the final \"reasonable costs\" figure is, an extra percentage of 15% should be added for head office overheads and profit. 14. The court's exercise now, therefore, is to take Mr Battersby's \"pure\" quantum meruit figure as the starting point for each item and then decide if it should be further discounted because of points made in the course of Mr Molloy's evidence. 15. For quantum purposes the items fall into three categories : A. Items upon which the experts are agreed : These total $33,772.51 and need no further consideration. B. Items about which the difference between the experts is small. For these items, I shall (as do experts themselves, frequently) take an approximate median figure as follows : ($) Progress photograph 1,350 Several site clearance 9,750 Disposal of material in platform 52,500 Principal office servicing 21,900 Provision of computer software 5,500 Excavation in platform 12,500 Operation of land transport 15,000 __________ 118,500 C. Items where the difference is substantial. These are : Mr Molloy ($) Mr Battersby ($) Establishment of Emergency Unit 810.00 11,810.00 Signboard Size N 15,450.83 64,000.00 Provision of Land Transport 10,208.22 93,000.00 Removal of abandoned plant 1,500.00 170,000.00 Contractors accommodation 184,966.67 363,673.98 Site Staff and other salaries 238,543.00 774,877.50 16. I shall deal briefly which each of these items. (a) Emergency unit 17. The difference between the experts is because an invoice for $11,000 does not, on its face, specifically state that the expense related to this project. I, like Mr Battersby, considers it reasonable to find that it does so relate. I adopt, therefore, $11,800 under this item. (b) Signboard Size N 18. Mr Battersby relies on debit notes in support of this assessment. Mr Molloy disregards the debit notes because they are not supported by an invoice. His figure is not based on actual costs but on an estimate of resources required at his own estimated rates. For two reasons, namely, the lack of invoices and the fact that the $64,000 (based on debit notes) does seem high for the item in question, I will make a reduction from Mr Battersby's figure. I will grant $50,000 for this item. (c) Provision of land transport 19. Mr Battersby has done a careful and lengthy calculation under this item. Mr Molloy's method of calculation produces a figure of $10,208 which I consider to be unrealistically low for the provision of vehicles for the period involved. On the other hand, a fair criticism of Mr Battersby's calculation is made, in that, his figure for depreciation is too high. Bearing in mind that the relevant period of use was relatively short and adopting a lower figure for depreciation, I think Mr Battersby's figure should be reduced. I do not think it is necessary to carry out a precise re-calculation. It is sufficient to make an approximate reasonable discount. I will reduce Mr Battersby's figure of $93,000 to $60,000. (d) Removal of abandoned plant 20. It is agreed that this was one of two variations allowed by the engineer. There were a number of factual disputes concerning how much actual dismantling was done and whether the plaintiff should still have been on site at the time it was done. I am satisfied that at least half the dismantling was carried out by the plaintiff (based on Mr Fai's evidence) and that the plaintiff is entitled to be paid a sum for it. I will allow half of the sum approved by the engineer as the cost of the work to be carried out, namely a figure of $75,000. (e) Contractors' accommodation 21. As with the other items my starting point under this head is Mr Battersby's figure, namely $363,673.96. He has identified the documentary evidence in support of this final figure. It is noted that the schedule to the defence pleads a figure of $397,300 which the defendant is willing to pay the plaintiff for this item (it is accepted that this does not compare like with like because, inter alia , the schedule makes no provision for salaries). Mr Molloy has made a number of downward adjustments where he considers the invoices to be \"doubtful\", or where he considers only a pro rata amount should be allowed because the plaintiff had other on-going projects or because he thinks the items should be included as head-office overheads and not contractors accommodation. I consider his observations and adjustments to be generally valid in principle but overstated in amount. The result is that the actual costs claimed have been, in a sense, over \"taxed\" by Mr Molloy. The adjustments for having other on-going projects has been particularly over done, in my judgment, because the particular project was at the remotest part of Lantau and could reasonably be regarded as being a \"self contained\" project. Bearing in mind the above factors I will reduce Mr Battersby's figure to $300,000. (f) Site staff and other salaries 22. Ms Yip makes the point that Mr Molloy's allowance under this heading ($238,543) is even less than the amount actually paid by the defendant on the plaintiff's behalf following the Labour Tribunal proceedings ($279,180). 23. Mr Battersby has allowed salaries even where no site activity has been recorded on the daily records. He has explained this in some detail in his supplemental report by commenting on each such day. In general I find it to be a fair analysis although it is, in part, speculative and thus some reduction should be made. On the other hand I do not think it reasonable to say that no salaries can be earned merely because presence on site cannot be proved (which is Mr Molloy's approach). This would only be appropriate if the employee in question was employed on a casual daily rate basis. 24. Once again, Mr Molloy has made substantial discounts because of the possibility that some staff were engaged on other projects at the same time. Again, the point is validly made in support of a lesser figure than Mr Battersby but not to the extent argued for by Mr Molloy. 25. I do not accept the submission that site salaries should be part of overheads. 26. Against the plaintiff, I do not accept that an extra months salary (June's) should be added in because they would be entitled to a month's wages in lieu of notice (the works ended fairly abruptly at the end of May). There is no evidence in support that such expense was actually incurred. I will therefore reduce Mr Battersby's figure firstly by 25% because of the claim for June and then by a further 15% for the other reasons referred to above. The result is a figure slightly below $500,000. I will allow $500,000. 27. The total for these in category C is $996,800. Categories A + B + C : $1,149,072 A + B + C + 15% : $1,321,433 Less salaries paid by defendant ($279,180) $1,042,253 28. There will be judgment for the plaintiff in the sum of $1,042,253 plus interest at prime plus 1% payable from 3 July 2001 with costs to the plaintiff on a nisi basis. (M.P. Burrell) Judge of the Court of First Instance High Court Representation: Ms Liza S.H. Yip, instructed by Messrs Cham & Co., for the Plaintiff Mr Anthony Houghton, instructed by Messrs Yam & Co., for the Defendant Look up this case on Lawcite Noteup",
  "length": 19962,
  "headers_seen": [
    "LIABILITY",
    "QUANTUM",
    "(a) Emergency unit",
    "(b) Signboard Size N",
    "(c) Provision of land transport",
    "(d) Removal of abandoned plant",
    "(e) Contractors' accommodation",
    "(f) Site staff and other salaries"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2003/687",
  "query": "quantum meruit",
  "ts": "2025-10-17T10:43:05",
  "ok": true
}