{
  "title": "THE CHINA STATE BANK LTD. V. WONG CHUN YING T/A WING FUNG HONG CO. | [2000] HKCFI 1529 | HKLII",
  "court": null,
  "year": 2000,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2000] HKCFI 1529 THE CHINA STATE BANK LTD. V. WONG CHUN YING T/A WING FUNG HONG CO. Judgment Information Date 5 Apr, 2000 Action No. HCA10825/1999 Neutral Cit. [2000] HKCFI 1529 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCA10825/1999 HCA010825/1999 XCHRX THE CHINA STATE BANK LTD. v. WONG CHUN YING t/a WING FUNG HONG CO. HCA010825/1999 HCA10825/1999 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE ACTION NO.10825 OF 1999 ------------- BETWEEN THE CHINA STATE BANK LIMITED Plaintiff AND WONG CHUN YING trading as WING FUNG HONG COMPANY Defendant (Judgment Debtor) ------------- Coram: Hon Waung J in Chambers Date of Hearing: 6 April 2000 Date of Judgment: 6 April 2000 ------------------------ J U D G M E N T ------------------------ 1. This is the hearing of an appeal by the defendant from a refusal by the master to set aside a default judgment 2. The hearing before the master took place on 31 March, and the next day, my understanding is that the defendant applied for legal aid. By a Memorandum of Notification of Application to Legal Aid dated 3 April 2000, the court was notified that the defendant had applied for legal aid. It follows, therefore, that the normal procedure would be that the automatic stay of 42 days will apply. 3. The question before me today is whether I should lift the stay of proceedings. In coming to the decision of whether I should exercise my discretion to lift the stay of proceedings, I take into account, in particular, two matters : firstly, as to whether there might be some merits to the defence to the action by the defendant; and secondly, whether there is any reason or justification for the late application for legal aid. 4. Having heard arguments from both sides, I am satisfied that there are reasonable grounds for the defendant to justify both the late application as well as the defence to the action. On the merit of the case, there is possible ground to argue that the plaintiff is not a holder in due course, and I certainly accept that there is a reasonable ground put before the court as to why there was not an earlier application for legal aid. 5. In the circumstances, I decline to exercise my discretion to lift the statutory stay of proceedings. It follows, therefore, that the hearing of today's appeal must be adjourned to a new date and the costs of today's hearing would be costs in the appeal. (William Waung) Judge of the Court of First Instance Representation: Miss Glenys Newall, instructed by Messrs K.W. Ng & Co., for the Plaintiff Defendant in person, present. Look up this case on Lawcite Noteup",
  "length": 2696,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2000/1529",
  "query": "stay of proceedings",
  "ts": "2025-10-14T11:23:12",
  "ok": true
}