{
  "title": "CEMAC (HONG KONG) LTD V. OCEAN & COLMAN CONSTRUCTION LTD | [2009] HKDC 267 | HKLII",
  "court": null,
  "year": 2009,
  "date": null,
  "content": "HKLII Databases District Court [2009] HKDC 267 CEMAC (HONG KONG) LTD V. OCEAN & COLMAN CONSTRUCTION LTD Judgment Information Date 8 Nov, 2009 Action No. DCCJ1493/2007 Neutral Cit. [2009] HKDC 267 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History DCCJ1493/2007 DCCJ001493/2007 CEMAC (HONG KONG) LTD v. OCEAN & COLMAN CONSTRUCTION LTD DCCJ 1493/2007 IN THE DISTRICT COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION CIVIL ACTION NO. 1493 OF 2007 -------------------- BETWEEN Cemac (Hong Kong) Limited Plaintiff and Ocean & Colman Construction Limited Defendant -------------------- Coram : His Honour Judge Chow Date of hearing : 1 st September, 2009 Date of handing down Decision : 9 th November, 2009 DECISION 1. On 16.7.2009, Master Lee ordered that judgment be entered for the Plaintiff. On 31.7.2007, Master Lee ordered that cost of the application for judgment and the action be to the Plaintiff. The Defendant appeals against this costs order. Background 2. On 23.6.2003, the Defendant engaged the Plaintiff to supply and install suspended ceiling system on part of the work under the redevelopment of Hong Chi Pinehill Schools Nos. 1 & 3. On 10.10.2003, the Defendant further engaged the Plaintiff to supply and install acoustic wall panel systems to the said redevelopment. Apart from the above the Plaintiff also carried out various additional works for the Defendant (“the Additional Works”). 3. On 21.10.2004 the Defendant sent a fax to the Plaintiff, saying that the Plaintiff’s final application for payment would be assessed by PQS Beria Consultant Ltd. (“PQS”). On 26.8.2005, the Defendant wrote to the Plaintiff, stating that the information supplied by the Plaintiff had been forwarded to PQS for final confirmation. 4. In or about July, 2006, the Plaintiff submitted its final account for payment of all the work done, which included the Additional Works. There is no dispute on the payment for the suspended ceiling works and the acoustic wall works. 5. On 14.10.2006 the Defendant sent a fax to the Plaintiff, attaching its own assessment of all the works done. 6. By a letter dated 14.7.2006, the Defendant advised the Plaintiff to re-submit its final account. On 27.7.2006, the Defendant wrote to the Plaintiff, advising the Plaintiff to re-submit its final account, and to provide the supporting documents. On the following day, the Plaintiff re-submitted the final account. On 8.8.2006, the Defendant wrote to the Plaintiff, asking it to submit the supporting documents. 7. On 23.8.2006, the Plaintiff through its solicitors sent to the Defendant a demand letter for the sum of $683,039.64. On 24.8.2006, the Defendant wrote to the Plaintiff, reminding that it should submit all the supporting documents for the Defendant’s assessment. On 25.8.2006 the Defendant reminded the Plaintiff to submit the necessary documents for assessment for payment. 8. On 30.3.2007, the Plaintiff instituted the present action, claiming for $730,709.25, alleging that there were agreements on the rates and the actual quantities for the work done. By its defence the Defendant admits the liability to pay for the work done, but not at the rate unilaterally imposed by the Plaintiff on the Defendant. 9. On 14.7.2008, the Plaintiff filed in the expert report of Mr. Au Kam Fai Eric (“Mr. Au”) who concluded that the sum for the Additional Works should be $519,282.51. 10. The Plaintiff made an application for amendment to the Statement of Claim, adding an alternative claim of quantum meruit at $519,282.51. The application was allowed on 11.10.2008. 11. On 21.10.2008,all the documents relied on by Mr. Au in making his assessment was provided to the Defendant on 21.10.2008. Then the Defendant instructed a Mr. Au Yeung Hon Man, Steve (“Mr. Au Yeung”) to make the assessment. On 27.11.2008, Mr. Au Yeung provided his expert report. On the same day, the Defendant made an offer to accept the Plaintiff’s alternative claim at $519,282.51 but disagreed to pay the Plaintiff’s costs, because the Defendant had all along been willing to pay the Plaintiff subject to the production of documents, but the Plaintiff had refused and failed to produce the same until October 2008. 12. The Defence Counsel submits that the learned Master had failed properly to take into account that the Defendant had always been willing to pay the Plaintiff even before the commencement of the action, that the newly added alternative claim of quantum meruit was a differently pleaded case to the Plaintiff’s original claim based on the agreement and that it was inappropriate for the learned Master to take judicial notice that the Defendant was able to make the assessment even without the supporting documents provided by the Plaintiff, contrary to the evidence before the Court. As such the learned Master did not exercise his discretion correctly. 13. To begin with I must ask this question: is the Plaintiff legally bound to provide the Defendant with documents so that it could do its own assessment of the Additional Works? The obvious answer is “No”. The Defendant has not shown to this Court that the Plaintiff was under such a duty. 14. The Defendant says that the Defendant could not do its own assessment without the documents provided by the Plaintiff. That cannot be right. On 21.10.2004, the Defendant wrote to the Plaintiff, saying, “ Final Payment Assessment With reference to your final payment application No. 4296F1 and 4347F2, as discussed before which involved STAR RATE and under assess by PQS Beria Consultant Ltd. Once assessment completed or negotiation in progress, we will inform you in due course ………” 15. On 26.8.2005, the Defendant wrote to the Plaintiff, stating:- “ Final Measurement Quantity of Suspended Ceiling System With reference to your letter dated on 24 August 2005 and our telephone discussion, your submitted quantity including V.O. and star rate had been forwarded to PQS – Beria for final confirmation. Once the information received from PQS, we will inform you in due course.” 16. The above two letters show that the Defendant could do its own assessment for payment. 17. The point is, even if the Defendant faced difficulty in making the assessment, it could not shift the burden to the Plaintiff, demanding the Plaintiff to provide it with documents so that it could do the assessment for payment. If the Plaintiff failed to do so, resulting in no assessment, then it would not make the payment. This cannot be right, because the Plaintiff has no legal obligation to provide the Defendant with the Plaintiff’s documents. 18. The defence argues that as soon as the Plaintiff amended its claims for quantum meruit and produced the supporting documents to the Defendant, the Defendant immediately accepted it. Therefore the Plaintiff would have received its payment without instituting the present action had the Plaintiff not unreasonably withheld the supporting documents from the Defendant for assessment. As such the Defendant should be entitled to costs of the present action. This is a hypothetical situation. The Plaintiff did start the present action. It is based on what actually happened, and not on a hypothetical case, that this Court is to make a finding. The Plaintiff is under no legal obligation to supply the documents. So it is wrong to say that it unreasonably withheld the supporting documents. 19. In its original claim the Plaintiff alleged that there were agreements on the rates and the actual quantities for the Work done. But the Defendant denied any agreement on the rates. That being the case, the Plaintiff must institute the action to have the dispute resolved in Court. It is not the scenario that the action is based solely on a claim of quarantum meruit. This alternative claim only came into existence 18 months after the original claim had been instituted. So it is wrong to say that the Plaintiff would have received payment without commencing the present action. 20. The Defendant further submitted that because of the Plaintiff’s late amendment in adding the quantum meruit claim which was effectively a differently pleaded case, the Defendant should be at least entitled to costs from the date of the commencement of the present action until the Plaintiff amended the Statement of Claim on 11.10.2008. There is no differently pleaded case. After the amendment, the claim comprises the original claim and the alternative claim. It is wrong to regard the case as merely a case of quantum meruit claim, because the original claim was still alive. The parties came to a settlement on the alternative claim. The case itself was not merely based on the alternative claim. The quantum meruit claim was not a differently pleaded “case”. It is a claim, and not a case. Prior to the settlement on the alternative claim, the original claim was still a live issue. Accordingly, there is no differently pleaded case; so there is no basis for the Defendant to argue that it should be entitled to costs from the date of the commencement of the present action until the Plaintiff amended the Statement of Claim. 21. By reason of the matters stated above I adjudge that the decision reached by the learned Master is correct. Accordingly I dismiss the appeal. Costs 22. I make an order nisi for costs, to be made absolute in 14 days’ time, that the Defendant do pay costs of this application, to be taxed, if not agreed, with Certificate for Counsel. ( S. Chow ) District Judge The Plaintiff : represented by Mr. Martin Wong, instructed by M/S. Chong & Partners, Solicitors. The Defendant : represented by Mr. Kenneth Wong, instructed by M/S. Chow & Ho, Solicitors. Look up this case on Lawcite Noteup",
  "length": 9687,
  "headers_seen": [
    "Background",
    "Costs"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkdc/2009/267",
  "query": "quantum meruit",
  "ts": "2025-10-17T10:43:11",
  "ok": true
}