{
  "title": "BGPB V. KSW | [2021] HKCFI 1366 | HKLII",
  "court": null,
  "year": 2021,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2021] HKCFI 1366 BGPB V. KSW Judgment Information Date 12 May, 2021 Action No. HCMP1922/2020 Neutral Cit. [2021] HKCFI 1366 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCMP1922/2020 HCMP1922A/2020 BGPB v. KSW HCMP 1922/2020 [2021] HKCFI 1366 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE MISCELLANEOUS PROCEEDINGS NO 1922 OF 2020 ____________ IN THE MATTER of AB, a boy born on 17 October 2014 (“the Minor”) and IN THE MATTER of Section 26 of the High Court Ordinance ( Cap 4 ) and Order 90 of the Rules of the High Court ( Cap 4A ) and IN THE MATTER of the Guardianship of Minors Ordinance ( Cap 13 ) and IN THE MATTER of the Child Abduction and Custody Ordinance ( Cap 512 ) ____________ BGPB Plaintiff and KSW Defendant ____________ Before: Hon Au-Yeung J in Chambers (Not Open to the Public) Closing Date for Written Submission: 5 May 2021 Date of Decision: 13 May 2021 _______________ D E C I S I O N _______________ Introduction 1. This is to decision with the Summons taken out by the Plaintiff ( Father ) for an anti-suit injunction to restrain the Defendant ( Mother ) from pursuing or taking further steps in the proceedings in respect of the child ( AB ) in the Family Court of Western Australia under file number /2021 or commencing parallel proceedings in Australia in respect of the custody, care and control arrangement of AB. 2. By an originating summons filed on 30 October 2020, AB, became a ward of this Court. At the call-over hearing on 6 January 2021, interim orders were made for AB to be returned to Hong Kong and for interim joint custody, shared care and control of AB to be given to both parents. The originating summons was set down for substantive hearing on 22 February 2021. That hearing had to be adjourned because the proceedings had to be stayed upon the Mother’s application for legal aid. 3. Meanwhile, the Father has issued the present Summons. The Summons and supporting affidavit had been served on the Mother by email on 19 February 2021. 4. The hearing of the originating summons was ultimately held on 30 March 2021 . The Mother did not appear and had not filed evidence. The Court thus proceeded to hear the case and made the order (“ the Substantive Order ”) that, amongst others, AB should continue to be a ward of court. The Father was granted all the rights and authority that the law would allow him as a father as if AB were legitimate under section 3 of the Guardianship of Minors Ordinance , Cap 13 (“ GMO ”). The joint custody and shared care and control of AB was granted to the Father and the Mother. The Mother was ordered to forthwith return AB to Hong Kong and thereupon surrender the passports of AB. The Mother was also restrained from taking AB out of Hong Kong. The details have been set out in the Reasons for Judgment dated 1 April 2021. 5. The Summons was adjourned on 30 March 2021 as the Court was concerned as to validity of service on the Mother by email in Australia. This Court gave directions for the filing of evidence and submission for the purpose of disposal of the Summons on paper. 6. The Summons and supporting affidavit had subsequently, on 31 March 2021, been delivered to the Mother to the mail box at her residence. On the same day, copies of the Substantive Order and another order as regards adjournment of the Summons were served on the mother by email and personal service on 22 April 2021. 7. The Mother has not filed any affidavit or submission in answer to the Summons. 8. Being satisfied as to service, I therefore proceed to consider the Summons. Legal principles on the grant of anti-suit injunction 9. The established principles for the grant of an anti-suit injunction are as follows: (1) The Hong Kong forum should have a sufficient interest in, or connection with, the matter in question to justify the indirect interference with a foreign court which an anti-suit injunction entails. In an alternative forum case, this will involve consideration of the question whether the Hong Kong court is the natural forum for the resolution of the dispute; (2) An injunction should only be granted when the “ ends of justice ” require it. Generally speaking, this may occur when the foreign proceedings are vexatious or oppressive; (3) The court decides to grant an injunction, its order is directed not against the foreign court but against the parties so proceeding or threatening to proceed; (4) An injunction will only be issued restraining a party who is amenable to the jurisdiction of the court and against whom an injunction will be an effective remedy; and (5) Since such an order indirectly affects the foreign court, in exercising the jurisdiction, regard must be had to comity, and the jurisdiction is one which must be exercised with caution. Airbus Industrie G.I.E. v Patel [1999] 1 AC 119 , at 138G (Lord Goff of Chieveley); at 133 (Lord Goff); and Société Aerospatiale v Lee Kui Jak [1987] 1 AC 871 at 892A-F. 10. These principles have been followed by the Court of Appeal in Hong Kong: Asha Harkishin Premsingh v Harkishin Isarsingh Premsingh (unrep, CACV 845/2000 dated 30 November 2000), §§22 & 24; Liaoyang Shunfeng Iron and Steel Co Ltd and anor v Yeung Tsz Wang and anor [2012] HKCA 246 , CACV 234/2011 (14 June 2012), §85, Hartmann JA; and Compania Sud Americana de Vapores SA v Hin-Pro International Logistics Ltd [2015] 2 HKLRD 458 , at §§35-45 (11 March 2015). Whether Hong Kong is the natural forum for the resolution of the dispute 11. The Hong Kong Courts have clear interest in AB. He was born in Hong Kong, resided in Hong Kong for 6 years and educated here until the Mother took him to Australia and kept him there against the Father’s wish. The child’s habitual residence before his removal to Australia has been Hong Kong. 12. The Father has been working in Hong Kong. Together with the Mother, they had resided in Hong Kong for 10 years before the Mother went with AB to Australia. 13. The application by the Father for an order under section 13 of GMO was under HK law. 14. Hong Kong was and is plainly the natural forum for the resolution of the dispute over AB. See §§45-52 of the Reasons for Judgment. Whether the proceedings in Western Australia was vexatious or oppressive 15. Firstly, the Father commenced proceedings in Hong Kong first in October 2020. The originating summons was properly served on the Mother but it has been held in the Reasons for Judgment (§§25-31) that the Mother has charted her course to delay the Hong Kong proceedings as far as possible. 16. Secondly, in the meantime, the Mother deliberately misled the Hong Kong Court, asking for an adjournment to take legal advice when she had already done so in Australia. She bought time in Hong Kong through her legal aid application and derailed the Hong Kong proceedings. 17. Thirdly, it could not be disputed from the reliefs that the Mother sought in the Western Australian proceedings that she acknowledged the rights of the Father as a father. She could have consented to the Father’s application under section 3 of GMO. She sought an order for shared parental responsibility in the Australia proceedings, which could have similarly been sought in Hong Kong. If she had wanted to challenge the Hong Kong Court’s proceedings, she could have done so. She could also have applied for a removal order in Hong Kong. 18. Fourthly, taking into account the fact that the Mother was acting in person, the Court had taken the extra step of reminding her that the substantive hearing would proceed, and arranged for pre-hearing testing to enable the Mother to appear through video conferencing, but the Mother neither appeared at the pre-hearing testing nor the hearing on 30 March 2021. 19. Fifthly, the day before the hearing on 30 March 2021, the Mother has submitted to the jurisdiction of the Hong Kong Court by filing submission which purported to but could not dispute the jurisdiction of the Hong Kong Court. She was “amenable” to the jurisdiction of the Hong Kong Courts and against her an anti-suit injunction would be an effective remedy. 20. Sixthly, this Court has exercised its jurisdiction by making the Substantive Order. It was a final order that determined the rights and authority of the Father and the question of custody, care and control of AB. To ask the parties to re-litigate the same issues in a second jurisdiction, after the Mother has refused to participate here, is wasteful of judicial resources. The Father’s resources, which have been earned for the benefit of the family of 3, could otherwise have been spent on the welfare of AB. Conclusion 21. Having regard to the 6 factors above, I consider the Mother’s pursuit of foreign proceedings, with knowledge of the Hong Kong proceedings, to be vexatious and oppressive. She has been given every opportunity to participate in proceedings in the jurisdiction where AB’s habitual residence was. The ends of justice require an anti-suit injunction. This is a personam order directed against her rather than the Western Australian Courts. 22. I therefore make an order for anti-suit injunction in terms of paragraph 1 of the Summons. 23. I also grant leave to the Father to disclose the Summons, supporting affidavit, these Reasons for Decision and a sealed copy of this order to the Family Court of Western Australia. 24. I also grant leave to serve a sealed copy of this order on the Mother out of jurisdiction at her last known address in Australia. 25. On a nisi basis, the Mother should bear the costs of the Father. 26. Unless any party objects, with reasons given to me in writing, copied to the other party, this decision will be published with redaction of personal details. 27. I thank Ms Irving for her assistance. (Queeny Au-Yeung) Judge of the Court of First Instance High Court Written Submission by Ms Francis Irving, instructed by Withers,for the Plaintiff No Written Submission was lodged by the Defendant Look up this case on Lawcite Noteup",
  "length": 10048,
  "headers_seen": [
    "Introduction",
    "Legal principles on the grant of anti-suit injunction",
    "Whether Hong Kong is the natural forum for the resolution of the dispute",
    "Whether the proceedings in Western Australia was vexatious or oppressive",
    "Conclusion"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2021/1366",
  "query": "anti-suit injunction",
  "ts": "2025-10-16T10:47:16",
  "ok": true
}