{
  "title": "WAN CHUNG CONSTRUCTION COMPANY LTD V. WAN CHUNG CONSTRUCTION COMPANY LTD & ANOTHER | [2001] HKCFI 172 | HKLII",
  "court": null,
  "year": 2001,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2001] HKCFI 172 WAN CHUNG CONSTRUCTION COMPANY LTD V. WAN CHUNG CONSTRUCTION COMPANY LTD & ANOTHER Judgment Information Date 5 Dec, 2001 Action No. HCCT43/2001 Neutral Cit. [2001] HKCFI 172 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCCT43/2001 HCCT000043/2001 XCHRX WAN CHUNG CONSTRUCTION COMPANY LTD v. WAN CHUNG CONSTRUCTION COMPANY LTD & ANOTHER HCCT000043/2001 HCCT 43/2001 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION & ARBITRATION PROCEEDINGS NO. 43 OF 2001 ____________ BETWEEN WAN CHUNG CONSTRUCTION COMPANY LTD Plaintiff AND LINGNAN UNIVERSITY 1st Defendant P & T ARCHITECTS AND ENGINEERS LIMITED 2nd Defendant ____________ Coram: Hon Kwan J in Chambers Date of Hearing: 29 November 2001 Date of Handing Down of Decision: 6 December 2001 _____________ D E C I S I O N _____________ 1. This is an application taken out by the 1st defendant, Lingnan University (\"the University\"), for an order that all the proceedings in this action as against the University be stayed for arbitration, by virtue of section 6 of the Arbitration Ordinance , Cap. 341 , and Article 8 of the UNCITRAL Model Law. The plaintiff, Wan Chung Construction Company Ltd (\"Wan Chung\"), was the main contractor appointed by the University in respect of building works for the new campus and the sites in question were known as site 2, site 3 and site 4. Wan Chung did not take out any cross application to the University's summons for a stay of proceedings but it was submitted on behalf of Wan Chung that the court should refuse to stay the proceedings under section 26(2) and (3) of Cap. 341 and should order that the agreement to arbitrate should cease to have effect as the dispute between the University and Wan Chung involves a question whether the University has been guilty of fraud. The 2nd defendant, P & T Architects and Engineers Limited (\"the Architect\"), was the architect appointed by the University in respect of site 1 and the other three sites of which Wan Chung was the main contractor. The Architect did not take part in this application. 2. Wan Chung was invited to submit tenders for the main contracts for the three sites in March 1995. The tenders were submitted in April and accepted by the University on 27 May 1995. The three main contracts entered into by Wan Chung all contained an arbitration clause in identical terms and this provided as follows: \"35. Arbitration (1) Provided always that in case any dispute or difference shall arise between the Employer or the Architect on his behalf and the Main Contractor, either during the progress or after the completion or abandonment of the Works, as to the construction of this Contract or as to any matter or thing of whatsoever nature arising thereunder or in connection therewith ......, then such dispute or difference shall be and is hereby referred to the arbitration and final decision of a person to be agreed between the parties, or, failing agreement within 14 days after either party has given to the other a written request to concur in the appointment of an Arbitrator, a person to be appointed on the request of either party by the President or Vice-President for the time being of the Hong Kong Institute of Architects co-jointly with the Chairman or Vice-Chairman for the time being of the Royal Institution of Chartered Surveyors (Hong Kong Branch). ......... (4) The award of such Arbitrator shall be final and binding on the parties.\" 3. In the Statement of Claim of Wan Chung, Wan Chung makes the following claims against the University and the Architect: (1) against the University only, a claim for the balance due on the final account of the original contract works and the variation works in the sum of HK$45,320,092.87 (\"the final account claim\"); (2) against the University only, a claim for damages for breach of contract alleging breach of implied terms and/or breach of warranty. The amount of damages claimed, as particularized, is for damages for delay in the sum of HK$110,914,000.00 and damages for disruption of work in the sum of HK$8,087,876.31, making the total sum of HK$119,001,876.31; (3) against the University and the Architect, a claim for damages for negligent misrepresentation. The measure of damages claimed is the same as that for damages for breach of contract, in the total sum of HK$119,001,876.31; and (4) against the University and the Architect, a claim for damages for fraudulent misrepresentation. Again, the amount of damages claimed, as particularized, is in the total sum of HK$119,001,876.31. 4. It is common ground that the four heads of claim all fall within the scope of the arbitration clause in the three main contracts as they are claims arising in connection with the contracts. It is also not in dispute that Article 8 of the UNCITRAL Model Law applies to a domestic arbitration agreement in the same way as to an international arbitration agreement, by virtue of section 6 of Cap. 341 . Article 8 is in the following terms: \"(1) A court before which an action is brought in a matter which is the subject of an arbitration agreement shall, if a party so requests not later than when submitting his first statement on the substance of the dispute, refer the parties to arbitration unless it finds that the agreement is null and void, inoperative or incapable of being performed.\" 5. The effect of Article 8 is that a stay of proceedings to arbitration is mandatory unless the party seeking a stay of proceedings has admitted the claim or the party opposing the stay could show that the arbitration agreement is null and void, inoperative or incapable of being performed ( Tai Hing Cotton Mill Ltd v. Glencore Grain Rotterdam BV [1996] 1 HKC 363 at 373G-H). 6. The stance of Wan Chung in this application is that the arbitration agreement should be ordered by the court to be inoperative under section 26(2) and a stay of proceedings should be refused under section 26(3). These statutory provisions are as follows: \"26. Power of Court to give relief where arbitrator is not impartial or the dispute involves question of fraud ........ (2) Where an agreement between any parties provides that disputes which may arise in the future between them shall be referred to arbitration, and a dispute which so arises involves the question whether any such party has been guilty of fraud, the Court shall, so far as may be necessary to enable that question to be determined by the Court, have power to order that the agreement shall cease to have effect and power to give leave to revoke the authority of any arbitrator or umpire appointed by or by virtue of the agreement. (3) In any case where by virtue of this section the Court has power to order that an arbitration agreement shall cease to have effect or to give leave to revoke the authority of an arbitrator or umpire, the Court may refuse to stay any action brought in breach of the agreement.\" 7. These provisions are the same as section 24(2) and (3) of the Arbitration Act 1950 in England. They were repealed by the Arbitration Act 1996 and have not been replaced. In Hong Kong, these provisions have been retained. The legal principles regarding the operation of these provisions may be summarized as follows: (1) For the court's power to be invoked under these provisions, it is necessary that the dispute involves the question whether any party to the arbitration agreement has been guilty of fraud. To satisfy this requirement, a \"concrete and specific issue of fraud\" must be raised. There must be \"sufficient prima facie evidence of fraud\" with \"convincing evidence to support the allegations\", not a mere bandying about of allegations (see Russell v. Russell (1880) 40 Ch D 471 at 481; Camilla Cotton Oil Co. v. Granadex S.A. [1976] 2 Lloyd's Rep 10 at 16; Cunningham-Reid v. Buchanan Jardine [1988] 1 WLR 678 at 691B-C). (2) If the stay of proceedings to arbitration is opposed by the party charged with the fraud, then almost as a matter of course the court will refuse a stay so that the matter can proceed to trial. This is a reflection of the view that when an allegation of fraud is made against a person, he is entitled to have that issue heard in public, so that his name may be cleared in public ( Russell v. Russell, supra. at 477; Camilla Cotton, supra . at 16; Yeu Shing Construction Co Ltd v. The Attorney General of Hong Kong (1988) 40 BLR 131 at 140-141; and Cunningham-Reid, supra . at 685D-E, 691E). (3) Where the party making an allegation of fraud opposes a stay of proceedings to arbitration and wishes the action to proceed in the court, the court has a discretion to refuse or grant a stay of proceedings. Whether it does so or not will depend on all the circumstances of the case. The court's normal approach is to grant a stay of proceedings to arbitration, when the \"sole matter relied on is the charge of fraud\". \"Even if there is a strong prima facie case of fraud in specific respects made out, that is not by itself enough to warrant refusing a stay.\" ( Russell v. Russell, supra . at 477; Cunningham-Reid, supra. at 685E, 687C-D, 691F). 8. It was submitted by Mr Robert Tang, SC, on behalf of Wan Chung, that there is something more in this instance to justify the exercise of the court's discretion under section 26 to refuse a stay of proceedings to arbitration, and that something more is Wan Chung's claim against the Architect, who has been brought in as the 2nd defendant and with whom Wan Chung had no arbitration agreement. Mr Tang also made the following points: (1) He submitted that the court's powers under section 26 may be exercised not only in relation to that part of the dispute which involves a question of fraud, but may also be exercised in respect of other parts of the dispute not involving any question of fraud. Thus, in the exercise of the court's discretion, the court may refuse a stay of proceedings to arbitration not just in respect of Wan Chung's claim against the University based on fraudulent misrepresentation, but also in respect of the other claims. (2) Even if the court is not minded to refuse a stay of proceedings in respect of all the claims of Wan Chung, it was submitted that the final account claim and the claim for breach of contract are separate and distinct from the claims based in tort, being the claims for negligent and fraudulent misrepresentation. For the claims based on negligent and fraudulent misrepresentation, Mr Tang submitted that they are inextricably linked and they should be heard together. Hence, the court should at least refuse a stay of proceedings to arbitration in respect of Wan Chung's claims for negligent and fraudulent misrepresentation. (3) Wan Chung will proceed with its claim against the Architect for negligent and fraudulent misrepresentation. If its claims against the University for negligent and fraudulent misrepresentation should be stayed to arbitration, there would be an obvious risk of inconsistent findings by different tribunals. Further, Wan Chung would have to prove its case twice before two different tribunals in respect of both liability and quantum for these claims. There may also be third party proceedings between the University and the Architect as the University may wish to contend that in the event that it is liable to Wan Chung for misrepresentation, the Architect should be liable to indemnify the University in whole or in part. (4) There is no guarantee that the arbitrator to be appointed would be a legally qualified person. The court is in a better position to determine a question of fraud than an arbitrator with no legal qualification. 9. Mr Clayton, who appeared for the University, does not dispute that multiplicity of proceedings with the inherent risk of inconsistent findings is a relevant factor. However, he submitted that this operates in his favour rather than against him for these reasons. Wan Chung's claims for final account, breach of contract and negligent misrepresentation do not raise any question of fraud. Mr Clayton differed from Mr Tang regarding the court's powers under section 26(2) and (3). Mr Clayton contended that the court does not have power under these provisions to refuse to stay proceedings in favour of arbitration in respect of the claim for final account, the claim for breach of contract and the claim for negligent misrepresentation because no question of fraud is raised in respect of these claims. The court's power to refuse a stay of proceedings is limited to the claim for fraudulent misrepresentation. Because of the mandatory stay of proceedings by virtue of Article 8 of the UNCITRAL Model Law, it is inevitable that there would be two sets of proceedings. There would be an arbitration in respect of the three heads of claim not involving any question of fraud and, if the claim for fraudulent misrepresentation is not stayed, there would be court proceedings in respect of that claim. Mr Clayton submitted that there may be a risk of inconsistent findings if the claims against the University were adjudicated by different tribunals. Hence, the court should not refuse a stay of proceedings in respect of the claim for fraudulent misrepresentation so that this claim, together with the other claims which must be referred to arbitration under Article 8, would all be dealt with by the arbitrator. 10. I will first consider the rival contentions of counsel on the court's powers under section 26(2) and (3). 11. To make good his submission, Mr Clayton referred me to the local decision of the The Attorney General of Hong Kong v. Aoki Construction Co Ltd (1981) 23 BLR 81 and the decision of the English Court of Appeal in Ashville Investments Ltd v. Elmer Contractors Ltd [1989] 1 QB 488 . In Aoki , Jackson-Lipkin J. considered the same question regarding the extent of the court's powers under these provisions and he had said this, obiter , at 90-91 of the report: \"The third matter is the significance of the commas at the end of the fourth and sixth lines of section 26 (2) of the Arbitration Ordinance . The learned author of Russell on Arbitration has no comment on the significance of these commas. Mr Gardam urges upon me that they mean that the court's power to order that the agreement to refer to arbitration cease to have effect and to revoke the authority of the arbitrator is limited to the single issue of fraud, and that the arbitration would continue before the same arbitrator on all the other issues, leaving the issue of fraud to be tried by a court if the parties so desired. Mr Graham contends for a different construction. It is, he says, a general power, and the court, if it exercises discretion in favour of the applicant, should order that the whole of clause 120(3), should cease to have effect and should give leave to revoke the authority of the arbitrator in toto. If it were necessary for me to decide the point, I should do so in favour of the defendant. The commas act as parentheses in the context of section 26(2), and the powers of this court are circumscribed by the words 'so far as may be necessary to enable that question to be determined by the court', that is to say, so far and no further, and only to enable that single issue, that is of fraud, to be determined by the court.\" (emphasis supplied) 12. Mr Clayton submitted that the English Court of Appeal in Ashville was also of the view that claims not involving any question of fraud would be referred to arbitration and would not come under the jurisdiction to make an order that the arbitration agreement should cease to have effect under the equivalent provision in the Arbitration Act 1950. The contractors in that case sought arbitration under the contract, claiming rectification of the contract on the ground of mistake and damages for innocent or fraudulent misrepresentation and negligent mis-statement by the owners which induced them to enter into the contract. As the contractors had raised the issue of fraud, the owners sought an order from the High Court under section 24(2) of the Arbitration Act so that that issue could be determined by the court. At the hearing before Sir Neil Lawson sitting as a judge of the Queen's Bench Division, the contractors abandoned the allegation of fraud and the judge granted the declarations sought by the contractors that the arbitrator had power to determine all issues in the pleadings and to grant the relief claimed, as the owners had raised questions as to the jurisdiction of the arbitrator to order rectification or any relief in respect of the misrepresentation pleaded. On the owners' appeal, the owners sought to argue that notwithstanding the allegation of fraud was abandoned by the contractors, the particulars in the points of claim served by the contractors remained unaltered so it was unreal not to treat the contractors' case as in effect continuing to allege fraud on the owners' part. The owners argued that it was an appropriate case for the exercise of the court's discretion to make an order under section 24(2) of the Arbitration Act. In rejecting that submission, the Court of Appeal had this to say: \"In any event, in his judgment below Sir Neil Lawson said that even if section 24(2) of the Act could apply in the circumstances of the instant case, he would not in the exercise of his discretion make any order thereunder. In my opinion, in giving his reasons for reaching this conclusion, the judge neither misdirected himself nor could we say that his conclusion was plainly wrong. Indeed were the discretion mine to exercise, I would take the same view as the judge and thus avoid concurrent legal and arbitration proceedings .\" (at 501, G-H, per May L.J.; emphasis supplied) \"But even if there had been a question of fraud in issue, in my judgment the proposed exercise by Sir Neil Lawson of his discretion under section 24(2), had it become exercisable, in refusing to make an order under that subsection could not have been effectively challenged in this court, since it is quite impossible to say that the judge misdirected himself or came to a decision which would have been plainly wrong. In so far as it is relevant, had the discretion been mine, I would have exercised it in the same way as the judge would have done, had the question arisen, so as to avoid two sets of proceedings .\" (at 506 C-D per Balcombe L.J.; emphasis supplied) 13. Thus, it would appear from the words italicised that the English Court of Appeal was of the view that the other claims of the contractors could not be the subject of an order made under section 24(2), hence, there would be legal and arbitration proceedings if the claim involving the question of fraud was not stayed in favour of arbitration. This was Mr Clayton's submission. Mr Tang however drew my attention to a passage in Balcombe L.J.'s judgment at 502A-C of the report and he submitted that Mr Clayton's reading of the case was erroneous. In the passage that Mr Tang referred to, Balcombe L.J. emphasized that some of the disputes between the parties were of a kind which only an arbitrator appointed under the arbitration clause in question had power to determine, being the power to open up, revise and review any certificate, opinion or decision. The judge then referred to the decision of Northern Regional Health Authority v. Derek Crouch Construction Co Ltd [1984] Q.B. 644 in which it was held that the court had no such power, unlike an arbitrator. Balcombe L.J. went on to say that the owners conceded that, \"should they succeed on their appeal, two sets of proceedings will be inevitable: one before the court and one before the arbitrator.\" Thus, Mr Tang submitted that when May L.J. and Balcombe L.J. talked about the inevitability of legal and arbitration proceedings, this was not because the court did not have power to make an order under section 24(2) in respect of other claims which did not raise any question of fraud, but it was because of a special provision in the arbitration clause which gave power to an arbitrator to vary and create new rights and as such powers were not available to the court, that made it inevitable for there to be two sets of proceedings. 14. To ascertain which reading of the judgments in Ashville is correct, I have read the decision of Sir Neil Lawson to see how his discretion was exercised as approved by the Court of Appeal. That decision was given on 29 January 1987 and is available on Lexis. I find it helpful and instructive in looking at the reasons given by the judge in exercising his discretion not to make an order under section 24(2) of the Act. The relevant parts of his judgment read as follows: \"Secondly, there is the question of the interplay of the facts in relation to fraud, originally alleged, and mistake or innocent misrepresentation. Critical to the decision of the first dispute of fact (that is the one raised about the differences between the drawings and specifications tendered and contracted) is what was the state of mind of the parties' representatives at the meeting on 22 December which preceded the sealing of the contract documents? On both sides, did they think the tender specification and drawing, and initialled specification were identical or that they were different? If one side thought they were identical and the other thought they were different, did the latter appreciate the former's error? If they, the latter, presented the contract specification and drawings for the former's signature, was the presentation accompanied by any, and what, representation? The line between 'mistake' and 'misrepresentation', whether innocent or fraudulent, is very fine indeed in the circumstances of this case. It would be most curious, therefore, if the arbitrator were free to deal with mistake and innocent misrepresentation but barred from an enquiry into fraudulent misrepresentation in relation to things which happened at the same meeting and were all part of the same discussions. The third point is the Minutes dispute. It is quite clear that the dispute as to the scope of the builder's design liability (which is plainly within the provisions of Clause 35) does not raise any question of fraud and that is a claim which relates to something like 50% of the amount claimed in point of cost and delay. Therefore, there is a very substantial part of the case which could not fall within the Arbitration Act 1950, s 24(2) and, in my judgment, it would be quite impossible for the arbitrator to avoid dealing with the whole ambit of these allegations as they now stand in the Amended Points of Claim by order under s 24(2).\" 15. Thus, it is clear that Mr Clayton's reading of the judgments in Ashville is correct and Balcombe L.J. was dealing with a different point about the arbitrator's power to open up certificates in that part of his judgment referred to by Mr Tang. Ashville and Aoki would appear to provide some support for Mr Clayton's submission that in respect of Wan Chung's claim for final account, the claim for breach of contract and the claim for negligent misrepresentation, in which no question of fraud is raised, the court's power under section 26(2) and (3) cannot be invoked. My only criticism with Aoki , in so far as the judge was saying that the power to make the order under section 26(2) is limited to the single issue of fraud, is that this is perhaps putting an unduly restrictive interpretation on section 26(2). The authors of Mustill and Boyd on Commercial Arbitration , 2nd ed., have a different view at p.502 which reads as follows: \"It is not merely the issue of fraud itself which is removed from the scope of the arbitration agreement. The Court can nullify the agreement to a sufficient extent to enable the issue to be fully tried. Thus, if the Court would be inhibited in reaching a decision on the question of fraud if it could not also investigate other matters, not themselves directly embracing any charge of fraud, the latter may properly be made the subject of an order made under section 25(2) [equivalent to section 27 (2) of Cap. 341 ]. But the order must be 'necessary' to enable the question of fraud to be determined: it is not sufficient if the court merely considers it sensible or convenient for all the issues to be tried together. \" (emphasis supplied) 16. In my judgment, the power of the court under section 24(2) does not have the wide effect as contended by Mr Tang. The power to make an order under section 26(2) is clearly qualified and circumscribed by the words \"so far as may be necessary to enable that question [the question of fraud] to be determined by the Court\". As the authors in Mustill and Boyd have pointed out, the key word here is \"necessary\". So for other matters not directly involving a question of fraud not to be referred to arbitration (under the general power under section 27 (2) of Cap. 341 , of which I have more to say), it must be shown that this is necessary to enable the question of fraud to be determined by the court, not merely because it would be convenient or appropriate or sensible for the other matters to be tried with an issue of fraud. Mr Tang has prayed in aid section 26(3) in which it is provided that the court may refuse to stay \"any action\", not \"an issue in the action\" or \"a part of the proceedings\", to support his contention that the court's power under section 26(2) is not limited so that the entire action may be the subject of an order made under section 26(2). I also reject this submission. Section 26(3) is consequential to the exercise of the court's power under section 26(1) and (2). Besides, the wording of section 26(2) is clear in that the court's power to order an arbitration agreement shall cease to have effect is circumscribed by the words that I have quoted. 17. I should point out that the general power of the court to order that the arbitration agreement shall cease to have effect \"with respect to the dispute referred\" under section 27(2)(b) cannot be invoked in this situation because this power is to be exercised only \"where the authority of an arbitrator or arbitrators or umpire is revoked by leave of the Court, or a sole arbitrator or all the arbitrators or an umpire who has entered on the reference is or are removed by the Court\", as stated in the opening words of section 27(2). Hence, unlike the special power under section 26(2), the general power under section 27(2) can be exercised only when an arbitration has been commenced, which is not the situation here (see Mustill and Boyd at p.500). 18. I also accept the submission of Mr Clayton that if section 26(2) is to be construed as giving the court power to declare the arbitration agreement inoperative in respect of all the issues in dispute notwithstanding that fraud is raised in only one of them, it would be difficult to read this provision consistently with the mandatory stay of proceedings except in limited circumstances as provided in section 6 and Article 8. 19. It has not been shown to me that it would be necessary , for the resolution of the claim for fraudulent misrepresentation, that the other claims for final account, for breach of contract and for negligent misrepresentation should also be heard and investigated by the court. In my judgment, these other claims should be stayed in accordance with Article 8(1) and the court does not have power under section 26(2) to order that the arbitration agreement should cease to have effect as regards the claim for final account, the claim for breach of contract and the claim for negligent misrepresentation. 20. Having come to that view, I agree with Mr Clayton that the factor of multiplicity of proceedings is in favour of the University and not Wan Chung. As Mr Tang has submitted, the claims in negligent misrepresentation and fraudulent misrepresentation are inextricably linked. I would go further. It is clear, on reading the Statement of Claim of Wan Chung, that the primary dispute in this action arose out of an allegation that Wan Chung had suffered substantial loss and damage because of the failure to give possession of sites 3 and 4 to Wan Chung within June 1995. The legal bases upon which relief is sought have been put in a number of ways. Firstly, it is pleaded that there were implied terms in the tenders submitted for each of the three main contracts that Wan Chung would be given possession of each of the three sites within June 1995. Secondly, it is alleged that the Architect had represented to Wan Chung in the final tender meeting on 24 May 1995 that possession of each of the three sites could and would be given to Wan Chung in June 1995. It is pleaded that this representation constituted a warranty. Thirdly, it is pleaded that the representation was a misrepresentation and that it was made fraudulently because the University and the Architect had decided, before the representation was made, that possession of site 4 would not be given to Wan Chung until after the completion of the access road to site 1 and also because the Architect knew that it was impossible to give possession of site 4 in June 1995 as the drainage plans containing the manhole details had not been submitted to the Building Department for approval. Fourthly, these same matters are relied on in support of the allegation that the representation was made negligently. 21. In respect of the final account claim, other than the claim for variation works in the sum of HK$28 million odd, the balance of the claim is premised on the allegation that there was breach of the implied term and breach of warranty regarding the date of giving possession of the sites, as it is Wan Chung's pleaded case that the completion date of the works \"became at large\" because of the failure to give possession of sites 3 and 4 to Wan Chung latest by 30 June 1995. Hence, the University was not entitled to deduct liquidated damages in the sum of HK$12 million odd and a sum of HK$15 million by way of global discount. 22. The claim for breach of contract in the total sum of HK$119 million odd is premised on breach of implied term and breach of warranty, and is clearly linked to the alleged representation made by the Architect on 24 May 1995. The claims founded on negligent and fraudulent misrepresentation are likewise linked to the alleged representation. 23. It is pertinent to note that the same particulars are relied on to support an allegation that the representation was made by the Architect fraudulently in that he knew that the representation was false, alternatively he was reckless, and to support an allegation that he had made the representation negligently. 24. Thus, it can be seen that the four claims made by Wan Chung against the University are inter-linked and inter-related and that they all sprang from the allegations that there was an obligation to give possession of the sites to Wan Chung within June 1995 but was not complied with. Like Sir Neil Lawson in Ashville , I find the lines between \"warranty\" and \"misrepresentation\", \"fraudulent misrepresentation\" and \"negligent misrepresentation\" very fine to draw in the circumstances of this case. Likewise, I would find it most curious if the arbitrator were free to deal with the claim for final account, the claim for breach of contract and the claim for negligent misrepresentation but \"barred from an enquiry into fraudulent misrepresentation in relation to things which happened at the same meeting and were all part of the same discussions.\" When the matter is approached in this manner, and once it is recognized that the claims for final account, breach of contract and negligent misrepresentation must be referred to arbitration by virtue of Article 8, it seems to me that it would only be proper, in the exercise of the court's discretion under section 26(2), not to refuse a stay in respect of the claim for fraudulent misrepresentation, so that all the claims against the University would be referred to arbitration. 25. What then of the position of the Architect and the submission made on behalf of Wan Chung that if there is arbitration against the University and there are separate proceedings against the Architect, there would be an inherent risk of inconsistent findings? In my view, the risk is exaggerated and I say this for the following reasons. 26. Firstly, although the Architect has not made any application to stay Wan Chung's claim against it, I have before me a letter dated 20 November 2001 from the Architect's solicitors to Wan Chung's solicitors. I note from that letter that before the Architect had served a defence in these proceedings, the Architect had proposed a general stay of these proceedings pending the outcome of the University's application for a stay to arbitration. Wan Chung rejected the Architect's proposal and insisted on the Architect serving a defence, which was done. By that letter, the Architect's solicitors again proposed that if the University's application to stay the proceedings against it in favour of arbitration should succeed in whole or in part, Wan Chung's claim against the Architect should also be stayed pending the resolution of the arbitration proceedings between the University and Wan Chung. I understand that there was no response from Wan Chung to this proposal. Mr Tang has submitted that I must not assume that the proceedings against the Architect would be stayed. Indeed, he was instructed that Wan Chung would pursue its claim against the Architect because it might be easier for Wan Chung to prove its case of fraudulent misrepresentation against the Architect as compared to its claim for fraudulent misrepresentation against the University. I make no assumption that Wan Chung's claim against the Architect would be stayed pending the arbitration between the University and Wan Chung. However, I am entitled to take into consideration that the Architect has, on two previous occasions, requested Wan Chung to agree to a stay of proceedings and that the Architect may well apply for a stay of proceedings if the court should grant a stay of proceedings in respect of Wan Chung's claim against the University. Mr Clayton referred me to a decision of Burrell J. in Paladin Agricultural Ltd v. Excelsior Hotel (Hong Kong) Ltd [2001] 2 HKC 215 in which the defendant sought a stay of proceedings against the 2nd plaintiff pending the determination of the arbitration between the defendant and the 1st plaintiff. In granting a stay, the judge took into account among other things that there were many common issues in the claim of the 1st plaintiff and the claim of the 2nd plaintiff although the claims were not identical; that the root cause of the claims was the same and the majority of the consequential issues were the same; and that a duplication of proceedings would create the risk of inconsistent findings and the inevitability of increased costs. The same may be said regarding Wan Chung's claim against the University for fraudulent misrepresentation and its claim against the Architect for fraudulent and negligent misrepresentation. I am entitled to take into account, that if and when an application is made by the Architect to stay the proceedings against him pending the arbitration between the University and Wan Chung, the matters considered by Burrell J. would be regarded as relevant to the exercise of the court's discretion whether to order a stay. 27. Secondly, it must not be assumed that there would be concurrent proceedings going on in respect of Wan Chung's arbitration against the University and Wan Chung's claim against the Architect and that there would be a race between the court and the arbitrator as to which tribunal should decide first. If the proceedings against the University are stayed to arbitration, the court may well have to look into the question whether to stay the proceedings against the Architect pending the determination of the arbitration or to restrain the arbitration from proceeding until after the proceedings against the Architect have been concluded. In either situation, a duplication of proceedings would be minimized if not avoided, and the risk of inconsistent findings by different tribunals would be reduced. 28. Thirdly, I think it is likely that the Architect's personnel would be key witnesses in the arbitration just as in the proceedings against the Architect. What they said and did and their state of mind would be looked into and investigated in the arbitration just as in the proceedings against the Architect. Even if the findings made by the arbitrator would not be binding on the court and vice versa, because the parties in the two sets of proceedings are not the same, it would be of assistance to the subsequent tribunal to have the evidence given in the earlier proceedings and this may well shorten the subsequent hearing. It is not as if there were to be new or different witnesses before the second tribunal so that there would be a significant risk that a different conclusion might be reached by the second tribunal on the same issue. Essentially, the second tribunal would be covering the same grounds as the first, but with the benefit of the evidence in the first hearing. 29. Fourthly, it was submitted by Mr Clayton that if Wan Chung should succeed against the University in respect of its claims for breach of contract or misrepresentation, it would not be necessary for Wan Chung to pursue its claim against the Architect for misrepresentation. This course of action would only be necessary if Wan Chung should fail in its claim against the University. Hence, it is possible that the proceedings against the Architect may not be pursued and the risk of inconsistent findings may not materialize at all. 30. As for the possibility of third party proceedings between the University and the Architect, I have not heard anything from Mr Clayton that the University might wish to bring third party proceedings against the Architect. I do not propose to take this possibility into account. 31. Lastly, in respect of the misgivings that the arbitrator appointed by the parties might not be in as good a position as a judge to try an issue of fraud, I note that similar submissions were made and rejected by Woolf L.J. in Cunningham-Reid, supra . at 688C and by Godfrey J. (as he then was) in Yeu Shing Construction, supra . at 142. I am of the same view that there is little or no substance in this point. 32. For the above reasons, I am not persuaded that I should exercise my discretion under section 26(2) and (3) and refuse a stay of any part of the proceedings against the University. I should like to mention that it must not be taken that I have accepted that Wan Chung has made out a sufficient prima facie case with convincing evidence to support the allegations of fraudulent misrepresentation against the University, whether the University is vicariously liable for the misrepresentation of the Architect, or on the basis that the University is liable on its own because the Architect had made the representation in the presence of a staff of the University and with the approval of the University. As I have stated above, it is a necessary requirement for a party to come up with sufficient prima facie evidence of fraud before the court is to consider whether to exercise its discretion under section 26(2). When I raised this matter with Mr Clayton, he informed me that he is not taking the point that there is no sufficient prima facie evidence of fraud, in view of an affirmation made by the Architect to the effect that he cannot recall making or hearing the representations alleged to have been made at the meeting on 24 May 1995. No submissions were made to me on the sufficiency or otherwise of the evidence adduced by Wan Chung on the allegation of fraud, so I have not made any ruling on this in this decision. 33. I make an order as sought by the University that all further proceedings in this action as against the University be stayed pursuant to section 6 (1) of the Arbitration Ordinance and Article 8(1) of the UNCITRAL Model Law. I make an order nisi that the University's costs of and occasioned by this action, including the costs of this application, be paid by Wan Chung forthwith, to be taxed if not agreed. (S. Kwan) Judge of the Court of First Instance, High Court Representation: Mr Robert Tang, SC and Mr Ronald Tang, instructed by Messrs Lee Chan Cheng, for the Plaintiff Mr Peter Clayton, instructed by Messrs Mallesons Stephen Jaques, for the 1st Defendant Look up this case on Lawcite Noteup",
  "length": 40594,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2001/172",
  "query": "stay of proceedings",
  "ts": "2025-10-16T10:40:16",
  "ok": true
}