{
  "title": "CHEUNG SHING HONG LTD V. CHINA PING AN INSURANCE (HONG KONG) CO LTD | [2020] HKCFI 2269 | HKLII",
  "court": null,
  "year": 2020,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2020] HKCFI 2269 CHEUNG SHING HONG LTD V. CHINA PING AN INSURANCE (HONG KONG) CO LTD Judgment Information Date 23 Aug, 2020 Action No. HCA1485/2019 Neutral Cit. [2020] HKCFI 2269 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCA1485/2019 HCA1485/2019 CHEUNG SHING HONG LTD v. CHINA PING AN INSURANCE (HONG KONG) CO LTD HCA 1485/2019 [2020] HKCFI 2269 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE ACTION NO 1485 OF 2019 __________________ BETWEEN CHEUNG SHING HONG LIMITED Plaintiff and CHINA PING AN INSURANCE (HONG KONG) COMPANY LIMITED Defendant __________________ Before: Deputy High Court Judge Maurellet SC in Chambers Date of Hearing: 24 August 2020 Date of Decision: 24 August 2020 __________________ DECISION __________________ 1. There is before me an application by China Ping An Insurance (Hong Kong) Company Limited (“the Insurance Company”) to stay High Court Action 1485/2019 commenced by one Cheung Shing Hong Limited (“the Insured”) in favour of arbitration. 2. The background of the case can be gleaned from the Statement of Claim filed by the Insured on 14 August 2019. The Insured is and was the occupier of certain industrial premises in Shenzhen in Guangdong, whereas the Insurance Company, as its name indicates is in the business of providing insurance. 3. On 12 May 2017, the Insured took out a fire insurance policy with the Insurance Company through an insurance agency. By contract of insurance contained in the policy No HKC-F-2017-10161, dated 15 May 2017 (“the Policy”), the Insurance Company in consideration for a premium, agreed to provide the Insured with fire insurance in respect of the premises and its contents from a period from 14 May 2017 to 13 May 2018. 4. It is said by the Insured that the premises sustained damage from fire, such damage occurring during the period of insurance under the Policy. It is alleged that on or about 19 December 2017 at around midnight a fire broke out at the workshop at the premises and that initially fumes were observed coming out from the window of the 5th floor, which is said to have resulted by reason of a short circuit. It is further suggested that the fire lasted about an hour and was ultimately extinguished by the fire brigade at around 1:30 am in the morning, and thereby damage was caused to the property of the Insured. 5. It is for those reasons, and the Insured says by reasons of the Insurance Company’s breach, that the Insured now claims a total sum of approximately RMB 2,905,214 or its equivalent in Hong Kong dollars. 6. As explained above, on 12 December 2019, the Insurance Company took out the present summons for a stay of those proceedings. 7. On 19 December 2019, the solicitors for the Insurance Company had applied for an extension of time to file and serve a defence, which was required to be filed under the rules. 8. On 23 December 2019, Master Chow dismissed the Insurance Company’s application for a time extension to file and serve its defence but made it clear that the filing and service of any defence shall be without prejudice to the application of the Insurance Company under Order 12, by way of its summons filed on 20 December 2019. 9. Pausing there, and whilst noting there may very well have been good reasons for the Master to make the decision that she did, one would have thought that in most cases where an application is made for a stay on the basis of an arbitration clause, it might be more cost efficient to simply extend time until the determination of the substantive hearing of a stay application. Of course, this is just a general observation. It may well be that in this specific case, based on specific facts, another contrary conclusion is called for. 10. Both parties before me accepted that the Court’s approach in such an application was correctly and conveniently set out in a decision of Ma J, as the Hon. Chief Justice then was, in Tommy CP Sze & Li & Fung (Trading) Ltd & Ors [2003] 1 HKC where it was held that: “The court’s approach in stay applications (18) It is of course crucial in any application for a stay (whether under section 6 of the Ordinance or Article 8 of the Model Law) that there exists an arbitration agreement. By this is meant an agreement between the parties by which present or future disputes or differences between them are required to be resolved by the arbitral process. The definition of “arbitration agreement” is contained in section 2 of the Ordinance, which in turn refers to Article 7 of the Model Law. An agreement which does not compel parties to have disputes or differences resolved by arbitration is not an arbitration agreement for present purposes. Where, for example, an option is given to the parties to go to arbitration if they so choose but with litigation in the courts being an available option as well, this is not truly an arbitration agreement. There must be its element of compulsion in the agreement between the parties that any disputes or differences must be arbitration. (19) Thus, the logical starting point of all applications for a stay must be : Is the clause in question an arbitration agreement? (Question 1) If the answer is No, a stay will not be granted. (20) Next, the arbitration agreement (if there is one) must not be “null and void, inoperative or incapable of being performed” : see Article 8(1) of the Model Law. The inquiry here is therefore : Is the arbitration agreement null and void, inoperative or incapable of being performed? (Question 2) If the answer is Yes, no stay can be ordered. (21) On the assumption that there exists an arbitration agreement and that it is capable of being performed, the next step is to discover whether in reality there does exist a dispute or difference between the parties. If upon analysis no dispute or difference exists, there is nothing to refer to arbitration. Here, the relevant question is : Is there in reality a dispute or difference between the parties? (Question 3) If the answer is No, no stay will be ordered. (22) Finally, even where a dispute or difference truly exists, it must be determined whether the arbitration agreement then covers the dispute or difference in question. This involves first analysing the nature of the dispute or difference between the parties and then construing the arbitration agreement to see whether it comes within it. The question here is therefore : Is the dispute or difference between the parties within the ambit of the arbitration agreement? (Question 4) If the answer is No, a stay will not be ordered. (23) I have set out the four questions that a court must generally deal with in stay applications. It is of course open to the court to deal with the questions in whatever order seems efficient and one has to recognize the obvious fact but not all of these questions will be controversial in every case, but in my view they set out the logical and basic approach of the court. (24) I now deal with each of these questions in the context of the present application. It is fair to say that to varying degrees, all of the questions are controversial.” 11. The parties before me agreed that in the present case the only of the four questions which was relevant and required determination was question 4, ie: “It must be determined whether the arbitration agreement then covers the dispute or difference in question. This involves first analysing the nature of the dispute or difference between the parties and then constrain the arbitration agreement to see whether it comes within it. The question here therefore is, is the dispute or difference between the parties within the ambit of the arbitration agreement?” 12. Of course, if the Court comes to the conclusion that the arbitration clause covers the dispute and the other three of the four questions are covered in the affirmative, the Court must stay the proceedings, as DHCJ Peter Ng, SC (as Mr Ng J then was), in Lin Ming v Chen Shu Quan [2012] 2 HKLR 547 at 556, paragraphs 24 to 25, held: “Section 20 of the Arbitration Ordinance gives legal effect Article 8 to the Model Law. It sets out the basic principle that the court before which an action is brought in a matter which is the subject of an arbitration agreement, must refer the parties to an arbitration unless it is established the arbitration agreement is null and void, inoperative or incapable of being formed. Once the conditions of Article 8 are satisfied, a stay of the legal action is mandatory. See Astel‑Peiniger Joint Venture v Argos Engineering [1995] 1 HKLR 300 , William Co & Chu Kong Agency Company Limited [1995] 2 HKLR 139 , Pacific Crown Engineering Ltd v Hyundai Engineering & Construction Co Ltd [2003] 3 HKLRD 440 . And the earlier decision in Tommy CP Sze & Co v Li & Fung (Trading) .” Analysis 13. When the court embarks in answering the questions set out as question 4 in Tommy CP Sze , the Court has to embark on the construction of the clause, bearing in mind both the clause in question and the agreement. It is an exercise that the Court has on every occasion to embark upon, having regard to the precise wording of the agreement and the surrounding circumstances and background. 14. In most cases, the clause before the court and the clauses analysed in earlier decisions would not be identical. In those cases, where the clause and the type of agreement is identical, one would normally expect the Court to follow the construction and the analysis of earlier Court decisions, both because it is compelling and because of consistency reasons. 15. Notwithstanding the industry of counsel appearing before me, it would appear that in none of the earlier reported decisions did the Court have to construe the exact same dispute resolution clause in the same type of agreement as the one currently before me [1] . 16. Ms Christina Lee, who eloquently represented the Insurer (ably assisted by Mr Jasper Wong), drew to my attention the decision of the English Court of Appeal in Sulamerica Cia Nacional De Seguros SA & Others v Enesa Engelharia SA and Others [2013] 1 WLR 102 . Those proceedings, strictly speaking, did not involve a stay in favour of arbitration, but both at First Instance and in the Court of Appeal, the English courts had occasion to construe the relevant dispute resolution clause, which Ms Lee submits is apposite in the present case. 17. The broad background can be taken from the case note of that decision in the law reports, and I quote: “The insured, Brazilian companies involved in the construction of a hydroelectric generating plant in Brazil made claims on the two insurance policies. Insurers denied liability on the ground the losses were uninsured or excluded under the terms of policies, or for material non‑disclosure by the insured. The policies which were in substantially the same term contained an express choice of Brazilian laws, the governing law of the contract, an exclusive jurisdiction clause in favour of the Brazilian courts, and mediation and arbitration clauses whereby the parties undertook that, prior to a reference to arbitration they would seek to have any dispute resolved by mediation, and that if they failed to agree to the amount due through mediation the dispute would be referred to arbitration, the seat of arbitration being London. Either party was entitled to refer to the dispute to arbitration. The insurers gave notice of arbitration without referring the dispute to mediation. The insured obtained an injunction in Brazil to restrain the insurers from pursuing arbitration proceedings whereupon the insurers applied to the English courts for, and were granted, an ex parte interim injunction to restrain the insured from pursuing proceedings in Brazil. Following an inter partes hearing, the judge continued the injunction holding that the agreement to arbitrate had its closest and most real connection with the English law because of the choice of law as the seat of arbitration and that accordingly, English law was a proper law of the arbitration agreement.” 18. The dispute resolution clauses in that case were set out in two interconnected clauses. Clause 11, with the heading, “Mediation”, provided as follows: “If any dispute or difference or whatsoever nature arises out of, or in connection with this policy including any question regarding its existence, validity or termination hereafter termed as dispute, the parties undertake that prior to a reference to arbitration they will seek to the dispute resolve amicably by mediation...” 19. Clause 12, under the heading “Arbitration” provided as follows: “In case the insured and the insurer, as, shall fail to agree as to the amount to be paid under the policy through mediation as above, such dispute shall then be referred to arbitration under ARIAS Arbitration Rules...” 20. The argument raised by the appellant there, which is pertinent for present purposes, is encapsulated at paragraph 6 of the Court of Appeal’s judgment. There, Moore-Bick LJ described it as follows: “The insured argued they were not bound to arbitrate because the arbitration agreement was done by the law of Brazil under which it could be invoked only with their consent. They also argued that the right to refer to disputes to arbitration arose only after the requirements of condition 11 had been satisfied. Those requirements were not satisfied in this case and in any event, the scope of the arbitration clause was limited to disputes about the quantum of the insurer’s liability and there not in composite disputes about substantive rights and obligation of the kind which the insurers had sought to refer.” 21. Ms Lee, understandably there seeks to draw a parallel between the approach and argument advanced by that party in the English Court of Appeal’s decision and that in the present case where effectively, what the Insured seeks to do is to interpret the DR Clause in the way which only covers the scope of a dispute on quantum , and not one where liability is denied wholesale. 22. Moore‑Bick LJ further analyses the scope of the arbitration agreement, (what I refer to as the dispute resolution clause), at paragraphs 38 to 41 of his judgment. At paragraph 39 he held as follows: “The insured submitted that the current dispute between the parties which concerned the insurer’s liability to indemnify them under the policy falls outside the scope of the argument which is limited to disputes about the amount to be paid in respect to any individual loss. The judge rejected that argument, and in my view, he was right to do so. Although it is possible to compare the opening language of condition 12 with the broader language of condition 7, ‘Any disputes arising under, out of or in connection with the policy, and 11 (any dispute or difference of whatsoever nature)’, it is impossible to overlook the close connection between clause 11 and condition 12. One thing that emerges clearly from condition 11, effective or not, is that the parties intended that all disputes should be subjected to mediation and that if mediation failed, that it should be capable of being referred to arbitration. That much appears clearly from the first and fourth paragraphs. Likewise, condition 12 contains its first sentence a reference back to condition 11. I am unable to attach much significance to the fact that the word, ‘dispute’, does not bear an initial capital letter; to hold that that represented a deliberate attempt to distinguish the content of condition 12 and that of condition 11 is somewhat fanciful and in any event creates its own problems, since it is clear that the two are intended to work in conjunction with each other. The real question is whether by using the expression, ‘failed to agree’, as to the amount to be paid under this policy, ‘The parties intended to limit the scope of the arbitration agreement in the manner inconsistent with the fourth paragraph of condition 11’.” 23. Pausing there, I think there is force in Mr Cheung’s submission that the wording of the arbitration clause in the Sulamerica case, in particular the beginning of clause 11, (“If any dispute or difference of whatsoever nature arises out of, in connection with this policy...”) informs the construction of clause 12 which in turn means that, in effect, the scope of clause 12 in Sulamerica when construed together with clause 11 is somewhat wider than the DR Clause before me. 24. Notwithstanding that the dispute resolution clause in Sulamerica could be said to be wider than that in the present case, it seems to me that the dicta of Moore-Bick LJ (which whom Lord Neuberger M.R, as he then was) also agreed is of wider and general application. It is set out at paragraphs 40 and 41: “In my view, it would be very surprising if the parties had intended to limit the scope of the arbitration agreement in that way. If, as Mr Wolston suggested there were 40 good reasons for resolving disputes about liability in the courts of Brazil, leaving only disputes about quantum to be determined by arbitration, that would easily have been provided for without creating a conflict between the two conditions. It would be unusual for parties to a contract of this kind to establish separate and distinct procedures for resolving that in many cases are likely to be different aspects of the same dispute and there is no indication that they had that in mind. Reading conditions 11 and 12 together, it is clear that they were intended to form part of a composite dispute resolution process applicable to disputes of every kind and the use of the word ‘dispute’, is intended to refer to all disputes to which condition 11 refers. If necessary I would be prepared to strain the language of condition 12 in order to reach a conclusion that accords with our consent I consider to be good commercial sense when in fact, it is not necessary to do so. There is no difficulty in construing the language of condition 12 in that way because as the judge observed in paragraph 44 in the First Instance, as a matter of language, a failure to agree as to the amount to be paid under this policy includes a dispute about whether any sum is due under the policy at all and thus includes matters of liability and coverage.” 25. As I have indicated above, although in the present case there is nothing like the wide words which were present in condition 11 in Sulamerica , the reasoning, in particular, the reference to the quote “good commercial sense”, is something which is of general application and which I will apply in the case before me. 26. Mr Albert Cheung who represented the Insured drew my attention to two decisions which he skilfully sought to draw assistance from. The first is a decision at First Instance by Sir Peter Webster, sitting as a judge of the English High Court in Callaghan v Dominion Insurance [1997] Lloyds Law Report, Vol 2 page 541. 27. The pertinent dispute resolution clause in that case was one condition 4, which provided as follows: “If any difference shall arise to the amount to be paid under this certificate, liability being otherwise admitted, such difference shall be referred to be an arbitrator to be appointed by the parties in accordance with statutory provisions that are for, the time being, in force.” 28. In that case, the learned Judge held that: “It has been noted first that this clause only applies if liability, that is to say the insurer’s primary liability, is admitted. It cannot therefore constitute a condition precedent to the existence of any such liability. Note also that the clause only has effect when there is a difference to the amount to be paid under the policy. In terms, therefore, it goes to the quantification of the insurance claim not to the insured’s primary liability in principle. In this context therefore the words ‘condition precedent or right of action against the insurer’ which I cited a moment ago from the front page of the certificate are clearly to be taken as relating only to the right to the insured to claim and recover a particular amount from the insurer in circumstances in which the insurer had admitted liability in principle and in which a difference to the amount to be paid has been risen.” 29. Given the key actionable words “liability being otherwise admitted” it is quite clear that only limited reliance can be placed by this court on Callaghan as was fairly accepted by Mr Cheung. 30. Mr Cheung then drew attention to a decision of the Hong Kong Court of Appeal in Possehl Electronics Hong Kong v China Taiping Insurance (HK) Co Ltd [2015] 1 HKLR 958 . This was an appeal from the decision of DHCJ Whitehead, SC, unreported judgment dated 19 September 2013, Although the case itself was not one concerning an application for stay in favour of arbitration, the issue of arbitrability and the construction of the clause in question is one which is of relevance in the case before me. Condition 7 in that case, which is the dispute resolution clause, provided as follows: “If any difference shall arise as to the amount to be paid under this policy, such difference shall independently of all other questions be referred to the decision of an arbitrator... and it is hereby expressly stipulated and declared that there shall be a condition precedent to any right of action or suit upon this policy that the award by such arbitrator... of the amount of the loss or damage if disputed shall be first obtained.” 31. Poon J (as the Chief Judge then was), together with Lam VP and Barma JA had placed emphasis in the clause on the words “independently of all other questions”. They further held at paragraphs 24 and 25: “On the proper construction condition 7 deals with a dispute relating to the amount to be paid under the property policy only. Any such dispute is to be resolved by arbitration ‘(all) other questions’ independent of the difference on quantum including liability, are not covered. Here, when the defendant rejected the plaintiff’s claim he denied liability altogether. Thus the dispute arising from the rejection was not a dispute on quantum only. (Counsel for the insured) argued that the total denial of liability was still a quantum dispute because what the defendant agreed to pay is nil whereas the plaintiff asked for full compensation. We reject his argument for two reasons.” 32. It seems to me that the existence of the words, “independently of all other questions”, is very important in the present context and therefore the construction of both the learned deputy Judge and the Court of Appeal is of limited assistance in construing the DR Clause before me. 33. How to construe any given clause in an exercise such as the one to be conducted by the courts in the present exercise, is ultimately an exercise of contractual interpretation. I also agree with the dicta of Moore‑Bick LJ in Sulamerica that it would be very surprising, generally speaking, if parties in an insurance contract had intended to limit the scope of a particular arbitration agreement to separate and delineate issues of liability with those relating to quantum and that when there are good reasons for resolving disputes in such a way, that would normally be clearly spelt out. 34. It would be unusual for parties in such a contract of this kind to establish separate and distinct procedures for resolving what are likely to be different aspects of the same dispute. 35. Notwithstanding the skilful submissions made by Mr Cheung on behalf of the Insured, I consider that on a proper and true construction of clause 14 of the Policy before me, the clause is apt to cover both issues of liability and quantum. 36. Notwithstanding that the wording, on its face, “as to the amount to be paid under this policy”, does not expressly refer to liability. It seems to me that it is simply a way of incorporating both issues of liability and quantum in the same vein. 37. For those reasons, and since I have concluded that the condition 14 is apt to cover disputes of liability and quantum, it follows that a stay in favour of arbitration will be granted. 38. It remains for me to thank all counsel for their helpful assistance. (José Maurellet SC) Deputy High Court Judge Mr Albert Cheung, instructed by Wong, Fung & Co, for the plaintiff Ms Christina Lee and Mr Jasper Wong, instructed by Leung & Lau, Solicitors LLP, for the defendant [1] Clause 14 of the Policy provides that “if any difference shall arise as to the amount to be paid under this Policy such difference shall be determined by arbitration in accordance with the prevailing Arbitration Ordinance . If the parties fail to agree upon the choice of an arbitrators or umpires, then the choice shall be referred to the Chairman for the time being of the Hong Kong International Arbitration Center”. (“the DR Clause”) Look up this case on Lawcite Noteup",
  "length": 24865,
  "headers_seen": [
    "Analysis"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2020/2269",
  "query": "seat of arbitration",
  "ts": "2025-10-16T10:49:23",
  "ok": true
}