{
  "title": "FUNG HING CHIU CYRIL V. HENRY WAI & CO (A FIRM) | [2018] HKCFI 31 | HKLII",
  "court": null,
  "year": 2018,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2018] HKCFI 31 FUNG HING CHIU CYRIL V. HENRY WAI & CO (A FIRM) HCMP1699/2017 GRANDOM ASIA HOLDING LTD V. HENRY WAI & CO (A FIRM) HCMP1700/2017 Collapse Titles Judgment Information Date 9 Jan, 2018 Action No. HCMP1699/2017 HCMP1700/2017 Neutral Cit. [2018] HKCFI 31 Parallel Cit. [2018] 1 HKLRD 808 [2018] 3 HKC 375 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCMP1699/2017 HCMP1700/2017 HCMP1699/2017 FUNG HING CHIU CYRIL v. HENRY WAI & CO (a firm) HCMP 1699/2017 [2018] HKCFI 31 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE MISCELLANEOUS PROCEEDINGS NO 1699 OF 2017 ____________ IN THE MATTER of Sections 60 and 67 of the Legal Practitioners Ordinance , Cap 159 ______________ BETWEEN FUNG HING CHIU CYRIL Plaintiff and HENRY WAI & CO (a firm) Defendant ______________ AND HCMP 1700/2017 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE MISCELLANEOUS PROCEEDINGS NO 1700 OF 2017 ____________ IN THE MATTER of Sections 60 and 67 of the Legal Practitioners Ordinance , Cap 159 ______________ BETWEEN GRANDOM ASIA HOLDING LIMITED Plaintiff and HENRY WAI & CO (a firm) Defendant ______________ (Heard Together) Before: Hon Mimmie Chan J in Chambers Date of Hearing: 19 December 2017 Date of Decision: 10 January 2018 ______________ D E C I S I O N ______________ 1. These proceedings relate to a dispute on the fees charged by Henry Wai & Co (“ Firm ”), solicitors, against their former clients, Fung Hing Chiu Cyril (“ CF ”) and Grandom Asia Holding Limited (“ GA ”). The issue is whether an arbitration clause in their retainer agreement is enforceable, and the action should be stayed for arbitration. 2. CF is now 78 years of age, but as a member of an old and eminent family with a long history of doing trading and investment businesses in Hong Kong, CF has been actively involved in his family enterprises and investment activities since the 1970s, and can be described as an extremely experienced businessman, or entrepreneur. He was an MBA graduate from Harvard Business School, served as director of various companies encompassing a broad range of industries, and even in his advanced age, he has been involved in brokering and negotiating commercial and corporate deals for takeovers and mergers and in the venture capital sector. 3. Until 2014, CF had been involved in the management of Shiu Fung Hong Limited (“ SFH ”), the shares of which are held in equal shares by 2 families, being descendants of the late Sir Fung Ping Fan Kenneth (“ PF Camp ”) and the late Mr Fung Ping Kan (“ PK Camp ”). CF is a member of the PF Camp. He is also the director of GA. 4. CF instructed the Firm in relation to disputes which had erupted between the PF Camp and the PK Camp in 2015, concerning the affairs of SFH and the exclusion of CF as a director of SFH in his capacity as nominee of GA. Proceedings were commenced in May 2016 by GA and the PF Camp, under HCCW 161/2016, against the PK Camp (“ SFH Proceedings ”), with the Firm acting on behalf of GA. A Letter of Appointment dated 13 January 2016 was signed by GA, evidencing its agreement made with the Firm for the Firm’s professional services in the matter of GA’s “proposed claims in respect of (SFH) and all matters relating and/or incidental thereto”. 5. CF was also named as defendant in proceedings commenced by his landlord in HCA 1360/2016, in respect of the tenancy of office premises in Rooms 502 and 1102, Shiu Fung Hong Building at 239-241 Wing Lok Street Hong Kong (“ Tenancy Proceedings ”), which proceedings were commenced in May 2016. CF signed a separate Letter of Appointment dated 6 September 2016, evidencing his agreement with the Firm for the appointment of the Firm to act for him in the Tenancy Proceedings and “all matters relating and/or incidental thereto”. 6. The Firm issued various bills under its 2 Letters of Appointment, and a total sum of approximately HK$1,150,795 is claimed to be outstanding and unpaid by CF and GA. In April 2017, the Firm commenced arbitration against CF and GA respectively, for outstanding fees due under the bills issued by the Firm, and in reliance on the arbitration clause contained in clause 7 of the Terms of Appointment in the schedule attached to each of the Letters of Appointment (“ Arbitration Clause ”). The Arbitration Clause provides: “Any dispute, controversy or claim arising out of or relating to the contract between you and our firm, including the validity, invalidity, breach or termination thereof and any claim for any sum payable thereunder, shall be settled by arbitration in Hong Kong under the Hong Kong International Arbitration Centre Administered Arbitration Rules in force at the time of commencement of arbitration. The number of arbitrators shall be one and shall be appointed by the Hong Kong International Arbitration Centre.” 7. The Originating Summonses in these proceedings in HCMP 1699/2017 (“ Fung Action ”) and HCMP 1700/2017 (“ GA Action ”) were issued by CF and GA respectively against the Firm in August 2017, by which CF and GA claim (in each case) a declaration that the Arbitration Clause is void; that the bills issued by the Firm and delivered to CF and GA under the Letters of Appointment should be referred to a taxing master of the court and be taxed; and further, that the arbitration proceedings commenced by the Firm against CF and GA for professional fees and disbursements due under the bills be stayed. The proceedings were purported to have been issued under ss 60 and 67 of the Legal Practitioners Ordinance (“ Cap 159 ”). 8. In the separate arbitrations commenced by the Firm in April 2017, CF asked the tribunal for an extension of time to file his defence, and then informed the tribunal in August 2017 that he did not submit to its jurisdiction. As for GA, it asked the Tribunal in July 2017 to deal with its challenge to jurisdiction by way of preliminary issue, to which procedure the Firm and the tribunal agreed. GA claimed initially that the scope of the Arbitration Clause did not extend to GA’s claim against the Firm for negligent advice, and alleged for the first time on 11 September 2017 that the Arbitration Clause was invalid and/or unenforceable (on the grounds of mistake, public policy, etc). 9. On 4 September 2017, the Firm applied by summons for the Fung Action and the GA Action to be stayed to arbitration pursuant to s 20 of the Arbitration Ordinance (“ Ordinance ”), on the basis and in reliance on the Arbitration Clause. 10. At the first hearing of the Originating Summonses and of the stay summons, I dismissed the application for the arbitration to be stayed, on the basis that the Court has no power to make such an order under the Ordinance, and the Court can intervene in an arbitration only as expressly provided for in the Ordinance. 11. The issues remaining for determination by the Court are whether the Arbitration Clause is void and unenforceable as claimed by CF and GA, whether the Fung Proceedings and GA Proceedings are abuse of the process of the Court, and whether they should be stayed to arbitration in accordance with the Arbitration Clause. 12. The legal principles for stay of legal proceedings to arbitration are demonstrably clear (set out in PCCW Global Ltd v Interactive Communications Services Ltd [2007] 1 HKLRD 309 , and applied in Chimbusco International Petroleum (Singapore) Pte Ltd v Fully Best Trading Ltd [2016] 1 HKLRD 582 and Polytec Overseas Limited and anr v X HCA 2766/2016, 22 March 2017), as are those relating to the competence of an arbitral tribunal to decide and rule on its own jurisdiction. These principles shall not be repeated here. Is there a prima facie valid arbitration agreement 13. It is indisputable that there is an agreement in writing between the parties, as evidenced by the Letters of Appointment. The claims made by CF, as to his lack of knowledge or understanding of the provisions or contents of the Letters of Appointment (which include the Arbitration Clause) which he signed, and his purported mistake as to the meaning or effect of what he had signed, or any mistake on his part as to the inclusion of or agreement to the Arbitration Clause, need not be repeated to be rejected. It has never been possible at law for a person who has signed a document to disown it by claiming that he had signed it without reading it or truly understanding it or its effect and legal consequences, for failing to have procured someone to explain the document, its terms and effect to him. Nor have these claims been further pursued by Counsel in the submissions made for the hearing. 14. The Court is bound under s 20 of the Ordinance to refer the parties to an arbitration agreement to arbitration, unless the Court finds that the arbitration agreement is null and void, inoperative or incapable of being performed. Unless the point is clear, that there is no valid arbitration agreement, or that the arbitration agreement is null, void or inoperative, the matter should be stayed to arbitration, for the tribunal to rule on its own jurisdiction. 15. The crux of the arguments made on behalf of CF and GA are that, firstly, CF and GA were “dealing as consumers” when they engaged the Firm to render legal services, and the Arbitration Clause is accordingly unenforceable under s 15 of the Control of Exemption Clauses Ordinance (“ CECO ”), without the written consent of CF and GA signified after the differences as to the fees due to the Firm had arisen. It follows from that argument, that the Arbitration Clause is said by CF and GA to be null, void, inoperative, or incapable of being performed. 16. Further, CF and GA argue that the Arbitration Clause is unenforceable for being contrary to public policy. They claim that it is contrary to public policy to enforce a provision which seeks to limit the supervisory powers of the Court over solicitors who are officers of the Court, and which seeks to remove the disciplinary powers of the Law Society or of the Court in respect of a solicitor’s breach of the Solicitors’ Code of Conduct issued by the Law Society (“ Code ”). 17. Counsel for CF and GA confirmed, at the hearing, that the earlier references made by CF and GA to ss 58- 60 of Cap 159 (and their provision for solicitors being remunerated for contentious business “by gross sum or by salary or otherwise at a greater or less rate than that at which he would otherwise have been entitled”) are no longer relied upon, and that they refer only to s 67 of Cap 159 , for the sole purpose of arguing that the Court should have jurisdiction over its solicitors and to oversee their fees charged to a client, by taxation. 18. Section 67 of Cap 159 merely provides that a party chargeable with a solicitor’s bill may apply to the Court, and the Court shall on such application order that the bill shall be taxed and that no action shall be commenced on the bill until the taxation is completed. 19. CF and GA also rely on principle 5.15 of the Code, which prohibits a solicitor from taking advantage of the age, inexperience, ill health, lack of education or business experience of his client, principle 4.12 of the Code, which provides that if a dispute arises on a bill or a query is raised about a bill of the solicitor, the client must be told, preferably in writing, of his right to apply to have the bill taxed, and principle 4.13 of the Code, which provides that a solicitor must not overcharge. The Court’s supervisory powers over solicitors and whether Arbitration Clause contrary to public policy 20. The Arbitration Clause provides for “any dispute, controversy or claim” arising out of or relating to the contract between the Firm and its client, including “any claim for any sum payable”, to be settled by arbitration. 21. Without disputing that there is a public policy interest for the Court to exercise control and supervision over solicitors who are officers of the Court, it is relevant to bear in mind that there are also public policy interests in holding parties to a contract, entered into by their free will, to settle their disputes by arbitration. It is also undeniable that Hong Kong is promoted as an important international arbitration centre, and that the Courts here encourage parties’ resolution of their disputes by arbitration - as can be evidenced by the object and principles of the Ordinance (set out in s 3 thereof), and the authorities on how the powers of the Court under the Ordinance are exercised. A further important policy consideration is that Hong Kong and the Courts here should observe the obligations assumed under international conventions, such as the New York Convention of which Hong Kong is a party, and the duties thereunder: under Article II, to recognize and enforce an arbitration agreement; and under Article III, to recognize arbitral awards as binding and to enforce them. To the extent that there may be any possible conflict between these policy considerations, then a proper balance has to be drawn by the Courts, in the exercise of its jurisdiction and powers on the facts of each case. 22. Apart from s 15 of CECO, no authorities have been cited in support of the proposition that a dispute between a solicitor and a client on fees is not an arbitrable matter. There is nothing in the Ordinance, or in Cap 159 , which either prohibits such a dispute from being referred to arbitration, or which exclusively reserves such disputes for resolution by the Courts. 23. On the other hand, Counsel for the Firm rely on the decisions of the English and Canadian Courts of Appeal in Assaubayev v Michael Wilson & Partners Ltd [2014] 6 Costs LR 1058, and Jean Estate v Wires Jolly LLP [2009] OJ No 1734, to argue that there is no public policy that disputes on solicitors’ fees cannot be decided by arbitration. 24. In Assaubayev v Michael Wilson & Partners Ltd , the Court was concerned with an application to stay taxation related proceedings in respect of a retainer letter signed by the appellant in the case to engage the respondent to act as its legal adviser. The Court of Appeal reviewed its supervisory jurisdiction over solicitors, and considered whether it would be contrary to public policy for matters relating to legal fees claimed to be decided in arbitration. At para 64 of the judgment, the Court noted: “I see no good reason why (the respondent) should be disentitled to rely on the arbitration clause - an agreement separate to that contained in the body of the Retainer - because the appellants allege that (the respondent) is unable to claim any fees on account of illegality; nor why, as a matter of construction, the clause should be inapplicable. There is nothing illegal about the right to have disputes referred to arbitration and the arbitrator is well able to decide whether the appellants’ illegality points are well founded. The critical question is whether, on the present assumptions, a stay should have been refused because it would be contrary to the public interest for matters to be decided in the arbitration when they were also part of the subject matter of the court’s supervisory jurisdiction. The appellants submit that the effect of the state ordered by the judge is to “bifurcate” the court’s supervisory jurisdiction, so that it is, in effect, partly subcontracted to the arbitrator. If the court is to exercise that jurisdiction it will need to determine whether (the respondent) has acted unlawfully, which will in part depend on the facts. … These are not in my judgment valid objections. There are some circumstances in which a dispute may not be arbitrable. A statutory provision or a rule of public policy may, in rare circumstances, render an arbitration agreement ineffective in so far as it purports to bind the parties to an arbitral determination of the issues sought to be referred. In such a case the arbitration agreement would - per Longmore LJ in Fulham Football Club (1987) Ltd v Richards [2017] Ch 333 (para 97) - be either “null and void” or, perhaps, “inoperative” within the meaning of s 9 (4) of the 1996 Act. I can, however, see no valid reason why in this case the public interest should require the arbitrator not to consider the issues that have been referred to him. These are, in essence, the legality of (the respondent’s) actions (including whether the Retainers are champertous), the effect of any such illegality on the recoverability of costs and, if relevant, the reasonableness of the costs claimed. These issues are covered by the terms of the arbitration agreements and well within an arbitrator’s reach. As the judge rightly held (para 205) the relief sought (cancellation or an assessment) is not such as to render the claims incapable of arbitration. The fact that the arbitrator cannot exercise the court’s supervisory jurisdiction is no reason to refuse a stay. No one is asking him to exercise that jurisdiction. In any event, the fact that an arbitrator cannot give all the remedies which a court could give does not afford any reason for treating an arbitration agreement as of no effect: Fulham Football Club (para 103). I do not regard the language of bifurcation or other similar expressions as apt. The fact that the consideration by the court whether to exercise his own jurisdiction might cover some of the same ground as that of the arbitrator does not mean that in staying the claims the court is ceding to the arbitrator any part of its jurisdiction. The arbitrator is carrying out a function of his own. Prima facie the arbitrator’s findings would bind the parties but it may be that the doctrine of issue estoppel (whose operation can be prevented in special circumstances) is inapplicable in so far as the appellants seek to invoke the court’s own jurisdiction, and, in any event, no decision of the arbitrator can foreclose the decision of the court itself as to the exercise by it of its jurisdiction.” 25. The Court of Appeal in Assaubayev accordingly held that there was no public policy which prevents matters relating to legal fees of solicitors subject to the supervision of the courts from being decided by arbitration. 26. With respect, the observations made by the Court of Appeal in Assaubayev apply with equal force to the present case, in the context of the Hong Kong Court’s supervisory jurisdiction over the Firm, the reference of the present dispute between the Firm and CF and GA with regard to the professional fees claimed by the solicitors, and the relevant provisions of Cap 159 dealing with taxation of the Firm’s bills. First and foremost, the dispute between the Firm and CF and GA as to the fees charged by the Firm for work carried out under the 2 Letters of Appointment, and whether such fees are reasonable, or were duplicative and amounts to overcharging, fall squarely within the scope of the Arbitration Clause: as a dispute, controversy or claim which arises out of, and relate to, the contract between the Firm and CF/GA for professional services; and as a claim for sums payable thereunder. I see no basis to find that the subject matter of such a claim or dispute is not arbitrable (apart from the CECO argument, which is dealt with below), or to rule that the arbitrators cannot be asked to consider and decide on the issues referred to them in the arbitration, as to (for example) whether the retainer agreement between the Firm and CF/GA is valid, whether the fees were properly chargeable by the Firm, whether the work to which the fees relate was performed by the Firm, and whether the fees were reasonable. Any tortious claim by CF and GA as to the Firm’s negligence in rendering its advice is likewise within the scope of the Arbitration Clause, as a claim which relates to or arises under the retainer, which cannot be said to be entirely unrelated to the Letters of Appointment (see Getwick Engineers Ltd v Pilecon Engineering Ltd HCA 558/2002, 28 October 2002 and Xu Yi Hong v Chen Ming Han HCA 1109/2005, 3 October 2006). The fact that such a dispute is referred to and decided by an arbitral tribunal does not mean that the Court has lost, and cannot exercise, its supervisory powers over the Firm. If CF and GA have any cause for complaint against the Firm as they allege under Cap 159 , they may still make any application to the Court as they may be advised, to seek any appropriate order from the Court to address the conduct of the Firm, in reliance upon any findings made by the tribunal in its final award. 27. The “control” initially relied upon by CF and GA by reference to ss 59 and 60 of Cap 159 , as to agreements for the remuneration of solicitors for contentious work, by gross sum or salary and at a greater or less rate than that at which the solicitor would otherwise have been entitled to be remunerated, and the power of the Court to declare such agreements to be unfair or unreasonable and therefore void, do not apply to the Letters of Appointment in this case. The Firm is charging for its professional services at the usual and normal hourly rates of its solicitors. 28. It is pertinent that in the arbitration commenced by the Firm against CF, the arbitrator already indicated that since the nature of the dispute between the Firm and CF is a taxation matter, he would be proceeding on the basis of taxation of the Firm’s bills. In accordance with the directions made by the arbitrator, the Firm has filed a Statement of Claim in the arbitration, with a bill of costs in a form used for the purposes of taxation in the Courts. I accept the submissions made on behalf of the Firm, that CF and GA would not lose any benefit, or statutory protection or right, affecting the dispute on the fees, merely by the reference of the dispute to arbitration. The taxation referred to in s 67 of Cap 159 , which is the benefit and protection claimed by CF and GA, simply refers to the solicitor’s bills being “taxed” by a “taxing officer”. It is open to an arbitrator to apply the principles of taxation set out in Order 62 RHC in the independent taxation or assessment of the fees charged by the Firm and which are in dispute. Order 62 defines “taxed costs” to mean simply “costs taxed in accordance with the taxation provisions of the Rules of the High Court ”. The fact that Order 62 defines “taxing master” as the Registrar of the Court, when taxation is carried out by the Court, does not mean that the tribunal cannot, as an independent decision maker, assess the reasonableness or recoverability of the solicitor’s costs. As Leading Counsel for the Firm highlighted, s 70 of the Ordinance provides that an arbitral tribunal may, in deciding a dispute, award any remedy or relief that could have been ordered by the Court if the dispute had been the subject of civil proceedings in the Court. The identification of the Registrar as the taxing officer under the taxation mechanism when it is carried out by the Court does not, by itself, exclude arbitration over the solicitor’s fees, if that was the mechanism agreed between the client and the solicitor. 29. The Firm further relies on the decision of the Ontario Court of Appeal in Jean Estate v Wires Jolly LLP [2009] OJ No 1734, in which the Court held that there is no Canadian public policy which entails that a solicitor and his clients cannot agree to have an arbitrator to hear the dispute concerning a contingency fee arrangement, notwithstanding that statute may have conferred protection provisions on the client. Referring to the relevant provisions in the Solicitors Act which provide that every question regarding the validity or effect of a written retainer agreement may be determined on application to the Superior Court, and that the Solicitors Act provides a comprehensive code for the assessment of contingency fees, the Court of Appeal referred to various authorities and continued, at para 72 of the judgment: “ The legislature was merely identifying the courts with the judicial system that would have jurisdiction to hear the dispute; it was not excluding arbitration over a particular subject matter. Arbitration, although not part of a state’s judicial system, is still, in a broad sense, part of a legitimate dispute resolution system that has been fully recognized by legislative authorities: see Desputeaux at para 40. Given the strong policy of deference afforded to arbitration agreements, and following the line of reasoning in Desputeaux , I would hold that, simply because the Solicitors Act refers to a Superior Court judge as having the jurisdiction to protect clients’ rights, this does not mean that disputes arising between the solicitor and a client may not be submitted to arbitration. The Act simply identifies the person within the judicial system empowered to make a decision. The right to have an independent decision maker who can interpret the agreement and make a decision respecting a contingency fee dispute is preserved through arbitration and hence the public policy of the Act, the provision of the forum for legitimate dispute resolution, is not undermined …” (Emphasis added) 30. I would agree that the taxation procedure contained in Cap 159 , and references therein to taxation by a Master of the Court, identify one method of assessment of the reasonableness of the fees payable by a client to its solicitor, but the existence of such a procedure does not mean that disputes between the client and the solicitor as to the latter’s fees may not be submitted to arbitration, or that upholding arbitration agreements between the solicitor and the client would be so repugnant to fundamental notions of morality and conscience as to render it contrary to public policy to enforce an otherwise valid arbitration agreement. 31. If the award made by the arbitrator on the dispute over the Firm’s fees can in any way be challenged under the Ordinance, on the exclusive grounds set out therein, it is of course still open to CF and GA to make the necessary application to the Court, to set aside the award and/or to seek any appropriate relief. The Court is not entirely excluded in the arbitral process, to ensure the observance of the necessary and basic safeguards required to preserve due process. 32. I shall deal with CECO separately, but the fact that there is statutory control over arbitration clauses for protection of consumers in their transactions to which s 15 CECO applies, fortifies the conclusion that there is no necessity to recognize a general public policy against the recognition and enforcement of all arbitration agreements made between a solicitor and a client in respect of professional fees. 33. Even if I was wrong, and the Firm should not be permitted to contract out of the taxation procedure identified in s 60 of Cap 159 , I consider that there are equally important public policy considerations, not to permit parties to retract from and break a clear written agreement whereby they accepted that their disputes should be referred to arbitration, and of upholding obligations under international conventions to enforce arbitration agreements. Weighing these different policy considerations, the balance is clearly tilted towards enforcing the Arbitration Clause in this case, when the arbitrator has indicated that the arbitration between the Firm and CF will proceed as taxation under Cap 159 . The tribunal in the arbitration against GA is equally able to independently and objectively assess the reasonableness of the fees charged by the Firm, so as to protect GA from being abused by the Firm in overcharging, or charging without a proper basis. 34. The fact that the arbitral tribunal has been asked to decide issues relating to the dispute on the fees payable under the Letters of Appointment certainly does not preclude the Law Society from exercising any of its disciplinary powers over the Firm, in respect of any matter for which there is ground for complaint to be made to the Law Society. Issues decided by the tribunal may be referred to and considered by the Law Society. If, for example, the tribunal should find that the fees of the Firm are unreasonable, or were improperly incurred, so as to disallow them in the award or to allow them only with huge reductions, it is open to CF and GA to refer the matter and the decision of the tribunal to the Law Society, on the ground that the Firm had overcharged, and was in breach of the Code. The Law Society may then take such action as it may deem fit in respect of any misconduct or breach of the Code on the part of the Firm. 35. For all these reasons, I find that there is no public policy reason to rule the Arbitration Clause to be null and void, or inoperative. Whether Arbitration Clause unenforceable under CECO 36. The CECO contains a form of limited control over arbitration clauses. Section 15 (1) of CECO states: “ As against a person dealing as consumer , an agreement to submit future differences to arbitration cannot be enforced except- (a) with his written consent signified after the differences in question have arisen ; or (b) where he has himself had recourse to arbitration in pursuance of the agreement in respect of any differences.” (Emphases added) 37. “Consumer” is defined in s 4 (1) of CECO, as follows: “A party to a contract “ deals as consumer ” in relation to another party if – (a) he neither makes the contract in the course of a business nor holds himself out as doing so ; (b) the other party does make the contract in the course of a business; (c) in the case of a contract governed by the law of sale of goods or by section 12, the goods passing under or in pursuance of the contract are of the type ordinarily supplied for private use or consumption.” (Emphases added) 38. The Firm accepts that it bears the burden of proving that CF and GA were not dealing as consumers vis-à-vis the Firm (s 4 (3), CECO). 39. I reject the submission made by CF and GA, that the case of Clyde & Co (a firm) v Maranta Enterprises Ltd , HCA 752/2002, unreported, 3 May 2002 can be taken as authority for the proposition that clients of solicitors are necessarily “consumers” of legal services within the meaning of CECO. The case did not concern s 15 of CECO, or the definition of “consumer” under s 4 (1) of CECO, at all. In its judgment, the Court was simply referring generally to “consumers of legal services”, in a descriptive sense. 40. In the context of construing s 15 and the purposes and legislative intent of CECO, Counsel have referred to the report of the Law Reform Commission on The Control of Exemption Clauses in December 1986 (“ Report ”), which Report made recommendations which were closely followed when the Control of Exemption Clauses Bill 1989 (“ Bill ”) was passed. The main purpose of CECO was to control the use of exemption clauses and clauses which restrict liability for breach of contract or negligence, or deny the legitimate rights of a party to a contract. Concepts of reasonableness and fairness underpin CECO, for the protection of “weaker” or less sophisticated parties dealing as consumers, who may have contract conditions imposed on them by counter-parties who are in a stronger bargaining position. There had apparently been debate and discussion as to whether the control of exemptions should extend to arbitration clauses generally. 41. According to the Official Report of Proceedings dated 31 May 1989, during the first reading of the Bill, the Attorney General had explained: “The Law Reform Commission concluded that the use of exemption clauses leads to abuse, particularly where the parties to the contract do not have equal bargaining strength. The commission believed that the benefits of some measure of control outweighed any economic disadvantages which may be caused by this limited interference with the freedom of contract. … The Bill would also prevent arbitration clauses from being enforced against a consumer unless the consumer consented to its enforcement after differences had risen, or the consumer had recourse to arbitration in pursuance of the agreement. The Administration supports the use of arbitration by parties to a contract who consciously choose that method of dispute resolution in the knowledge of all its implications. However, in the case of a consumer contract, it is possible that the consumer agreed to an arbitration clause either without knowing of its existence or without realizing its implications. The consumer may then discover that it is much more costly for him to refer a dispute under the contract to arbitration than it would be for him to refer it to the courts. For these reasons the Administration supports the recommendation of the Law Reform Commission that arbitration clauses in consumer contracts be subject to a form of control.” 42. Counsel for the Firm emphasized that the control imposed and the protection intended to be conferred under CECO was on the basis of a consumer being vulnerable, with unequal bargaining power, and CECO is concerned with addressing the unfairness of terms being imposed by small print on such a vulnerable consumer, in the absence of negotiations. 43. On the evidence filed in this case as to CF’s business background, his extensive work and brokering experience, his dealings with lawyers and professionals in the course of his businesses and work, it is in my judgment highly unreal to suggest that CF and GA (whom CF represents) were vulnerable or unsophisticated parties, with no or little bargaining power, when they were dealing with the Firm. In these modern times and in the business climate prevailing in Hong Kong in the past decade, it is artificial to believe that clients who deal with solicitor firms in this competitive legal environment in Hong Kong have no bargaining power, when solicitors’ fees and the terms of their retainers are being negotiated. Distinction must also be made between a client who is not aware of the provisions of a contract imposed on him because he was not given the reasonable opportunity to read and was unable to understand them, and one who is not aware of such provisions simply because he chose not to read the contract, or to have the provisions explained to him, despite having been given a fair and reasonable opportunity to do so. The present case is not a situation of a lone, desperate widow being ousted from her home and seeking legal advice, nor a case of an injured employee on legal aid seeking recovery of damages from his employer, who may have little bargaining power in the terms of obtaining legal assistance. On the evidence, CF had been assisted by different lawyers and professional advisers on transactions in which he had been involved, for himself and for GA, the suit against SFH being only one of the matters on which he sought legal advice from solicitors. According to the evidence of the Firm’s Wai Yip Hin (“ Wai ”), CF was even able to lead the direction of the Tenancy Proceedings, by questioning the authority of the plaintiff to sue, which led to the action being struck out. 44. According to the Firm, the Letter of Appointment for GA had been retained by CF for over a month after it was sent to him on 10 December 2015. He had had sufficient time to review the provisions of the Letters of Appointment. On behalf of the Firm, Wai claims that he had, at meetings held with CF in December 2015 and January 2016, explained the Arbitration Clause and the benefits of arbitration to CF, although this is denied by CF. At this stage, I accept the evidence of Wai. The portrayal of CF as a vulnerable, ignorant and hoodwinked client in these proceedings are, as Wai highlighted, contradicted by CF’s own evidence and assertions made for the purposes of the SFH Proceedings. In the SFH Proceedings, CF claims that he had been fully and ably involved in the management of the affairs of SFH. In an email dated 25 May 2013 produced in evidence in the SFH Proceedings, CF had claimed: “I have years of business experience and I have learned to deal with the most difficult and sensitive problems/issues which is why my advice is frequently sought by many therefore DON’T PUSH ME or force me to resort to very firm/tough but legal actions in order to rectify things…” A subsequent email dated 17 October 2013 from CF also supports Wai’s claim, that CF is a prudent and careful businessman who would not sign any important document without first understanding its nature and effect. 45. I agree with the Firm, that CF’s own evidence in the SFH Proceedings does not support his claims of being an unsophisticated and inexperienced client, misled into agreeing to the Arbitration Clause, without any bargaining power, in the course of his dealings with the Firm. 46. On behalf of CF and GA, counsel referred to the Law Reform Commission of Hong Kong’s report on class actions dated May 2012, and to s 3 of the Unconscionable Contracts Ordinance (“ UCO ”), which contains nearly identical provisions as those of s 15 of CECO. Counsel highlighted the observations made by the Law Reform Commission on s 3 of UCO, that “consumer” is defined there “by virtue of the specific transaction in question”. The report states: “An individual is not defined as “a consumer” for all purposes and all times. Rather, an individual is treated as “dealing as consumer” in respect of the specific transaction if he satisfies the terms of section 3. It is possible that an individual may be treated as a consumer in respect of one transaction and not another. It is equally possible that a corporate entity may “deal as consumer” in certain circumstances. What is necessary to satisfy the terms of section 3 is that one party did not make the contract “in the course of the business” (and the other did) and that the goods or services involved are “of the type ordinarily supplied or provided for private use.” 47. I agree, that an individual may not be a “consumer” for the purposes of CECO for all purposes and all times, and that whether such a party is to be treated as dealing as consumer in respect of a specific transaction depends on whether he can, for the specific transaction in question, satisfy the terms of s 4 of CECO. An individual client instructing solicitors to prepare a will, or to act in divorce proceedings, may be dealing as a consumer in respect of these specific transactions. However, it does not follow that he will be treated as dealing as a consumer in respect of all transactions with solicitors, irrespective of the nature of the transaction. 48. In R & B Customs Brokers Co Ltd v United Dominion’s Trust Ltd [1988] 1 WLR 321 , the English Court of Appeal explained the meaning of the phrase “in the course of business”, as used in the Unfair Contract Terms Act 1977. In the judgment of the Court, Dillon LJ stated (at p 330H-331B): “This reasoning leads to the conclusion that, in the Act of 1977 also, the words ‘in the course of business’ are not used in what Lord Keith called ‘the broadest sense’. I also find helpful the phrase used by Lord H Parker CJ and quoted by Lord Keith, ‘ an integral part of the business carried on ’. The reconciliation between that phrase and the need for some degree of regularity is, as I see it, as follows: there are some transactions which are clearly integral parts of the businesses concerned, and these should be held to have been carried out in the course of those businesses ; this would cover, apart from much else, the instance of a one-off adventure in the nature of trade, where the transaction itself would constitute a trade or business. There are other transactions , however, such as the purchase of the car in the present case, which are at highest only incidental to the carrying on of the relevant business; here a degree of regularity is required before it can be said that they are an integral part of the business carried on, and so entered into in the course of that business .” (Emphasis added) 49. At all material times, GA’s objects and business interests were the investment in and the holding of 46.67% of the share capital of SFH. Through CF, GA is said (by CF in the SFH Proceedings) to have actively participated in the management of SFH, at both the shareholders and board levels. The Firm was engaged by GA under the Letter of Appointment, to act on behalf of GA in its disputes with the PK Camp relating to the management and control of SFH. The SFH Proceedings were commenced by GA in order to enforce its rights as shareholder of SFH, and importantly, to preserve and protect its business interests and investments in SFH, as well as its right to participate in the business and management of SFH through CF. Adopting the test set out in R & B Customs, I agree with the Firm that GA’s instruction and appointment of the Firm in the commencement and conduct of the SFH Proceedings was an integral part of the business carried on by GA. As such, GA made the contract with the Firm (evidenced by the Letter of Appointment) in the course of its business, and was not dealing as consumer in respect of that contract. 50. As for CF, the Letter of Appointment was for the instruction of the Firm in the matter of the Tenancy Proceedings instituted by the landlord against CF as tenant. The plaintiff in the Tenancy Proceedings and one of the landlords were companies owned and controlled by the PK Camp of SFH. The Tenancy Proceedings related to CF’s tenancy and occupation of commercial premises used as an office for his businesses of handling the affairs and investments of GA in the participation of the management of SFH, and for conducting and transacting the deals brokered by CF as part of his own business. The occupation and use of the office premises was part of the conduct of the business of CF and GA, being necessary for and incidental to such business, and the Tenancy Proceedings relate to the payment of rent and the right to occupy the premises. On such facts, I accept that CF’s appointment of the Firm to act for him in the Tenancy Proceedings and in all matters relating and/or incidental thereto, formed an integral part of the business carried on by CF. His agreement with the Firm, as evidenced by the Letter of Appointment dated 6 September 2016, was made in the course of CF’s business, and he was not dealing with the Firm as consumer in respect of such engagement. 51. On my findings, the control set out in s 15 of CECO does not apply to the Arbitration Clause. It is therefore not necessary to consider whether there is written consent signified by CF and GA to submit the differences to arbitration after such differences have arisen. If I were wrong on the application of CECO, I would have found that by confirming his agreement by email on 22 June 2017 to the appointment of the arbitrator, and stating his intention to file a defence, CF at least had consented in writing to the submission of the dispute to arbitration. It was only on 8 August 2017, after serving his Answer in the arbitration, that CF indicated that he had issued legal proceedings and that his arbitration with the Firm should be stayed. Conclusions 52. There is a prima facie arbitration agreement between the Firm, CF and GA. Unless the matter is clear, that there is no such agreement, or that such agreement is null and void, or incapable of being performed, the action should be stayed to arbitration. The authorities are clear ( PCCW Global Ltd v Interactive Communications Services Ltd [2007] 1 HKLRD 309 ; Polytec Overseas Limited and anr v X HCA 2766/2016, 22 March 2017). On the evidence before me, there is no basis to find such agreement to be null or void, inoperative or incapable of being performed. Accordingly, it is mandatory for the Court to stay these proceedings to arbitration under s 20 of the Ordinance, and I make such an order. 53. These proceedings were commenced by CF and GA after the Firm had commenced arbitration and had served notice of arbitration on CF and GA respectively. If they dispute the jurisdiction of the tribunal or the validity of the Arbitration Clause, they could have raised such challenge before the tribunal. Despite having agreed to the appointment of the arbitrator (on 22 and 30 June 2017) and seeking an extension of time from the arbitrator to file his Answer, CF commenced these proceedings in August 2017, for a declaration that the Arbitration Clause is void, for taxation by the Court and to stay the arbitration. I agree that such proceedings are totally unnecessary, when he could have raised the challenge to the jurisdiction of the tribunal and the validity of the Arbitration Clause in the arbitration itself. Any finding by the tribunal as to its jurisdiction can then be reviewed by the Court, under s 34 (1) (3), or s 81 (1) (2) (a) (i) or (iii) of the Ordinance, as may be applicable. 54. GA in fact requested the arbitrator in July 2017 to deal with its jurisdiction challenge as a preliminary issue in the Firm’s arbitration against GA. It nevertheless commenced these proceedings in August 2017, without waiting for the arbitrator’s preliminary award, which was issued on 27 November 2017 (dismissing GA’s challenge on jurisdiction). Bifurcation of proceedings in this way only served to waste time and expenses, in contradiction to CF’s claim of his desire to avoid the costs of arbitration as opposed to taxation by the Court. 55. The object and principles of the Ordinance (stated in s 3) are to facilitate the fair and speedy resolution of disputes by arbitration without unnecessary expense, and that the Court should interfere in the arbitration of a dispute “only as expressly provided for in the Ordinance”. It would be contrary to such object and principles if the Court should entertain an application for the determination of the validity of an arbitration agreement after arbitration has commenced and before the tribunal makes a preliminary or final decision on its jurisdiction, outside the regime set out in ss 34 and 81 of the Ordinance. Even if (as argued on behalf of CF and GA) there is any concurrent jurisdiction on the part of the Court to rule on the existence and validity of the arbitration agreement, such jurisdiction should very rarely be exercised when an arbitration has already been commenced, a tribunal constituted, and the challenge to the agreement can be determined by the tribunal as a preliminary issue, as in this case. 56. The application by originating summonses in these proceedings are dismissed, for all the reasons set out in the preceding paragraphs. There are no merits in the resistance to the application for stay of these proceedings to arbitration, and I grant the stay with an order nisi that the costs of and occasioned by the application for stay, and the costs of and occasioned by the dismissal of the originating summonses, be paid by CF and GA on an indemnity basis, with certificate for 2 counsel. 57. As explained by the arbitration judge in A v R (Arbitration: Enforcement) [2009] 3 HKLRD, parties should be entitled to expect that the Court will enforce arbitration agreements and arbitral awards made pursuant thereto as a matter of course. Challenges to the Courts should be exceptional events. Hence, a party who takes an exceptional and high-risk strategy to challenge the validity of either an arbitral award or an arbitration agreement will have to take the risk and accept the higher costs consequences of its action, namely, costs on an indemnity basis. This is only consistent with the objectives of the Ordinance and those of the CJR. (Mimmie Chan) Judge of the Court of First Instance High Court Mr Kelvin Liu and Mr Raymond Chu, instructed by Lily Fenn & Partners, for the plaintiff [under both HCMP 1699/2017 & HCMP 1700/2017] Ms Audrey Eu SC and Ms Jacqueline Law, instructed by Henry Wai & Co, for the defendant [under both HCMP 1699/2017 & HCMP 1700/2017] Look up this case on Lawcite Noteup",
  "length": 47894,
  "headers_seen": [
    "Is there a prima facie valid arbitration agreement",
    "The Court’s supervisory powers over solicitors and whether Arbitration Clause contrary to public policy",
    "Whether Arbitration Clause unenforceable under CECO",
    "Conclusions"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2018/31",
  "query": "costs of arbitration",
  "ts": "2025-10-16T10:45:21",
  "ok": true
}