{
  "title": "HKSAR V. CHAN YIU MING | [1999] HKCFI 151 | HKLII",
  "court": null,
  "year": 1999,
  "date": null,
  "content": "HKLII Databases Court of First Instance [1999] HKCFI 151 HKSAR V. CHAN YIU MING Judgment Information Date 22 Nov, 1999 Action No. HCMA603/1999 Neutral Cit. [1999] HKCFI 151 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCMA603/1999 HCMA000603/1999 HKSAR v. CHAN YIU MING HCMA000603/1999 HCMA 603/1999 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE (Appellate Jurisdiction) MAGISTRACY APPEAL NO. HCMA 603 OF 1999 (On Appeal from NKCC 913/99) ____________ BETWEEN HKSAR Respondent AND CHAN YIU MING Appellant ____________ Coram: The Hon. Madam Justice Beeson in Court Date of Hearing: 23 November 1999 Date of Judgment: 23 November 1999 ______________ J U D G M E N T ______________ 1. This Appellant was found guilty after trial of one count of Attempting Theft, which was a pickpocketing, and one count of Assault Occasioning Actual Bodily Harm. Originally the Magistrate sentenced him to 12 months' imprisonment in total in respect of those counts, but on review that was reduced to 6 months' imprisonment for the Attempted Theft and 1 month imprisonment for Assault Occasioning Actual Bodily Harm. The sentences were to be concurrent, making a total of 6 months' imprisonment. 2. The Appellant originally appealed against conviction and sentence in respect of both counts. Today he advised the court he did not wish to appeal against conviction in respect of the Assault Occasioning Actual Bodily Harm, but wished to proceed with his appeal in respect of the conviction for Attempted Theft. 3. I took it, although Appellant did not expressly say so, that he was not withdrawing the appeal against the sentence in respect of the assault occasioning actual bodily harm. I was sure the Appellant wished to appeal the conviction and sentence in respect of the Attempted Theft. There were no grounds of appeal put before me apart from general references to evidence that had already been canvassed at some length before the Magistrate. The Appellant, who represented himself on the appeal, had been represented at trial. 4. The Appellant complained that the Magistrate failed to consider that the train compartment at the time of the alleged offence was particularly crowded and had not taken into account the fact that Appellant had no intent to steal, or that he had a permanent job which would make it unlikely that he would become involved in a theft on the train. The Appellant said that it was not fair that the Magistrate had accepted the evidence of the victim and as there was no independent evidence he should not have been convicted at all. Although Appellant agreed that he had run off after the incident, he said this was because he was anxious to get to work where he was participating in a staff bonus scheme for early attendance and regular attendance. 5. He also complained generally that he had not been dealt with fairly by his defence lawyer who had been supplied by the Duty Lawyer Scheme. The complaint appeared to be that his representative had sought an adjournment for the purpose of dealing with his personal affairs, rather than for the purposes of Appellant's proper defence. However, there is no evidence from the papers before me that substantiates such a complaint or that, even if it could be, it affected Appellant's defence. I advised the Appellant that if he had any complaint about the duty lawyer he should make a complaint to the Duty Lawyer Scheme, or the Law Society. 6. None of the matters raised by the Appellant indicated that the Magistrate erred in finding him guilty of the two charges. I dismiss the appeal against the Attempted Theft and note that the appeal against the conviction for Assault Occasioning Actual Bodily Harm has been withdrawn. 7. In respect of his appeal against sentence on both charges, the Appellant said that as he was a first offender he should have been given credit for that. I note that the Magistrate was well aware of the fact and had sought both C.S.O. and Probation reports. The Appellant told the court that he had to care for his girlfriend who is in a coma; that matter was before the Magistrate also. Other grounds Appellant suggests for suspending the sentence are the difficulties caused by his losing his job and his having to care for his mother. Again these matters had been put before the Magistrate; he took both into account on sentence. 8. I note the normal sentence for an offence of Attempted Theft is in the region of 12 to 15 months' imprisonment. The Magistrate, on review, cut the original sentence of 12 months to 6 months' imprisonment. The Magistrate did not consider there were any grounds that would justify his suspending the sentences and I agree with him. The appeal against the sentences is dismissed. (C-M. Beeson) Judge of the Court of First Instance Representation: Mr. P.K. Madigan, S.G.C. for D.P.P. CHAN Yiu-ming, Appellant, in person Look up this case on Lawcite Noteup",
  "length": 4959,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/1999/151",
  "query": "assault occasioning actual bodily harm",
  "ts": "2025-10-17T10:41:15",
  "ok": true
}