{
  "title": "CHAN HO FONG V. CHAN FAT SHUI | [2003] HKCA 319 | HKLII",
  "court": null,
  "year": 2003,
  "date": null,
  "content": "HKLII Databases Court of Appeal [2003] HKCA 319 CHAN HO FONG V. CHAN FAT SHUI Judgment Information Date 23 Dec, 2003 Action No. CACV291/2003 Neutral Cit. [2003] HKCA 319 Parallel Cit. [2004] 2 HKLRD 245 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History CACV291/2003 CACV000291/2003 CHAN HO FONG v. CHAN FAT SHUI CACV000291/2003 CACV 291/2003 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF APPEAL CIVIL APPEAL NO. 291 OF 2003 (ON APPEAL FROM FCMC NO. 9989 OF 2002) _______________________ BETWEEN CHAN HO FONG nee HO FONG Petitioner AND CHAN FAT SHUI Respondent ______________________ Coram: Hon Cheung JA and Yeung JA Date of Hearing: 18 December 2003 Date of Judgment: 24 December 2003 __________________ J U D G M E N T __________________ Hon Yeung JA (giving Judgment of the Court): 1. The Petitioner, Chan Ho Fong (the wife) petitioned for a divorce against the Respondent, Chan Fat Shui (the husband) in August 2002 on two years' separation together with an application for ancillary relief. The petition is being contested. 2. There are 4 adult children to the family but they no longer require any support. 3. The wife is 47 years' old and is a full time housewife. She resides in the former matrimonial home (mortgage free). 4. The wife issued a summons seeking maintenance pending suit. 5. On 9 December 2002, HH Judge Geiser in the Family Court adjourned the hearing for maintenance pending suit to a date to be fixed. The judge further ordered the husband to pay the wife an interim sum of $6,000 per month and the monthly outgoings of the former matrimonial home of just over $1,000. 6. In the affirmation filed in support of her application for maintenance pending suit, the wife suggested that she required a monthly maintenance of about $15,000. She set out her financial position and explained why she needed $15,000 per month. 7. The husband had filed an affirmation in response. He set out his assets together with details of his bank and credit card accounts. The wife's solicitors then raised two questionnaires dated 19 February 2003 and 19 March 2003 seeking further and better particulars. 8. The wife had not applied for the application for maintenance pending suit or the divorce to be restored or heard. 9. Instead, the wife took out two summonses dated 13 and 26 of March 2003 respectively seeking further and better particulars to various questions of the wife's questionnaires. 10. At a hearing on 3 April 2003, Judge Geiser by consent, ordered the husband to provide information within 7 days of some of the particulars requested by the wife and adjourned the hearing for argument. He also reserved the question of costs. 11. The position of the husband at some stage appeared to be that he was in any event capable of meeting the reasonable need of the wife and therefore the request for the further particulars was unnecessary. 12. At the adjourned hearing on 11 July 2003, Judge Geiser dismissed the two summonses. The judge took the view that on maintenance pending suit, the issue was the wife's immediate need and not the affordability of the husband. In the circumstances, the particulars requested for were not relevant, at least not at that stage. 13. The judge did indicate that the wife was entitled to the requested particulars. The implication was that such particulars would be relevant at the final maintenance stage. 14. However the judge went on to make an order requiring the husband to pay maintenance pending suit of $10,000 per month plus outgoings for the matrimonial home even though there was no such application before him. He also made no order as to costs. The judge had not dealt with the reserved costs order for the hearing on 3 April 2003. 15. The husband now appeals against Judge Geiser's order of 11 July 2003. 16. Mr. Chan, on behalf of the husband makes two simple points: (1) the hearing on 11 July 2003 was confined to the hearing of the two summonses for particulars and there was no warning at all that the issue of maintenance pending suit would be dealt with; and (2) having dismissed the wife's summonses, the judge should have ordered costs against her. 17. There can be no doubt that it was not the wife's intention to apply for the maintenance pending suit by the 2 summonses in question. It appeared to be the wife's intention to seek the further and better particulars on the basis that such particulars would assist her case, including the application for maintenance pending suit. 18. Indeed in the course of the hearing of the 2 summonses, counsel for the wife said in no uncertain terms: \"..because we thought that at the present moment we deal with only further and better particulars requiring the...only put in the respondent's affirmation.\" 19. Counsel were not prepared and had been not invited to make submissions on the question of variation of maintenance pending suit. 20. It is true that the Matrimonial Proceedings and Property Ordinance Cap. 192 gives the court an unfettered discretion to vary an order for maintenance pending suit and in the exercise of the discretion, the court can adopt a broad-brush approach. 21. But in our adversarial system, the court's power can and should only be exercised on applications by the parties. 22. The wife had not yet requested for the application for maintenance pending suit to be heard. 23. We have no doubt that out of the concern for the way in which the case had been conducted and in order to save time and money, the judge raised the issue of maintenance pending suit at the hearing on 11 July 2003 although it was meant to be a hearing of the summonses for particulars. 24. If that was his intention, the judge should have made his intention known to the parties and sought their views on the matter. It the parties agreed to the suggested course, the issue could then be dealt with. 25. The judge might have hinted, in the course of the hearing that he was considering the question of maintenance pending suit. However, he had not made clear his intention to the parties. He had not sought consent from the parties to enable him to deal with the matter. 26. It is perhaps helpful to set out the relevant dialogues between counsel and the judge in the course of the hearing: \" Court: I mean, I could make-what I could do right now is simply make an order for maintenance pending suit. Dismiss this application, make an order for maintenance pending suit and that's the end of it. Mr. Chan: I understand, your Honour, that there is at least temporarily an order for Maintenance pending suit. Court: I can simply... Mr. Chan: Vary it. Court: I can increase that right now. Put your heads together and think about it. ......................................... Mr. Chan: Your Honour, I'm unable to be bearer of any good news. Court: No, well, carry on then. ....................................................... Mr. Chan: He can afford 10,000. Court: ..he can afford 10,000. Mr. Chan: Yes, Is she going to get more than 10,000? I don't know. I don't know. She's asking for 15. She used to get 8. I don't know.\" 27. Ms. Tsui, counsel for the wife emphasizes on the concession made by the husband at the hearing that he was able to pay an interim maintenance of at least $10,000. Ms. Tsui may well be right. 28. But as the judge had rightly identified, the issue was not the affordability of the husband. The issue was the wife's immediate need. There was no concession on this issue (the immediate need of the wife). The parties clearly could not agree on the issue. The judge had also made no finding on the issue although in his judgment, he suggested that $15,000 asked for by the wife was only slightly excessive. 29. Such informal finding was not based on proper and/or comprehensive evidence and/or as assisted by submissions from the parties. 30. Indeed, Mr. Chan points out to us that had the husband been given the chance, he would have put in a further affirmation showing that his affordability had been significantly reduced because of the SARS incident. 31. Ms. Tsui points out that the husband had been paying $7,000 a month and the difference was only about $3,000 to $4,000. Whether $3,000 to $4,000 is a small sum is a matter of opinion. This, however is not too important. The important issue is whether justice has been seen to be done. 32. In our view, by resolving the issue in the summary way as the judge did, it could have resulted in injustice not just to the husband, but to the wife as well. The wife might need and the husband could well afford more than $10,000 a month for her maintenance. 33. In our view, there had been procedural irregularity. The judge should not have dealt with the issue of variation of maintenance pending suit when the issue was not properly before him. 34. It was not good enough for the judge to try to resolve the reasonable need of the wife without the assistance from the parties. 35. If the judge, for whatever reason, wished to deal with the matter, he should have put the suggestion to the parties and invited their comments. He should only deal with the issue if he was assured that the parties agreed to such course and were ready to deal with the issue. 36. By trying to resolve the issue in the manner as the judge did, justice was not done to either party. 37. The order requiring the husband to pay maintenance pending suit in the amount of $10,000 plus outgoings must be set-aside with liberty to the wife to re-apply. 38. The wife was legally aided. This is not a relevant consideration on the issue of costs before us. (See Chan Sau-kut v Gray & Iron Construction [1986] HKLR 84 ) 39. The judge had not given any reason to explain the costs order he made. We have to consider whether there was any basis for the judge to make the order as he did, bearing in mind the question of cost is always a matter of discretion. 40. The judge had clearly found that the content of the husband's affirmation of means inadequate. He found that the wife would be entitled to the requested particulars. 41. There was also an earlier hearing on 3 April 2003 when the husband was ordered to provide some particulars asked for. 42. We are not persuaded that there was no basis for the judge to exercise his discretion by ordering no order as to costs. Such order must therefore be allowed to remain. For the avoidance of doubt, we also order that such costs order covers the costs of the hearing on 3 April 2003 as well. 43. The appeal by the husband is allowed to the extent indicated. 44. This is one of those cases in which the parties could easily have resolved the small difference without the need to spend so much time and costs on an appeal. 45. The procedural irregularity resulting in the appeal is not the fault of the wife. 46. The husband succeeds in the appeal only on one of the two issues that he raises. 47. In the light of the aforesaid factors and in exercising out discretion, we make no order as to costs on the appeal. (Peter Cheung) Justice of Appeal (W Yeung) Justice of Appeal Representation: Ms Jennifer Tsui instructed by Messrs Wong Hui & Co. for the Petitioner. Mr Jeremy S.K. Chan instructed by Messrs Wat & Co. for the Respondent. Look up this case on Lawcite Noteup",
  "length": 11253,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkca/2003/319",
  "query": "maintenance pending suit",
  "ts": "2025-10-16T12:10:48",
  "ok": true
}