{
  "title": "RE THE APPLICATION OF MONICA CARSS-FRISK QC | [2017] HKCFI 598 | HKLII",
  "court": null,
  "year": 2017,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2017] HKCFI 598 RE THE APPLICATION OF MONICA CARSS-FRISK QC Judgment Information Date 4 Apr, 2017 Action No. HCMP415/2017 Neutral Cit. [2017] HKCFI 598 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCMP415/2017 HCMP350/2017 RE THE APPLICATION OF DINAH ROSE QC HCMP 350 and 415/2017 (Heard Together) IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE MISCELLANEOUS PROCEEDINGS NO 350 OF 2017 ________________________ IN THE MATTER of the application of Dinah ROSE QC to be approved, admitted and enrolled as a Barrister of the High Court of the Hong Kong Special Administrative Region for the purpose of a particular case and IN THE MATTER of Section 27 (4) of the Legal Practitioners Ordinance , Cap 159 ________________________ IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE MISCELLANEOUS PROCEEDINGS NO 415 OF 2017 ________________________ IN THE MATTER of the application of Monica Carss-FRISK QC to be approved, admitted and enrolled as a Barrister of the High Court of the Hong Kong Special Administrative Region for the purpose of a particular case and IN THE MATTER of Section 27 (4) of the Legal Practitioners Ordinance , Cap 159 ________________________ Before: Hon Kwan JA (sitting as an additional judge of the Court of First Instance) in Court Date of Hearing: 31 March 2017 Date of Judgment: 31 March 2017 Date of Reasons for Judgment: 5 April 2017 ____________________ REASONS FOR JUDGMENT ____________________ 1. I have before me two applications for the ad hoc admission of overseas counsel, pursuant to section 27 (4) of the Legal Practitioners Ordinance , Cap 159 . One is for the admission of Ms Dinah Rose, QC, for the purpose of advising and appearing for QT, the appellant in CACV 117/2016, in an appeal against the judgment of Au J in QT v Director of Immigration [2016] 2 HKLRD 583 (“the Judgment”). The other is for the admission of Ms Monica Carss-Frisk, QC, who is to act for the Director of Immigration (“the Director”), the respondent in the same appeal. 2. In the hearing before Au J, QT, who is legally aided, was represented by Mr Timothy Parker. The Director of Legal Aid has approved the assignment of Ms Rose to lead Mr Parker in the appeal if her application for admission is granted. Mr Stewart Wong, SC and Ms Grace Chow appeared for the Director in the court below. Shortly after the service of the Notice of Appeal on the director, the Department of Justice began to give consideration to engaging Ms Carss-Frisk, who had previously advised the Director on the case. She will be briefed to lead Mr Wong and Ms Chow in the appeal, subject to the court’s approval of her admission. 3. The appeal is to be heard by the Court of Appeal on 15 and 16 June 2017. I am given to understand that in fixing the hearing dates, account was taken of the diaries of Ms Rose and Ms Carss-Frisk. 4. Both applicants are advocates of the highest standing with immense expertise and experience in public law and human rights, particularly in the context of discrimination, immigration and marriage law, with which the appeal is concerned. Both have appeared in our courts in important constitutional and public law cases. 5. The applications are premised on four grounds. First, the legal issues in the appeal are unusually complex and difficult. Second, the resolution of the issues will have a substantial impact on the local jurisprudence. Third, the case is likely to end up in the Court of Final Appeal. Fourth, each of the applicants is able to bring a significant additional dimension to the case. 6. The Hong Kong Bar Association opposed the applications. It was contended by Mr Jose Maurellet, SC and Mr Jason Yu on its behalf that the appeal does not involve issues of unusual difficulty or complexity, and that the resolution of the issues in the appeal will not have a substantial impact on local jurisprudence. They submitted that local counsel who appeared before Au J had no trouble in advancing their respective cases and are more than capable to conduct the appeal. 7. The Secretary for Justice, who appeared by Mr Russell Coleman, SC and Mr Anthony Chan in these applications in his role as the guardian of public interest in cases involving ad hoc admissions of overseas counsel, supported both applications. 8. After hearing all the parties, I am satisfied that public interest lies in favour of admitting both applicants and made an order in terms of the Notice of Motion in each application. These are the reasons for granting the admissions. The underlying proceedings for judicial review 9. At issue in the appeal is the lawfulness of the Director’s policy in refusing to accord dependency visas to same-sex couples, on the basis that the same-sex partner in a civil partnership is not the “spouse” of the sponsor and is outside the existing dependent policy (“the Policy”). The Director’s case is that the meaning of “spouse” refers only to one whose marriage is a heterosexual and monogamous marriage, as it is the only form of valid marriage recognised under Hong Kong law. 10. QT is a female national of the United Kingdom and had entered into a civil partnership with the sponsor in accordance with UK laws. The sponsor came to Hong Kong on an employment visa, while QT entered on a visitor’s visa. She challenged the Director’s decision to refuse her application for a dependent visa to live and work in Hong Kong (“the Decision”) by way of judicial review. The challenge also attacked the Policy and the constitutionality of the immigration legislation under which the Policy has been adopted. 11. In her application for judicial review, QT claimed that: (1) the Decision and the Policy are discriminatory and Wednesbury unreasonable in discriminating her on sexual orientation grounds which are not justified; (2) the Director erred in law in construing “spouse” to mean husband or wife but not to include a party to a same-sex marriage-like relationship; (3) if the Director was correct in his construction of “spouse”, then this infringes QT’s constitutional rights under articles 1, 14 and 22 of the Hong Kong Bill of Rights (“BOR”) and articles 25, 39 and 41 of the Basic Law (“BL”). 12. Au J dismissed the application for judicial review and held inter alia that: (1) QT (or those who are parties to a homosexual (or heterosexual) relationship who are not married) and married persons are in a sufficiently relevant different position to justify the differential treatment under the Policy. Bearing in mind the proper context being immigration control, the differential treatment is justified as a proportionate measure to achieve the legitimate aim of striking a balance between (a) maintaining Hong Kong’s continued ability to attract talented and skilled foreign workers; and (b) the need to maintain an effective, strict and stringent immigration control. (2) To enable the Director to apply the Policy lawfully in Hong Kong, the Director is obliged to adopt and give effect to the legal meaning of “marriage” as recognised in Hong Kong by construing the word “spouse” in the Policy to mean only a party to the traditional form of a heterosexual and monogamous marriage. On a proper objective and purposive construction of “marriage” in other ordinances in Hong Kong, with reference to their history and various other provisions in them, the legislature did not intend to include in those definitions foreign legally recognised civil partnership or same-sex marriage. (3) Hence, there is no question of (direct or indirect) discrimination based on sexual orientation. And the Director did not err in his construction of the Policy. (4) As there is no discrimination as contended for by QT, there is no question of any of the rights protected under the BL and BOR being engaged and infringed. It is unnecessary to address the ground of constitutional challenge. 13. The broad grounds of appeal are: (1) The judge should have held that same-sex couples are materially indistinguishable from opposite-sex couples. The judge erred as he did not direct himself on, or had misapplied, the test for justification and the margin of appreciation. (2) The judge erred in his construction of “spouse” in the Policy. He should have construed the word to apply to persons, such as QT, in a settled, marriage-like same-sex relationship. Alternatively, he should have held that QT is a “spouse” of the sponsor on account of their substantive relationship, including inter alia their settled commitment to each other and their civil partnership entered pursuant to the laws of the UK. (3) The judge should have held the Policy and the Decision were discriminatory against QT and he should have continued on to decide that they were unconstitutional. The applicable legal principles 14. The legal principles applicable to the present applications are well settled. I do not intend to set them out. The paramount, if not the sole consideration is whether it is in the public interest to admit overseas counsel in the particular case, and the court adopts a flexible and sensible approach which involves a balancing exercise having regard to all aspects of the public interest ( Re Flesch QC [1999] 1 HKLRD 506 and Re McGregor QC [2003] 3 HKLRD 585 ). The relevant principles have been comprehensively summarised by McWalters JA recently in Re Perry QC [2016] 2 HKLRD 647 at §24. Whether the legal issues in the appeal are unusually complex and difficult 15. Mr Parker submitted that the question at the heart of this appeal is whether there exists justification (within the meaning ascribed to that term in discrimination law) for the Director to accord less favourable treatment to all homosexual couples – even those in a formal union recognised in a foreign jurisdiction – than he accords to all married heterosexual couples. To answer this key question would involve a nuanced understanding of the relevant similarities and differences between UK civil partnerships and married status. A further point of extreme complexity arises in the constitutional challenge (which Au J did not find necessary to decide) that may be framed in this way: can the Director rely upon the immigration reservation to the ICCPR and section 11 of the Hong Kong Bill of Rights Ordinance , Cap 383 (“HKBORO”) as exempting him from observing the right to equality before the law in the application of immigration legislation? 16. Mr Wong submitted that the appeal raises fundamental issues of the nature and purpose of “marriage”, under both the BL and the general matrimonial law in Hong Kong, and in particular whether it is necessarily of a heterosexual nature, and the true impact of discrimination law thereon. The issues go to the heart of marriage law, the constitutional right to equality, discrimination law and the interplay between them, and the potential impacts thereon in many other areas such as inheritance, child custody, social benefits, cannot be overstated. There is also the question whether the Director has any margin of discretion to achieve the objective of strict immigration control set against a claim of sexual orientation discrimination and a claimed right of access by an unmarried couple to a status equivalent to marriage for immigration purposes, as well as the appropriateness of the comparator approach. And there are important constitutional issues raised on whether section 11 of the HKBORO excludes QT’s reliance on articles 1 and 22 of the BOR and whether she is precluded from relying on article 25 of the BL. 17. Mr Coleman made similar submissions to the effect that the appeal raised questions that are extremely important, difficult and delicate. 18. Mr Maurellet did not argue that the issues in the appeal are not difficult or complex but submitted that they are not of unusual difficulty or complexity. His argument ran as follows: (1) The appeal did not involve any dispute as to the applicable test for differential treatment, the principles for which were established in Fok Chun Wah v Hospital Authority (2012) 15 HKCFAR 409 and applied by Au J in the Judgment. The question raised on appeal is whether Au J had misapplied the justification test and the other principles set out in Fok Chun Wah. (2) Nor did the appeal raise the question of legality of the exclusion of same-sex marriage from the institution of marriage. As recorded in §28 of the Judgment, it was confirmed by Mr Parker that QT does not seek to contend that the non-recognition of same-sex marriages or civil partnerships under the existing Hong Kong laws is unlawful or unconstitutional. (3) As regards the margin of discretion, Au J did not expressly adopt the concept of “margin of appreciation” in relying on Gas v France (2014) 59 EHRR 22 . (4) Au J did not find it necessary to deal with the constitutional challenge. It would only arise if the court came to the conclusion that the Director has been authorised by legislation to act in a discriminatory way. (5) Even if the constitutional challenge has to be determined in the appeal, the basic test in respect of that issue was established in Ubamaka v Secretary for Security (2012) 15 HKCFAR 743 and the application of that test is not unusually difficult or complex. While Ubamaka confined its analysis to the right under article 3 of the BOR, and did not specifically address the interplay between sections 5 and 11 of the HKBORO and article 22 of the BOR, the Court of Final Appeal has laid down clear preconditions for rights to take precedence over section 11 of the HKBORO, namely, that the rights engaged must be absolute and non-derogable. 19. I am not persuaded by Mr Maurellet. As recognised by all, whether the issues raised in the appeal are considered to be unusually difficult or complex is a matter of feel and judgment. The fact that certain basic tests have been laid down does not mean that applying the tests to the issues raised in this particular context should not involve questions of unusual difficulty or complexity. To the contrary, I am inclined to think it calls for a nuanced approach in applying the test of justification and the margin of appreciation. As submitted by Mr Wong, the margin of appreciation is inextricably linked up with the justification test. If it is suggested that the concept of the margin of appreciation would not arise in the appeal, I do not agree with this. 20. It is Mr Parker’s contention that the Director had departed from the requirements of the justification test in Fok Chun Wa . And the question of proportionality and its application to the issues can often be very difficult, see Re Pannick QC , HCMP 1414/2006, 21 July 2006, at §7 and Re Pannick QC , HCMP 2475/2013, 18 October 2013, at §20. 21. Even though QT does not seek to contend that the non-recognition of same-sex marriages or civil partnerships under the existing Hong Kong laws is unlawful or unconstitutional, the question of legality of a civil partnership loomed large in the Decision. It is the bedrock of the Decision that the Director in adopting a bright line rule based on marital status is to recognise only a marriage which is lawfully valid in Hong Kong. As submitted by Mr Wong, this goes to the very heart of marriage law, the constitutional right to equality, discrimination law, and the interplay between them. That gives rise to extremely difficult and complicated legal and constitutional issues. 22. The same can be said about applying the test laid down in Ubamaka in the present context. It is true that the constitutional challenge may or may not be decided by the Court of Appeal, but that does not detract from the fact that it is a live issue. As rightly observed by Mr Coleman, the Court of Appeal may wish to tackle this issue, knowing that the case is likely to go to the Court of Final Appeal. Whether the resolution of the issues will have a substantial impact on the local jurisprudence 23. Mr Maurellat submitted that the issues raised in the appeal involve no more than the application of well-established principles laid down in the decisions of the Court of Final Appeal. And given there are decisions of the Court of Final Appeal and the Court of Appeal on the effect of section 11 of the HKBORO and its interplay with different rights (although not regarding article 22 of the BOR), even if there is a determination on the constitutional challenge, it does not have a substantial impact on local jurisprudence per se . 24. I do not agree with his submissions. 25. On any view, the issues raised in the appeal are clearly of profound importance to the local jurisprudence, and would affect the development of local jurisprudence in constitutional, discrimination, immigration and family law. Cases involving the determination of legal principles which may have an impact on the development of local jurisprudence are likely to go all the way to the Court of Final Appeal ( Re Flesch , at 513J to 514A). Mr Maurellet accepted there is a reasonable possibility of this appeal going to the Court of Final Appeal. 26. To date, there is no other decision in Hong Kong which examines the issue of whether married heterosexual couples are in a relatively similar position to unmarried homosexual couples for the purpose of discrimination law, or on the question of same-sex marriage or similar relationships generally. An application for judicial review was heard by the Court of First Instance in December 2016 concerning a civil servant who has entered into a same-sex marriage in a foreign jurisdiction challenging the decisions of the Commissioner of Inland Revenue and the Secretary for Civil Service in not recognising them as a married couple in relation to married persons benefits. QT’s solicitors informed the court that the Judgment of Au J formed the centrepiece of the Government’s defence in that case, in which judgment was reserved. 27. As stated in Re Gordon QC , HCMP 1031/2010, 23 June 2010 at §6, rarely, if ever, would legitimate constitutional challenges not involve these two aspects, namely, that the issues are of unusual difficulty or complexity, and that their determination would impact substantially on the development of Hong Kong law. I have no reason to think the constitutional challenge to be mounted is not legitimate and bona fide . The CFA factor 28. If the case is one where the ventilation of arguments on important legal principles is likely to end up in the Court of Final Appeal, this is a very powerful factor in favour of admission ( Re McGregor QC , at §11(1)). 29. Mr Maurellet did not dispute the assessment of the other parties that the case is likely to end up in the Court of Final Appeal, but stressed that the admissions are for the purpose of conducting the appeal in the Court of Appeal. He indicated that the Bar Association might take a different view if the appeal should eventually go to the Court of Final Appeal. He prayed in aid Re Dicker QC [2013] 2 HKLRD 245 at §22, in which it was stated that for the purpose of admitting overseas counsel, there is a significant distinction between a hearing before the Court of Final Appeal and one before the Court of Appeal, even though the nature of the hearing and the issues involved may be identical. At §25, it was stated that whatever further input overseas counsel may be required to render can be easily obtained and included in the written submissions to be lodged with the Court of Appeal. 30. Re Dicker QC is far removed from the present situation. There, admission was sought for the purpose of an application before the Court of Appeal to seek leave to appeal to the Court of Final Appeal. The Bar Association opposed the application but indicated that if the leave application before the Court of Appeal should fail, it would not object to the applicant’s admission for appearing in the leave application in the Court of Final Appeal. It was in those circumstances that the application for admission was refused and the applicant was contingently admitted to appear before the Court of Final Appeal. And it is entirely understandable that the statements relied on by Mr Maurellet at §§22 and 25 were made. 31. We are here concerned with a substantive appeal, not an application for leave to appeal, and there are quite a number of legal issues involved, unlike Re Parsons QC [2015] 4 HKLRD 781 at §27 (another case relied on by Mr Maurellet), in which a discrete point of law on limitation was to be argued. In these circumstances, it is impracticable to obtain the input of overseas counsel in the skeleton submissions to be filed, leaving the advocacy work to be done by local counsel, as suggested by Mr Maurellet. 32. Furthermore, as submitted by Mr Coleman, it is important that the applicants should be brought in at the stage before the Court of Appeal, rather than later, so that all the relevant arguments can be fully and properly ventilated before the Court of Appeal. As Bokhary PJ has said in Flywin Co Ltd v Strong & Associates Ltd (2002) 5 HKCFAR 356 at §39, where the question of a major development of the law is involved, having the view of the Court of Appeal on the point of law involved would be of assistance to the Court of Final Appeal and when the courts develop the law, it is best that they do so with all their intellectual resources fully deployed. Bringing a significant additional dimension to the case 33. I have no doubt that both applicants will bring a significant added dimension to the appeal. It is envisaged that both sides would rely on extensive UK and European authorities on discrimination law, the justification test and margin of appreciation. There may be debate on the similarities and differences between the marriage laws in Hong Kong and the UK laws on civil partnership. There is no question that the applicants would be able to make significant and valuable contributions to the appeal. 34. The fact that local counsel had conducted the hearing before Au J is not a relevant consideration. 35. Mr Maurellet criticized QT’s solicitors for making no effort to engage local senior counsel and submitted that QT has not discharged her burden to demonstrate reasonable efforts to instruct a local silk. I am not impressed with this criticism. It is not invariably the case that overseas counsel are admitted to lead local Senior Counsel and junior counsel. There is ample precedent for overseas counsel to be admitted to lead local junior counsel without a local silk also being involved. QT is legally aided, and her solicitors formed the view that it would not be necessary or justified to engage both overseas Queen’s Counsel and local Senior Counsel. There is nothing improper about this. 36. In the case of the Director, he has confirmed that Mr Wong and Ms Chow would be instructed to assist overseas Queen’s Counsel in the appeal. So the necessity of making enquiries of other suitable leading counsel in Hong Kong assumes far less importance ( Re Gordon QC , at §7). 37. There is no question of the local Bar being prejudiced in these circumstances. 38. The main plank of the opposition of the Bar Association is that the appeal is not unusually difficult or complex. As I have said, whether the issues involved are of unusual difficulty or complexity is a matter of feel and judgment. This appeal is likely to end up in the Court of Final Appeal. On any view, the resolution of the legal issues will have a significant impact on local jurisprudence. Both parties have sought the admission of overseas counsel to argue the appeal in the Court of Appeal. The applications are supported by the Secretary of Justice. Balancing the different facets of public interest involved, I am satisfied that public interest militates in favour of both ad hoc admissions and have made an order in terms of each application. (Susan Kwan) Justice of Appeal Mr Timothy Parker, instructed by Vidler & Co, for the applicant in HCMP 350/2017 Mr Stewart Wong SC and Ms Grace Chow, instructed by the Department of Justice, for the applicant in HCMP 415/2017 Mr Jose-Antonio Maurellet SC and Mr Jason Yu, instructed by Kwok, Ng & Chan, for the Hong Kong Bar Association Mr Russell Coleman SC and Mr Anthony Chan, instructed by Department of Justice, for the Secretary for Justice Look up this case on Lawcite Noteup",
  "length": 24380,
  "headers_seen": [
    "The underlying proceedings for judicial review",
    "The applicable legal principles",
    "Whether the legal issues in the appeal are unusually complex and difficult",
    "Whether the resolution of the issues will have a substantial impact on the local jurisprudence",
    "The CFA factor",
    "Bringing a significant additional dimension to the case"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2017/598",
  "query": "constitutional challenge",
  "ts": "2025-10-17T10:43:33",
  "ok": true
}