{
  "title": "RE KENWORTH ENGINEERING LTD V. | [2005] HKCFI 78 | HKLII",
  "court": null,
  "year": 2005,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2005] HKCFI 78 RE KENWORTH ENGINEERING LTD V. Judgment Information Date 24 Jan, 2005 Action No. HCMP5519/1999 Neutral Cit. [2005] HKCFI 78 Parallel Cit. [2005] 2 HKLRD 97 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCMP5519/1999 HCMP005519A/1999 RE KENWORTH ENGINEERING LTD v. HCMP 5519/1999 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE MISCELLANEOUS PROCEEDINGS NO. 5519 OF 1999 ____________ IN THE MATTER of KENWORTH ENGINEERING LIMITED FORMERLY KNOWN AS UDL KENWORTH ENGINEERING LIMITED and IN THE MATTER of the Companies Ordinance , Chapter 32 of the Laws of the Hong Kong Special Administrative Region ____________ Before: Hon Kwan J in Chambers Dates of Hearing: 14 December 2004 Date of Handing Down of Decision: 25 January 2005 _____________ D E C I S I O N _____________ The application 1. This is an amended summons brought by Kenworth Engineering Limited (“KEL”), formerly known as UDL Kenworth Engineering Limited, under section 166 of the Companies Ordinance , Cap. 32 and the inherent jurisdiction of the court. I am only concerned with paragraphs 3 and 4 of the amended summons; paragraphs 1 and 2 were withdrawn by a consent order. KEL seeks declarations from the court on the interpretation of the terms of a composite scheme of arrangement (“the Scheme”) sanctioned by the court on 11 July 2000. The declarations sought are in these terms: (1) a declaration that in relation to any awards or orders for costs made against KEL in relation to arbitrations between KEL and any claimant against KEL, which had commenced and were continuing as at 3 August 2000 (the effective date of the Scheme; “the Effective Date”) pursuant to clause 1 of the Scheme, the amount recoverable against KEL in respect of: (i) any such awards or orders for costs made in such arbitrations; and (ii) if any such award or order as described above is subject to any review or appeal, any awards or orders for costs made in any reviews or appeals, including but not limited only to any remittance of the award or order to the arbitrator or any review or further review of the award or order by the arbitrator and any subsequent appeal therefrom shall be limited in accordance with the provisions of the Scheme and shall thereby form part of the claims under the Scheme; and (2) a declaration that in relation to any arbitrations between KEL and any claimant against KEL which had commenced and were continuing as at the Effective Date, that in compliance with: (i) any award or order for security for costs made against KEL in such arbitrations; and (ii) any award or order for security for costs made against KEL in any reviews or appeals, or in any proceedings subsequent to any reviews or appeals, including but not limited only to any remittance of the award or order to the arbitrator or any review or further review of the award or order by the arbitrator and any subsequent appeal therefrom KEL shall pursuant to clause 1 of the Scheme only be required to provide security for costs limited in accordance with the provisions of the Scheme such that, for every HK$10,000.00 that KEL is required to provide as security for costs pursuant to any award or order, KEL shall only be obliged to provide for, pay or deposit as security either: (a) the equivalent dividends which would under the Scheme operate to fully discharge KEL’s liability for such payment, that is, HK$312.50 in cash, 5,000 shares in KEL Holdings Limited and notes in the principal amount of HK$187.50; or (b) the cash equivalent of such dividends of HK$1,000.00. 2. The summons was served on, inter alia, the Scheme Administrator and Nishimatsu Construction Company Limited (“NCC”). The Scheme Administrator adopted a neutral stance in this application, taking the view that whilst the administration of the Scheme is a matter for him, there is nothing in the wording of the Scheme which would appear to oust the jurisdiction of the court to make the declarations sought in this situation, as no determination has been made by the Scheme Administrator or the Scheme Adjudicators on any of the matters which fall to be determined in this application. The background 3. The relevant background matters may be stated as follows. 4. By a contract dated 25 June 1996, NCC was engaged by the Airport Authority (“AA”) as the main contractor for the construction of the ground transportation centre at the new airport at Chek Lap Kok. KEL was the nominated subcontractor for the provision of the building services for the ground transportation centre under a nominated subcontract dated 24 July 1996 (“NSC 423”). 5. On 19 May 1998, KEL’s employment under NSC 423 was terminated by NCC with immediate effect, with the consent of AA, on account of the alleged defaults of KEL, which allegedly caused the non-completion of the ground transportation centre in time for the airport opening date on 6 July 1998. KEL maintained that NSC 423 was wrongfully terminated by NCC and on 27 May 1998, KEL issued a notice of dispute to NCC requiring that the disputes under NSC 423 be resolved by arbitration. On 2 September 1998, NCC wrote to KEL indicating its intention to counterclaim in the arbitration. 6. In October 1998, a creditor presented a petition to wind up KEL. In January 1999, some former employees also presented a petition to wind up KEL. On 8 September 1999, KEL issued an originating summons seeking sanction of a scheme of arrangement. On 17 May 2000, KEL Holdings Limited, the ultimate holding company of KEL, and Kenworth Group Limited, formerly known as UDL Kenworth Group Limited, the direct parent company, also took out an originating summons seeking sanction of a scheme of arrangement in order that a composite scheme was to be put forward for the creditors of these three companies. NCC appeared at the hearing of the petition to object to sanction being granted insofar as the composite scheme affected KEL. On 11 July 2000, the Scheme received the sanction of the court. It became effective on 3 August 2000. The two petitions to wind up KEL were later dismissed. 7. The cut-off date for creditors bound by the Scheme to submit their claims to the Scheme Administrator was 17 October 2000. On 16 October 2000, NCC submitted its claim against KEL for the sum of HK$341,403,880.01 by way of the prescribed form for a notice of claim under the Scheme. 8. On 7 and 8 November 2000, the appeal against the sanction of the Scheme in CACV No. 280 of 2000 was heard, together with the appeal against the sanction of a composite scheme in respect of UDL Holdings Limited and 24 subsidiaries (“the UDL Scheme”) in CACV Nos. 157, 164, 258 to 262 of 2000. NCC had also appeared in CACV No. 164 of 2000 and objected to the UDL Scheme, as UDL Holdings Limited had guaranteed the liabilities of KEL and one of the 24 participating subsidiaries under their contracts with NCC. NCC claimed to be a creditor of UDL Holdings Limited on the basis of the guarantee. The Court of Appeal dismissed all the appeals on 7 December 2000 ( Re UDL Holdings Ltd. & Ors . [2000] 4 HKC 778 ). Although only the UDL Scheme was discussed in the judgment, the decision covered both the Scheme and the UDL Scheme. 9. On 31 May 2001, NCC settled its claims against AA. AA attributed HK$236,602,673.76 of the settlement sum to cover NCC’s claims arising from NSC 423. As a result, on 17 September 2001, NCC revised down its claim against KEL under the Scheme to HK$141,042,108.10, being the difference between NCC’s claim submitted to AA and the amount AA has paid to NCC under the settlement. 10. I understand no progress was made in the arbitration between KEL and NCC for several years after KEL had served notice in May 1998 to refer the disputes to arbitration. It was only in 2002 that the arbitrator was appointed and pleadings were then served as directed by the arbitrator. NCC’s claim of HK$141,042,108.10 has now been further revised in its defence and counterclaim to HK$82,772,206.00. NCC seeks to maintain this claim as a defence and only to the extent necessary to set off the claims of KEL. The substantive hearing of the arbitration is expected to take place in October 2005. NCC’s present estimate of the total costs for the conduct of the arbitration proceedings is in the region of HK$31 million. 11. On 27 March 2003, NCC obtained an order from the arbitrator (the third interim award) that KEL should provide HK$5 million as security for NCC’s costs in the arbitration. KEL has complied with the order for security for costs and there was no appeal against that order. 12. After KEL had issued the summons that I am concerned with, NCC applied for an increase of the amount of security for costs in the arbitration. On 12 July 2004, the arbitrator published the twelfth interim award in which he ordered the security for costs to be increased by HK$6 million. By agreement between the parties, the twelfth interim award is subject to appeal pending the outcome of the present application, which the parties expect to resolve the issue. The relevant provisions of the Scheme 13. For ease of reference, I set out some of the provisions of the Scheme pertinent to this application: The definition section Expression Meaning “Claims” the claims of Proving Creditors against the Company [i.e. KEL Holdings Limited] or any Subsidiary [which included KEL] “Creditors” the Creditors of the Company or any Subsidiary including the Secured Creditor and/or Preferential Creditors, being in each case Creditors whose claims arose out of or had their origin in any matter occurring before the Effective Date and whether present, future or contingent, whether sounding in equity, contract, tort or under statute and whether liquidated or yet to be ascertained “Post-Scheme Costs” those costs, charges, expenses and disbursements (including those incurred or suffered by the Trustee not recoverable from the Company in connection with his acting as trustee and performance of duties under the Trust Deed) necessarily and properly incurred after the Effective Date, in connection with the administration and implementation of the Scheme including the fees and remuneration of the Scheme Administrator, the Adjudicators and the Trustee (who for the time being is the Scheme Administrator) “Preferential Claims” all claims of Creditors against the Company or any Subsidiary which would, if a winding up of the Company, or as the case may be a Subsidiary had commenced on the Effective Date, have been payable out of the assets of the Company pursuant to the Ordinance in priority to the claims of the general unsecured creditors of the Company “Preferential Creditors” Creditors to the extent to which they have Preferential Claims against the Company or the Subsidiaries or any of them “Proving Creditors” Preferential Creditors and Unsecured Creditors (other than the Company and the Scheme Participating Subsidiaries “Scheme Creditors” Creditors (including Foreign Creditors) with Scheme Debts “Scheme Debts” subject to paragraph 38 (1) all Claims of Proving Creditors against the Company and Scheme Participating Subsidiaries established in accordance with Part 3 of the Scheme and (2) the balances of the Fuji Debts less the Secured Debt …, and which in both cases (1) and (2) is a claim which would be provable under Section 263 of the Ordinance, if an order for the winding up of the Company were made on the Effective Date “Scheme Funds” funds held in the Scheme Account (including all interests accrued thereon) available for settlement of, firstly, the Post-Scheme Costs, secondly, the Preferential Claims and thereafter, distribution as cash Dividends to the non-preferential Scheme Creditors under the Scheme “Unsecured Creditors” Creditors of the Company or the Subsidiaries or any of them other than the Secured Creditors and Preferential Creditors (but including … (ii) to the extent of their non-preferential claims, persons who, while they have Preferential Claims against the Company or a Subsidiary, also have unsecured non-preferential claims against the Company or that Subsidiary) Clause 1 “Save as provided in Part 3 of this Scheme, after this Scheme of Arrangement becomes effective, no Creditor shall be entitled to make any demand or exercise any right of set-off against the Company [i.e. KEL Holdings Limited] or any of the Scheme Participating Subsidiaries [which included KEL] in respect of, or shall seek to recover from the Company or the Scheme Participating Subsidiaries by legal process or otherwise, or take any step or proceedings against the Company or any of the Scheme Participating Subsidiaries or their properties or assets for the purpose of enforcing or recovering by way of execution or otherwise, any Claim or to commence or join in any proceedings to wind up the Company or any of the Scheme Participating Subsidiaries provided that nothing in this Scheme of Arrangement shall … affect any arbitration between the Company or any Scheme Participating Subsidiary and any claimant against the Company or such Scheme Participating Subsidiary which has commenced and is continuing as at the Effective Date but so that the amount recoverable pursuant to any award made in such arbitration proceedings shall be limited in accordance with the provisions of this Scheme of Arrangement . …” (emphasis supplied) Clause 18 “In the event that a Notice of Claim submitted by a Proving Creditor comprises a claim which is subject to arbitration proceedings between the Company or any Scheme Participating Subsidiary on the one hand and himself on the other and which arbitration proceedings have commenced and are continuing as at the Effective Date, the Scheme Administrator shall await for the decision to be made by the arbitrator in such arbitration proceedings or, in the event that such decision is subject to appeal or further appeal(s) by either party thereto, the ultimate and final decision to be made by the relevant appellate body whereupon the amount of the Claim for which the Company or the Scheme Participating Subsidiary is liable to such Proving Creditor at the Effective Date shall be deemed to be the award made by such arbitrator or appellate body after deducting any interest, damage, compensation and loss of profit forming part of the award which relate to the period after the Effective Date (whether arising out of the said award, a contract, judgment or otherwise), and after setting off any award (excluding interest, damage, compensation and loss of profit forming part of the award which relate to the period after the Effective Date) made by such arbitrator or appellate body in favour of the Company or the relevant Scheme Participating Subsidiary in respect of its claims or counterclaims against the Proving Creditor in such arbitration proceedings.” (emphasis supplied) Clause 27 “The Scheme Funds together with any interest accruing thereon whilst held by the Scheme Administrator shall be applied in or towards payment of, firstly, the Post-Scheme Costs, secondly, the Preferential Claims and, thereafter, the balance of the Scheme Debts by way of cash Dividends ranking pari passu and rateably amongst them to the extent as determined by the Scheme Administrator pursuant to Clauses 28 and 29 of this Scheme.” Clause 31 “The Scheme Funds together with any interest thereon whilst held by the Scheme Administrator shall be applied in or towards settlement of firstly, the Post-Scheme Costs, secondly the Preferential Claims and thereafter as cash Dividends to the non-preferential Scheme Creditors under the Scheme to the extent as determined by the Scheme Administrator. Any excess of the funds held by the Scheme Administrator and interest thereon remaining after the application as aforesaid shall be paid to the Company as soon as practicable after the termination of the Scheme.” Clause 38 “All reasonable costs, charges, expenses and disbursements (including those incurred or suffered by the Trustee not recoverable from the Company in connection with his acting as trustee and performance of duties under the Trust Deed) necessarily and properly incurred after the Effective Date in connection with the administration and implementation of the Scheme including the fees and remuneration of the Scheme Administrator, the Adjudicators and the Trustee shall be paid in full out of the Scheme Funds in priority to the payment of Preferential Claims and distribution to the non-preferential Scheme Creditors.” The contentions of KEL 14. In this application, KEL seeks a determination whether an order for costs in favour of a party who succeeds in an arbitration covered by clauses 1 and 18 of the Scheme is entitled to receive those costs in full, or only a dividend under the Scheme; and whether an order for security for costs in such an arbitration requires security to be paid in full, or only in proportion to the amount of dividend that would be received under the Scheme in respect of the sum ordered to be paid. Mr. Edward Bannister, QC, who appeared with Mr. William Wong, submitted on behalf of KEL that the successful claimant against KEL in such arbitration should only receive a dividend under the Scheme in respect of the costs awarded in its favour. The main points in the contentions of KEL may be summarised as follows: (1) The Court of Appeal in CACV No. 280 of 2000 has decided that an award in such arbitration includes the costs involved and the ruling of the Court of Appeal forms an issue estoppel. (2) Should NCC obtain an award of costs in its favour in the arbitration, that award would be deemed by clause 18 of the Scheme to be the amount for which KEL was liable to NCC at the Effective Date and be a “Scheme Debt”; as such, it would give NCC an entitlement to dividend only under clause 1 of the Scheme. (3) A contingent entitlement to costs in the arbitration does meet the requirement in the definition of “Scheme Debts” that this should have been provable under section 263 of Cap. 32 , had a winding-up order been made against KEL on the Effective Date. (4) The fact that the Scheme may in certain respects diverge from practice in liquidation, such as the treatment of costs when a liquidator pursues or adopts hostile litigation, is not relevant to the proper construction of the terms of the Scheme. 15. Mr. Jose-Antonio Maurellet, for the Scheme Administrator, supported the construction of the Scheme adopted by KEL. The contentions of NCC 16. Mr. William Trower, QC, who appeared with Mr. Robert Whitehead, SC, made these principal submissions on behalf of NCC: (1) The costs incurred by NCC in the arbitration proceedings are not the costs of proving a claim but the costs of defending a claim made against it by KEL. Nothing in the Scheme affects the right of NCC to recover from KEL in full the costs incurred in defending KEL’s claim. (2) Even if the costs incurred in the arbitration constitute a “Claim” for the purpose of the Scheme, they are not “Scheme Debts”, being the debts on which only a dividend is payable, as in the hypothetical winding up of KEL on the Effective Date, NCC would not have been required to prove for such costs which would have been paid in full. (3) KEL’s costs liability to NCC constitutes “Post-Scheme Costs”, and has the same status under the Scheme as it would have had in liquidation. (4) Alternatively, NCC’s costs of the arbitration are payable in priority to the claims of KEL’s general unsecured creditors as a “Preferential Claim”. (5) The court should not grant the declaration sought in respect of any award or order for security for costs in the arbitration, as this would constitute an illegitimate interference with the arbitration process. Is there issue estoppel in CACV No. 280 of 2000 17. One of the reasons advanced by NCC in the appeals that the court should refuse to sanction the two composite schemes related to the costs that may be awarded in its favour against KEL in the arbitration proceedings. The same submissions were made in this respect in the skeleton arguments of NCC in CACV No. 164 of 2000 and in CACV No. 280 of 2000. NCC’s complaint was that because of the operation of, inter alia, clause 33 of the UDL Scheme (identical in all material respects to clause 18 of the Scheme), NCC would be gravely disadvantaged in relation to the heavy costs of arbitration, as it would receive only a small dividend on its costs and this would be a significant disincentive to pursuing its claims in arbitration. 18. On behalf of the companies being the subject of the composite schemes, it was contended in the skeleton submissions in the appeals that any award of costs incurred in the arbitration in favour of a successful claimant would fall to be treated as part of the “Post-Scheme Costs” as defined in the UDL Scheme and would form a prior charge over the Scheme Funds by virtue of clause 25. Although by the definition of “Post-Scheme Costs” and clause 50, only such costs as are approved by the Committee of Inspection are so payable, it was submitted that the Committee would be bound to approve payment out of Scheme Funds to satisfy an award of costs in such arbitration. Hence, the point raised by NCC in relation to its costs in arbitration should not constitute a reason for refusing to sanction the UDL Scheme. 19. Unlike the UDL Scheme, there is no provision for a committee of inspection under the Scheme. Except in this respect, there is no material difference in the definition provision of “Post-Scheme Costs” in the Scheme. As for clause 38 of the Scheme, which is the equivalent to clause 50 of the UDL Scheme, the only material difference is that in the former it is provided that all “reasonable” costs necessarily and properly incurred after the Effective Date in connection with the administration and implementation of the Scheme shall be paid in full out of the Scheme Funds, whereas in clause 50 of the UDL Scheme it is provided that all such costs subject to the approval of the Committee of Inspection shall be paid in full to the extent approved by the Committee. 20. In the judgment of the Court of Appeal, Seagroatt J dealt with the above submissions in respect of the costs of the arbitration in this way: “Mr Bunting [Senior Counsel for NCC] was concerned about the question of Nishimatsu's costs in the event of a successful arbitration award for his clients. The definition of ‘claims’ in the scheme is ‘the claims of proving creditors’. This must include the costs of proving such claims . It would in my view require a specific exclusion of the necessary costs to defeat any claim to include such costs. ‘Scheme debts’ has a definition. It includes ‘all claims of proving creditors against the company ... established in accordance with part 3 of the scheme ...’. It would indeed be inequitable if, having been required to prove its claim, a potential creditor was not able to include the costs of so doing in its claim. In my view, the word ‘claim’ unarguably includes the reasonable costs of proving that claim. The word ‘award’ in clause 33 includes the costs involved .” (at 789I to 790B; emphasis supplied) 21. Mr. Bannister submitted that it was specifically decided that the word “award” in clause 33 of the UDL Scheme (equivalent to clause 18 of the Scheme) included the costs of the award. Hence, the effect of the above dicta is that if NCC should succeed in the arbitration, it would be entitled to add its costs to its claim. The award, including the costs element, ranks for dividend as a “Scheme Debt”, being a “Claim” “established in accordance with Part 3 of the Scheme”. As the decision of the Court of Appeal is binding on NCC and KEL, this should decide the point of construction raised in this application in favour of KEL. 22. Mr. Trower submitted that the passage in the judgment of Seagroatt J cited above does not support the proposition advanced on behalf of KEL that this should lead to the conclusion that NCC is only entitled to a dividend in respect of the costs that may be awarded in arbitration. In any event, the UDL Scheme, although similar to the Scheme, is not the same as the scheme with which the court is concerned with in the present application, and no submissions were made in the appeals of the differences in wording of the relevant provisions in the two composite schemes; there can be no issue estoppel in these circumstances. Apart from the differences I have pointed out regarding the definition of “Post-Scheme Costs” and clause 38 in the Scheme (which were not referred to by Seagroatt J), the definition of “Scheme Debts” (which was referred to by Seagroatt J) is different in the Scheme in that the latter is defined as “subject to paragraph 38”. Further, in the UDL Scheme, there are provisions for financing the costs of recovering the “Accounts Receivable” (defined as including all claims or counterclaims claimed by UDL Holdings Limited or the Scheme Participating Subsidiaries in pending arbitrations) and the costs of defending arbitration claims by UDL Holdings Limited, and the reimbursement to the same to the extent of the amount incurred out of the proceeds obtained or the cost award in a successful recovery or defence. There are no provisions to similar effect in the Scheme. 23. In my respectful opinion, Seagroatt J did not clearly rule that costs in the arbitration do not constitute “Post-Scheme Costs”, although this may have been implicit in his view that “Scheme Debts” as defined in the UDL Scheme should include the costs of the arbitration. The concern raised by NCC’s counsel was that by the provisions of the schemes, its costs in the arbitration would be included in its claim and because of that such costs would only rank for dividend. In coming to the view that NCC should be able to include “the reasonable costs” of the arbitration in its claim, Seagroatt J did not specifically state that NCC would only be entitled to a dividend. Mr. Trower made the point that it would be odd if Seagroatt J had reached that conclusion, as the judge seemed to think that the complaint of NCC was unfounded. 24. I do not think there is issue estoppel here for two reasons. There is absence of a specific determination of the material issue that I am concerned with in this application, namely, whether the costs of an arbitration which was pending at the Effective Date should only rank for dividend, and there is material difference in relevant provisions of the two composite schemes. Proper approach to construction of the Scheme 25. Having come to the view that the decision of the Court of Appeal does not give rise to issue estoppel, I need to approach the question of construction afresh. 26. The Scheme is a contractual arrangement between the companies concerned and the creditors who are bound by it. It does not appear controversial that as such, its true meaning and effect should be ascertained by applying ordinary principles of construction, with proper regard to the commercial context in which it was approved by the creditors and sanctioned by the court. 27. Mr. Trower pointed out that in this instance, one of the most important aspects of the matrix of fact is that at the time the Scheme was approved and sanctioned, KEL was insolvent, that the Scheme was proposed as an alternative to an insolvent liquidation, and that there is much within the Scheme which relates its terms to the basic principles of an insolvent winding up. These matters should also not give rise to controversy. 28. What Mr. Bannister took issue with is the further submission of Mr. Trower that whilst it may be the case that creditors’ rights against a company are dealt with in a scheme of arrangement in a manner different from how they would have been dealt with in a winding up, any such differences and their consequences should be spelt out clearly in the scheme itself and the explanatory statement, and that the court should approach the construction of the scheme accordingly. In support of his submission, Mr. Trower referred to the judgment of Chadwick LJ in Re Hawk Insurance Co. Ltd. [2001] 2 BCLC 480 at 523 to 525, in particular para. [42] which contained the following statements: “It is, to my mind, essential to have regard to the fact that the scheme is proposed as an alternative to a winding up. There is no doubt that the company is insolvent. … The right approach in those circumstances, as it seems to me, is to consider the position on the basis that the relevant rights are those which creditors would have in a winding up.” 29. These statements were made in the context where the court was dealing with the question if classes of creditors were properly constituted in a scheme and the evaluation of the rights of creditors for that purpose. I agree with Mr. Bannister that these statements should not be regarded as support for some canon of construction that the terms of a scheme proposed as an alternative to an insolvent winding up should be approached on the basis that any divergence from the rights and practice in a liquidation regime must be clearly spelt out, otherwise it would be assumed and construed that the provisions in the scheme would be no different from the parallel situation under the liquidation regime. 30. I will have regard to what would have happened in the liquidation regime as part of the factual matrix in construing the Scheme, but I do not think this should be taken further. In this regard, I take note of the following principles and practices relating to the costs to be paid by a company in liquidation, which were not in dispute: (1) A creditor is normally not allowed his costs of proving his debt (rule 85 of the Companies (Winding-up) Rules ), but he would have been allowed, as an expense of the liquidation payable out of the assets in full, his costs of any successful appeal against the decision made on the proof ( In re National Wholemeal Bread and Biscuit Company [1892] 2 Ch 457 ). (2) Where a creditor has obtained leave of the court to bring proceedings against a company in liquidation, any costs to which the creditor would become entitled as a result of the successful prosecution of the proceedings would be payable out of the company’s assets in full ( In re Trent and Humber Ship-building Company, Bailey & Leetham’s Case (1869) LR 8 Eq 94). The position would be the same if the company through its liquidator has commenced or continued with proceedings against a creditor ( In re Bank of Hindustan, China and Japan, ex parte Smith (1867) 3 Ch App 125). There is thus no difference in principle between the costs of an action by the company which fails and the costs of an action which has been unsuccessfully defended by the company. (3) If the liquidator has adopted the company’s case in existing proceedings against a creditor, the entire costs incurred by the creditor in successfully pursuing or defending those proceedings, not just the costs after the liquidator’s appointment, would have been payable as an expense of the liquidation ( In re London Drapery Stores [1898] 2 Ch 684 ; In re Wenborn & Co . [1905] 1 Ch 413 ). (4) Legal costs ordered to be paid by a company in liquidation have a very high ranking order in the order of priority. The successful litigant is entitled to be paid his costs in priority to the general costs of the liquidation ( In re London Metallurgical Company [1895] 1 Ch 758 at 764; Norglen Ltd. v. Reeds Rains Prudential Ltd . [1999] 2 AC 1 at 20G to 21B; rule 179 (3) of the Companies (Winding-up) Rules ). 31. If there were no Scheme, and if NCC had obtained leave to proceed with the arbitration, or if the liquidators had obtained adopted KEL’s case in the arbitration, any award of costs in the arbitration in favour of NCC would have been dealt with in accordance with the above principles. 32. I also note that under the Scheme, the costs of delivering evidence in support of a claim are borne by the claimant (clause 17) and that the costs of the determination by the Adjudicators, when the adjudication process is invoked by a proving creditor dissatisfied with the decision of the Scheme Administrator, are borne by the proving creditor or by KEL depending on who is successful (clause 23). If the costs of adjudication are ordered to be borne by KEL, I accept they will be “Post-Scheme Costs”, and, as such, they will be payable in full ahead of the “Preferential Claims” and the balance of the “Scheme Debts” (clauses 27, 28, 31 and 38). All these provisions are broadly consistent with the principles and practice in the liquidation regime. 33. With that, I turn to consider the costs of an arbitration permitted to continue under the Scheme for the purpose of quantifying the claim of a proving creditor. Are costs in the arbitration within a “Claim” 34. Cash dividends are payable only in respect of “Scheme Debts”; Part 3 of the Scheme provides for proof and determination of “Scheme Debts” and Part 4 provides for, inter alia, the distribution of cash dividends towards payment of the balance of the “Scheme Debts”, after the payment of “Post-Scheme Costs” and “Preferential Claims”. To come within “Scheme Debts”, it must first be established that an award of costs that may be made against KEL in the arbitration comes within a “Claim”. 35. Mr. Trower submitted that the costs incurred by NCC in defending the arbitration proceedings brought against it by KEL cannot fall within a “Claim” at all, notwithstanding the dicta in the judgment of Seagroatt J, because they are incurred in defending proceedings brought by KEL. Clause 1 of the Scheme should not apply to this arbitration because it is not proceeding “for the purpose of enforcing or recovering by way of execution or otherwise, any Claim”. Hence, NCC can recover in full without any restrictions imposed by the Scheme, there being no provision in the Scheme which makes express reference to the costs of an arbitration initiated by KEL against any creditor. 36. I do not accept this submission for the following reasons: (1) I find the distinction sought to be drawn by Mr. Trower artificial and do not think this could have been the effect of the provisions in the Scheme on a proper construction. I fail to see any cogent reason why the costs incurred in proving a claim by a creditor should be treated on a different footing from the costs incurred by a creditor in resisting a claim made against it by the company. (2) I am unable to discern from the judgment of Seagroatt J that he was dealing with the costs of proving claims, not the costs of making counterclaims, in the arbitration. At the time of the hearing of the appeals, which was before pleadings were ordered to be served in the arbitration, it was noted that the potential debt to NCC was the subject of arbitration proceedings and that KEL had “counterclaimed”. The decision of the Court of Appeal did not involve or turn on the question of which party had first invoked the contractual provisions to go to arbitration. (3) Although NCC has maintained subsequently in the arbitration that it has deployed its counterclaim by way of set off only, it remains the case that in substance NCC is setting up a claim against KEL for a substantial sum of money. As Mr. Bannister has submitted, the outcome of the arbitration will decide what, if anything, is due from either party to the other; if the counterclaim succeeds, NCC will have established its claim, which will have a money value and is to be set off against KEL’s claim, if the latter is successful. (4) The proviso in clause 1 governs the situation where there are pending arbitration proceedings between KEL and any claimant as at the Effective Date, it does not stipulate that the arbitration must be initiated or brought by which party. (5) Clause 18 applies whether KEL is the claimant or respondent in the relevant arbitration proceedings, provided that the arbitration has as part of its subject matter a claim by a “Proving Creditor”. The plain intention being that the most effective way to resolve the claim of a Proving Creditor which is the subject of a pending arbitration is in the arbitration itself. 37. I see no reason to differ from the holding of Seagroatt J that NCC’s costs of the arbitration if awarded in its favour may be included in its “Claim”. Although I would agree that clause 18 is engaged where the costs element is included in the award in arbitration, I am inclined to think that this provision is relevant only to the process by which the quantum of the “Claim” is determined. As submitted by Mr. Trower, once the determination has been made, whether by the Scheme Administrator, the Adjudicators, or in arbitration, it would be necessary to consider the nature of the Proving Creditors’ rights to participate in the distribution of the Scheme Funds, which is regulated by clauses 27 and 31. That issue is to be determined by considering whether a “Claim” is a “Scheme Debt”, “Post-Scheme Cost” or “Preferential Claim”, as defined in the Scheme. 38. The inclusion of the costs element in the “Claim” is but part of the requirement for the award in costs to qualify as a “Scheme Debt”, there is also another requirement by virtue of the definition of this expression in the Scheme, namely that it is “a claim which would be provable under Section 263 of the [Companies] Ordinance, if an order for the winding up of the Company were made on the Effective Date”. In my view, clauses 1 and 18 of the Scheme do not alter or affect the latter requirement. Are costs in the arbitration within “Scheme Debts” 39. The definition of “Scheme Debts” excludes those kinds of claims which are not provable, thereby tracking the position in a winding up. The question here is whether NCC’s claim for costs in the arbitration would be provable in a winding up as a contingent liability under section 263. 40. Mr. Trower submitted that it is not, citing the decision of the English Court of Appeal in Glenister v. Rowe [2000] Ch 76 . Mr. Bannister submitted that the decision is distinguishable. 41. In Glenister , the court was not concerned with a claim for costs in arbitration proceedings but with costs in ordinary litigation. The question was whether a claim for costs in subsisting litigation is a contingent liability and provable in a bankruptcy. There is no difference in an insolvent winding up in this respect, as provided in section 263. The reasons for allowing the appeal and holding that such claim is not a provable debt, as stated by Mummery LJ at 84B to 85B, were as follows: (1) Costs of legal proceedings are in the discretion of the court. Until an order for payment of costs is made, there is no obligation or liability to pay them and there is no right to recover them. (2) Once legal proceedings have been commenced, there is always a possibility or risk that an order for costs may be made against a party and in that sense, an order for costs is a “contingency” which may or may not happen at some stage during or at the conclusion of the proceedings. (3) However, the fact that an order for costs (a) creates an obligation to pay money and (b) is a contingency in legal proceedings is not sufficient to make such an order a “contingent liability”. It is accepted that before such an order is made, there is no present liability to pay. Nor can there be a future liability: there is no certainty that the court will exercise its discretion to make such an order. (4) Even if a contingent liability can exist for insolvency purposes without any existing or underlying obligation, the discretionary nature of the court’s power to order costs indicates that there is no liability, contingent or otherwise, in the absence of a court order. It is necessary to identify something agreed or some act done by the paying party to give rise to a liability on his part. The initiation of legal proceedings is no more than a notification to the opposing party that in certain events a request will be made to the court to make an order for costs; such notification of a claim cannot involve any commitment to a course of action which will necessarily and ultimately lead to the actual order for costs against the paying party. (5) Although in section 382 (4) of the Insolvency Act 1986, “liability” is defined to include a liability to pay money (the near equivalent provision in Hong Kong is section 34(8) of the Bankruptcy Ordinance , Cap. 6 and applies to the winding up of insolvent companies) and is wide enough to include an order for costs when it is made, it is not wide enough to embrace a possibility that the court may exercise its discretion to make a costs order. 42. In the succinct judgment of Thorpe LJ at 85D to F, he stated as follows: “In my judgment Mr. Arnold’s endeavour to uphold the judge founders on his inability to distinguish between liability and risk of a liability. Of course when his client issued his strike-out application he exposed himself to the risk of a liability for costs contingent on the future exercise of the court’s discretion when determining the pending application. The element of contingency is certainly satisfied but, in my judgment, the element of liability is not. The future exercise of the court’s discretion might eliminate that risk of liability. Equally it might elevate the risk of liability into an actual liability, either present, in diem, or subject to taxation. This essential distinction between incurring a liability and exposing oneself to the risk of liability should not be undermined.” 43. Mr. Bannister sought to distinguish Glenister on the basis that we are here concerned with a claim for costs in arbitration. An arbitration is based on contract and there is an implied contractual obligation to pay costs if awarded by the arbitrator. He submitted that unlike Glenister , where arbitration proceedings are pending at the commencement of winding up, there is an “identifiable pre-liquidation obligation” on the part of the insolvent to pay such costs. 44. I am unable to distinguish Glenister on the above basis. Notwithstanding that the obligation to pay costs, in the event that an award for costs is made by the arbitrator, is founded ultimately in the arbitration agreement, I cannot see how this could be elevated to a pre-liquidation obligation or liability. There is no difference in substance from ordinary litigation in that costs are in the discretion of the arbitrator (section 2GJ of the Arbitration Ordinance , Cap. 341 ). The fact that KEL is engaged in arbitration would only mean that it is exposed to the risk of a liability for costs, no obligation to pay is assumed until an award for costs is made against it. The essential distinction drawn by Thorpe LJ between incurring a liability and exposing oneself to the risk of liability should not be overlooked. 45. Mr. Bannister further submitted that the deeming provision in clause 18 should assist in that the cost element in the award is deemed a liability of KEL at the Effective Date. I do not think this provision would have the effect of deeming the existence of a liability notwithstanding there is no actual liability in the event of a decision being made in the arbitration. The deeming provision in clause 18 would only go to quantifying the amount of a “Claim”, in the event that a decision is made in the arbitration. 46. For the above reasons, I do not think a claim for costs in a pending arbitration would come within “Scheme Debts”, quite apart from another consideration that in the Scheme, “Scheme Debts” is defined as “subject to paragraph 38”. This leads to the submission of Mr. Trower that such costs would come within “Post-Scheme Costs”, as defined in the definition section and further provided for in clause 38. Are costs in the arbitration within “Post-Scheme Costs” 47. As defined, “Post-Scheme Costs” are “costs, charges, expenses and disbursements … necessarily and properly incurred after the Effective Date, in connection with the administration and implementation of the Scheme …”. Under clause 38, it is provided that “all reasonable costs, charges, expenses and disbursements … necessarily and properly incurred after the Effective Date in connection with the administration and implementation of the Scheme … shall be paid in full out of the Scheme Funds in priority to the payment of Preferential Claims and distribution to the non-preferential Scheme Creditors.” 48. Mr. Trower submitted that the costs, charges, expenses and disbursements incurred by KEL in its arbitration, including any costs liability to NCC, are incurred in connection with the administration and implementation of the Scheme. Pending arbitrations are permitted under the Scheme to continue for the purpose of quantifying “Claims” and establishing entitlement to dividends under the Scheme, such arbitration proceedings should be regarded as part of the process of administering the Scheme. Costs awarded by the arbitrator against KEL are “incurred” in the process of administering the Scheme, as they are ordered to be paid by the arbitrator; they are “necessarily and properly” incurred, as they arise out of the alternative process provided for in the Scheme for establishing KEL’s liability in pending arbitrations. Hence, such costs if awarded would come within “Post-Scheme Costs”. I agree with this. I see no reason why “Post-Scheme Costs” as defined should not cover an adverse costs order against KEL in arbitration. As for the provision for the priority of payment of reasonable “Post-Scheme Costs” in clause 38, this would seem to be consistent with the principles in winding up by which costs in litigation awarded against the insolvent would be payable in full as an expense of the liquidation. Are costs in the arbitration within “Preferential Claim” 49. Mr. Trower argued in the alternative that NCC’s costs in the arbitration are payable in priority to the claims of the general unsecured creditors as they would come within “Preferential Claim”, which is defined as “all claims of creditors against [KEL] … which would, if a winding up of [KEL] had commenced on the Effective Date, have been payable out of the assets of [KEL] pursuant to the [Companies] Ordinance in priority to the claims of the general unsecured creditors of [KEL]”. He accepted that the primary purpose of the provision of “Preferential Claims” is to deal with the claims of KEL’s preferential creditors, as that expression is normally used, for which specific provision is made by section 265. Nevertheless, he contended that by section 265(4), the obligation to pay liquidation preferential creditors is expressly subject to the retention of such sums as may be necessary for the costs and expenses of the winding up, it follows that the form of words used to define “Preferential Claims” should encompass claims which would be costs and expenses of a winding up, if for whatever reason they fall outside the definition of “Post-Scheme Costs”. 50. I do not accept the alternative submission that if the costs of the arbitration ordered to be paid by KEL are not “Post-Scheme Costs”, they should be treated as “Preferential Claims” as defined in the Scheme. I am inclined to agree with Mr. Bannister that the definition of “Preferential Claims” must be read with the definition of “Preferential Creditors”, the latter expression is defined as “Creditors to the extent to which they have Preferential Claims against … [KEL]”. These creditors are specifically listed at Appendix 3 to the Explanatory Statement of the Scheme. It does not appear to me that “Preferential Creditors” would include someone who may have a claim, in other words a contingent claim. If a declaration should be made in respect of an order for security for costs 51. Lastly, it was submitted by Mr. Trower that the court should not make any declaration in respect of the orders for security for costs in the arbitration. There has been no appeal from the third interim award by which KEL was ordered to provide HK$5 million as security for costs. As for the twelfth interim award, the parties have reserved their rights of appeal. Mr. Trower no longer maintained there is any issue estoppel in this situation but he submitted that the court should not grant relief where this would amount to interference with the arbitration process. Section 2AA (2)(b) of the Arbitration Ordinance , Cap. 341 provides that the Ordinance is based on the principle that the Court should interfere in the arbitration of a dispute only as expressly provided by the Ordinance. Sections 23 and 24 provide for avenues by which the determinations made by an arbitrator may be appealed. It is only appropriate that the arbitrator’s decision should be challenged through the avenues provided in Cap. 341 . 52. I am inclined to agree with the above submission, although this does not arise as I am not minded to grant relief sought by KEL, in view of the conclusions I have reached on the points of construction raised. Conclusion 53. For the above reasons, I decline to make the declarations sought in paragraphs 3 and 4 of the amended summons of KEL. I make an order nisi that KEL is to pay NCC’s costs in this application, with a certificate for two counsel, and that the costs of the Scheme Administrator are to be part of the “Post-Scheme Costs” and be dealt with in accordance with clause 38 of the Scheme. (S Kwan) Judge of the Court of First Instance High Court Mr. Edward Bannister, QC and Mr. William Wong, instructed by Messrs. Tsang & Lee, for Kenworth Engineering Limited Mr. William Trower, QC and Mr. Robert Whitehead, SC, instructed by Masons, for Nishimatsu Construction Company Limited Mr. Jose-Antonio Maurellet, instructed by Clifford Chance, for the Scheme Administrator Look up this case on Lawcite Noteup",
  "length": 49820,
  "headers_seen": [
    "The application",
    "The background",
    "The relevant provisions of the Scheme",
    "The contentions of KEL",
    "The contentions of NCC",
    "Is there issue estoppel in CACV No. 280 of 2000",
    "Proper approach to construction of the Scheme",
    "Are costs in the arbitration within a “Claim”"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2005/78",
  "query": "costs of arbitration",
  "ts": "2025-10-16T10:45:18",
  "ok": true
}