{
  "title": "KINLI CIVIL ENGINEERING LTD V. GEOTECH ENGINEERING LTD | [2021] HKCFI 2503 | HKLII",
  "court": null,
  "year": 2021,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2021] HKCFI 2503 KINLI CIVIL ENGINEERING LTD V. GEOTECH ENGINEERING LTD Judgment Information Date 25 Aug, 2021 Action No. HCA2141/2020 Neutral Cit. [2021] HKCFI 2503 Parallel Cit. [2021] 6 HKC 524 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCA2141/2020 HCA2141/2020 KINLI CIVIL ENGINEERING LTD v. GEOTECH ENGINEERING LTD HCA 2141/2020 [2021] HKCFI 2503 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE ACTION NO 2141 OF 2020 _____________ BETWEEN KINLI CIVIL ENGINEERING LIMITED Plaintiff and GEOTECH ENGINEERING LIMITED Defendant _____________ Before: Hon Mimmie Chan J in Chambers Date of Hearing: 11 August 2021 Date of Decision: 26 August 2021 _____________ D E C I S I O N _____________ 1. These proceedings were instituted by the Plaintiff (“ K ”) against the Defendant (“ G ”) for $4,055,696.83, as the sum claimed to be owing from G and due under a written contract dated 15 September 2016 (“ Contract ”). K is the subcontractor of G, for works to be carried out on a project for site formation, drainage and pile cap works (“ Works ”) in relation to a public housing development project at Shek Kip Mei Estate Phase 6 (“ Project ”). The Housing Authority is the employer, and Shui On Building Contractors Limited is the main contractor (“ MC ”) under a contract between them for the Project Works (“ Main Contract ”). G is the MC’s sub-contractor for the Works, and one Union Link is K’s sub-contractor, and G’s sub-sub-contractor. 2. The claims made by K in these proceedings are on the basis that the Works under the Contract had been completed on about 31 August 2020, but G wrongfully deducted a sum of $3,160,199.15 from the amount certified to be payable to K under an interim payment certificate (“ IP Certificate 12 ”), and that a further sum of $895,497.68 is payable to K under another interim payment certificate (“ IP Certificate 14 ”), making a total amount of $4,055,696.83 due and unpaid. 3. On 9 February 2021, G applied for the action to be stayed on the ground that the dispute between the parties should be submitted to arbitration in accordance with the arbitration clause contained in Clause 8 of the Contract (“ Clause ”). The Clause (as translated) reads: “If in the course of executing the Contract, any disputes or controversies arise between (G) and (K) on any question and the parties are unable to reach agreement, both parties may in accordance with the relevant arbitration laws of Hong Kong submit the dispute or controversy to the relevant arbitral institution for resolution, and the arbitral award resulting from arbitration in the HKSAR shall be final and binding on both parties, and unless otherwise agreed by both parties, the aforesaid arbitration shall not be conducted before either the completion of the main contract or the determination of the subcontract.” The Chinese text reads: “若在執行分判合約的過程中，甲乙雙方在任何問題上產生任何爭端或糾紛而以不能達成協議時，雙方可按照香港有關仲裁法例提交有關仲裁機構解決，並在香港特別行政區進行而仲裁之裁決將是最終決定及對雙方具有約束力，除非雙方另有協定，否則在總工程合約完成或分判合約終止前皆不得進行上述仲裁。” 4. The dispute between the parties is firstly, whether the Clause provides for permissive arbitration, or whether arbitration is mandatory; and further, whether the text of the proviso to the Clause (“ Proviso ”) has the effect that arbitration cannot be conducted until the Main Contract has been completed and the Contract has also been terminated or determined. Although “or” (“或”) is used in the Proviso, K contends that the use of “皆” means that completion of the Main Contract and determination of the Contract have both to be satisfied, before there can be any arbitration. 5. There is no serious dispute as to the approach to be adopted by the Court in dealing with an application for stay of an action to arbitration. Under s 20 (1) of the Arbitration Ordinance (“ Ordinance ”), which gives effect to Article 8 of the Model Law, a court before which an action is brought in a matter which is the subject of an arbitration agreement shall , if a parties so requests not later than when submitting his first statement on the substance of the dispute, refer the parties to arbitration, unless it finds that the agreement is null and void, inoperative or incapable of being performed. 6. As set out in Tommy CP Sze & Co v Li & Fung (Trading) Ltd [2003] 1 HKC 418 , the 4 questions for the court are: (1) Is there an arbitration agreement between the parties? (2) Is the clause in question capable of being performed? (3) Is that in reality a dispute or difference between the parties? (4) Is the dispute or difference between the parties within the ambit of the arbitration agreement? 7. As held in PCCW Global Ltd v Interactive Communications Service Ltd [2007] 1 HKLRD 309 , the onus is on the applicant for stay to demonstrate only that there is a prima facie case that the parties were bound by an arbitration clause, and unless the point is clear, the Court should not attempt to resolve the issue and the matter should be stayed in favour of arbitration, as it is for the tribunal to decide first on its jurisdiction. 8. As the Court found in C v D [2021] HKCFI 1474 , the question of whether a party has complied with the procedure or conditions as to the exercise of the right to arbitrate, as set out in an arbitration agreement, is a question of admissibility of the claim, and the Court has no role to play in relation to such a question, as it does not go to the question of the jurisdiction of the tribunal. It is for the tribunal to decide on admissibility and such decision of the tribunal is final, and not for review by the Court. 9. The dispute between K and G, as to whether there are sums due and payable to K under the Contract, clearly falls within the scope of the arbitration clause, as a dispute or controversy arising in the course of the execution of the Contract, on which the parties were not able to reach agreement. There is also clearly a dispute between K and G. 10. K contends that the Clause uses “可” meaning “may” or “can”, as opposed to “須”, “shall” or “must”. This means that the parties only have the option to elect arbitration, and the Clause does not take away the right of K to litigate the dispute in court. Counsel for K relies on the decisions of the District Court in IO of Wing Fai Building, Sui Wo Street v Golden Rise (HK) Project Co Ltd DCCJ 225/2016, unreported, 23 June 2016, and of the Court of Appeal in Thorn Security (Hong Kong) Ltd v Cheung Kee Fung Cheung Construction Co Ltd [2005] 1 HKC 252 . Counsel for K argued that on the proper construction of the Contract and the Clause, the parties could not have intended that arbitration was compulsory, since the Clause provides that arbitration should not be commenced before the 2 conditions stated in the Proviso have been fulfilled, namely the completion of the Main Contract and the determination/termination of the Contract. 11. In China State Construction Engineering Corp Guangdong Branch v Madiford Ltd [1992] 1 HKC 320 , Kaplan J (then the Arbitration judge) considered the authorities and texts on the use of “may” in arbitration clauses, and held that that does not detract from the existence of an arbitration agreement made between the parties. The clause in question in the case provided that “if settlement cannot be reached through consultation, the matter may be submitted for arbitration”. Kaplan J reviewed the decisions of the English, Hong Kong as well as US courts, and observed as follows: “It seems clear to me that the parties in the case before me had agreed on arbitration as opposed to litigation in the courts in any particular country. The fact that the permissive word ‘may’ was used does not in the end detract from this agreement. It seems to me that once one party or the other has opted for arbitration (as by taking out this application for stay) the other party is obliged to honour the agreement to arbitrate . It follows, of course, that if both parties agreed not to arbitrate but to litigate, they would be perfectly free to do so but I do not think the word ‘may’ in the context of this clause entitles the plaintiffs to negate the defendants’ wish to arbitrate by the issue of court proceedings . At the end of the day, it seems clear to me that this is one of those cases where the word ‘may’ in effect means ‘shall’. I do not think that the defendants are prevented from insisting upon arbitration merely because the plaintiffs issued their proceedings before any steps could be taken by the defendants to commence the arbitration.” (Emphasis added) 12. In the US decisions which were considered by the Court in China State , the US District Court considered that an arbitration clause which employs “may” provides for permissive arbitration until one of the parties chooses to invoke the arbitration clause, and when such an election is made by the party, the arbitration then becomes mandatory for both parties. 13. In Guangdong Agriculture Co Ltd v Conagra International (Far East) Ltd HCA 3032/1992, 24 September 1992, Barnett J construed an arbitration clause which provided that disputes “can” be submitted to arbitration if they cannot be settled by negotiation, and found that taken as a whole, the parties had plainly agreed by the clause to arbitrate their disputes. 14. Hermes One Ltd v Everbread Holdings Ltd [2016] 1 WLR 4098 is a more recent decision, where the Privy Council stayed proceedings in favour of arbitration, in relation to disputes under a shareholders’ agreement which provided that disputes “may” be submitted to arbitration. The Board pointed out that where arbitration clauses provide that disputes “should” or “shall” be submitted to arbitration, the silent concomitant of such clauses is that neither party will seek any relief in respect of such disputes in any other forum, and these words make clear that it is a breach of contract to litigate. The Board went on to explain (at paragraph 13): “As with any issue of construction, the language and context of the particular agreement must ultimately be decisive. But clauses depriving a party of the right to litigate should be expected to be clearly worded - even though the commercial community’s evident preference for arbitration in many spheres makes any such presumption a less persuasive factor nowadays than it was once. The consequence of the defendants’ case would, at least in theory, be that the claimant’s commencement of litigation was a breach of contract, for which the defendants proving loss could without more claim damages - though the prevalence of clauses providing that arbitration ‘shall’ take place and the infrequency of claims for their breach may again reduce the weight of this factor. The fact remains that there is an obvious linguistic difference between a promise that disputes shall be submitted to arbitration and the provision, agreed by both parties, that ‘any party may submit the dispute to binding arbitration’. This clear contrast and the evident risk that the word ‘may’ may be understood by parties to mean that litigation is open, unless and until arbitration is elected, are, in the Board’s view, important pointers away from (the analysis that arbitration is exclusive)”. 15. The Board reviewed authorities from different jurisdictions, as well as academic writings on the significance of the word “may”, including David Joseph QC on Jurisdiction and Arbitration Agreements and their Enforcemen t 2 nd ed (2010), and Born’s International Commercial Arbitration, Volume I International Arbitration Agreements , 2 nd ed (2014). Its conclusions are set out at paragraphs 33 and 34 of the judgment, where the Board found that as a matter of general principle, the preferred and proper analysis is that the words “any party may submit the dispute to binding arbitration” are purely permissive, leaving it open to one party to commence litigation, but giving the other party the option of submitting the dispute to binding arbitration, such option being exercisable by requiring the party which has commenced the litigation to submit the dispute to arbitration, by making an unequivocal request to that effect and/or by applying for a corresponding stay of the litigation. It was pointed out that the hallmark of arbitration is consent, and parties to an agreement to arbitrate are under mutual obligations to one another to cooperate in the pursuit of the arbitration. The analysis found by the Board, whereby notice will trigger the mutual agreement to arbitrate a dispute, was considered to fit better into a consensual scheme. 16. The decision in Hermes One was followed by this Court in Polytech Overseas Ltd v Grand Dragon International Holdings Co Ltd [2017] 3 HKLRD 258 . 17. The cases of IO of Wing Fai Building, Sui Wo Street v Golden Rise (HK) Project Co Ltd (“ IO v Golden Rise ”) and Thorn Security (Hong Kong) Ltd v Cheung Kee Fung Cheung Construction Co Ltd are distinguishable on their facts, and cannot be applied as a general rule to all cases where the arbitration clause in question adopts the word “may”. The arbitration clause in IO v Golden Rise includes the express provision and the parties’ express acknowledgment that “arbitration was only one of the options for the resolution of disputes”, and that neither party may unilaterally commence arbitration without the written consent of the other. With such a contractual provision, it is not surprising that the Court found that there was no agreement that arbitration was the exclusive course for the resolution of disputes and that the defendant’s unilateral application to stay the proceedings should be refused. 18. In Thorn Security , the arbitration clause in question provided for a mandatory framework devised by the parties for the resolution of disputes: first, by service of a notice of dispute on the Contract Manager, for him to give his decision in writing on the dispute or to state his inability to make a decision on the dispute, which decision of the Contract Manager was stated to be final and binding upon the parties, unless and until the decision of the Contract Manager is revised by an arbitrator. The clause goes on to state that either party “may” then require the dispute to be referred to arbitration, by serving a written notice within 28 days of receipt of the decision of the Contract Manager. 19. The Court found in Thorn Security that the Contract Manager had already made a decision on the dispute, but the defendant had failed to refer the dispute to arbitration within the 28 days specified in the dispute resolution clause. As such, the Court considered that the decision made by the Contract Manager was final and binding, and that the conditions for exercising the option to arbitrate must be strictly complied with, but had not been complied with. The Court’s decision that there was no arbitration agreement must be read in the context of the facts of the case and the clause in question. 20. In Grandeur Electrical Co Ltd v Cheung Kee Fung Cheung Construction Co Ltd [2006] 3 HKLRD 535 , Yuen JA distinguished Thorn Security on its facts, pointing out that in the particular circumstances of that case, there was in fact no dispute to engage the arbitration clause, or rendering the arbitration agreement operative at the time when the defendant asked for a stay. As Her Ladyship pointed out, the Court of Appeal in Thorn Security could not have intended to identify the nature of the entire dispute resolution clause, or to go any further than the facts in that case. Specifically, Yuen JA explained (at para 10 of her judgment): “In particular, the reference (in Thorn Security ) to the parties having an ‘option’ should be understood. Once there is a decision of the contract manager (or he has stated his inability to decide), a party wishing to challenge the decision (or wishing to pursue the matter) does not have an ‘option’ whether: (a) to proceed to litigation; or (b) to refer the dispute to an arbitrator. The ‘option’ is only between (1) accepting the contract manager’s decision as final and binding - which is what the defendant in ( Thorn Security ) was found to have done - (or if the contract manager has stated his inability to decide, not pursuing the matter further); and (2) referring the dispute to an arbitrator .” 21. K’s reliance on Thorn Security and IO v Golden Rise is accordingly misplaced. 22. The scope of an arbitration clause is to be construed and interpreted in the context of the agreement made by the parties, and the exercise of construction is one of ascertaining objectively the intention of the parties at the time when the agreement was made. Counsel for K argued that the Clause must be construed in context, and that objectively read as a whole, the Clause could not have been intended as an arbitration agreement, at least not for disputes arising before the completion of the Main Contract or the termination of the Contract. It was contended that such an arbitration agreement (in the sense of arbitration being compulsory) would render the Contract unworkable. K claims that there may be disputes as to performance of the Contract, or as to interim payments due, or regarding delay and liability for liquidated damages, and to require these disputes to be arbitrated only upon completion of the Main Contract and termination of the Contract would create hardship on the parties, and render the Contract unworkable. As such, it was contended that the Clause could only have been intended to give an option to the parties, to arbitrate such disputes only upon the happening of the 2 events stated in the Proviso to the Clause. 23. As the courts have explained, an arbitration agreement can be held to exist so long as the intention to arbitrate is sufficiently clear ( China State Construction ; Continental Corporation (No 2) v Vincenzo Fedele [1964] HKLRD 213; Hobbs Padgett v JC Kirkland [1969] 2 Lloyd’s Rep 547). The modern approach to the construction of arbitration agreements is the presumption in favour of arbitrability and the “one-stop” adjudication approach ( Fili Shipping Co Ltd and others v Premium Nafta Products Ltd [2007] BUS LR 1719), at least as a useful starting point. In Fili Shipping , Lord Hoffman referred to the construction of an arbitration clause as “starting from the assumption that the parties, as rational businessmen, are likely to have intended any dispute arising out of the relationship in which they have entered or purported to enter to be decided by the same tribunal”. There are of course reminders from the courts that the presumption may be rebutted and would not be applicable in particular cases, eg where the parties have entered into different interlinked agreements, relating to different aspects of an overall and often complex commercial transaction, and where they are differently expressed choices of jurisdiction and/or law in different agreements providing for different manner of resolution of disputes. 24. The present relationship between K and G is one of contractor and subcontractor, confined to the execution of the Works on the Project. Disputes which arise between them are all related to this relationship and concern the respective rights and obligations arising under the Contract, including K’s duty of execution of the Works and G’s obligation to pay for the Works. It would be unusual for the parties to a contract of this kind to establish separate and distinct procedures for resolving what are likely to be different aspects of the same dispute. 25. In Grandeur Electrical Co Ltd , Barma JA was clear in his judgment that the relevant dispute resolution clause was an arbitration agreement, despite the multi-stage procedure and the use of “may” where it refers to the reference to arbitration. His Lordship considered that read as a whole, the clause required the parties to submit any dispute between them to arbitration, and did not give either party a choice that would entitle it to have the disputes litigated in courts, taking into consideration the fact that the clause contained the provision that any dispute or difference arising between the parties “shall be settled” in accordance with the procedure specified. At paragraph 26, His Lordship explained: “These provisions, in my view, set out an exhaustive set of procedures for the resolution of the parties’ disputes. Nowhere in them is it suggested that the option of court proceedings is one which is available to the parties . I do not see that such an option is provided for, and would echo the comments of Ma J (as he then was) in Tommy CP Sze & Co v Li & Fung (Trading) Ltd [2003] 1 HKC 418 at paras 33 and 34 of his judgment, that in the light of the emphasis given to party autonomy in relation to dispute resolution by arbitration, a clause in a contract providing for disputes to be settled by arbitration should not readily be construed as giving a choice between arbitration and litigation unless that is specifically and clearly spelled out . It is true that arbitration is not mandated at every stage of the dispute resolution procedure envisaged under (the clause), but that does not make any difference. Provided that the stage in the dispute resolution procedure at which arbitration is called for has been reached, the clause must be read as containing an arbitration agreement which mandates the use of arbitration as the only means of further advancing the dispute.” (Emphasis added) 26. What Ma J (as His Lordship then was) said in Tommy CP Sze & Co was that in order for the Court to reach the view that if a party fails to institute arbitration proceedings within a certain time, he is then at liberty to commence court proceedings (thus having effectively an option whether or not to arbitrate), the clause in question providing for such option must be specific and clear to this effect. His Lordship pointed out (at paragraph 34 of the judgment) that it makes little sense to construe a clause as giving an option to the parties whether or not to have the disputes or differences resolved by arbitration, as it is difficult to understand why parties would wish to have disputes between them resolved both privately and publicly. His Lordship concluded: “It does not readily make sense (in the absence of clear words dictating this result) that a party is able or is required to go to arbitration provided he fulfills procedural requirements (such as commencing proceedings within a certain time) but if he does not or chooses not to, then he can freely litigate in the courts.” 27. In summary, if there is an arbitration clause, bearing in mind the presumption in favour of one-stop adjudication by the same forum, it will not be construed as giving a choice to the parties between arbitration and litigation, unless there is very clear language providing for such. 28. Reading the Clause in this case as a whole, I cannot accept the submissions made on behalf of K, that it is clear that the parties could not have reasonably intended to have agreed on arbitration of their disputes arising in the course of the performance of the Contract, as that would not be workable. Counsel emphasized that the Proviso stating that arbitration cannot be conducted before the completion of the Main Contract or the determination/termination of the Contract supports his construction, that disputes arising in the course of the Contract before its termination, and before the completion of the Main Contract, can be litigated. 29. The Clause makes no mention at all of litigation or the right or even option of the parties to litigate. If there were good reasons for resolving any type of dispute by litigation before the completion of the Main Contract and/or the determination/termination of the Contact, that would normally and could easily have been spelt out and made clear. There is no such provision in the Contract or the Clause. 30. The provision for arbitration to be commenced only after completion or substantial completion of works under a construction contract, or after determination of the contract for a contractor’s works, commonly appears in standard form construction contracts in use in Hong Kong. The objective of such a provision is to ensure that the contractor should continue to proceed with the works despite a dispute having arisen, and not to bring progress of the works to a halt and cause delay in the performance of the contract in question as well as the performance of other contracts/subcontracts in the entire construction project. Under such a provision, arbitration shall not be commenced unless and until the contract is completed, or if there is agreement between the parties. It is of course open to the parties to expressly agree for specified disputes to be excluded from the relevant provision. 31. The mere existence of the Proviso in the Clause cannot mean that there is no commercial object which can be achieved, or render any arbitration agreement contained in the Clause to be “unworkable” as K contends. To the extent that K argued that it would be unfair for disputes on interim payments and extensions of time to be deferred until completion of Works and the determination of the Contract, the Court cannot rewrite the Contract or the Clause for the parties. As is clear from the authorities, there may well have been a valid and commercial quid pro quo for the Proviso to have been agreed, of which the Court is not aware. Moreover, as referred to above, the parties could have agreed and provided for a carveout provision from the Proviso, if it was considered necessary and appropriate, for disputes as to the validity of instructions for Works, or for extensions of time, to be dealt with at such time and by such specific dispute resolution procedure other than arbitration as may be stated in the Clause. This the parties failed to do, and in the absence of such provision, there is no reason for the Court to depart from the position which is expressly stated in the Clause, namely, for disputes to be arbitrated upon completion of the Main Contract, or termination of the Contract. Needless to say, it is of course also open to K to terminate the Contract on the ground of any breach on the part of G of any of its duties under the Contract, and thereafter to commence arbitration. 32. However, it is not necessary for G to go so far as to prove that the Clause has the effect of requiring the parties to arbitrate their disputes. Its onus is only to establish a prima facie case of the existence of an arbitration agreement, and in my judgment, it has discharged such onus. In my view, and following the analysis adopted in Hermes One , it is arguable to the extent of having real prospects of success that notwithstanding the use of “may” in the Clause, the effect of the Clause is that if any dispute arises in the course of the execution or performance of the Contract, and such dispute cannot be agreed, the parties are bound to arbitrate such disputes if either party elects arbitration. Because “may” is used in the Clause, it is open to one party to the Contract to commence litigation, but the Clause gives the other party the option of submitting the dispute to binding arbitration, which option is exercisable by requiring the party which has commenced the litigation to submit the dispute to arbitration, by making an unequivocal request to that effect and/or by applying for a corresponding stay of the litigation, as G has done in the present case. 33. The question as to when arbitration can be commenced, whether the parties have to wait until the Main Contract has been completed, or the Contract has been determined or terminated by performance or by breach, and whether these events have occurred, is a matter for the tribunal to decide and does not concern the Court at this stage, if it is satisfied that there is a prima facie case of the existence of an arbitration agreement. 34. For all the above reasons, the application for stay is granted. The fact that K has an arguable defence to the application for stay is no answer against an order being made that the costs of the unsuccessful opposition to the application for stay should be paid by K to G on indemnity basis ( A v R (Arbitration: Enforcement) [2009] 3 HKLRD 389 ). An order nisi is made to such effect, extending to any costs reserved, and with certificate for counsel. (Mimmie Chan) Judge of the Court of First Instance High Court Mr Desmond Leung, instructed by Chau & Associates, for the plaintiff Mr Keith Chan, instructed by Zhong Lun Law Firm LLP, for the defendant Look up this case on Lawcite Noteup",
  "length": 28645,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2021/2503",
  "query": "arbitration",
  "ts": "2025-10-14T11:20:49",
  "ok": true
}