{
  "title": "LO KING YEUNG V. EDDIE CHU HOI DICK | [2018] HKCA 137 | HKLII",
  "court": null,
  "year": 2018,
  "date": null,
  "content": "HKLII Databases Court of Appeal [2018] HKCA 137 LO KING YEUNG V. EDDIE CHU HOI DICK CACV192/2017 CAMP18/2017 LO KING YEUNG V. CHENG CHUNG TAI CACV193/2017 CAMP19/2017 Collapse Titles Judgment Information Date 13 Mar, 2018 Action No. CACV192/2017 CACV193/2017 CAMP18/2017 CAMP19/2017 Neutral Cit. [2018] HKCA 137 Download MS Word Judgment Reading Options Translation Toggle Highlight Appeal History CACV192/2017 CACV193/2017 CAMP18/2017 CAMP19/2017 CAMP18A/2017 LO KING YEUNG v. EDDIE CHU HOI DICK CAMP 18/2017 [2018] HKCA 137 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF APPEAL MISCELLANEOUS PROCEEDINGS NO 18 OF 2017 (ON AN INTENDED APPEAL FROM HCMP NO 482 OF 2017) _______________ IN THE MATTER OF section 73 of the Legislative Council Ordinance ( Cap 542 ) _______________ BETWEEN LO KING YEUNG Plaintiff and EDDIE CHU HOI DICK Defendant _______________ AND CAMP 19/2017 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF APPEAL MISCELLANEOUS PROCEEDINGS NO 19 OF 2017 (ON AN INTENDED APPEAL FROM HCMP NO 483 OF 2017) _______________ IN THE MATTER OF section 73 of the Legislative Council Ordinance ( Cap 542 ) _______________ BETWEEN LO KING YEUNG Plaintiff and CHENG CHUNG TAI Defendant _______________ AND CACV 192/2017 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF APPEAL CIVIL APPEAL NO 192 OF 2017 (ON APPEAL FROM HCMP NO 482 OF 2017) _______________ IN THE MATTER OF section 73 of the Legislative Council Ordinance ( Cap 542 ) _______________ BETWEEN LO KING YEUNG Plaintiff and EDDIE CHU HOI DICK Defendant _______________ AND CACV 193/2017 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF APPEAL CIVIL APPEAL NO 193 OF 2017 (ON APPEAL FROM HCMP NO 483 OF 2017) _______________ IN THE MATTER OF section 73 of the Legislative Council Ordinance ( Cap 542 ) _______________ BETWEEN LO KING YEUNG Plaintiff and CHENG CHUNG TAI Defendant _______________ Before: Hon Cheung CJHC, Lam VP and Poon JA in Court Date of Hearing: 7 March 2018 Date of Judgment: 7 March 2018 Date of Reasons for Judgment: 14 March 2018 _____________________________________ REASONS FOR JUDGMENT _____________________________________ Hon Lam VP (giving the Reasons for Judgment of the Court): 1. On 23 November 2017, we struck out and dismissed these appeals on the ground that they were incompetent as leave to appeal was refused in CAMP 18 and 19 of 2017. 2. Since then, the Plaintiff took out 4 Notices of Motion (all dated 4 December 2017) to seek leave to appeal to the Court of Final Appeal: (a) a Notice of Motion in CAMP 18 of 2017 which was amended on 18 December 2017 without leave; (b) a Notice of Motion in CAMP 19 of 2017 which was also amended on 18 December 2017 without leave; (c) a Notice of Motion in CACV 192 of 2017 which was also amended on 18 December 2017 without leave; (d) a Notice of Motion in CACV 193 of 2017 which was also amended on 18 December 2017 without leave. We granted leave to amend at the beginning of the hearing upon the application of Mr Ma. 3. The grounds of application in all these motions are identical. We set them out as follows: “(1) In matters where there is a prima facie infringement of the Basic Law of the Hong Kong Special Administration Region:- (a) Whether the constitutional duty of a judicial officer under Basic Law art.104 to uphold the Basic Law a relevant consideration in the exercise of discretion? (b) If the answer to question 1(a) is affirmative, should significant/sufficient weight be attached to such consideration so as to facilitate a final determination of the dispute on its merit? (2) Whether the courts below fundamentally erred in their exercise of jurisdiction thereby rendering the decision(s) invalid in: (a) upholding a stay under s.73 (5) of the Legislative Council Ordinance ( Cap 542 ) consequential upon a plaintiff’s failure to apply to pay security for costs? (b) dealing with the appeal of an interlocutory judgment that finally determined the rights of parties by way of interlocutory appeal? AND THAT leave is sought also on “or otherwise” ground: (3) The present appeals, concerning the qualification of two Legislative Councillors currently in office, are of significant public interest. 4. Written submissions were lodged by the Plaintiff and the Defendant in CAMP 18 of 2017 and CACV 192 of 2017 on these applications pursuant to the directions in PD2.1. The Defendant in CAMP 19 of 2017 and CACV 193 of 2017 is not legally represented and did not lodge any written submissions. Nor did he attend the hearing. 5. For present purposes, it is not necessary to discuss in length the arguments of the parties. In our view, there are fundamental difficulties with the Plaintiff’s applications. 6. First, in respect of the intended appeals regarding the decisions in CAMP 18 and 19 of 2017, those were decisions refusing to grant leave to the Plaintiff to appeal against the determinations of Au J which, according to our judgment, were interlocutory in nature. As such leave to appeal is required under Section 14AA of the High Court Ordinance . 7. Section 14AB of the High Court Ordinance provides that no appeal lies from a decision of the Court of Appeal as to whether or not leave to appeal to it should be granted. It was decided by the Court of Final Appeal in Incorporated Owners of Po Hang Building v Sam Woo Marine Works Ltd (2017) 20 HKCFAR 240 that a similar provision in the District Court Ordinance is constitutionally valid. 8. We do not accept Mr Ma’s submission that the Plaintiff can rely on a constitutional challenge exception to escape from the finality under Section 14AB. The constitutional challenge alluded to by Ribeiro PJ in HLF v MTC (2004) 7 HKCFAR 167 at [27] is a constitutional challenge in respect of the finality provision itself. In the present case, there is no constitutional challenge to Section 14AB. The so-called constitutional challenge raised in the Notices of Motion is in respect of the duty of judges. Even assuming for a moment that such constitutional challenge is arguable (which, as we shall explain later, is not the case), we do not think it comes within the exception envisaged in HLF v MTC , supra. 9. Hence, there cannot be any further appeals in CAMP 18 and 19 of 2017. The Notices of Motion (including the Amended Notices of Motion) in those proceedings are dismissed. 10. The consequence of the refusal of leave to appeal (which, as we have explained, is not appealable) is that the appeals in CACV 192 and 193 of 2017 were incompetent and struck out as such. The further implication is that no appealable judgment of this Court came into existence, see the discussion by Ribeiro PJ in Incorporated Owners of Po Hang Building v Sam Woo Marine Works Ltd , supra, under Section C.3 in relation to the reasoning in Lane v Esdaile . See also the decision of this Court on refusing leave to appeal to the Court of Final Appeal in American International Group Inc v Huaxia Life Insurance Co Ltd HCMP 3417 of 2016, 18 July 2017 at [4]. 11. Further, Question 2(b) as formulated in the Notices of Motion and Mr Ma’s submission under Section A6 in his submissions of 18 December 2017 highlight that what the Plaintiff is actually trying to achieve is to challenge our determination that these appeals are interlocutory in nature. In this connection, Section 14 (5) of the High Court Ordinance provides that no appeal shall lie from a decision of this Court as to whether a judgment or order is final or interlocutory. 12. It follows that there cannot be any further appeals in respect of the striking out of CACV 192 and 193 of 2017. The applications for leave to appeal in those appeals must fail as well. 13. We shall comment briefly on Question 1(a), the so-called constitutional challenge based on art 104 of the Basic Law. Mr Ma referred to art 104 and the judicial oath taken by judicial officers to advance the proposition that a judicial officer has a duty to uphold the Basic Law. 14. It is trite that a judicial officer should uphold the Basic Law. However, Mr Ma did not explain the basis on which he advanced the bold submission at para 3 of his reply submissions of 8 January 2018 that Au J as well as this Court committed a breach of constitutional duty to uphold the Basic Law. Insofar as counsel advanced the suggestion that such breach arises from the refusal to permit the Plaintiff to advance his challenge to the Defendants’ holding of office based on the Basic Law arguments due to his own failure in timely compliance with the legal requirement of payment of security, we have no hesitation in rejecting the submission as hopelessly wrong and wholly unarguable. 15. The duty of a judge to uphold the law (including the Basic Law) is to apply the law impartially and conscientiously without fear or favour. This is exactly what Au J and this Court did in these proceedings. The application of the law (including procedural as well as substantive law) may for a variety of reasons lead to the outcome that an argument based on the Basic Law is not capable of being entertained in a particular case. However, in an adversarial system of administration of justice, it is a mistake to equate such an outcome with the failure of a judge to uphold the law. 16. In the present cases, Au J as well as this Court have explained in the respective judgments how the law was applied which led to the outcome as it is. We cannot see any reasonably arguable basis for suggesting there is any failure on the part of Au J or this Court in upholding the Basic Law. 17. For these reasons, we dismiss all the Notices of Motion. (Andrew Cheung) (M H Lam) (Jeremy Poon) Chief Judge of the High Court Vice President Justice of Appeal Mr Lawrence Ma and Mr Kacee Ting, instructed by YK Lau & Chu, for the plaintiff in all actions Mr Jeffrey Tam and Mr Albert Wan, instructed by Ho, Tse, Wai & Partners, for the defendant in CAMP 18/2017 and CACV 192/2017 The defendant in CAMP 19/2017 and CACV 193/2017, absent Look up this case on Lawcite Noteup",
  "length": 10067,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkca/2018/137",
  "query": "constitutional challenge",
  "ts": "2025-10-17T10:43:27",
  "ok": true
}