{
  "title": "BATES HONG KONG LTD V. CASH ASSETS LTD AND ANOTHER | [2006] HKCA 444 | HKLII",
  "court": null,
  "year": 2003,
  "date": null,
  "content": "HKLII Databases Court of Appeal [2006] HKCA 444 BATES HONG KONG LTD V. CASH ASSETS LTD AND ANOTHER Judgment Information Date 28 Nov, 2006 Action No. CACV316/2005 Neutral Cit. [2006] HKCA 444 Download MS Word Judgment Reading Options Translation Toggle Highlight Appeal History CACV316/2005 CACV000316/2005 BATES CHINA LTD v. CASH ASSETS LTD AND ANOTHER CACV 316 & 321/2005 CACV 316/2005 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF APPEAL CIVIL APPEAL NO. 316 OF 2005 (ON APPEAL FROM HCA NO. 1572 OF 2003) ______________________ BETWEEN BATES HONG KONG LIMITED Plaintiff and CASH ASSETS LIMITED 1st Defendant PRICERITE STORES LIMITED 2nd Defendant ______________________ CACV 321/2005 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF APPEAL CIVIL APPEAL NO. 321 OF 2005 (ON APPEAL FROM HCA NO. 1675 OF 2003) ______________________ BETWEEN BATES CHINA LIMITED Plaintiff and CASH ASSETS LIMITED 1st Defendant PRICERITE GROUP LIMITED 2nd Defendant ______________________ Before : Hon Ma CJHC, Stock JA & Sakhrani J in Court Date of Hearing: 27 October 2006 Date of Handing Down Judgment: 29 November 2006 ______________ J U D G M E N T ______________ Hon Ma CJHC : 1. These appeals arise from a trial before Suffiad J of two actions which were ordered to be heard together. The main issue in both was whether an agreement to perform services existed and if so, on what terms. As found by the Judge, agreements existed on certain terms and damages were accordingly awarded to the Plaintiffs. The Defendants have challenged the Judge’s findings in these appeals. Their case was simply that no agreement existed. 2. The Plaintiffs in both actions (which I shall refer to as the Hong Kong Action and the China Action) are both part of a group of companies carrying on the same business, namely as advertising agents. I shall for convenience, like the Judge, refer to the two actions separately and refer to the Plaintiffs as Bates HK and Bates China. Although the issues in both were similar, one action concerned the advertising work carried out in Hong Kong whereas the other dealt with advertising work mainly in Guangzhou. 3. The Defendants in the Hong Kong Action (HCA 1572/2003) are both part of the Celestial Asia Securities Holdings group of companies. In the China Action (HCA 1675/2003), there is a common defendant with the Hong Kong Action (Cash Assets Limited) but the other defendant is different, although again both defendants are part of the same group of companies. For the most part, it is unnecessary to differentiate between the various legal entities and I shall simply refer to the various defendants as “the Defendants”. The Defendants carry on business as retailers of household utilities and furniture. The Hong Kong Action (HCA 1572/2003 and CACV 316/2005) 4. By a letter of intent dated 24 June 2002 from Bates HK to the holding company of the Defendants, Celestial Asia Securities Holding Ltd (“CASH Ltd”), it was stated that Bates HK would be appointed as the advertising agent for the Defendants for a period of 2 years. The letter set out various terms of the engagement, including the payment of a monthly fee of $320,000 (which was based on an estimated annualized budget of $20 million) and a notice of termination period of 3 months. There were other terms dealing with matters such as performance bonus and other aspects. 5. This was, however, only a letter of intent. When it was signed by Mr Felix Miao, the Director and head of the CASH Group’s Public Affairs Department, the letter contained the words “Subject to Contract” and also the following note at the end : - “Note : This letter is intended solely as a basis for further discussion. Nothing herein contained shall constitute a legally binding agreement between your company or any company within the Pricerite Group and us unless and until a formal legal contract is duly signed.” 6. Following the letter of intent, a formal agreement was prepared by Bates HK (headed Advertising Agency Service Agreement) in which the above terms (amongst other terms) were set out in detail. This draft was not signed. 7. Bates HK’s case was that an oral agreement was reached between the parties on the basis of all the terms set out in the written draft save that there was no agreement on the bonus payable to Bates HK. The main terms relied on by it were that : - (1) the period of the agency agreement was to be from 1 July 2002 to 30 June 2004; (2) for that period the 1st Defendant appointed the Plaintiff as advertising agent for the 2nd Defendant in Hong Kong; (3) the monthly retainer fee for the first year was to be $320,000; (4) there would be charged interest at 1.5% a month for any overdue payments (i.e. not paid within 30 days from receipt of invoice); (5) the Plaintiff would not handle any accounts which would be in competition with the 1st Defendant or its affiliates; (6) termination of the agency agreement by either party would be by three months prior notice. 8. According to the Plaintiffs’ pleaded case, the oral agreement was made at the beginning of July 2002 at a meeting between Ms Chris Leong (who signed the letter of intent as Managing Director), Ms Yvonne Tang and Ms Margaret Hung for Bates HK, and Mr Miao for the Defendants. 9. Thereafter, Bates HK began to provide advertising agency services to the Defendants. This was not in contention at the trial and indeed invoices were sent to the Defendants for work carried out from July to October 2002 and these were paid in full. The Judge regarded these payments as important since they demonstrated not only the existence of an agreement between the parties but also provided strong support for the Plaintiffs’ case as a whole. In my judgment, the Judge was fully entitled to take this view. It was said on behalf of the Defendants (Mr Robin McLeish appeared for them in the appeal and also for the Defendants in CACV 321/2005) that the payments for the work carried out from August to October were only made in May 2003, well after it had been made clear in correspondence that no agreement existed. Thus, he argued, the payments were not indicative of the existence of any agreement at all. The explanation provided by the Defendants for making payment in the sums claimed in the invoices was that they reflected what the Defendants had themselves assessed to be reasonable sums that were payable to Bates HK for the work done (in other words, assessments based on a quantum meruit). 10. I cannot agree with these submissions. First, the payment for the work done in July 2002 was made on 11 October 2002, well before the Defendants began denying the existence of an agreement. Secondly, the Judge regarded it as simply too much of a coincidence that the value of the work allegedly assessed by the Defendants was exactly the same as the contractual rate under the agreement relied on by Bates HK. I can see no fault in this reasoning. I should also add that Mr McLeish was unable to point to any evidence that provided details of the assessment exercise which the Defendants allegedly carried out. It is also a matter of some note that the invoices sent by Bates HK to the Defendants did not contain any details of the work done. 11. The contemporaneous correspondence between the parties also supports the Judge’s conclusions on both the existence and the terms of the agreement between the parties. By a letter dated 11 December 2002, the Defendants sought to terminate Bates HK’s consultancy. The letter was in the following terms : - “We are writing to express our gratitude and appreciation for your good work in advertising consulting, media and strategic advertising and promotional planning for Pricerite Stores Ltd. (‘Pricerite’). It is our pleasure to appoint Bates Hong Kong Ltd. (‘Bates’) as our agency and consultant in the year 2002. We are very delighted to have the opportunity to cooperate with you. We address this letter to you to ensure that there should be no outstanding services remained between Pricerite and Bates. We are looking forward to cooperating with you again in the future and wishing you every success in your business.” 12. By its very terms, the letter recognized the existence of some sort of firmer arrangement between the parties beyond the ad hoc nature of the relationship that was asserted by the Defendants. 13. Next, and more important, the letter prompted a response from Bates HK asking that the Defendants “stick to the letter of our agreement and terminate our [Bates HK’s] service by giving us 3 months notice period”. This was repeated in an e-mail dated 23 January 2003 from Mr Jeffrey Yu (the Chief Executive Officer of Bates HK) to Mr Bankee Kwan (the Chairman and Chief Executive Officer of CASH Ltd). At no stage was there a response denying the need to give 3 month notice. The response dated the same day from Mr Kwan was in the following terms : - “Thanks for dropping me a note today. As a matter of fact, I am highly satisfied with our relationship and the professional services provided by you and your colleagues. I am sure you share my view that we must control our cost and preserve our capital for the downturn of the economy. I view this as our temporary departure from our working relationship. I have full confidence to tell you that we will seek your support for long term basis. Just like you are now riding on a Mercedes Benz while I am riding on a Honda. We will cross the road but please give me some time. Wish you and your colleagues a prosperous year of the Goat! Kung Hey Fat Choy!” 14. The Judge found support for the existence of an agreement in relation to the 3 month notice period in the fact that the Defendants had stipulated that during the time Bates HK worked for them, it would not handle the accounts of any of the Defendants’ competitors. The Judge also made a finding that over the 3 month notice period (December 2002 to February 2003), Bates HK rendered services to the Defendants. This was not challenged on appeal and is in fact borne out by the contemporaneous documents and the evidence of Ms Margaret Hung. Among the documents is a timesheet of Bates HK which clearly shows work done by its staff over the relevant period. 15. All the above strongly supports the existence of an agreement regarding the 3 month notice period and in turn of course reinforces the Plaintiffs’ case generally. Commonsense would also support this conclusion : given the level of commitment shown by Bates HK in the discharge of its responsibilities to the Defendants, it would make sense for a notice of termination period to have been agreed. An ad hoc arrangement in these circumstances appears to be extremely unlikely. Bates HK was not so disadvantaged to have been compelled to enter into an arrangement that made no commercial sense. The correspondence showed that while the parties were negotiating on the level of bonus payments to be made to Bates HK, the Defendants were urging Bates HK to carry out work. Mr Felix Miao, who gave evidence in the trial, referred in his witness statement to the need to provide Bates HK with some “comfort” notwithstanding the absence of a written agreement between them. Bates HK was hardly commercially disadvantaged. 16. I have already referred to some of the points that the Defendants raised to defend the claim. The following contentions were also made : - (1) Much reliance was understandably placed on the words I have earlier quoted from the letter of intent dated 24 June 2002 (see paragraph 4 above) in which it was made clear that nothing contained in the letter would constitute a binding agreement unless a formal contract was signed. This, argued Mr McLeish, made it absolutely clear that no agreement could exist unless there was in existence a signed written contract. (2) The Judge was criticized as not have made any actual findings on the case pleaded by Bates HK that the alleged oral agreement was made in July 2002 (see paragraph 8 above). It was said that although the Judge found the existence of an oral agreement, no findings were made as to exactly how, when, where and between whom the agreement was made. (3) The absence of any agreement on bonus was important as it was indicative that the parties had not reached agreement. The correspondence clearly showed that the parties regarded this aspect of being particularly important. (4) In any event, the person on the Defendants’ side who allegedly made the oral agreement was Mr Miao and he lacked the necessary authority to commit the Defendants into a binding agreement with Bates HK. Reliance was placed on the fact that Bates HK was informed that the person who would sign on any written agreement was a Mr Bernard Law, an executive director and the Chief Financial Officer of CASH Ltd. As an auxiliary point, it was also argued that insofar as the Judge found that even without actual authority, there was ostensible or apparent authority, this was not open to the Plaintiffs as it had not been expressly pleaded. (5) Insofar as the Plaintiffs claimed on a quantum meruit basis (on the assumption of course that no agreement existed) there was no evidence before the Judge to enable any award to be made on this basis. 17. The quantum meruit basis was not a live one before us and Mr Benjamin Chain (who, together with Mr Kenneth Wong, represented the Plaintiffs in the appeal) made no submissions in this regard. As with the other points made by the Defendants, I do not agree that they provide any basis to undermine the judgment below : - (1) The fact it was expressly stated in correspondence that no agreement would come into existence until a signed written agreement was made, did not mean that an oral agreement could not be made. I agree that such expressions would often strongly support such a conclusion but it does not provide an automatic bar to such a finding. Much of course depends on the precise facts of any given case. In the present case, an oral agreement was made on the terms as found by the Judge and this is strongly supported by the actual performance of it by Bates HK, by the contemporaneous correspondence and the payments made by the Defendants. It is worth remarking that, properly analyzed, it could scarcely be denied that an agreement between the parties must have existed : Bates HK actually performed services for the Defendants so that the only question that really remained was identifying the terms of its engagement. (2) Admittedly, the evidence going towards how the oral agreement was actually made was sparse at trial; certainly such evidence as there was did not make out the Plaintiffs’ pleaded case (as identified in paragraph 8 above). However, there was some evidence of the making of the agreement both in the witness statement of Ms Hung and also in her testimony at trial. More important, the Judge was entitled to make a finding that the existence of an oral agreement was supported by the documents and the conduct of the Defendants, without having to go on to make a finding as to precisely how that agreement was made. It must also not be forgotten that the Judge rejected the evidence of the Defendants, in particular the testimony of Mr Miao. (3) The failure of the parties to agree on what was evidently an important issue, namely bonus payments, did not render impossible the existence of an agreement. This is clearly demonstrated by the fact that there was performance by Bates HK, not to mention the other aspects to which reference has already been made. The following extract from the judgment of Lloyd LJ (later Lord Lloyd of Berwick) in Pagnan SpA v Feed Products Ltd [1987] 2 Lloyds Rep 601, at 619(2) is apt : - “It is for the parties to decide whether they wish to be bound and, if so, by what terms, whether important or unimportant. It is the parties who are, in the memorable phrase coined by the Judge, ‘the masters of their contractual fate’. Of course the more important the term is the less likely it is that the parties will have left it for future decision. But there is no legal obstacle which stands in the way of the parties agreeing to be bound now while deferring important matters to be agreed later.” (4) On the question of authority, the Judge found that Mr Miao clearly had authority to enter into a binding agreement on behalf of the Defendants. His testimony to the contrary was rejected by the Judge and nothing that has been advanced by Mr McLeish undermines the Judge’s finding. The fact it was intended that Mr Bernard Law would actually sign any formal contract did not mean that Mr Miao did not have the necessary authority. It should also be remembered just what position Mr Miao held within the CASH group of companies : he was a director of CASH Ltd (the holding company of the Defendants) and the head of the CASH Group’s Public Affairs Department. 18. In my judgment, the Judge was, with respect, fully entitled to reach the conclusions he did and award damages to Bates HK in the sum of $1,383,226 together with interest at the contractual rate of 1.5% a month from the date of the writ to judgment and thereafter at the judgment rate. The China Action (HCA 1675/2003 and CACV 321/2005) 19. The main issue in this action was the same as in the Hong Kong Action : whether notwithstanding the absence of a written agreement between the parties, an oral agreement nevertheless existed for the provision of advertising agency services by Bates China. The difference in the services provided by the Plaintiff in this case, Bates China, was that the promotional work would relate to China (specifically in relation to the Defendants’ store in Guangzhou). As the Judge remarked in his judgment, the promotional work carried out by Bates China preceded the work done by Bates HK in the other contract. 20. The Judge dealt with the issues in the China Action in the same way as in the Hong Kong Action and ultimately decided that if an agreement existed in relation to the Hong Kong engagement, it was likely that one must have existed regarding the work carried out by Bates China in China. This was an approach that was justified on the evidence. For example, in the presentations made to the Defendants by Bates China and Bates HK, the activities in China were coupled to those in Hong Kong. The presentation made to the Defendants on 10 May 2002 stated (regarding a previous meeting), “Exchanged views on how we will work in China and Hong Kong”. 21. As in the case of Bates HK, there was a letter of intent dated 1 May 2002 from the Defendants to Bates China whereby Bates China was appointed “to handle all marketing communication activities for [the Defendants]”. That letter also stated that the terms of the engagement would be further discussed and finalized. A draft agreement (also ultimately not signed by the parties) also came into existence setting out the terms of the engagement. The principal terms for present purposes were as follows : - (1) The duration of the appointment of Bates China was from 1 June 2002 to 31 December 2002. (2) The monthly retainer fee was to be $150,500. (3) Interest at the rate of 1.5% a month would be charged on any overdue accounts (the credit period was 30 days from the date of receipt of invoices). 22. The Judge found that an oral agreement was made between the parties containing the terms of the draft agreement except for those relating to the bonus payable. This aspect was again the point on which the parties could not agree. In an e-mail dated 18 September 2002 from Mr Felix Miao to Ms Grace Wong of Bates China, it was stated : - “In terms of the actual contract, I do not believe that there are too much specific issues that we have to deal with. However, I have communicated to Bates HK that the directors would like to review the contracts together with the proposed performance incentive measurements simultaneously.” The reference to “contracts” was a reference to the proposed agreements with both Bates HK and Bates China (as stated above, the two engagements went hand in hand). 23. In my view, the Judge was again fully entitled, after hearing the evidence, to reach the conclusions he did. The existence of an agreement is supported as well by the following : - (1) Work was again carried out by Bates China. This was far from a situation where parties are negotiating before performance : here, while the parties were negotiating on the bonus calculations, there was actual performance. (2) Invoices or debit notes (dated 6 August 2002, 2 September 2002 and 2 April 2003) were sent by Bates China to the Defendants in relation to the months from June through to December 2002. These referred to the monthly retainer fee of $150,500, and also to the credit and interest terms set out above. At no stage did the Defendants dispute Bates China’s entitlement to payment (except when litigation was contemplated) or the terms regarding the credit period and interest. Far from it. By an e-mail dated 11 December 2002 from Mr Miao to Mr Barry Leung (the Regional Director of Bates China), the Defendants were almost apologetic in not having paid the invoices in relation to the June to September 2002 monthly retainer fees. The e-mail stated as well, “I [Mr Miao] have signed-off all invoices, thus verifying from the GPA [Group Public Affairs] perspective”. This verification was further confirmed in an e-mail the next day from Ms Rosa Li (a manager in the GPA Department). It was suggested by Mr McLeish that there may be some doubts as to the authority to write these e-mails but this contention was not substantiated by any concrete evidence. 24. The main thrust of the Defendants’ arguments in the appeal was that the Judge was not entitled on the evidence to make the finding that an oral agreement existed. Mr McLeish referred to Bates China’s pleading which alleged an agreement in writing, being the said e-mail dated 18 September 2002 (see paragraph 22 above). This was to be contrasted with the Judge’s finding of an oral agreement. I have to say that the pleading ought to have been amended to make clear the Plaintiffs’ real case but as the point was not really taken by the Defendants below, Mr McLeish very fairly acknowledged that a pleading point could not be taken at this stage. Nevertheless, he argued, this was however a point to be taken into account to test the credibility of the Plaintiffs’ case. In my view, the Judge did weigh up all the relevant material before him before reaching a conclusion that was, with respect, correct. 25. The Judge was therefore entitled to enter judgment for the Plaintiffs in this action for $1,053,500 together with interest at the contractual rate of 1.5% a month from the date of the writ to judgment and thereafter at the judgment rate. Conclusion 26. For the above reasons, I would dismiss both appeals. I would also order that there be a costs order nisi that the Defendants pay to the Plaintiffs the costs of the appeals, such costs to be taxed if not agreed. Hon Stock JA : 27. I agree. Hon Sakhrani J : 28. I agree with the judgment of Ma CJHC. Hon Ma CJHC : 29. The appeals are accordingly dismissed with costs orders nisi that the Defendants pay to the Plaintiffs in each appeal the costs of the appeal, such costs to be taxed if not agreed. (Geoffrey Ma) Chief Judge, High Court (Frank Stock) Justice of Appeal (Arjan H. Sakhrani) Judge of the Court of First Instance Mr Benjamin Chain & Mr Kenneth Y F Wong, instructed by Messrs Jesse H Y Kwok & Co for the Plaintiffs/Respondents Mr Robin McLeish, instructed by Messrs A M Mui & Kwan for the 1st & 2nd Defendants/Appellants Look up this case on Lawcite Noteup",
  "length": 23669,
  "headers_seen": [
    "The Hong Kong Action (HCA 1572/2003 and CACV 316/2005)",
    "The China Action (HCA 1675/2003 and CACV 321/2005)",
    "Conclusion"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkca/2006/444",
  "query": "quantum meruit",
  "ts": "2025-10-17T10:43:07",
  "ok": true
}