{
  "title": "ALEXINA INVESTMENTS LTD AND ANOTHER V. KEYSBERG LTD AND OTHERS | [2004] HKCFI 94 | HKLII",
  "court": null,
  "year": 2004,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2004] HKCFI 94 ALEXINA INVESTMENTS LTD AND ANOTHER V. KEYSBERG LTD AND OTHERS Judgment Information Date 16 Mar, 2004 Action No. HCA6359/1992 Neutral Cit. [2004] HKCFI 94 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCA6359/1992 HCA006359D/1992 ALEXINA INVESTMENTS LTD AND ANOTHER v. KEYSBERG LTD AND OTHERS HCA006359D/1992 HCA6359/1992 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE ACTION NO.6359 OF 1992 --------------------- BETWEEN ALEXINA INVESTMENTS LIMITED 1st Plaintiff SOVEREIGN NOMINEES LIMITED formerly known as Roche Nominees Limited 2nd Plaintiff AND KEYSBERG LIMITED 1st Defendant COLLINWOOD LIMITED 2nd Defendant CARRASCO INVESTMENTS LIMITED 3rd Defendant MANOHAR RAJARAM CHHABRIA 4th Defendant JUMBO INTERNATIONAL HOLDINGS LTD 5th Defendant CHANDRU SAMTANI 6th Defendant and VIJAY MALLYA Third Party ---------------------- Coram: Hon Waung J in Chambers Date of Hearing: 17 March 2004 Date of Judgment: 17 March 2004 ------------------------- J U D G M E N T ------------------------- 1. I have before me an application for a stay of proceedings by the defendants or alternatively for a stay of proceedings relating to the remedies that are still outstanding, the court having by my judgment of 8 January 2004, adjudged that so far as liability is concerned, the defendants are liable. 2. A notice of appeal had been put in, alleging a large number of grounds. The appeal date had been fixed for November 2004. The question now is whether because of an appeal pending that there should be either a stay of proceedings generally or a stay of proceedings partially to stop any further proceedings in relation to the remedies, that is to ascertain what and/or how much should be due by the various defendants to the various plaintiffs. 3. I have heard the detailed argument from Mr Barlow. He first characterised the appeal in relation to the 2nd, 3rd, 4th and 5th defendants (who of course have no contractual relationship with the plaintiffs but who have been sued by reason of breaches of trust) as being strong. The strong appeal is held by Ma J (as he then was) in Star Play Development Limited v. Bess Fashion Management Company Limited , HCA4726/2001, at page 3 under ground (7), as what might constitute a good reason for a stay. I think it is conceded and is agreed also on all sides that the mere fact that there is an appeal by itself does not constitute a good reason for a stay. It is trite law that an appeal does not operate as a stay, and the court does not deprive the successful plaintiffs of the fruit of a judgment or stop the proceedings merely because of an appeal. So it requires a very good reason to order a stay of proceedings. 4. The question that has arisen is, sitting here as I am and being familiar with the matter, whether I can agree with Mr Barlow that so far at least as the 2nd to 5th defendants are concerned that he has what I might call the extreme situations described by Ma J in paragraph 8 on page 3 of the Star Play judgment, that is, a strong appeal or the existence of a strong appeal. In my view, although the grounds in the appeal are arguable, they are no more than what in ordinary way an appellant having a prospect of appeal. I am certainly not persuaded that they fall into the extreme situation of strong appeal. 5. Mr Burns contends that if there is no strong prospect of the appeal being allowed then there are no good reason or no sufficient ground for ordering a stay. I agree. 6. But I am prepared to consider (in case I am wrong) that I need to look at all the circumstances. It seems to me that even if I do it on that basis, Mr Barlow has not made out a case that the remedies aspect should not go ahead. 7. I take on board of course the fact that there would be considerable costs which would be incurred if the court does not order a stay. No doubt directions will have to be given for the further progress of the case in relation to remedies and damages and of course costs would be incurred to take the steps ordered and, no doubt, that if at the end of the day whether in the Court of Appeal or in the Court of Final Appeal the liability against all the defendants are held to be not sustainable then those costs would be wasted, but they are in no way different from costs incurred for quantum in a trial involving both liability and quantum. It seems to me that the fact of cots will be incurred for remedies is not a sufficiently good reason to order a stay of proceedings. The plaintiffs are entitled, having won on liability, to ask the court to continue to go on to complete the process by the appropriate trial on the outstanding aspect of the claim, namely to ascertain the amount payable which in this case is a very large amount, likely in any event to exceed US$20 million. The defendants are largely foreign based with no known assets in Hong Kong. The time that would be wasted if the remedies are not proceeded until everything on appeal have been cleared up could be long. 8. I need to balance all the circumstances into my consideration. I certainly take on board the fact that this matter has taken a long time to come on. I certainly take on board the fact that the plaintiffs may not be substantial companies themselves. It seems to me that balancing all the considerations that it would be wrong to order a stay without at least imposing the condition that money is to be paid into court so that the plaintiffs' position will not be prejudiced by an order of a stay. 9. In all circumstances, I do exercise my discretion by refusing to order a stay unless within 14 days from today the sum of US$20 million is paid into court. ( William Waung ) Judge of the Court of First Instance, High Court Representation: Mr Ashley Burns, instructed by Messrs Jonathan Rostron, for the Plaintiffs Mr Barrie Barlow, instructed by Messrs Susan Liang & Co., for the 1st to 5th Defendants Mr Mark Side of Messrs Tanner De Witt, for the Third Party Look up this case on Lawcite Noteup",
  "length": 6087,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2004/94",
  "query": "stay of proceedings",
  "ts": "2025-10-17T10:45:45",
  "ok": true
}