{
  "title": "ARJOWIGGINS HKK2 LTD V. X CO | [2016] HKCFI 1901 | HKLII",
  "court": null,
  "year": 2016,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2016] HKCFI 1901 ARJOWIGGINS HKK2 LTD V. X CO Judgment Information Date 12 Oct, 2016 Action No. HCCT53/2015 Neutral Cit. [2016] HKCFI 1901 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCCT53/2015 HCCT53/2015 ARJOWIGGINS HKK2 LTD v. X CO HCCT 53/2015 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO 53 OF 2015 ______________ IN THE MATTER of the Arbitration Ordinance ( Cap 609 ) and IN THE MATTER of an Arbitration ______________ BETWEEN ARJOWIGGINS HKK2 LIMITED Applicant (Claimant in Arbitration ) and X CO Respondent (Respondent in Arbitration ) ______________ Before: Hon Mimmie Chan J in Chambers Date of Hearing: 9 September 2016 Date of Decision: 12 October 2016 _____________ D E C I S I O N _____________ Background 1. This is an application made to set aside an award made in an arbitration which was conducted in Hong Kong (“ Arbitration ”), pursuant to a notice of arbitration (“ Notice ”) filed with the Hong Kong International Arbitration Centre (“ HKIAC ”) and served on 19 October 2012. The Arbitration was commenced by Arjowiggins HKK2 Limited (“ Claimant ”) against X Co (“ Respondent ”), under a joint venture contract dated 27 October 2005 (“ JV Contract ”) made between the Claimant and the Respondent. 2. Under the JV Contract, the Claimant and the Respondent agreed to establish a joint venture company on the Mainland in accordance with the relevant PRC laws and regulations. As stated in Article 5.1 of the JV Contract, the purpose of the JV Company was to manufacture paper products “in order to achieve favorable economic results and a high rate of return for the parties”. The JV Contract sets out the parties’ respective capital contributions. Under Article 3.1(5), the Respondent warrants that it shall by itself enter into or procure its affiliated companies to enter into Related Contracts (as defined) with the JV Company, pursuant to which the Respondent and/or its concerned affiliated companies “shall ensure” that the JV Company “shall have a continuous and stable supply of power, water, steam and wastewater treatment facilities at affordable rates in accordance with the terms and conditions of each of the Related Contracts”. The relevant Related Contracts are set out in Schedule 1 of the JV Contract, and these include a Steam Supply Contract made between the Respondent and the JV Company (represented by the Claimant under the said contract), which was signed on 9 September 2005 (“ Steam Supply Contract ”). 3. The recitals of the Steam Supply Contract refer to the fact that the Respondent as the owner of steam generating facilities had undertaken under the JV Contract to provide the JV Company with a stable and economic supply of steam throughout the term of the Steam Supply Contract. Under Article 1 of the Steam Supply Contract, the Respondent agreed and undertook to supply steam to the JV Company’s plant in such manner as is required by the JV Company to conduct its business. 4. Under the JV Contract itself, the Claimant and the Respondent agreed (article 7.4.4) that each shall be responsible for “cooperating to achieve the practice and goals of the JV Company” as set forth in the JV Contract and the Related Contracts, by executing by itself and procuring its concerned affiliated companies to execute any and all documents, and taking all actions necessary or advisable to effect the foregoing. 5. Article 23.1 of the JV Contract states that the formation of the JV Contract, “its validity, interpretation, execution and settlement of any disputes arising hereunder shall be governed by, and construed in accordance with, the laws of the PRC.” 6. The arbitration clause of the JV Contract provides, under Article 24.2.1: “Any dispute arising out of or in connection with this Contract, including any question regarding its existence, validity or termination or as to rights or obligations of the parties hereunder which is not settled by friendly discussions pursuant to Article 24.1 shall be referred to and finally resolved by arbitration in Hong Kong in accordance with the Arbitration Rules of the Hong Kong International Arbitration Centre (the “HKIAC Rules”) for the time being in force which rules are deemed to be incorporated by reference into this article save and except for any multiplication made hereunder or otherwise agreed by the Parties. The arbitral award shall be final and binding on the parties.” 7. Article 24.2.4 further provides as follows: “To the extent this Article is deemed to be a separate agreement independent from this Contract, Article 23.1 concerning governing law and Article 26.3 concerning notices are incorporated herein by reference.” 8. Disputes arose between the Claimant and the Respondent as to whether the Respondent was entitled to terminate the supply of steam to the JV Company under the Steam Supply Contract, as a result of which various proceedings were instituted on the Mainland. These include proceedings commenced by the Respondent for the dissolution of the JV Company in June 2010, and the JV Company was ordered by the Weifeng Intermediate Court to be dissolved. 9. In October 2012, the Claimant commenced the Arbitration pursuant to the JV Contract, claiming that the Respondent was in breach of the provisions of the JV Contract, by seeking the dissolution of the JV Company without the necessary unanimous vote of all the directors of the JV Company pursuant to Article 10.14 of the JV Contract, and in failing to supply steam in accordance with the provisions of Articles 3.1 (5) and 12.3 of the JV Contract. On its part, the Respondent counterclaimed for damages in respect of the Claimant’s breach of the JV Contract and/or its breach of PRC law. 10. Following hearings in September 2014 and January 2015 which took place before the tribunal in the Arbitration (“ Tribunal ”), the Tribunal rendered the Award on 20 November 2015, whereby it found that the Respondent was in breach of Article 3.1 (5) of the JV Contract, by failing to supply steam to the JV Company, and was in further breach of its obligations under the JV Contract by seeking the judicial dissolution of the JV Company. The Tribunal further found that the Respondent was in breach of its obligations of good faith and fair dealing, and dismissed the Respondent’s counterclaims in their entirety. By a majority, damages in the sum of RMB 167,860,000 were awarded to the Claimant, with interest and costs. 11. On 7 December 2015, the Applicant obtained leave of the Court to enforce the Award (“ Order ”) in Hong Kong. On 17 and 19 February 2016 respectively, the Respondent applied to set aside the Order and the Award, on the ground that (under Article 34 (2) (a) (i)) the arbitration agreement between the parties was invalid under PRC law; that the Award deals with a dispute not contemplated by or falling within the terms of the submission to arbitration or contains decisions on matters beyond the scope of the submission (under Article 34 (2) (a) (iii)); and that (under Article 34 (2) (a) (iv)) the composition of the Tribunal was not in accordance with the agreement of the parties. 12. The parties do not dispute that PRC law is the governing law of the JV Contract and the law of the arbitration agreement (by virtue of the provisions of Articles 23.1 and 24.2.4 of the JV Contract). It is also indisputable that the Arbitration which was held and seated in Hong Kong is governed by the Arbitration Ordinance Cap 609 (“ Ordinance ”) (s 5 of the Ordinance), and that Hong Kong law is the lex arbitri governing the conduct of the arbitral proceedings and the exercise of the Court’s supervisory jurisdiction over the Arbitration ( PCCW Global Ltd v Interactive Communications Service Ltd [2007] 1 HKLRD 309 , 314E-315). 13. Having considered the submissions made by Counsel and the evidence adduced in this case, I find that there is no substance in the Respondent’s application to set aside the Order, or the Award. The following are my reasons. The invalidity ground 14. In support of its case that Article 24.2.1 of the JV Contract is invalid as an arbitration agreement, the Respondent relies on expert evidence on Article 16 of the PRC Arbitration Law. This states: “An arbitration agreement shall include the arbitration clauses stipulated in a contract and any other written agreement for arbitration concluded before or after a dispute occurs. The following contents shall be included in an arbitration agreement: (1) the expression of the parties’ wish to submit for arbitration ; (2) the matters to be arbitrated; and (3) the Arbitration Commission selected by the parties.” 15. It is not disputed by the Claimant that HKIAC is not expressly identified as the arbitration commission or institution in Article 24.2.1. 16. The Respondent’s expert (“ Wang ”) has referred to Articles 3 and 6 of the Interpretation of the Supreme People’s Court (“ SPC ”) on the PRC Arbitration Law (“ SPC Interpretation ”). Article 3 of the SPC Interpretation provides that if the name of the arbitration body stipulated in the arbitration agreement is incorrect but the specific arbitration body can be determined, the agreement may be found to have selected an arbitration body. Article 6 of the SPC Interpretation states that if an arbitration agreement stipulates arbitration by an arbitration body in a certain location and the said location has only one arbitration body, this arbitration body shall be regarded as the agreed arbitration body. If the location has multiple arbitration bodies, the parties may agree to select one of these arbitration bodies when applying for arbitration . If the parties cannot reach a consensus concerning the selection of arbitration body, the arbitration agreement is invalid. 17. In support of its claim that Article 24.2.1 is invalid as an arbitration agreement, the Respondent relies on Article 4 of the SPC Interpretation. This states that if an arbitration agreement stipulates merely the arbitration rules that apply to the dispute, it shall be regarded as not stipulating the arbitration body, unless the parties reach a supplemental agreement or are able to determine an arbitration body based on the agreed arbitration rules. 18. Wang’s opinion refers to the fact that the HKIAC Rules do not contain a deeming provision similar to Article 4 (3) of the CIETAC Arbitration Rules, to the effect that the parties’ agreement to undergo arbitration in accordance with the CIETAC Rules shall be regarded as agreeing to submit the dispute to the CIETAC Arbitration Commission for arbitration . In Wang’s opinion, the absence of such a deeming provision in the HKIAC Rules, coupled with the fact that there are more than one arbitral institutions in Hong Kong, lead to the conclusion that Article 24.2.1 is invalid by operation of Article 16 of the PRC Arbitration Law, as interpreted by the SPC Interpretation. 19. The absence of a deeming provision similar to Article 4 (3) of the CIETAC Arbitration Rules only means that the mere reference to the HKIAC Rules cannot automatically be taken to mean that the HKIAC will be the arbitral body administering the arbitration . It cannot by itself lead to the conclusion that the clause is invalid under Article 16. 20. Wang referred to various decisions of the SPC in his opinion, but these are on the basis that if the arbitration body cannot be determined from the arbitration rules, the arbitration clause is invalid under Article 16. The test is whether the arbitration body can be determined - as recognized by Article 4 of the SPC Interpretation itself. 21. As highlighted by Leading Counsel for the Claimant, and by the Claimant’s expert (“ Fei ”), HKIAC as the arbitration body can be ascertained and identified from the HKIAC Rules. The role and powers of the HKIAC as the institution administering the Arbitration are provided in numerous parts of the HKIAC Rules themselves. The Introduction to the HKIAC Rules states that the rules were adopted by the Council of the HKIAC for use by parties who seek the formality and convenience of an administered arbitration . Article 4 of the HKIAC Rules requires the notice of arbitration to be filed with the HKIAC Secretariat. The HKIAC Secretariat has the power to extend time limits provided for in the HKIAC Rules. Article 5 requires the answer to the notice of arbitration to be submitted to the HKIAC Secretariat. The HKIAC Secretariat has the power to require a notice of arbitration to be amended. Section III of the HKIAC Rules states the administrative functions, powers and duties of the HKIAC Counsel in the management of the arbitration process and the appointment of arbitrators. 22. On behalf of the Claimant, Mr Coleman SC argued that a reference to the HKIAC Rules in an arbitration clause is sufficient for the purpose of designating HKIAC as the arbitration commission, as supported by the fact that even the model arbitration clause suggested by the HKIAC Rules merely provides for settlement by arbitration in Hong Kong under the HKIAC Rules. The model clause proposed by the HKIAC for adoption by parties who wish to have disputes referred to arbitration in accordance with the HKIAC Rules is as follows: “Any dispute, controversy or claim arising out of or relating to this contract, including the validity, invalidity, breach or termination thereof, shall be settled by arbitration in Hong Kong under the Hong Kong International Arbitration Centre Administered Arbitration Rules in force when the Notice of Arbitration is submitted in accordance with these rules.” (Emphasis added) 23. Considering the HKIAC Rules as a whole, I accept Fei’s evidence and agree with him that the arbitration body can be identified and determined from the HKIAC Rules themselves. 24. Even if the HKIAC Rules do not clearly identify HKIAC as the body to administer the Arbitration , Article 4 of the SPC Interpretation expressly provides for the ability of the parties to reach a “supplemental agreement” as to the stipulation of the arbitration party. Article 4 states: “If an arbitration agreement stipulates merely the arbitration rules that apply to a dispute, it shall be regarded as not stipulating the arbitration party, unless the parties reach a supplemental agreement or are able to determine an arbitration body based on the agreed arbitration rules .” (Emphasis added) 25. The Claimant and the Respondent in this case had no difficulty in determining HKIAC as the arbitration body to administer the Arbitration , from the time when the Notice was served in October 2012. By agreeing to the Amended Terms of Appointment of the arbitrators and participating in the Arbitration administered by the HKIAC, the Claimant and the Respondent had clearly agreed to HKIAC as the arbitration body to administer the Arbitration . Other than objecting to the Tribunal’s rejection of the Respondent’s application for an extension of time to appoint its arbitrator and to the Tribunal’s appointment of Professor Lu Song as the Respondent’s arbitrator upon the Respondent’s default, the Respondent raised no objection to the appointment of the other arbitrators on the Tribunal, nor to the conduct of the Arbitration in accordance with the HKIAC Rules. 26. In Fei’s opinion, which I accept, the parties’ adoption of the Amended Terms of Appointment in the Arbitration amounts to a valid supplementary agreement, which identified HKIAC as the arbitration institution, to constitute a valid arbitration agreement under the PRC Arbitration Law. On the other hand, Wang has failed to address, or to address adequately, the issues of whether or not the parties had reached a supplemental agreement on the arbitration body, and whether HKIAC can be determined as the arbitration body from the agreed HKIAC Rules. I agree that Wang has failed to give his opinion as an independent expert of the Court, and has simply reargued the case of the Respondent as advanced by the Respondent’s team, of which Wang formed a part, in the PRC proceedings and in the Arbitration . 27. Significantly, it must be emphasized that the Respondent never raised issue with the Tribunal that HKIAC was not intended to be the arbitration institution to conduct the Arbitration under Article 24.2.1, or that there was no valid arbitration agreement for submission of their dispute to the Tribunal for arbitration . The Respondent signed the Amended Terms of Appointment, in which the parties acknowledged and expressly agree that the Tribunal had been validly established in accordance with the JV Contract and Article 8 of the HKIAC Rules, and that HKIAC was to handle the security and payment for the Tribunal’s fees and disbursements. The Respondent filed its Answer and counterclaim, and fully participated in the Arbitration . 28. Article 4 of the Model Law, adopted by s 11 of the Ordinance, expressly states: “A party who knows that any provision of this Law from which the parties may derogate or any requirement under the arbitration agreement has not been complied with and yet proceeds with the arbitration without stating his objection to such non-compliance without undue delay or, if a time limit is provided therefore, within such period of time, shall be deemed to have waived his right to object.” 29. Article 28 of the HKIAC Rules, which the parties agreed under Article 24.2.1 of the JV Contract should apply to the Arbitration , also states: “A party who knows or ought reasonably to know that any provision of, or requirement arising under, these Rules (including the agreement to arbitrate) has not been complied with and yet proceeds with the arbitration without promptly stating its objection to such non-compliance, shall be deemed to have waived its right to object.” 30. As Mr Coleman was quick to point out, Wang was part of the legal team representing the Respondent in the Arbitration . All the objections now raised by him under the PRC law governing the Arbitration were well known to him at the time of the Arbitration , but none of them were raised until now. 31. Article 20.3 of the HKIAC Rules further provides that: “A plea that the arbitral tribunal does not have jurisdiction shall be raised if possible in the Answer to the Notice of Arbitration , but shall in no event be raised later than in the Statement of Defence referred to in Article 18, or, with respect to the counterclaim, in the reply to the counterclaim.” 32. The Hong Kong courts have made it clear that a party to an arbitration who wishes to rely on any non-compliance with the rules governing the arbitration should do so promptly, and should not proceed with the arbitration as if there had been compliance, keeping the point up its sleeve for later use ( Hebei Import & Export Corp v Polyteck Engineering Co Ltd (1999) 2 HKCFAR 111 , China Nanhai Oil Joint Service Corp Shenzhen Branch v Gee Tai Holdings Co Ltd [1995] 2 HKLRD 215 ). There is a duty of good faith which required the Respondent in this case to bring to the notice of the Tribunal any objections it may have to the validity of the arbitration agreement. Not having done so, choosing instead not only to fully participate in the Arbitration , but also to make a counterclaim against the Claimant, to adduce factual and expert evidence and to make full submissions on the merits, the Respondent had deprived the Tribunal of the opportunity to rectify any alleged invalidity or defect in the arbitral process, and is estopped and precluded now from raising this complaint and objection as to alleged invalidity and lack of arbitration agreement. 33. The case of Klockner Pentaplast GmbH & Co KG v Advance Technology (HK) Co Ltd [2011] 4 HKLRD 262 relied upon by the Respondent is distinguishable from the present case, since the party raising the invalidity of the arbitration agreement in Klockner was opposing the application for stay of the proceedings to arbitration , and had not participated in the arbitration itself. 34. The question of whether the arbitration agreement is valid is governed by the law of the arbitration agreement, in this case PRC law. However, whether or not the Award should be set aside, and whether enforcement of the Award should be allowed in Hong Kong is a question governed by Hong Kong law, under the Ordinance. 35. There is no merit to the invalidity ground under PRC law, and no ground that the Award should be set aside and refused enforcement under the Ordinance. The jurisdiction ground 36. The Respondent seeks to rely on Wang’s evidence that the Tribunal had no jurisdiction to determine the claims submitted by the Claimant in the Arbitration , that the Respondent was in breach of the JV Contract by failing to supply steam to the JV Company, and by having commenced dissolution proceedings against the JV Company. This is stated to be on the basis that the JV Company had submitted to the jurisdiction of the PRC courts, when the Respondent filed its claim against the JV Company in the Shouguang Court in December 2008 for fees due under the Steam Supply Contract, and when the Respondent initiated dissolution proceedings against the JV Company in the PRC Weifang Court in November 2010. The Respondent further relies on the fact that the Weifang Court had refused to enforce a CEITAC award made in arbitration proceedings which the JV Company had commenced against the Respondent in Beijing under the Steam Supply Contract, and that the Shouguang Court had held that the Steam Supply Contract had been validly terminated by the Respondent. 37. It is clear and beyond argument that the claims made in the Arbitration are made by the Claimant, a separate legal entity to the JV Company, and under the JV Contract, a separate agreement to the Steam Supply Contract made between the JV Company and the Respondent. The Claimant has separate rights, and the Respondent has separate obligations, under the JV Contract for the Respondent’s supply of steam to the JV Company. These rights and obligations are separate and distinct from the rights of and obligations owed to the JV Company under the Steam Supply Contract. Any submission by the JV Company to the jurisdiction of the PRC courts, and any assumption of jurisdiction by the PRC courts over the JV Company in respect of the Steam Supply Contract, cannot affect the rights of the Claimant to pursue the Arbitration in Hong Kong in respect of the alleged breaches of the Respondent under the JV Contract. 38. The dispute as to the Respondent’s alleged breach of its obligations owed to the Claimant under the JV Contract is clearly a dispute “arising out of or in connection with” the JV Contract, to fall squarely within the scope of the arbitration clause in Article 24.2.1. The issues for determination, and decided by the Tribunal, in the Arbitration were whether the Respondent was in breach of Article 3.1 (5) of the JV Contract by failing to supply steam to the JV Company, and in breach of Article 10.14 of the JV Contract by seeking the dissolution of the JV Company without the unanimous vote of all directors at a meeting which is quorate. 39. The position is clear, and supported by the opinion of Fei, that any adjudication by the PRC courts as to the rights and obligations of the parties to the Steam Supply Contract cannot give rise to any issue of res judicata between the Claimant and the Respondent, since the parties to the JV Contract and the Steam Supply Contract are different, and the agreements adjudicated upon are different. 40. In addition, the expert evidence of Fei is clear, that: (1) res judicata under PRC law is part of the PRC Civil Procedure Law, which has no application to proceedings outside the PRC; (2) the issue decided by the PRC court, as to whether a winding up order should be made by the PRC court under Article 182 of the PRC Company Laws, is totally different to the issue for determination in the Arbitration , as to whether Article 10.14 of the JV Contract has been complied with for a party to the JV Contract to seek the dissolution of the JV Company, and whether the Claimant’s contractual rights under the JV Contract should be enforced; (3) the subject matter, parties and remedies sought in the dissolution proceedings before the PRC court are all different to the subject matter, parties and remedies in the Arbitration of the JV Contract before the Tribunal. 41. Again, no challenge was ever made by the Respondent in the Arbitration that the Tribunal had exceeded the scope of its authority in dealing with the issues raised in the Arbitration , which issues were known to and agreed by the Respondent, and in fact submitted by both parties to the Tribunal for determination. The Tribunal was in fact made aware of the PRC proceedings, except for the judgment of the Shouguang court. 42. There is accordingly no merit in the jurisdiction ground, or in the claim that the issues are not arbitrable under PRC law. The Tribunal never purported to make any order to dissolve the JV Company, or to rule on the dissolution of the JV Company. It only decided that the Respondent was in breach of the provisions of Article 10.14 of the JV Contract. The points made by Wang and by Counsel for the Respondent, that only the PRC court has jurisdiction to order the judicial dissolution of the JV Company on the grounds set out in the PRC Company Law are totally irrelevant to the question of the jurisdiction of the Tribunal, or the arbitrability of the matters submitted to the Tribunal in the Arbitration . The composition ground 43. Under Article 24.2.2 of the JV Contract, the Tribunal is to consist of 3 arbitrators for determination of disputes arising out of or in connection with the JV Contract. Article 24.2.2 provides: “The tribunal shall consist of 3 arbitrators. Party A and Party B shall each appoint one arbitrator within 30 days of the referral of the dispute to arbitration . The 2 arbitrators appointed by Party A and Party B shall appoint a third arbitrator. If any Party fails to appoint its arbitrator or such arbitrators are unable to agree upon the third arbitrator within 60 days of the referral of the dispute to arbitration , then the Party’s arbitrator or the third arbitrator, as the case may be, shall be appointed by the Chairman of the Hong Kong International Arbitration Centre.” 44. The Respondent as Party B to the JV Contract failed to appoint its arbitrator within 60 days of the referral of the dispute to the Arbitration . Its application for an extension of time to make the appointment was dismissed by the Secretariat of the HKIAC. By letter dated 27 December 2012, HKIAC informed the parties that in accordance with Article 24.2.2 of the JV Contract, the HKIAC Council had appointed Professor Lu as the Respondent’s arbitrator. By letter dated 11 January 2013, HKIAC informed the parties that Mr Christopher Lau SC was confirmed to be the 3 rd and presiding arbitrator as nominated by Dr Moser (the arbitrator appointed by the Claimant) and by Professor Lu. 45. As indicated in the earlier parts of this Decision, the Respondent only objected to HKIAC’s refusal to grant a time extension. The challenge to Professor Lu’s appointment was in limited terms only before the Tribunal. The Respondent did not challenge the appointment of Mr Lau in the Arbitration . 46. The Respondent now contends before this Court that the appointment of Professor Lu and of Mr Lau was not in accordance with the parties’ agreement under Article 24.2.2, in that Professor Lu and Mr Lau were not, but should have been, appointed by the Chairman of the HKIAC, and not by the Council. 47. On a plain reading of Article 24.2.2, where the Respondent failed to appoint its arbitrator within the 60 days period specified in Article 24.2.2, the Respondent’s arbitrator was to be appointed by the Chairman of the HKIAC. 48. The part of Article 24.2.2 which reads “or the 3 rd arbitrator” (to be appointed by the Chairman) does not apply, when the 2 arbitrators can agree on the 3 rd arbitrator. 49. The Chairman of the HKIAC is part of the Council which made the appointment of Professor Lu in this case. I do not accept that the Respondent has furnished proof (as it is required under Article 34 (2) (a) to do) that the ground under Article 34 (2) (a) (iv) has been made out. 50. Opposition to enforcement and recognition of awards based on unmeritorious technical points or minor procedural complaints have always been viewed with disfavor by the Hong Kong courts. In Grand Pacific Holdings Ltd v Pacific China Holdings Ltd (in liq) (No 1) [2012] 4 HKLRD 1 , the Court of Appeal made it clear (in the context of inability to present a party’s case as a ground of opposition) that “the conduct complained of must be serious, even egregious”, before a court could find that a ground has been made out. In his judgment (at paragraphs 94 and 105), Tang VP (as His Lordship then was) explained: “ ... the conduct complained of must be sufficiently serious or egregious so that one could say a party has been denied due process... ... an error would only be sufficiently serious if it has undermined due process. ... Even so, the Court may refuse to set aside the award if the Court is satisfied that the arbitral tribunal could not have reached a different conclusion. How a court may exercise its discretion in any particular case will depend on the view it takes of the seriousness of the breach. Some breaches may be so egregious that an award would be set aside although the result could not be different. ” 51. Even if a ground can be made out that Professor Lu was not appointed by the Chairman, but by the Council only, I fail to see how it can be said that the Respondent suffered any prejudice as a result of the appointment by the Council, and how due process can be said to have been undermined as a result. I am not prepared to exercise my discretion to set aside the Award on the ground that there has been a serious or egregious error in the appointment of Professor Lu (or Mr Lau), to constitute a denial of due process. 52. The points made in the earlier parts of this Decision, as to the Respondent’s failure to raise its objections to the Tribunal, apply to this ground of complaint. The Respondent agreed to and confirmed the validity of the composition of the Tribunal by signing the Amended Terms of Appointment, and participated in the Arbitration notwithstanding the alleged irregularity in the appointment, without raising these objections and depriving the Tribunal of the opportunity to rectify any such defect. The Court will not permit the Respondent to raise these alleged irregularities now ( Hebei Import & Export Corp v Polyteck Engineering Co Ltd (1999) 2 HKCFAR 111 , China Nanhai Oil Joint Service Corp Shenzhen Branch v Gee Tai Holdings Co Ltd [1995] 2 HKLRD 215 ). Conclusion 53. For all the above reasons, the Respondent’s applications to set aside the Order and the Award are dismissed as totally without merit, with costs to the Applicant on an indemnity basis, with certificate for 2 Counsel. (Mimmie Chan) Judge of the Court of First Instance High Court Mr Russell Coleman SC and Mr Val Chow, instructed by Morrison & Foerster, for the applicant Ms Teresa Wu and Ms Jacqueline Law, instructed by Li & Partners, for the respondent Look up this case on Lawcite Noteup",
  "length": 31405,
  "headers_seen": [
    "Background",
    "The invalidity ground",
    "The jurisdiction ground",
    "The composition ground",
    "Conclusion"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2016/1901?hl=arbitration",
  "query": "arbitration",
  "ts": "2025-10-11T00:52:54",
  "ok": true
}