{
  "title": "MONAT INVESTMENT LTD V. ALL PERSON(S) IN OCCUPATION OF PART OF THE REMAINING PORTION OF LOT NO 591 IN MUI WO D.D. 4 NO.16 MA PO TSUEN, MUI WO, LANTAU ISLAND AND ANOTHER | [2020] HKCFI 1970 | HKLII",
  "court": null,
  "year": 2020,
  "date": "2025-02-02",
  "content": "HKLII Databases Court of First Instance [2020] HKCFI 1970 MONAT INVESTMENT LTD V. ALL PERSON(S) IN OCCUPATION OF PART OF THE REMAINING PORTION OF LOT NO 591 IN MUI WO D.D. 4 NO.16 MA PO TSUEN, MUI WO, LANTAU ISLAND AND ANOTHER Judgment Information Date 10 Aug, 2020 Action No. HCMP1894/2015 Neutral Cit. [2020] HKCFI 1970 Parallel Cit. [2020] 4 HKLRD 330 Download MS Word Judgment Corrigendum Reading Options Translation Toggle Highlight Appeal History HCMP1894/2015 HCMP 1894/2015 [2020] HKCFI 1970 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE MISCELLANEOUS PROCEEDINGS NO 1894 OF 2015 ________________________ IN THE MATTER of Part of The Remaining Portion of Lot No 591 in Mui Wo D.D. 4 No. 16 Ma Po Tsuen, Mui Wo, Lantau Island. and IN THE MATTER of Order 113 of the Rules of the High Court ____________ BETWEEN MONAT INVESTMENT LIMITED (滿利投資有限公司） Plaintiff and ALL PERSON(S) IN OCCUPATION OF Part of The Remaining Portion of Lot No 591 in Mui Wo D.D. 4 No. 16 Ma Po Tsuen, Mui Wo, Lantau Island 1 st Defendant LAU CHI KAN KENITH (劉志勤） 2 nd Defendant ________________________ Before: Deputy High Court Judge To in Court Date of Trial: 2 – 3 June 2020 Date of Judgment: 11 August 2020 ________________________ CORRIGENDUM ________________________ Please note the following amendment in the Judgment dated 11 August 2020: 1. In the first sentence of paragraph 81 on page 43, add “to the extent of the area covered by the brick house and the semi-circular paved area immediately outside its front entrance” after “the Plaintiff’s claim is dismissed”. Dated the 25 th day of September 2020 (WU Sin Mei, Sammi) Clerk to Deputy High Court Judge To HCMP1894/2015 MONAT INVESTMENT LTD v. ALL PERSON(S) IN OCCUPATION OF Part of The Remaining Portion of Lot No 591 in Mui Wo D.D. 4 No.16 Ma Po Tsuen, Mui Wo, Lantau Island AND ANOTHER HCMP 1894/2015 [2020] HKCFI 1970 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE MISCELLANEOUS PROCEEDINGS NO 1894 OF 2015 ________________________ IN THE MATTER of Part of The Remaining Portion of Lot No 591 in Mui Wo D.D. 4 No. 16 Ma Po Tsuen, Mui Wo, Lantau Island. and IN THE MATTER of Order 113 of the Rules of the High Court ____________ BETWEEN MONAT INVESTMENT LIMITED (滿利投資有限公司） Plaintiff and ALL PERSON(S) IN OCCUPATION OF Part of The Remaining Portion of Lot No 591 in Mui Wo D.D. 4 No. 16 Ma Po Tsuen, Mui Wo, Lantau Island 1 st Defendant LAU CHI KAN KENITH (劉志勤） 2 nd Defendant ________________________ Before: Deputy High Court Judge To in Court Date of Trial: 2 – 3 June 2020 Date of Judgment: 11 August 2020 ____________________ J U D G M E N T ____________________ Introduction 1. This is the trial of the Plaintiff’s action for recovery of possession of land (“the Land”) and mesne profits against the 2 nd Defendant and the 2 nd Defendant’s counterclaim for possessory title of an area of land which is slightly bigger than and covers the entirety of the said Land. 2. The Plaintiff has been the registered owner of a piece of land registered at the Land Registry as The Remaining Portion of Lot No 591 in Mui Wo D.D. 4, Mui Wo, Lantau Island since 11 July 1987, known as No. 16 Ma Po Tsuen. Part of Lot 591 was occupied by the 2 nd Defendant. It puts the 2 nd Defendant to strict proof of his defence of adverse possession and defend the counterclaim in reliance of the maxim ex turpi causa non oritur actio . The Plaintiff argues that the relief sought by the 2 nd Defendant should be refused on the ground that he has to rely on his illegal conduct to succeed. The illegal conduct relied on, apart from trespass against the Plaintiff, is the erection of an unauthorised structure on the land in breach of the government lease and section 14 of the Buildings Ordinance . Legal principles on adverse possession 3. The law on adverse possession is well-settled and trite. To establish adverse possession, the squatter has to show both the intention to adversely possess the land in question and the fact of exclusive possession for a duration in excess of the statutory limitation period. Under sections 7(2), 17 and 38A of the Limitation Ordinance , the limitation period is 20 years if adverse possession commenced prior to 1991 or 12 years if it commenced after 1991: see Lam Kin Lai v Li Ha Ching [1] . 4. The classic definition of intention to possess is an intention in one’s own name and on one’s own behalf, to exclude the world at large, including the owner with the paper title if he be not himself the possessor, so far as it reasonably practicable and so far as the processes of the law will allow: per Slade J in Powell v McFarlane [2] as approved by Lord Browne Wilkinson in J A Pye (Oxford) Ltd & Another v Graham & Another [3] . The squatter must make such intention clear to the world. If his acts are equivocal and open to more than one interpretation and he has not made it perfectly plain to the world at large by his actions or words that he has intended to exclude the owner as best as he can, he will not be treated as having the requisite intention to possess. However, it is not necessary for the squatter to give evidence of his subjective intention. As was suggested by the Court of Final Appeal in Wong Tak Yue v Kung Kwok Wai & Anor (No 2) [4] , any such express intention by the squatter must be viewed with scepticism. Conversely, where the squatter has made statements as to what his intention was and such statements are against his interest, the courts would usually accord to them considerable weight. 5. Factual possession is basically physical control and dealing with the land as an occupying owner might have been expected to deal with it and that no one else had done so. The following statement of factual possession by Slade J in Powell v McFarlane was approved by Lord Browne Wilkinson in J A Pye (Oxford) Ltd & Another v Graham & Another [5] : “Factual possession signifies an appropriate degree of physical control. It must be a single and [exclusive] possession, though there can be a single possession exercised by or on behalf of several persons jointly. Thus an owner of land and a person intruding on that land without his consent cannot both be in possession of the land at the same time. The question what acts constitute a sufficient degree of exclusive physical control must depend on the circumstances, in particular the nature of the land and the manner in which land of that nature is commonly used or enjoyed … Everything must depend on the particular circumstances but broadly, I think, what must be shown as constituting factual possession is that the alleged possessor has been dealing with the land in question as an occupying owner might have been expected to deal with it and that no one else had done so.” 6. Not every use or occupation of land can satisfy the requirement of factual possession. To qualify as adverse possession, such use and occupation must be exclusive. It is a question of fact which has to be resolved having regard to the nature and physical character of the land in question, its surrounding area and what the squatter has done to manifest his intention of exclusiveness. Fencing is usually a strong evidence of such exclusive possession. In Gotland Enterprises Limited v Kwok Chi Yau & Ors [6] , Lam VP discussed exclusive possession, plantation of trees or storing articles on a piece of land as follows:- “36. One must not lose sight of the exclusive character of the occupation in order to establish factual possession. Not every use or occupation of land can satisfy this requirement. The Judge gave the example of growing of fruits on a piece of open land. If a person only plants fruit trees without excluding others from entering the land, he is only using the land instead of occupying the same exclusively. It is akin to leaving some articles on some private property (where the owner is at liberty to take steps to remove the articles as abatement of trespass) and no matter how long the articles were left there (and not removed by the owner of the land), it would not constitute adverse possession”. 37. Though it is not absolutely essential to have the land fenced off in order to establish exclusive occupation, this is the classic way of doing so. In the absence of any physical barriers set up to exclude others from entering the land, one must examine what steps were taken by the person claiming exclusive occupation to exclude others.” 7. Where there is evidence pointing to contrary conclusion or where the acts of the person who claimed possession are equivocal and capable of more than one interpretation, the intention to possess is not established: see Tsang Foo Keung v Chu Jim Mi Jimmy and Ors . [7] 8. The person claiming adverse possession has the burden of proof. The paper owner does not have to plead any positive case or call any witness. He is entitled to rely on his paper title. He may test the squatter’s case and is entitled to judgment, if the squatter fails to discharge the very high burden of proof: see Birkenhead Properties and Investments Limited v Lam Kai Man & Anor [8] . He may test the squatter’s case against contemporaneous written documents, incontrovertible documents, particularly those which came into existence before the issue arose which are of the greatest importance in assessing credibility: Wong Wai Chi Susanna v Lam Lai Chun & Anor [9] . As always, the test of credibility of a witness is inherent probability. 9. The standard of proof is the normal civil standard, i.e. on a balance of probabilities. Because of the serious consequence of a finding that the title of a paper owner has been displaced by an adverse possessor, the evidence necessary to establish adverse possession must be compelling: see Wu Yee Pak v Un Fong Leung & Others [10] . An overview of the 2 nd Defendant’s case 10. The 2 nd Defendant’s case is that adverse possession had commenced against the Plaintiff’s predecessors in title by his father (the “Father”) as early as 1954 and by him since 1978 under the following circumstances. 11. In the 1950s, the Father and the 2 nd Defendant’s mother (the “Mother”) had exclusive possession, occupation and control of a small portion of Lot No. 591 on which a one-storey wooden hut of about 504 square feet had been built (the “Brown Area”) and some surrounding land (the “Green Area”). The Brown Area and Green Area together make up the Disputed Area. (the “Disputed Area”). That wooden hut was demolished in 1977/78 and in its place was erected a two-storey brick house which is marked in brown in the Lot Index Plan annexed to the Amended Defence and Counterclaim (“ADCC”). The Father and Mother also continued occupation and use of the surrounding Green Area. The surveying experts of both parties are in agreement that the Lot Index Plan did not accurately set out the correct position of the Brown Area and Green Area. But, it is common ground that the Brown Area together with the Green Area which make up the Disputed Area is slightly larger than and overlaps the Land as pleaded by the Plaintiff. 12. The brick house was completed in about April 1978. The Father opened an account for supply of water from the Water Authority and an account for supply of electricity from CLP Power Hong Kong Limited. The brick house was used by the Father as the home for his family, which comprised of the Mother and their eight children. The Father made a gift of the Disputed Area including the brick house to the 2 nd Defendant as the eldest son of the family. At that time, the 2 nd Defendant was 19 years of age while his young siblings were aged between 4 and 17. 13. Two years later, the Father died on 14 December 1980. By then, the 2 nd Defendant and his eldest sister (“Irene”) had moved out of the brick house to live and work in the urban area. The Mother and the remaining six children continued to live in the brick house. During a squatter control survey in about 1982, the Lands Department gave a squatter control number to the brick house and registered the 2 nd Defendant as one of its occupants. 14. The 2 nd Defendant joined the Police Force in 1980 and moved to rented accommodation initially with Irene in Mong Kok, then in police married quarters and eventually in a unit under the Home Ownership Scheme in Tai Po. Irene moved to a public housing unit and then a unit under the Home Ownership Scheme in Shatin. In course of time, the other six children also moved to the urban area where they worked and maintained their permanent residence. The Mother continued living in the brick house. In 1996, she paved a small area immediately outside the front of the brick house. Then, the Mother died in October 1999. 15. The 2 nd Defendant and the siblings visited the brick house occasionally, mainly during weekends and holidays. The water and electricity bills are sent to the address of Irene, who presumably settled them. Until the commencement of these proceedings, the use and occupation of the brick house and the Disputed Area by the 2 nd Defendant and his siblings has never been interfered with. 16. Irene had knowledge of these proceedings. She gave a written confirmation supporting the 2 nd Defendant’s claim to the Disputed Area but made no claim for herself. The other six siblings made no claim either, leaving the 2 nd Defendant as the only claimant in this action. 17. After hearing all the evidence, I do not consider the 2 nd Defendant a credible witness. His case about the gift of the brick house and Disputed Area in 1978 is inherently improbable. His evidence about his weekend and holiday returns to the brick house is an exaggeration, not to be believed in its entirety. Despite that, there is indisputable evidence that he and Irene had control and occupation of the brick house since the Mother’s death. Thus, when analysing the evidence in this case, I shall consider factual possession of the Disputed Area under three different periods: from 1954 to December 1980, December 1980 to October 1999 and then from October 1999 thereafter. The Disputed Area 18. There is general agreement between the surveying experts of both parties about the location, historical use and occupation of the Disputed Area. It is common ground that the correct position of the brick house is not as indicated in the survey sheet; that it rested on the Brown Area surrounded by the Green Area; that the brick house existed at least since 1978; that the northern part of the Green Area has been covered with vegetation and the aerial photographs show no sign of active land use since 1978; and that sometime after 1996 a portion of the southern part of the Green Area was cleared of vegetation and paved with concrete. The experts also agreed that no fence was shown or could be identified along the boundaries circumscribing the Land or the Disputed Area. At the dates of the survey, an iron gate and nylon string tied to some support or isolated tubing along the perimeter of the Green Area on the southern part of the Disputed Area were observed. The area of the brick house exclusive of the balcony was 44.5 square metres or 46.8 square metres inclusive of the balcony. The gift of the brick house and Disputed Area to the 2 nd Defendant 19. The eldest child of the Family, Irene, was born in 1956, followed by the 2 nd Defendant in June 1959. By 1978, the 2 nd Defendant was 19 years old, while his Father was 48 years of age. He had attained majority and was the eldest son of the family. He said that as his Father was suffering ill-health, his Father gifted the Disputed Area to him. Two years later, his Father died of cancer on 14 December 1980. 20. Mr Yuen, counsel for the Plaintiff, challenged this aspect of the 2 nd Defendant’s evidence. According to Schedule of Property annexed to the Letters of Administration in respect of the Father’s estate issued to the 2 nd Defendant, the Father had acquired three other lots of land in Mui Wo. He had two lots of land, namely Lot No. 167 RP and Lot No.168 in D.D. No. 4 in Mui Wo at the time of the alleged gift of the Disputed Area. Just two years after the alleged gift and six months before his death, the Father purchased a third lot of land, namely Lot No. 400 in D.D. No. 3 in Mui Wo under his sole name. The 2 nd Defendant was not even aware of this lot of land purchased by the Father. He was unable to explain why given the ill-health of the Father, the Father did not dispose of the two lots of land which he had at the time of the alleged gift, whether to him or to any of the siblings, and why the Father would have bought yet another lot and held it under his sole name when his health must have further deteriorated six months before his demise. The 2 nd Defendant’s evidence of the gift and the reason for the gift do not sit well with the Father’s conscious decision not to dispose of the other two lots and yet to acquire a third lot under his sole name six months before his death. 21. The 2 nd Defendant’s evidence about the gift sits very uncomfortably with the circumstances surrounding the making of the gift. At the time, the brick house was just newly built by the Father. It was used by the Father as the home for his family including the 2 nd Defendant and his seven siblings. Six of the siblings were aged between 4 and 17 and were still studying in school. It is incredible that the Father would have divested himself of this home to his eldest son, particularly as the 2 nd Defendant alleged, to the exclusion of himself, the Mother and these six infant siblings so that all of them, including the Father himself, had to seek the 2 nd Defendant’s permission to be allowed to live in the brick house, as the 2 nd Defendant so pleaded in his ADCC. This aspect of the 2 nd Defendant’s evidence is ludicrous. 22. The 2 nd Defendant’s evidence also sits uncomfortably with the Mother’s answers to the questionnaire issued by the Rating and Valuation Department. The questionnaire was dated 5 December 1996. In the Defence and Counterclaim, the 2 nd Defendant pleaded that in response to the questionnaire the Mother claimed that she was the owner of the brick house and the brick house was used as residence wholly occupied by the owner. In the ADCC the 2 nd Defendant amended the plea and asserted that it was he who provided the information requested in the questionnaire through the Mother. This is contrary to his own evidence in court that he knew nothing about this questionnaire until these proceedings. The questionnaire was signed by the Mother but was completed by someone on her behalf. The correspondence address of the Mother as stated on the questionnaire was the address of Irene. The contact telephone numbers given were Irene’s telephone number and the number at the brick house. 23. The 2 nd Defendant was evasive. He said he was not aware of the questionnaire or why it was so completed and signed by the Mother. He only came to know about it when preparing for these proceedings. Then he gave, yet, a third explanation for the questionnaire. He said that being a filial son he had no objection to the Mother signing the questionnaire as owner of the Disputed Area if she wished. That evidence is obviously a concoction in the witness box. 24. Mr Lung, counsel for the 2 nd Defendant, argues that there is a distinction between owning and possessing and that the mother signing the questionnaire as owner is not inconsistent with the 2 nd Defendant being in exclusive possession of the property. While this distinction exists in a scenario where the squatter has dispossessed the paper owner, it cannot exist between two squatters with conflicting claim to possessory title over the same piece of land. The Mother was not the paper owner. The ownership asserted by the Mother could only be one of a possessory title based on exclusive possession. On the 2 nd Defendant’s case, the title he acquired from his Father is also a possessory title and the Mother was in occupation as his licensee. The Mother and the 2 nd Defendant were not joint owners. Either the Mother had exclusive possession with the 2 nd Defendant as her licensee or the 2 nd Defendant had exclusive possession with the Mother as his licensee. On the facts of this case, there is no room for Mr Lung’s argument. 25. The 2 nd Defendant had moved out of the brick house since 1980. He had no knowledge about the questionnaire. On his evidence, he only returned to the brick house during weekends or holidays. At that time, five of his siblings were still infants aged 6 to 17. According to paragraph 5A of the ADCC, those five siblings and the third sibling, aged 19, were staying in Mui Wo at that time. The likelihood was that in 1980 the Mother was living in the brick house full time looking after those younger siblings and possibly the third sibling as well. She received the questionnaire in 1996, caused it be completed claiming to be the owner and she signed on it. At that time, as pleaded by the 2 nd Defendant in paragraph 5A of the ADCC, two siblings, aged 33 and 26, were still living in the brick house. It is more likely than not that the Mother as head of the family had succeeded the Father’s possession of the brick house and the Disputed Area and was in occupation and control rather than the 2 nd Defendant. Hence she signed the questionnaire as owner. 26. In conclusion, I reject the 2 nd Defendant’s evidence about being gifted the brick house and the Disputed Area by the Father in 1978. Adverse possession – 1954 to December 1980 27. Having rejected the 2 nd Defendant’s case of gift of the Disputed Area in 1978, his case has to be considered in the light of the changes in possession since the Father first took possession until commencement of this action. 28. There is indisputable evidence that a structure had been in existence since at least 1975 on the Disputed Area as evidenced by the survey sheet and aerial photographs. Probably that was the wooden hut first occupied by the Father in 1954 which was then demolished and the brick house was erected in its stead. The birth certificates of the 2 nd Defendant and his younger siblings show that the Father and Mother resided in an unnumbered hut in Ma Po/Luk Tei Tong, Mui Wo. There is indisputable evidence from CLP Power Hong Kong Limited that the Father obtained metered electricity supply to the brick house at 16 Ma Po Tsuen, Luk Tei Tong, Lantau since January 1975. There is also indisputable evidence from the Water Supplies Department that the Father opened an account for supply of water to the same address on 6 September 1977. Thus, there could be little to doubt that that address referred to the brick house erected on the Brown Area. Eventually, the brick house was assigned a Squatter Control Number by the Lands Department on 18 January 1982 with the 2 nd Defendant as one of its registered occupants. The above evidence puts it beyond doubt that the Father had possession and control of the brick house since its erection in 1978 and of the Brown Area since 1975 until 14 December 1980 when he died. 29. Up to that stage, the Green Area remained as an open unfenced and unpaved area covered with natural vegetation. Though not absolutely essential, fencing is the classic way of acquiring physical possession and manifesting intention to possession. In the absence of physical barriers set up to exclude others from entering the land, the squatter must show what steps he had taken to possess the land to the exclusion of others and to manifest that intention. There was no fencing or other form of barrier which prevented others from entering the Green Area. There was no natural feature in the Green Area which served as an effective barrier preventing others from entering. There was no notice warning against trespassing the Green Area. There was no evidence of active land use by the Father of the kind which was consistent with the exercise of the rights of a landowner. Though the Father and his family must have used part of the Green Area for their access to the brick house and in connection with their use and enjoyment of the brick house, such occasional use was insufficient to amount to exclusive possession and control. There was no evidence of what the Father did to make known his intention to possess the Green Area or any part of it to the exclusion of the whole world including the paper owner. There was no evidence of factual possession of the Green Area and his intention to so possess. 30. The Father’s construction of the brick house together with his use and long period of occupation of the brick house as the home for his family in excess of 20 years evinced a clear intention of exclusive possession. Accordingly, I find that from 1954 to 14 December 1980, the Father had adverse possession of the Brick House and the Brown Area. Adverse possession – December 1980 to October 1999 31. The physical possession remained that way until 1996. The aerial photograph taken on 29 October 1996 shows that parts of the vegetation to the south of the brick house had since been cleared and then paved. Mr Yuen argues that the Disputed Area had not been fenced off and that paving land does not mean that the squatter was in exclusive possession of the land. He referred me to the case of Tang Moon Lam v Tang Ying Yeung [11] in which B Chu J held: “ … the environment had in fact improved after the lots were cleared. The paved vacant site was like a small village square. Although anyone who wanted to use the site/square for any specific or official purpose or a large scale function would probably have to obtain the permission of the Village Representative…there was no restriction to other villagers carrying out occasional recreational activities thereon, such as playing football. There was no sign on the paved vacant site or a fence to present villagers walking over it freely, or around it or crossing it diagonally. In my view, there was no sufficient evidence that D had maintained exclusive occupation/ possession over Lot 1 and I find he had failed to demonstrate a sufficient degree of exclusive physical control over Lot 1 after it was cleared and paved” 32. Possession is a question of fact. I do not think the above dicta have established any principle that paving is not sufficient evidence of exclusive possession. It is only a conclusion reached on the facts of that particular case. Enclosing land by the squatter is an obvious manner in which he can take possession and make known to the world his intention of assuming the rights over the land as owner. Fencing is not an absolute requirement and not the only way in which possession of land can be asserted and achieved. The type of conduct necessary to create such an effect depends on the nature of the land in question. In essence, the conduct required must be such as is sufficient to show that the squatter has been dealing with the land as an occupying owner might have been expected to deal with it. In Thorpe v Frank [12] , the appellant paved land in front of her bungalow which in fact belonged to her neighbour. The Court of Appeal held that in considering the question whether the alleged possessor has been dealing with the land as an occupying owner might have been expected to deal with it, the nature of the land in question is very important. While enclosure of land in issue by the squatter is an obvious manner in which he can take possession, it is not an absolute requirement and not the only way in which possession of land can be asserted and achieved. Making physical changes to the surface of land is a very significant act which is inconsistent with the paper owner’s right to control of his land. 33. Cutting down trees, clearing vegetation in part of the Green Area and then paving it is the kind of conduct which an owner would have been expected to do in dealing with his land for his convenience, enjoyment and/or amenity. It has the effect of changing its physical appearance permanently. It is equivalent to exercising permanent control over the land. It is clear interference with the Plaintiff’s rights to use, enjoy, occupy and control its own land. It is inconsistent with the Plaintiff’s right as owner. Such conduct amounted to occupation and use of land which is adverse to the Plaintiff. Though the land had not been fenced off, the paved area and the physical changes identified the land in question and distinguished it from the surrounding area. It was done in open land where the surrounding area was and was at all material times rarely if at all visited by the public. In the circumstances, I am satisfied that paving was sufficient manifestation of intention to control and evidence of factual possession even in the absence of fencing. This paved area is a small area in the shape of a semi-circle extending from the front of the brick house. Accordingly, I find that adverse possession of the paved area commenced sometime in 1996. 34. On the 2 nd Defendant’s own evidence, he moved out of the brick house to live in rented accommodation in Mong Kok with his eldest sister when he joined the Police Force in October 1980. At some stage, he moved to live with her in a unit in a public housing estate in Shatin. He was married in the 1980s. Presumably, after his marriage, he bought a unit in a Home Ownership Scheme in Tai Po in 1986 and moved to live there. In early 1990s, he lived in the Police Married Quarters until his retirement in 2014 when he moved back to Tai Po. During this period from December 1980 to October 1999, the 2 nd Defendant worked and maintained a home in the urban area. He was not using the brick house as his usual place of residence, even if he had maintained any presence in the brick house. That casts serious doubts on his having any occupation and control over the brick house. 35. Irene was a retired civil servant formerly employed in the Post Office. It is not clear when she had moved out of the brick house. The 2 nd Defendant’s case is that she never did, which is obviously untrue. According to the 2 nd Defendant, he had lived with her in an address in Mong Kok in 1980. By 1996, his eldest sister had been allocated a public housing unit in Shatin which was also used as the Mother’s correspondence address. She then moved to a unit under the Home Ownership Scheme in Shatin in 1999 where the utility bills are sent. She maintained a home in Shatin and made no claim to the Disputed Area. She was not in occupation or control of the brick house during this period of time. 36. Some of the siblings moved out of the brick house at various time between 1986 and 1999. According to paragraph 5A of the ADCC, the fourth and seventh siblings were living in the brick house with the Mother in 1996 until they moved out in 1998 and 1999 respectively. They made no claim to the Disputed Area. 37. Around the time of his Father’s death in December 1980, the 2 nd Defendant and his elder sister had moved out of the brick house. His other siblings were then aged 6 to 19. Most of them were studying and under the parental care of the Mother. In all likelihood, the Mother assumed the position of the head of the family and the duty of looking after the younger siblings. She was in occupation and control of the brick house. That condition must have continued to December 1996 when the Mother completed the questionnaire issued by the Rating and Valuation Department. 38. By December 1996, only the fourth and seventh siblings were residing in the brick house with the Mother. They were respectively aged 35 and 26. All of the other siblings, including the 2 nd Defendant, had moved out of the brick house to work and live in the urban area. In that very year, part of the Green Area was paved. That, as I have found, is evidence of physical possession as well as intention to possess the said area to the exclusion of the whole world, including the Plaintiff. 39. In the questionnaire, the Mother claimed to be the owner of the brick house. I reject the 2 nd Defendant’s evidence that he had occupation and control of the brick house at the time the questionnaire was completed by the Mother. In the questionnaire, the Mother gave the address and telephone number of the eldest sister as her correspondence address and day time contact telephone number. She also gave the telephone number of the telephone line installed in the brick house. This suggests that it was more likely than not that she could be reached at the address and telephone number of the eldest sister. The inference is that she had probably moved out of the brick house to live with the eldest sister who was single. There was nothing to suggest that the brick house was not kept under lock and key while the Mother was away. She retained possession and control of the brick house and, in the peculiar circumstances of this case, the paved area as well. 40. Even if the Mother had moved out of the brick house, her answers in the questionnaire evinced her intention to maintain possession and control over the brick house and the paved area. She paid the utilities bill or caused them to be paid. There is no evidence that she abandoned occupation. Having dismissed the 2 nd Defendant’s evidence about his Father’s gift of the brick house, it would be monstrous to suggest that he, while working and maintaining a home in the urban area had occupation and control over the brick house instead of the Mother who was still raising and looking after the younger siblings. All the other siblings have no claim to the brick house and the Disputed Area. I am satisfied that upon the Father’s death the Mother succeeded the Father as head of the family. She had occupation and use of the brick house where she raised the younger siblings who were still studying until they finished their study and moved out of the brick house at various times. In 1996 when she and the fourth and the seventh siblings were still living in the brick house, she paved the area outside the front door of the brick house. Accordingly, I find that the Mother had adverse possession of the brick house from December 1980 and the paved area from 1996 until her demise in October 1999. Adverse possession – October 1999 to August 2015 41. What is left of the 2 nd Defendant’s case is that after the Mother’s death, he continued to visit the brick house during weekends and holidays to collect mails and to take care of maintenance, etc. He also arranged his siblings to return to the brick house by turn to do the same. But then, he said he did not know how often his siblings returned to stay in the brick house. In my view, his evidence about his and his siblings’ weekend visits is rather artificial and self-serving. None of his siblings has any interest or claim to the Disputed Area. There was no reason for them to take turns to “guard” the brick house. The 2 nd Defendant and the siblings had all moved out of the brick house years ago. There was no reason why they would anticipate any mails for them to be delivered to the brick house. 42. The 2 nd Defendant said he settled the utilities bills. The utilities bills were delivered to his eldest sister’s address in Shatin, but he could not even affirmatively say who settled the bills or whether he instructed someone to settle them. Though he said he maintained good relations with his siblings, he did not call any of them to corroborate his evidence. His explanation was their evidence would all be the same. He did not call any of his neighbours to testify because he said they did not wish to attend court. The 2 nd Defendant’s evidence lacks conviction. 43. There were some suggestions by Mr Yuen that when the 2 nd Defendant moved out of the brick house in 1980 he ceased occupation. It is trite that law what is required to establish adverse possession is the taking of possession and not continuous use of the land. In Chambers v London Borough of Havering [13] , Lewison LJ said: “57. … In addition at this point in his judgment he seems to have been looking for ‘continuous use’. But in my judgment continuous use is not the test. It is the taking of possession that is critical. If possession passed to Mr Chambers at any point then he would not have needed continuous use to have maintained possession. Bligh v Martin [1968] 1 W.L.R. 804, p.811; Generay Ltd v Containerised Storage Company Ltd [2005] EWCA Civ 478 at [49].” 44. The 2 nd Defendant was a registered occupier of the brick house in 1982. That evidences his intention to occupy the brick house. At that time, the Mother as head of the family had possession and control of the brick house. However, after her death, there is incontrovertible evidence that the utilities bills were all settled, if necessary, and the brick house was kept under lock and key during the absence of the 2 nd Defendant and his siblings. It is the 2 nd Defendant’s pleaded case that only he and his eldest sister had occupation and control of the brick house and the Disputed Area up to now. The eldest sister confirmed that she supports the 2 nd Defendant’s case and is not making any claim in the Disputed Area. By a process of elimination and on the basis of incontrovertible evidence of possession and control, I find that the 2 nd Defendant succeeded the Mother and had possession and control of the brick house since the Mother’s death on 18 October 1999. The Plaintiff having been dispossessed, the possession by the 2 nd Defendant was continuous. His keeping the brick house under lock and key and continuing to pay or cause to be paid the utilities bills are evidences both of possession and intention to possess. 45. It is also trite that in computing time, a successive squatter can add the preceding squatter’s period of possession to his own provided they are continuous: Ng Lai Sim v Lam Yip Shing & Anor [14] . This principle applies to squatters within the same family: Ricas Properties Ltd v Armed Forces Trading Co Ltd [15] . Hence, despite my rejection of the 2 nd Defendant’s evidence that he was gifted the brick house by his Father back in 1978, by reason of succession from his Mother and his continued factual possession of the brick house and the paved area, he has acquired adverse possession over the Brown Area and the paved area since at least December 1980 and October 1996 respectively. The limitation periods in respect of the Brown Area and the paved area are 20 years and 12 years respectively and have well expired by the time the Plaintiff commenced this action in 2015. Illegality 46. In paragraph 4A of the Re-amended Reply to the 2 nd Defendant’s ADCC, the Plaintiff pleaded that the 2 nd Defendant’s occupation of the Disputed Area is in breach of the government lease and section 14 of the Buildings Ordinance . The Plaintiff is therefore invoking the maxim ex turpi causa non oritur actio . Mr Yuen argues that under this principle the 2 nd Defendant is not entitled to the remedy sought under the Limitation Ordinance because he may not rely on an illegal conduct to establish his defence or counterclaim. The illegal conduct is his use of the Brown Area as a residence in breach of the user stipulation under the government lease and the erection of the brick house in breach of section 14 of the Buildings Ordinance and applicable regulations. 47. The legal consequence of illegality on a claim of adverse possession is not settled. Quoting from Jourdan, Adverse Possession Mr Yuen submits that there are two alternative approaches in dealing with the question of illegality in the context of adverse possession [16] :- “There is a general principle that a person should not be granted a remedy where he has to rely directly on unlawful conduct to succeed 302 . However, the law of adverse possession is concerned with rendering lawful conduct which initially constitutes the tort of trespass. Given that, it is not obvious that the principle should apply to prevent the passage of time from barring a claim to possession by the owner of land, simply because the squatter’s conduct is contrary to a statutory prohibition as well as the constituting a trespass. An alternative approach would be to consider whether the policy behind the statutory prohibition in question would be infringed if a squatter was allowed to rely on acts committed in breach of the prohibition in support of a claim to title by adverse possession. Where the prohibition is enacted to protect public rights, and the acquisition of title by adverse possession will have no effect on those rights, it may be that the prohibition should not prevent the squatter’s claim from succeeding.” (My emphasis highlighted in bold and italic print) 48. The general principle referred to by Jourdan is the maxim ex turpi causa non oritur actio . The first approach suggested by Jourdan is the “reliance approach”. As is apparent from footnote 302 in the first part of the above quoted passage, the reliance approach is based on the reliance test adopted by the House of Lords in Tinsley v Milligan [17] . In that case, the plaintiff and defendant used funds from their partnership business to purchase a house in the plaintiff’s name in which they lived together. The purpose of the arrangement was to enable the defendant to make false claims for social security. Subsequently, the defendant repented of the frauds and disclosed them to the authorities. Then the plaintiff brought proceedings against her claiming possession and asserting sole ownership of the property. The defendant counterclaimed for an order for sale and for a declaration that the property was held by the plaintiff on trust for the parties in equal shares. The judge dismissed the plaintiff’s claim and allowed the counterclaim. On appeal, the Court of Appeal dismissed the appeal and held that in the circumstances the public conscience would not be affronted if the defendant’s counterclaim were to succeed. On further appeal, the House of Lords unanimously dismissed the public conscience test and held that the defendant was entitled to recover if she was not forced to plead or rely on an illegality. Under this approach, a person should not be granted a remedy if he has to rely directly on unlawful conduct to succeed. Conversely, if he can assert his claim without relying on the illegal conduct, he is entitled to succeed. 49. The alternative approach is the “proportionality approach” adopted by the later Supreme Court decision in Patel v Mirza [18] . In that case, the plaintiff paid a large sum of money to the defendant pursuant to an agreement that he would use it to bet on the movement of shares on the basis of inside information. The agreement contravened a statutory prohibition on insider dealing. However, the agreement could not be carried out because the expected insider information was not forthcoming. Then the plaintiff brought a claim against the defendant for repayment. The judge dismissed the claim as being barred by illegality. The Court of Appeal allowed the plaintiff’s appeal on the basis that a party who had withdrawn from an illegal agreement because it could no longer be performed was not prevented by public policy from relying on the agreement provided that no part of it had been carried into effect. In dismissing the defendant’s appeal, the Supreme Court unanimously held that the general rule was that a person who satisfied the ordinary requirement of a claim in unjust enrichment should be entitled to the return of his money or property and such a person should not prima facie be debarred from recovering money paid or property transferred by reason of the fact that the consideration which had failed in whole or in part was an unlawful consideration. The majority also held that the two broad policy reasons for the common law doctrine of illegality as a defence to a civil claim are that (i) a person should not be allowed to profit from his own wrongdoing and (ii) the law should be coherent and not self-defeating. The essential rationale of the doctrine is that it would be contrary to the public interest to enforce a claim if to do so would be harmful to the integrity of the legal system. The court preferred to assess the situation by considering various factors such as policy consideration of the prohibition, proportionality between denial of claim and seriousness of the breach, etc. 50. Mr Lung argues that it is not open to Mr Yuen to resort to authorities which address the illegality defence in other context and argues that those authorities do not apply to adverse possession cases. He submits that it is impossible to have a wholesale transposition of the reliance approach to adverse possession cases because the initial entry and possession of land in all adverse possession cases would have been wrongful and illegal. A strict application of the reliance approach to adverse possession cases will render the entire doctrine obsolete. That was in fact the thrust of Jourdan’s opinion when he suggested that it was not obvious that the principle should apply to adverse possession cases and formulated the alternative proportionality approach. 51. Mr Lung referred me to Choy Kuen Chi v Tat Fung Enterprises Company Ltd [19] which is the only local case in which the consequence of illegality in a claim on adverse possession was comprehensively discussed. DHCJ Leung started off with the maxim. At paragraph 68 of that judgment, after referring to a number of authorities on this issue (which I shall analyse later) and to Chung Man Yau v Sihon Co Ltd [20] , DHCJ Leung said: “If the bar to making title by adverse possession is based on public policy considerations, the nature and seriousness of the unlawful conduct in question would be relevant: see Chung Man Yau v Sihon Co Ltd [1997] HKLRD 1221 at 1226-1228 per Mortimer VP, 1228-1229 per Godfrey JA and 1229-1230 per V Bokhary J (in the context of whether award for loss of earnings from unlicensed hawking should be made), …” In the paragraph that followed, DHCJ Leung formulated his seven-point propositions as follows: (1) There is no general principle of law that acts in breach of public law prohibitions could never lead to acquisition of rights. (2) To suggest that illegality of the means of possession is irrelevant will be an over-simplification of how the general principle under the maxim ex turpi causa non oritur actio applies. (3) The general principle could not be mechanically applied to the context of adverse possession. It is applied as an instrument of public policy, but not in circumstances where it does not serve the public interest. (4) The requirement of public policy has to be ascertained by identifying the objective behind the legal prohibition and criminal sanction. Equally important is the context in which the legal prohibition, and thus breach, comes to be considered. (5) A legal prohibition may make the very act of possession illegal, such as what happened in the cases of R(Smith) and Collins (above). In such cases, the public policy behind the legal prohibition could well be to bar the acquisition of any right over the land by such acts. (6) A legal prohibition may have nothing to do with possession of the land but the act by which one comes to possess the land. (7) The very act of occupying the land may not be illegal, but there are legal restrictions in respect of how the land may be used or what may be done on it. The requirement of public policy behind such kind of restrictions would be case specific. In the end, DHCJ Leung held that the squatter was entitled to succeed despite breach of prohibitions under section 14 of the Buildings Ordinance . 52. These propositions were formulated on the basis that the maxim ex turpi causa non oritur actio applies to illegality in the context of adverse possession. Though Tinsley had not been considered, the first three propositions effectively rejected the reliance approached in Tinsley . Basically, the approach adopted by DHCJ Leung was the proportionality approach, which was later adopted by the UK Supreme Court. 53. Mr Lung submits that I should follow Choy Kuen Chi and that the proportionality approach has found favour in at least three other local decisions. The first one was Tsang Foo Keung & Anor v Chu Jim Mi Jimmy [21] . That was an application for striking out for delay and abuse of process. The defendant asserted adverse possession of hawking pitches originally and partly covered by hawkers’ licences issued to them pursuant to the Hawker Regulation s. In seeking to recover possession, the plaintiffs contended ( albeit yet to be pleaded at that stage) that the defendant had been in breach of the terms of the licences and thus the regulations. The plaintiff relied on R(Smith) v Land Registry [22] and Wan Hok Taoist Association v The Incorporated Owners of Nos 88-90 Pan Hoi Street & Anor [23] and succeeded in resisting the striking out application. However, when the matter came on for trial before Chow J, the parties’ argument on illegality was said to be brief and the case was actually not determined on that issue. 54. The second case was Lam Tak Choi v Chow Tai Fook Jewellery Co Ltd [24] . The plaintiff sought summary determination under Order 14 on the issue whether the existence of unauthorized building works would have prevented or stopped the limitation period from running for the purpose of an adverse possession claim. Relying on Wan Hok Taoist Association and Choy Kuen Chi , the plaintiff argued that the determination should be in favour of the plaintiff. However, Mimmie Chan J considered it an oversimplification to state that the law on the consequences of illegality on a claim of adverse possession is already settled by these two cases, particularly having regard to the Chief Justice’s obiter remark in Ryder Industries Ltd (formerly Saitek Ltd) v Chan Shui Woo [25] which cast doubt on the proportionality approach in Choy Kuen Chi (see below). She considered the case not suitable for summary determination. Thus, the consequence of illegality was not decided. 55. The third case is Fong Kam Mui v HSBC Private Trustee (Hong Kong) Ltd [26] . In that case,DHCJ Maurellet SC held that he would have rejected the illegality arguments if the squatter had made out her case on adverse possession. That was only an obiter remark. 56. Thus, Choy Kuen Chi was the only case in which the issue of illegality in the context of adverse possession was properly argued and decided. However, Mr Yuen criticises the propositions developed in Choy Kuen Chi as being wrongly founded on Chung Man Yau which was a personal injuries case. In that case, the Court of Appeal held that when considering the question of what damages the court would award when the basis of the loss was said to be tainted by illegality, the court must examine all the circumstances – the nature of illegality complained of, the moral and criminal culpability and the plaintiff’s conduct, and also any relevant legislations. In essence, the Court of Appeal adopted the proportionality approach. The law of illegality in the context of personal injuries cases is very different from that in adverse possession cases. In personal injuries cases, whatever was the claimant’s illegality, he is seeking compensation for injuries caused to him by the wrongdoer, whereas in adverse possession cases, the claimant is seeking title by relying on his own wrong committed against the paper owner. The policy considerations of the two types of cases are different and may lead to different result. 57. Mr Yuen further submits that as a matter of precedent Tinsley is binding on this court because it was adopted by the Court of Final Appeal in HKSAR v Lau Kam Ying [27] . Though at that time, the Court of Final Appeal did not have the opportunity to consider the effect of Patel , however, in Ryder Industries , the Court of Final Appeal had an opportunity to consider ParkingEye Ltd v Sommerfield Stores Ltd [28] which was similar to and in a way leading to the decision of Patel . Ryder Industries was a decision on foreign illegality. In his judgment,Chief Justice Ma remarked that he was not in favour of applying the proportionality approach as the applicable test for illegality since it appeared to suggest some kind of judicial discretion to be exercised and he was of the view that the question of illegality must be based on firmer principle and policy. The same sentiment was expressed by three Law Lords in their dissenting opinion in Patel . In particular, Lord Sumption JSC said [29] : “… An evaluation test dependent on the perceived relevance and relative weight to be accorded in each individual case to a large number of incommensurate factors leaves a great deal to a judges’ visceral reaction to particular facts. Questions such as how illegal is illegality would admit of no predicable answer, even if the responses of different judges were entirely uniform. In fact, it is an inescapable truth that some judges are more censorious than others. Far from resolving the uncertainties created by recent differences of judicial opinion, the range of factors test would open a new era in this part of the law. … No one factor would ever be decisive as a matter of law, only in some cases on their particular facts. … I would readily accept that certainty is not the only value, or even necessarily the most important. …” Mr Yuen submits that I should follow Tinsley and HKSAR v Lau Kam Ying and depart from Choy Kuen Chi . 58. With respect to both Mr Yuen and Mr Lung, I disagree with their arguments. Tinsley and Patel are authorities for the proposition whether a claimant is entitled to remedy arising out of his transaction with another which is tainted by illegality. In Tinsley , the illegality was the parties’ mutual intention to defraud the social security authorities. It was a joint enterprise of the parties to the illegality to defraud a third party. In Patel , it was the parties’ mutual agreement to engage in illegal insider dealings. It was also a joint enterprise by the parties to defraud the general investors at large. There was strong public interest and public policy in discouraging such illegal activities by barring parties to such illegal activities from remedy arising out of their illegal activities. Tinsley and Patel were decided on the common law principle stated in the maxim ex turpi causa non oritur actio . 59. The law on adverse possession is founded on a wholly different basis, albeit also based on public policy. The justification for the law on adverse possession was discussed in the Consultation Paper prepared by the Adverse Possession Sub-Committee of the Law Reform Commission of Hong Kong. The justifications for the concept were set out in paragraph 2.4 to 2.7 of the Paper. These justifications are reproduced hereunder: “ Justifications for the concept 2.4 As Dockray explains, the rule of adverse possession prompts a number of questions: “At first sight, the law of adverse possession has the appearance of an unprincipled and neglected backwater; an area of law in need of reform but which is not perhaps of great importance. How, it might be asked, could there be any rational explanation for depriving an owner of property, simply because of the long continued possession of another? And why should the law seem to ignore the demerits of a trespasser? Why should it protect a wrongdoer - a person whose conduct might be tantamount to theft - but whom the law may nevertheless aid even against an innocent owner, that is, a person who did not know and could not have discovered that time had begun to run? Why should the long suffering of injury bar the remedy? … Why, then, do we need adverse possession?” [30] 60. Dockray then sets out three generally accepted justifications for the rule which are traditionally attributed to the Statute of Limitations, as well as a fourth policy objective [31] . Dockray's statement of the justifications for the rule was endorsed by the English Law Commission in its 1998 consultation paper. [32] The three justifications are: (1) to protect against stale claims; (2) to avoid land becoming undeveloped and neglected; and (3) to prevent hardship in cases of mistake. The fourth justification is a policy one of facilitating conveyancing in unregistered land. At paragraph 2.6, Dockray expanded the reasons for the first justification as follows: “2.6 Adverse possession is one aspect of the law of limitations. The policy of limitation statutes applies to protect defendants from stale claims and to encourage plaintiffs not to sleep on their rights. This is because with the passage of time, it will become more and more difficult to investigate the circumstances in which a possession commenced and continued. Therefore, the policy is that a fixed period should be prescribed for the sake of certainty. However, as pointed out by the English Law Commission [33] , adverse possession does not merely bar claims; a squatter can get a title to land by his possession and this can only be justified by factors over and above those which explain the law on limitations. For the purpose of the present discussion, it is not necessary to quote the other justifications. Those justifications are obvious. 61. The same justification was advanced in the Law Reform Commission’s Consultation Paper on Adverse Possession [34] presented to the Panel on Administration of Justice and Legal Services in the Legislative Council in 2014. The major theme behind the Limitation Ordinance and the law on adverse possession is to protect the squatter’s long and uninterrupted possession of land from stale claims of the paper owner and to give him a good title for various reasons of public interests and public policy such as encouraging development and proper maintenance of land and facilitating conveyancing. 62. All adverse possession cases commence with some illegality, for example, the initial trespass on land belonging to another or refusal to deliver up possession upon expiry of lease or licence, etc. The Limitation Ordinance was enacted to protect the squatters by rendering initially wrongful conduct lawful. It provides for the time when cause of action accrued, the limitation period and extinguishment of title. It is a statutory scheme which “legalises” such illegal conduct by extinguishing the title of the paper owner upon expiration of the limitation period after the cause of action has accrued. The Limitation Ordinance effectively creates a right from a wrong. The law is determinedly in favour of the trespasser against the lawful owner who is sleeping on his right and not putting his land to good use. The interest of the squatter who has been enjoying uninterrupted peaceful possession and putting idling land to good use is the public interest which the Limitation Ordinance seeks to protect. Discouraging the paper owner sleeping on his right and allowing his land to go idle is the public policy reasons behind the Limitation Ordinance . These are the overriding policy considerations in the law of adverse possession and the Limitation Ordinance . They are so important as to allow a trespasser’s illegality to override the property right of the paper owner. What the Limitation Ordinance and law of adverse possession seek to protect is very different from what the common law principle seeks to achieve by denying remedy to parties who are engaged in a joint enterprise to defraud third parties. There are no third parties in a contest between the squatter and the paper owner. The law is to protect the squatter against the paper owner and not the other way round. There is nothing in the Limitation Ordinance to prevent a squatter who had committed a criminal offence in the act of possession or the manner of possession of land from relying on the limitation provisions. If anyone is to receive a windfall under the law, it should be the squatter. There is no reason why the paper owner should be protected by receiving a windfall as result of the squatter’s illegality which is the very reason for his entitlement under the law. Illegality in the context of adverse possession has a different flavour than illegality in other context. The former illegality is to be protected; the latter is to be punished. 63. If this common law principle is to be mechanically applied to cases of adverse possession it will defeat the entire doctrine of adverse possession which has been developed over the past 400 years and amount to an outright repeal of the Limitation Ordinance . In my view, this common law principle which is so inconsistent with the statutory regime under the Limitation Ordinance that it must be deemed to have been displaced by the Limitation Ordinance . It has no application to the law of adverse possession whether under the reliance approach or the proportionality approach. I therefore come to the conclusion, firstly, illegality whether in the act of possession or the manner of possession is generally irrelevant, and secondly, it is only when that the possession or the manner of possession is prohibited by some other statutory provisions that it becomes necessary for the court to resolve the conflict by statutory construction or by balancing public interest and public policy behind the statutory provisions. 64. Even in circumstances where the possession or the manner of possession is prohibited by some other statutory provisions, given the legislative intent behind the Limitation Ordinance , it is difficult to see why the illegality associated with the squatter’s possession, use or occupation of land should have any impact on his entitlement to possessory title acquired by adverse possession. Usually, the prohibition could be enforced against the squatter after he has acquired title in just the same way as it could be or could have been enforced against him before he acquired legal title or could have been so enforced against the paper owner. Further, the law is to protect the squatter’s uninterrupted occupation and not to protect the paper owner from being dispossessed of his land. If so, there is no reason why the paper owner should receive a windfall as result of the squatter’s illegal conduct and be exempted from the consequences under the Limitation Ordinance . 65. I have not been referred to many adverse possession cases in which the conflict between public interest or policy and statutory prohibitions were discussed. But I think the above proposition is adequately borne out by the authorities considered by DHCJ Leung in his admirable judgment in Choy Kuen Chi . 66. The first and most important case is the House of Lords decision in the Scottish case of Lord Advocate v Lord Lovat [35] . In that case, the Crown granted to Lord Lovat a barony charter to lands almost continuous on both sides of a river, included were older baronies containing express grants of salmon fishing to parts of the river some above and some below certain falls. From time immemorial Lord Lovat had exercised his possession, up to 1862, taking all the fish in the whole river by means of close cruives, just below the falls, which prevented spawning salmons jumping up the fall. He also prevented all others from fishing in the river. He practically harvested all the salmon in the river. Since 1862, when use of close cruives was prohibited, he regularly fished above the falls with net and coble. One of the arguments raised against Lord Lovat was that his mode of fishing was illegal, which deprived him of his claim to possession of the river, to which he had no title. On this issue, the House of Lords held [36] : “It has been said, that the formation and the working of the cruives was illegal; and on this an argument has been founded in favour of the Crown. But I do not feel the force of it. On the contrary, if illegality there was, it appears to me, on this question of possession, to tell in favour of the Respondent. If, in the assertion of a claim and the enjoyment of a privilege to which they were not entitled, the Lovat family transcended the limits of the law, it was all the easier to call their acts in question, and restrain them from proceedings inconsistent with the rights of others. If the Crown, or any grantee of the Crown, had to complain of the invasion of such rights, the alleged illegality, making that invasion more palpable and injurious, was a challenge to assert them. But no one interfered ; the detention of the salmon went on without complaint, and the inference, that it was allowed because it was rightful, was strengthened if it was really illegal . Therefore, I conceive that the argument tells rather the other way.” (My emphasis highlighted in bold and italic print) 67. It can be seen from the above dicta that it was the illegality and the lack of interference over more than forty years which created the right. The illegality of the mode of fishing, which presumably was criminal, did not make such act the less an important element in showing what the possession was. Practically, absence any statutory prohibition against his adverse possession of the river, Lord Lovat’s adverse possession was protected and illegality of the means of possession was irrelevant. This case supports the first limb of the proposition which I advanced. 68. Lambeth London Borough Council v Blackburn [37] was discussed by DHCJ Leung in Choy Kuen Chi after formulating his seven-point propositions by way of demonstration of how his propositions work. In that case, the squatter broke into a council flat by damaging the padlock and replacing it with his own Yale lock. He resided there for twelve years. The Court of Appeal held that he was successful in claiming adverse possession against the Council. It was not argued in that case that the act of criminal damage of the padlock would have prevented time from accruing in favour of the squatter. The authors of Jourdan, Adverse Possession believed that such argument would have failed [38] . It therefore seems that the illegal manner of acquiring possession by criminal damage, albeit a criminal offence, has no effect on adverse possession. Possession is possession. However, DHCJ Leung was of the opinion that had the prohibited act in question not been confined to criminal damage but the intended illegal entry as well, he would have thought that the subsequent possession would be tainted as part and parcel of the illegal entry. He said [39] : “I would be surprised if the public policy behind the criminality of the act would not require the interest of the public to be guarded against such act of illegal entry and occupation by way of breaking-in. The nature and seriousness of such unlawful conduct would afford a good reason for denying the squatter the right to acquire right over the property as a matter of public policy.” It is all hypothetical. One does not know what was the precise terms of the prohibition and the policy under this hypothetical prohibition. The court may reach the same result by a process of statutory construction. 69. In Collins v Amphlett [40] , the defendant had enclosed part of a common land. It was held that he could not succeed in showing adverse possession of the enclosed part of the common and claiming the benefit of the Real Property Limitation Acts 1833 and 1874 because the possession was contrary to section 36 of the Commons Act 1876, which prohibited inclosure of common without sanction of the Parliament. That section provided: “Where an Act of Parliament has been passed confirming a provisional order under this Act for the regulation of a common, then, subject to and without prejudice to the provisions of that order, such common shall not, nor shall any part thereof, be inclosed without the sanction of Parliament subsequently obtained.” 70. This decision can be readily explained on the basis that the Commons Act 1876 prevented inclosure of common land without sanction of Parliament. The plaintiff’s inclosure could not be complete without the plaintiff making an application to the Parliament and obtaining the sanction of Parliament. Further positive action, other than the mere act of enclosing, had to be taken by him and by Parliament before the land could in law be inclosed. The plaintiff’s failure to take those positive actions rendered the land incapable of being physically and exclusively possessed by a trespasser under the common law principle of adverse possession. There was no issue about illegality in the fact of possession or manner of possession. Simply put, possession was incomplete. This is a case of statutory construction which supports the second limb of my proposition. 71. In Glamorgan County Council v Carter [41] , the council cleared a piece of land on which some caravans were parked without authority of the council. The last caravan was removed at the end of 1937 or early January 1938. In 1954, the vacant land was sold to its present owner. Temporary planning permission was granted to him to use the land as a caravan site for two years. After expiry of the term, the owner continued such use without permission. The county council served an enforcement notice requiring the removal of the caravans. The owner refused, claiming the right to continue using the land for parking caravan without planning permission as the land had been so last used under section 12(5)(c) of the Town and Country Planning Act 1947 in 1937 or 1938 albeit without approval of the council. It was held that the statutory right to use the land under the Act, as a matter of construction, meant lawful use (referring to the use in parking caravan in 1937/1938), and in principle, it was impossible to acquire legal right by committing a criminal or quasi- criminal offence. This was plainly a case of statutory construction, not an adverse possession case, and still less an authority for the proposition that illegality in the manner of possession is a bar to adverse possession. 72. In Bakewell Management Limited v Brandwood [42] , as pointed out by DHCJ Leung, it was decided on the basis of lost modern grant, i.e. a legal fiction that the land owner had granted an easement and there was no issue of criminality of the user by the neighbouring owners. It was not a case of adverse possession. Even if it were, the trespasser was not prevented from acquiring the easement by reason of illegal trespass or illegality of his means of trespass. 73. In Regina (on the application of Smith) v Land Registry [43] , the claimant claimed adverse possession of part of a public highway, and sought to have his title so allegedly acquired registered. The Land Registry refused, and hence the claimant sought judicial review. The issue before the Court of First Instance was whether the claimant could claim such right on part of the public highway by adverse possession, when the act of possession constituted a criminal offence of wilfully obstructing the public highway without lawful authority contrary to section 137 of the Highways Act 1980. Pelling QC dismissed the review, holding that it was a legal impossibility for the claimant to claim adverse possession to part of a highway by reference to illegal obstruction which was criminal and not merely tortuously unlawful. Thus, the judge seemingly took the view that a squatter may not claim adverse possession if it was acquired by way of criminal conduct. 74. The claimant appealed. However, the Court of Appeal declined hearing argument on the effect of section 137 on the claim for adverse possession. It decided nothing about the consequence of illegality on adverse possession. The Court of Appeal unanimously dismissed the appeal. Arden LJ explained that the highway had two components: a physical element and an incorporeal element, namely a public right of passage. A squatter can only acquire the title of the owner whom he has dispossessed but there is no means in law by which, as a result of occupying land forming part of the highway the squatter can bring to an end the public's right of passage [44] . 75. Elias LJ was of the opinion that section 263 of the Highways Act vested title to a highway which is maintainable at public expense in the Highway Authority responsible for its maintenance. As such it is legally impossible for title to land to be acquired by adverse possession [45] . Mummery LJ, however, considered that the squatter may succeed if he can establish that the public right of way has been extinguished over that part of the land to which he claims adverse possession but there was no such evidence [46] . 76. Regina (on the application of Smith) v Land Registry was certainly not a case about the consequence of illegality on adverse possession. The Court of Appeal expressly refrained from dealing with that issue. It dismissed the squatter’s claim because of his failure to extinguish the public right to passage. It was about right of way and lost modern grant. 77. In Wan Hok Taoist Association v The Incorporated Owners of Nos 88-90 Pan Hoi Street & Anor [47] , Deputy High Court Judge Carlson held that the squatter’s conduct in erecting illegal structures on the land will not prevent the possession from running adversely. This may not be a strong authority as it was undefended. Basically it followed Lord Advocate. 78. In Walton v Hedleyhope Parish Council [48] , the issue was whether a squatter who enclosed a village green in contravention of section 12 of the Inclosure Act 1857 causing injury to the land and section 29 of the Commons Act 1876 could assert adverse possession of the fenced land. The Deputy Adjudicator noted that the issue of illegality in the context of the alleged adverse possession of the statutorily governed green had not been judicially determined before. He observed that there was nothing express in the Limitation Act 1980 to prevent a squatter who had committed a criminal offence in, or in the course of, taking possession of land from relying on the provision. He took the view that possession is possession, irrespective of whether acts done to secure or retain possession are contrary to the criminal law. In that sense, he followed Lord Advocate . Then, he referred to the maxim ex turpi causa non oritur actio and upon public interest and public policy considerations, he held that the squatter cannot rely on his illegal acts in seeking to show title by adverse possession. He effectively adopted the proportionality approach. The same result could be reached through statutory construction as in Collins v Amphlett . 79. Having considered these authorities and the legislative intent behind the Limitation Ordinance , I am of the opinion that the maxim ex turpi causa non oritur actio has no application to illegality in the context of adverse possession. Illegality whether in the act of possession or the manner of possession is generally irrelevant. It is only when the possession or the manner of possession is prohibited by some other statutory provisions that it becomes necessary for the court to resolve the conflict by statutory construction or by balancing the public interest and public policy behind the statutory provisions against those behind the Limitation Ordinance . 80. Accordingly, the fact that the 2 nd Defendant’s or his parents’ occupation of the Disputed Area is in breach of the government lease or section 14 of the Buildings Ordinance has no effect on his claim for adverse possession as in the case of Lord Advocate v Lord Lovat . The manner of possession may be prohibited by the Building Ordinance and the government lease. If it becomes necessary to balance the public interest and public policy consideration behind the Building Ordinance and the government lease against those behind the Limitation Ordinance , I would find in favour of the squatter. The fact that the authorities have taken no enforcement action in the past 40-odd years suggests that on the facts of this particular case there is little public interest or public policy to be served in enforcing the prohibition. Enforcement action, which the authorities have failed to take in all these 40-odd years, could be taken against the 2 nd Defendant at any time. The public interest and public policy in protecting the squatter prevail. There is no reason why the paper owner should have the benefit of the windfall caused by the illegality and be spared of the consequence of the Limitation Ordinance . Furthermore, the present case is on all fours with Choy Kuen Chi . For the same reasons as given by DHCJ Leung in that case, the balance is also in the squatter’s favour. Accordingly, the 2 nd Defendant is entitled to succeed. Conclusion 81. For the above reasons, the Plaintiff’s claim is dismissed. I enter judgment in favour of the 2 nd Defendant on his counterclaim and grant him the declarations sought but only to the extent of the area covered by the brick house and the semi-circular paved area immediately outside its front entrance. I make a costs order nisi that there be no order as to costs. ( Anthony To ) Deputy High Court Judge Mr. Ross Yuen, instructed by Vincent T.K. Cheung, Yap & Co., for the Plaintiff The 1 st Defendant acting in person being absent Mr. Vincent Lung and Ms. Leticia Tang, instructed by Ma Tang & Co for the 2 nd Defendant [1] [2020] HKCFI 751 at §20 [2] [1977] 38 P&CR 452 at §§470-471 [3] [2003] 1 A.C. 419 [4] (1997-1998) 1 HKCFAR 55 , at §69 [5] Supra, at §41 [6] CACV 260/2014, 19 January 2016 unreported at §§36-37 [7] CACV 178/2015, 28 October 2016, as per Cheung JA at §2.6. [8] HCMP 1588/2012 (unreported, 12 January 2016, at §20) [9] [2020] HKCFI 583 at §§26-27 [10] (2004) 7 HKCFAR 498 at §5 per Chan PJ [11] [2018] HKCFI 923 at §144 [12] [2019] 1 W.L.R. 6217 [13] [2011] EWCA Civ 1576 [14] HCA 2963/1998, unreported, 22 November 1999 at §21 [15] DCMP 75/2008, unreported, 29 August 2008 at §§18-26 [16] 2 nd Ed at §7-140 [17] [1994] 1 AC 340 [18] [2017] AC 467 [19] HCA 915/2011, unreported 20 July 2015 [20] [1997] HKLRD 1221 at 1226-1228 per Mortimer VP, 1228-1229 per Godfrey JA and 1229-1230 per V Bokhary J [21] [2015] 6 HKC 200 [22] [2009] EWHC 328 [23] HCA 2384/2008, unreported 16 December 2011 [24] [2020] HKCFI 362 [25] (2015) 18 HKCFAR 544 [26] HCA 2264/2014, unreported, 26 February 2019 [27] (2013) 16 HKCFAR 595 [28] [2013] QB 840 [29] Supra , at §263 [30] M Dockray, \"Why do we need adverse possession?\" [1985] Conv 272, at 272. [31] M Dockray, \"Why do we need adverse possession?\" [1985] Conv 272, at §2.5. [32] English Law Commission, Land Registration for the Twenty-first Century, A Consultative Document (1998, Law Com No 254), at paras 10.5 to 10.10. [33] English Law Commission, above, at para 10.6. [34] LC Paper No. CB(4)264/14-15(05), Dec 16, 2014 [35] (1880) 5 App Case 273 [36] Supra , at §§ 291-292 [37] [2001] All ER (D) 127 [38] §7-133. [39] Supra , at § 69 [40] (1917) 67 Sol Jo 37 [41] [1963] 1 WLR 1 [42] [2004] 2 AC 519 [43] [2009] All ER (D) 208; [2009] EWHC 328 (Admin) [44] §38 [45] §44 [46] §58 [47] HCA 2384/2008, unreported 16 December 2011 [48] [2012] EWLandRA 2011 – 0400 Look up this case on Lawcite Noteup",
  "length": 79105,
  "headers_seen": [
    "Introduction",
    "Legal principles on adverse possession",
    "An overview of the 2 nd Defendant’s case",
    "The Disputed Area",
    "The gift of the brick house and Disputed Area to the 2 nd Defendant",
    "Adverse possession – 1954 to December 1980",
    "Adverse possession – December 1980 to October 1999",
    "Adverse possession – October 1999 to August 2015"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2020/1970",
  "query": "adverse possession",
  "ts": "2025-10-17T10:44:07",
  "ok": true
}