{
  "title": "S CO V. B CO | [2014] HKCFI 1436 | HKLII",
  "court": null,
  "year": 2014,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2014] HKCFI 1436 S CO V. B CO Judgment Information Date 23 Jul, 2014 Action No. HCCT12/2013 Neutral Cit. [2014] HKCFI 1436 Parallel Cit. [2014] 6 HKC 421 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCCT12/2013 HCCT12/2013 S Co v. B Co HCCT 12/2013 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO 12 OF 2013 ____________ IN THE MATTER of Section 34C of the Arbitration Ordinance ( Cap 341 ) and IN THE MATTER of Article 16(3) of the UNCITRAL Model Law on International Commercial Arbitration (“the Model Law”) and IN THE MATTER of an Arbitration Award dated 5 April 2013 (as amended by the correction dated 31 May 2013) (“the Award”); and an Arbitration Award on Costs dated 10 June 2013 (“the Costs Award”) _____________ BETWEEN S Co Plaintiff (Respondent in the arbitration proceedings) and B Co Defendant (Claimant in the arbitration proceedings) AND HCCT 16/2013 CONSTRUCTION AND ARBITRATION PROCEEDINGS NO 16 OF 2013 ____________ IN THE MATTER of Section 34C of the Arbitration Ordinance ( Cap 341 ) and IN THE MATTER of Article 34 of the UNCITRAL Model Law on International Commercial Arbitration (“the Model Law”) and IN THE MATTER of an Arbitration Award dated 5 April 2013 (as amended by the correction dated 31 May 2013) (“the Award”); and an Arbitration Award on Costs dated 10 June 2013 (“the Costs Award”) _____________ BETWEEN S Co Plaintiff (Respondent in the arbitration proceedings) and B Co Defendant (Claimant in the arbitration proceedings) ____________ (consolidated pursuant to the Order of The Honourable Mr Justice Au dated 9 July 2013) Before: Hon Mimmie Chan J in Chambers Dates of Hearing: 12, 13 & 16 June 2014 Date of Decision: 24 July 2014 ____________ D E C I S I O N ____________ Introduction 1. In these proceedings, S Co (“ S Co ”) seeks to set aside the operative parts of an award made by an arbitral tribunal on 5 April 2013, on the ground that S Co was unable to present its case in the arbitration before the tribunal; that the award deals with a dispute not contemplated by or falling within the terms of the submission to arbitration, or contains decisions on matters beyond the scope of the submission to arbitration; that the arbitral procedure was not in accordance with the parties’ agreement; and that the award is in conflict with the public policy of Hong Kong. S Co further challenges the award of the tribunal pursuant to Article 16 (3) of the Model Law, and seeks a declaration that the tribunal did not have jurisdiction to adjudicate the claims dealt with in the award. The costs award made by the tribunal on 10 June 2013 is challenged, and sought to be set aside, on the same grounds. Background 2. S Co is a company incorporated under the laws of the PRC, and is a supplier of hardware for the generation of electricity and the establishment of power plants. Between 2002 and 2007, S Co entered into various agreements with B Co (“ B Co ”), which is a company incorporated in Hong Kong, and carries on business as a consultant with expertise in the establishment of power plants and in electricity supply. 3. On 3 March 2002, S Co and B Co entered into an agreement in writing (“ Cooperation Agreement ”) whereby B Co agreed to furnish to S Co technical assistance and advice on energy projects proposed to be developed for the Government of Nigeria. Under the Cooperation Agreement, B Co was generally to assist S Co ( inter alia ) to finalize and perfect its proposal to be submitted to the Nigerian Government in respect of the establishment of plants and facilities for the generation of electricity supply (“ Project ”), and to procure the appointment of S Co as the contractor and hardware supplier for the Project. S Co agreed to pay consultancy fees to B Co in accordance with the provisions of the Cooperation Agreement. The parties further agreed, under clause 4.4 of the Cooperation Agreement, to arbitrate in Hong Kong disputes which arise in the course of the performance, or execution, of the Cooperation Agreement, in accordance with the provisions of the Model Law. 4. On 27 March 2002, the National Electric Power Authority of Federal Ministry of Power and Steel of the Federal Republic of Nigeria (“ NEPA ”) concluded with S Co a contract (“ Phase 1 Contract ”) whereby S Co agreed to design, supply and build for NEPA a 335 MW single cycle gas turbine power plant at State A, Nigeria (“ Phase 1 Project ”). The site of the plant was subsequently moved to State B, Nigeria. 5. On 2 May 2002, S Co and NEPA entered into a further agreement (“ Phase 2 Contract ”) for the construction of a 335 MW single cycle gas turbine power plant at State B (“ Phase 2 Project ”). 6. It is not in dispute that pursuant to clause 3.5 of the Cooperation Agreement, the parties agreed that the fee payable to B Co was fixed at US$22.50 per kilowatt. S Co agreed under clause 3.6 of the Cooperation Agreement to issue to B Co, or to such third party as B Co may designate, a letter of undertaking of payment (“ Letter of Undertaking ”) in respect of the fees payable to B Co. Pursuant to the Cooperation Agreement, S Co issued 3 Letters of Undertaking, the first on 26 March 2002 and the remaining 2 on 15 April 2002, whereby it undertook to pay US$7,537,500 as consultancy fee and development cost, and US$1,560,000 as agency fee and development cost, both in respect of the Phase 1 Project, and a further sum of US$7,537,500 as consultancy fee and development cost in respect of the Phase II Project. The 1 st Letter of Undertaking of 26 March 2002 was issued to Mr MD (“ MD ”), the managing director of B Co at the material time. The 2 nd and 3 rd Letters of Undertakings were issued to “MD/B Co”. 7. It is not disputed that the Phase 2 Project was never built. On B Co’s case, B Co and S Co made new proposals to the Nigerian employer for the construction of another power plant with higher power, namely a 754 MW combined cycle gas turbine power plant at P in State B, to replace the Phase 2 Project. 8. On 16 April 2007, a contract was concluded between the Federal Ministry of Energy and S III, a legal entity separate to S Co (“ S III Contract ”), whereby S III undertook and agreed to engineer, design and deliver the equipment for and to construct a 750 MW power plant for the P Phase 2 Power Station in Nigeria (“ Revised Phase 2 Project ”). According to B Co, S III was S Co’s designated and affiliated company and/or subsidiary to enter into the S III Contract, and the Revised Phase 2 Project was revised and expanded from the Phase 2 Project through B Co’s effort. 9. On B Co’s case, S Co acted in breach of the Cooperation Agreement by appointing one F Limited (“ F Ltd ”) to be its consultant to replace the role played by B Co under the Cooperation Agreement, and was further in breach by failing and refusing to pay consultancy fees due to B Co. 10. On B Co’s case, S Co had paid a total sum of US$7,759,984 under its Letters of Undertaking, and had failed to pay the balance of US$996,846 due and payable as consultancy fees under the Cooperation Agreement. 11. On 11 October 2007, B Co commenced arbitral proceedings against S Co in Hong Kong (“ Arbitration ”). The Tribunal was constituted on 6 May 2009. On 9 April 2010, S Co challenged the Tribunal’s jurisdiction by notice (“ Notice of Challenge ”), stating that the Tribunal did not have jurisdiction over B Co’s claims for the unpaid balance of US $996,846 due under the 2 letters of undertaking (“ Balance Payment Claim ”), and for the US$7,537,500 under the S III Contract (“ S III Contract Claim ”). On 13 September 2010, the Tribunal directed that the jurisdictional challenge of S Co was to be heard and dealt with together with the substantive hearing on the merits. 12. By an Interim Award issued on 5 April 2013, the Tribunal dismissed S Co’s jurisdictional challenge, and at the same time ordered S Co to make payment to B Co of (i) US$996,846 on the Balance Payment Claim; (ii) US$7,537,500 on the S III Contract Claim; and (iii) 70% of the costs. The Tribunal further awarded to S Co a nominal sum of US$1 on its counterclaim against B Co for damages for breach. 13. On 10 June 2013, the Tribunal made a Costs Award, whereby S Co was to pay 70% of the costs of the arbitration to B Co. 14. These proceedings are commenced by S Co to challenge both the Interim Award and the Costs Award, invoking Articles 16 (3) and 34 of the Model Law. On 3 May 2013, S Co issued HCCT 12/2013 (“ Article 16 OS ”), to seek a declaration that the Tribunal did not have jurisdiction to adjudicate the Balance Payment Claim and the S III Contract Claim, and an order that the operative parts of the Interim Award and of the Costs Award be set aside under Article 16 (3) of the Model Law. On 27 May 2013, S Co also issued HCCT 16/2013 (“ Article 34 OS ”), for an order that the operative parts of the Interim Award and of the Costs Award be set aside under Article 34 (2) (a) (ii), (iii), (iv) and/or (b) (ii) of the Model Law. The relevant grounds relied upon under Article 34 are that S Co was unable to present its case; that the Interim Award deals with a dispute not contemplated by or not falling within the terms of the submission to arbitration, or contains decisions on matters beyond the scope of the submission; that the arbitral procedure was not in accordance with the agreement of the parties; or that the award is in conflict with public policy. The jurisdiction challenge 15. Article 16 of the Model Law provides : “(1) The arbitral tribunal may rule on its own jurisdiction, including any objections with respect to the existence or the validity of the arbitration agreement. For that purpose, an arbitration clause which forms part of a contract shall be treated as an agreement independent of the other terms of the contract. A decision by the arbitral tribunal that the contract is null and void shall not entail ipso jure the invalidity of the arbitration clause. (2) A plea that the arbitral tribunal does not have jurisdiction shall be raised not later than the submission of the statement of defence. A party is not precluded from raising such a plea by the fact that he has appointed, or participated in the appointment of, an arbitrator. A plea that the arbitral tribunal is exceeding the scope of his authority shall be raised as soon as the matter alleged to be beyond the scope of his authority is raised during the arbitral proceedings. The arbitral tribunal may, in either case, admit a later plea if it considers the delay justified. (3) The arbitral tribunal may rule on a plea referred to in paragraph (2) of this article either as a preliminary question or in an award on the merits. If the arbitral tribunal rules as a preliminary question that it has jurisdiction, any party may request, within 30 days after having received notice of that ruling, the court specified in article 6 to decide the matter, which decision shall be subject to no appeal; while such a request is pending, the arbitral tribunal may continue the arbitral proceedings and make an award.” 16. In relation to the jurisdiction challenge made under Article 16, S Co claims that, in respect of the Balance Payment Claim: (1) it was not a dispute arising in the course of performance of the Cooperation Agreement, to fall within the scope of clause 4.4 of the Cooperation Agreement (“ Arbitration Clause ”); (2) the Tribunal wrongly found that the Letters of Undertaking which support the Balance Payment Claim were derived from and supplemented the Cooperative Agreement; (3) B Co’s claim for fees was made under the Letters of Undertaking, which contained no arbitration clause to make the dispute referable to arbitration; (4) B Co was not a party to the Letter of Undertaking issued on 26 March 2002, which was issued to MD and not B Co, such that B Co lacked basis or locus to refer to arbitration its claim for the amount due under the 26 March 2002 Letter of Undertaking; (5) at the time of commencement of the arbitral proceedings on 11 October 2007 when B Co lodged Form 2, the unpaid balance under the 2 Letters of Undertaking had not fallen due because the Take Over Certificate was not yet issued; and (6) the Balance Payment Claim was not referred to in Form 2, and the Tribunal had wrongly found that S Co had waived its right to object on this ground. 17. S Co also claims that, in respect of the S III Contract, the Tribunal lacked jurisdiction to award unliquidated damages of US$7,537,500, when B Co’s claims under the Points of Claim in the arbitral proceedings were for liquidated damages only, and when S III was not a party to the Cooperation Agreement. The standard of review for jurisdiction challenge 18. Detailed submissions were made by Ms Cheng SC and Mr Wong SC, respectively for S Co and B Co, on the standard of the review applicable, when the court considers a challenge to the determination made by the Tribunal on its jurisdiction over the claim referred, and its award made on the claim. 19. On behalf of S Co, Ms Cheng argued that whereas an arbitral tribunal has power to decide challenges as to its own jurisdiction, including any claim that the arbitration agreement was non-existent, invalid or illegal or that it did not encompass some or all of the parties’ disputes or claims, the tribunal’s decision on jurisdiction is preliminary, is neither exclusive nor final, and is open to a full and de novo review by the court. 20. Ms Cheng argued that this is apparent from the language of Article 16 (3) of the Model Law, which provides that any party may request the court “to decide ” the matter of the arbitral tribunal’s jurisdiction. 21. Ms Cheng referred to the passage of the judgment of Kaplan J in Fung Sang Trading Limited v Kai Sun Sea Products & Food Co Ltd [1992] 1 HKLRD 40 : “The Tribunal’s decision on its jurisdiction is neither exclusive nor final. It is subject to immediate but final review under Article 16 (3). The Tribunal’s decision may later be considered in an application to set aside the award under Article 34…” 22. In his judgment, Kaplan J referred to Aron Broches’ “Commentary on the UNCITRAL Model Law”, published by Kluwer in 1990, where it is stated: “The concept of ‘competence-competence’ concerns the degree to which an arbitral tribunal may rule on its own jurisdiction as defined by the arbitration agreement. It does not imply the power of an arbitral tribunal to make a final and binding decision as to its jurisdiction. The issue is not the finality of the arbitrators’ decision on the jurisdiction and the consequent ouster of the jurisdiction of the courts, but rather the time at which and the conditions under which the courts may play their role as the final authority on the question of arbitral jurisdiction. It is therefore an issue which is to be resolved on the basis of practical rather than doctrinal considerations. The basic problem is how to reconcile the realization of the objectives of commercial arbitration, which would be defeated if an arbitral tribunal would have to suspend or terminate its proceedings each time a party pleaded invalidity of the arbitration agreement, with an effective measure of court supervision to ensure that the arbitral tribunal does not finally confer on itself a jurisdiction which by reason of the consensual nature of arbitration can only derived from the agreement of the parties.” 23. As Ms Cheng highlighted, the fact that a ruling on jurisdiction is termed an “award” does not change the nature of its ruling, as held in Weltime Hong Kong Limited & Anr v Ken Forward Engineering Limited [2001] 1 HKC 458 . In that case, Burrell made it clear: “A ruling on jurisdiction, by its very nature, is a preliminary ruling which much precedes an award on the merits. The fact that it may be titled “an award” or an “interim award” does not mean it ceases to be a preliminary ruling on jurisdiction, which it plainly was.” (Emphasis added) 24. The decision of Burrell J was approved and confirmed by the Court of Appeal in Incorporated Owners of Tak Tai Building v Leung Yau Building Limited [2005] 1 HKC 530 . 25. In Born , International Commercial Arbitration , 2 nd edition (2014) Vol 1, the learned author states (at pp 1107- 1108) under “Standard of Judicial Review of Jurisdictional Rulings by Arbitral Tribunal Under UNCITRAL Model Law”: “The text of Article 16 (3) arguably implies de novo judicial review (by providing that the dissatisfied party may request ‘the court specified in Article 6 to decide the matter’). Equally, the language of Article 34 (2) (a) (i) and (iii), which permits the annulment of awards on jurisdictional grounds, also arguably implies de novo judicial review (by simply stating the grounds on which an award may be set aside, without any reference to deference to arbitral determinations). In several cases, courts have assumed without analysis that interim jurisdictional decisions by arbitral tribunals will be fully reviewed under Article 16 (3). On the other hand, nothing in the Model Law expressly resolved this issue or prescribes the standard of judicial review of jurisdictional awards. As an eminent commentator on the Model Law explained regarding the drafting process, ‘it proved difficult…to reach agreement on the… scope of court review.’ In the absence of statutory guidance, courts in Model Law jurisdictions have generally adopted a de novo standard of review in proceedings under Articles 16 (3) and 34 (2) (a), at least in so far as issues of law (as distinguished from fact) are concerned.” 26. The Singaporean courts supported the view of there being a de novo standard of review in 2 cases. In PT Tugu Pratama Indonesia v Magma Nusantara Ltd [2004] 4 SLR (R) 257, Judith Prakash J held (at paragraph 18 of her judgment): “MNL puts up a procedural objection to this argument. MNL says that PT Tugu cannot make the argument because it was not raised in the statement of defence filed in the arbitration. MNL did not push this contention in its oral arguments and rightfully so because I see no reason why my consideration of the issue is to be limited by what was pleaded by the parties in the arbitral proceedings. This hearing under Art 16 (3) is not by way of appeal against the decision of the tribunal. … Accordingly, the court makes an independent determination on the issue of jurisdiction and is not constrained in any way by the findings or the reasoning of the tribunal. In the same way, parties are not limited to rehearsing before the court the contentions put before the tribunal but are entitled to put forward new arguments on the issue and the court is entitled to consider these. ” (Emphasis added) 27. In the later case of Insigma Technology Co Ltd v Alstom Technology Ltd [2009] 1 SLR 23 , the learned judge further explained the nature of jurisdictional review: “In the text Jurisdiction and Arbitration Agreement and their Enforcement (Sweet & Maxwell, 2005) by David Joseph QC (‘ Jurisdiction and Arbitration Agreements ’), it is stated (at para 13.28) that the power of the court in deciding whether the tribunal had jurisdiction is not limited to reviewing the tribunal’s decision for error, but involves a rehearing, including if necessary the calling of witnesses already heard by the tribunal. The statement was based on the authority of a number of first instance English decisions that considered the meaning and effect of s 67 of the English Arbitration Act 1996 (c 23). Whilst I am not aware of any authority on the point in connection with the Model Law, it is my view that, under this legislation too, the court’s jurisdiction to decide on the jurisdiction of an arbitral tribunal is an original jurisdiction and not an appellate one . This is clear from the wording of Art 16 (3) of the Model Law. It simply provides for the court ‘to decide the matter’ of jurisdiction after the tribunal has made a ruling that it has jurisdiction. This is not language implying that the court’s powers to act are of an appellate nature. Although the word ‘appeal’ does appear within the article, the context in which it is found is the specification that there should be no appeal against the decision of the court on jurisdiction. There are also good reasons why the court should have the power to hear the matter afresh rather than to take the position of an appellate body. These are enumerated in the same paragraph of Jurisdiction and Arbitration Agreements and are as follows. First, it the court was limited to a process of review, it might be reviewing the decision of the tribunal that itself had no jurisdiction to make such a finding. Second, the procedure to determine the jurisdiction is available to a party that took no part in the arbitral proceedings; if the court was confined to a review of the tribunal’s decision this would greatly undermine the ability of the challenging party to make its case. Third, if there is to be a challenge on an issue of fact, the court should not be in a worse position to make an assessment than the tribunal, and should therefore be able to examine witnesses in the usual way. Accordingly, therefore, a party is entitled to raise an objection to jurisdiction before the judge that it had not raised and argued before the arbitrator. However, ‘a failure to raise a specific point before the arbitrator is likely to be relevant as to weight’ ( Jurisdiction and Arbitration Agreement at para 13.35).” (Emphasis added) 28. In The United Mexican States v Cargill, Incorporated 2011 ONCA 622 (Court of Appeal for Ontario), the Canadian court also endorsed the de novo approach: “31. The starting point for determining the appropriate standard of review to be applied… is the words of art 34 (2) of the Model Law … The article provides that an award may only be set aside if the objecting party proves one of the enumerated deficiencies. None of the grounds allows a reviewing court to review the merits of a tribunal’s decision. Article 34 (2) (a) (iii) (of the Model Law) allows a court to review the award based on excess of jurisdiction by the tribunal… 34. Because the court has been given the oversight power provided in Article 34 (2) of the Model Law, the question how a reviewing court is intended to perform the review and what test is to apply is a critical one. In this case, the specific question is what test does the court apply under art 34 (2) (a) (iii) of the Model Law to determine whether the tribunal exceeded its jurisdiction by deciding an issue that was not within the submission of the parties…? 35. Accepting that courts should interfere only sparingly or in extraordinary cases, the court must have some basis to test whether the panel acted beyond its jurisdiction. If we were to use judicial review principles that apply in a domestic context, we would conduct a Dunsmuir analysis and determine whether the applicable standard is reasonableness or correctness. Normally, where the issue is one of pure jurisdiction, the correctness standard would apply, implying possible consideration of, but no deference to, the decision of the tribunal under review ...” (Emphasis added) 29. The Canadian court then referred to the decision of the English Supreme Court in Dallah Real Estate and Tourism Holding Co v Ministry of Religious Affairs of the Government of Pakistan , [2011] 1 AC 763 , [2011] 1 All ER 485 (UKSC). From paragraph 41 of its judgment, the court concluded that the tribunal has to be correct in the sense that the decision it made has to be within the scope of the submission, and it has no authority to expand its jurisdiction by incorrectly interpreting the submissions. The court went on to highlight various matters: “44. It is important, however, to remember that the fact that the standard of review on jurisdictional questions is correctness does not give the courts a broad scope for intervention in the decisions of international arbitral tribunals. To the contrary, courts are expected to intervene only in rare circumstances where there is a true question of jurisdiction. 45. In the domestic law context, courts are warned to ensure that they take a narrow view of what constitutes a question of jurisdiction and to resist broadening the scope of the issue to effectively decide the merits of the case… 46. This latter approach is magnified in the international arbitration context. Courts are warned to limit themselves in the strictest terms to intervene only rarely in decisions made by consensual, expert, international arbitration tribunals, including on issues of jurisdiction. In my view, the principle underlying the concept of “powerful presumption” is that courts will intervene rarely because their intervention is limited to true jurisdictional areas. To the extent that the phrase “powerful presumption” may suggest that a reviewing court should presume that the tribunal was correct in determining the scope of its jurisdiction, the phrase is misleading. If courts were to defer to the decision of the tribunal on issues of true jurisdiction, that would effectively nullify the purpose and intent of the review authority of the court under art 34 (2) (a) (iii). 47. Therefore, courts are to be circumspect in their approach to determining whether an error alleged under art 34 (2) (a) (iii) properly falls within that provision and is a true question of jurisdiction. They are obliged to take a narrow view of the extent of any such question. And when they do identify such an issue, they are to carefully limit the issue they address to ensure that they do not, advertently or inadvertently, stray into the merits of the question that was decided by the tribunal. 48. One challenge for a reviewing court is to navigate the tension between the discouragement to courts to intervene on the one hand, and on the other, the court’s statutory mandate to review for jurisdictional excess, ensuring that the tribunal correctly identified the limits of its decision-making authority. Ultimately, when deciding its own jurisdiction, the tribunal has to be correct. … 50. The second challenge for the court is to limit its review to determining whether the award ‘contains decisions on matters beyond the scope of the submission’ and not to review the merits of the decision itself. … 53. The role of the reviewing court is to identify and narrowly define any true question of jurisdiction. The onus is on the party that challenges the award. Where the court is satisfied that there is an identified true question of jurisdiction, the tribunal had to be correct in its assumption of jurisdiction to decide the particular question it accepted and it is for the court to determine whether it was. In assessing whether the tribunal exceeded the scope of the terms of jurisdiction, the court is to avoid a review of the merits. ” (Emphasis added) 30. In the case of Dallah Real Estate and Tourism Holding Co v Ministry of Religious Affairs of the Government of Pakistan , [2011] 1 AC 763 , [2011] 1 All ER 485 (UKSC), the English Supreme Court held that an arbitral tribunal’s decision as to the existence of its own jurisdiction could not bind a party who had not submitted the question of arbitrability to that tribunal; and that a person who denied being party to an arbitration agreement was under no obligation to participate in the arbitration or to take any step in the country of the seat of the allegedly invalid arbitration. The court further held that where an English court was asked to enforce a foreign arbitration award, and an application was made to resist enforcement on the ground that the alleged arbitration agreement was not valid, the court would determine anew the question as to whether or not the non-signatory had been a party, and that in so doing, the tribunal’s own view of its jurisdiction had no legal or evidential value, although the court would examine its reasoning and conclusions. 31. In his judgment, Lord Mance observed: “28. It is true that article V (1) (e) of (the New York Convention) and section 103 (2) (f) of the 1996 Act recognized the courts of “the country in which, or under the law of which” an award was made as the courts where an application to set aside or suspend an award may appropriately be made; and also that article VI and section 103 (5) permit the court in any other country where recognition or enforcement of the award is sought to adjourn, if it considers it proper, pending resolution of any such application…. Neither article V (1) (a) and section 103 (2) (b) hints at any restriction on the nature of the exercise open, either to the person resisting enforcement or to the court asked to enforce an award, when the validity (sc existence) of the supposed arbitration agreement is in issue. The onus may be on the person resisting recognition or enforcement, but the language enables such person to do so by proving (or furnishing proof) of the nonexistence of any arbitration agreement. This language points strongly to ordinary judicial determination of that issue …. 30. The nature of the present exercise is, in my opinion, also unaffected where an arbitral tribunal has either assumed or, after full deliberation, concluded that it had jurisdiction. There is in law no distinction between these situations. The tribunal’s own view of its jurisdiction has no legal or evidential value, when the issue is whether the tribunal had any legitimate authority in relation to the Government at all. This is so however full was the evidence before it and however carefully deliberated was its conclusion. … 31. This is not to say that a court seised of an issue under article V (1) (a) and section 103 (2) (b) will not examine, both carefully and with interest, the reasoning and conclusions of an arbitral tribunal which has undertaken a similar examination. Courts welcome useful assistance. … ” (Emphasis added) 32. Lord Collins also explained thus, in his judgment in Dallah : “84. So also the principle that a tribunal in an international commercial arbitration has the power to consider its own jurisdiction is no doubt a general principle of law. It is a principle which is connected with, but not dependent upon, the principle that the arbitration agreement is separate from the contract of which it normally forms a part. But it does not follow that the tribunal has the exclusive power to determine its own jurisdiction, nor does it follow that the court of the seat may not determine whether the tribunal has jurisdiction before the tribunal has ruled on it. Nor does it follow that the question of jurisdiction may not be re-examined by the supervisory court of the seat in a challenge to the tribunal’s ruling on jurisdiction . Still less does it mean that when the award comes to be enforced in another country, the foreign court may not re-examine the jurisdiction of the tribunal. 85. Thus article 16 (1) of the UNCITRAL Model Law on International Commercial Arbitration provides that the arbitral tribunal may rule on its own jurisdiction, including any objections with respect to the existence or the validity of the arbitration agreement. But by article 34 (2) an arbitral award may be set aside by the court of the seat if an applicant furnishes proof that the agreement is not valid under the law to which the parties have subjected, or, failing any indication thereon, under the law of the seat (and see also article 36 (1) (a) (i))…. 86. Consequently in most national systems, arbitral tribunals are entitled to consider their own jurisdiction, and to do so in the form of an award. But the last word as to whether or not an alleged arbitral tribunal actually has jurisdiction will lie with the court , either in a challenge before the courts of the arbitral seat, where the determination may be set aside or annulled, or in the challenge to recognition or enforcement abroad. The degree of scrutiny, particularly as regards the factual inquiry, will depend on national law, subject to applicable international conventions.” (Emphasis added) 33. After examining section 30 of the Arbitration Act of 1996 (equivalent to Article 16 of the Model Law), Lord Collins observed: “96. The consistent practice of the courts in England has been that they will examine or re-examine for themselves the jurisdiction of arbitrators. This can arise in a variety of contexts, including a challenge to the tribunal’s jurisdiction under section 67 of the 1996 Act, or in an application to stay judicial proceedings on the ground that the parties have agreed to arbitrate. Thus in Azov Shipping Co v Baltic Shipping Co [1999] 1 All ER 476 Rix J decided that where there was a substantial issue of fact as to whether a party had entered into an arbitration agreement, then even if there had already been a full hearing before the arbitrator the court, on a challenge under section 67, should not be in a worse position than the arbitrator for the purpose of determining the challenge. This decision has been consistently applied at first instance (see, eg Peterson Farms Inc v C & M Farming Ltd [2004] 1 Lloyd’s Rep 603) and is plainly right. … 98. Consequently, in an international commercial arbitration a party which objects to the jurisdiction of the tribunal has two options. It can challenge the tribunal’s jurisdiction in the courts of the arbitral seat; and it can resist enforcement in the court before which the award is brought for recognition and enforcement. These two options are not mutually exclusive, although in some cases a determination by the courts of the seat may give rise to an issue estoppel or other preclusive effect in the court in which enforcement is sought. The fact that jurisdiction can no longer be challenged in the courts of the seat does not preclude consideration of the tribunal’s jurisdiction by the enforcing court: Svenska Petroleum Exploration AB v Government off the Republic of Lithuania (No 2) [2007] QB 886 , para 104 and Paklito Investment Ltd v Klockner East Asia Ltd [1993] 2 HKLR 39 , 48, per Kaplan J.” 34. Finally, the judgment of Lord Saville of Newdigate SJC in Dallah states: “159. …I am of the view that to take as the starting point the ruling made by the arbitrators and to give that ruling some special status is to beg the question at issue, for this approach necessarily assumes that the parties have, to some extent at least, agreed that the arbitrators have power to make a binding ruling that affects their rights and obligations, but without some such agreement such a ruling cannot have any status at all. 160. In my judgment therefore, the starting point cannot be a review of the decision of the arbitrators that there was an arbitration agreement between the parties. Indeed no question of a review arises at any stage. The starting point in this case must be an independent investigation by the court of the question whether the person challenging the enforcement of the award can prove that he was not a party to the arbitration agreement under which the award was made. The findings of fact made by the arbitrators and their view of the law can in no sense confine the court, though of course the court may find it useful to see how the arbitrators dealt with the question. Whether the arbitrators had jurisdiction is a matter that in enforcement proceedings the court must consider for itself.” 35. I respectfully agree with the detailed analyses set out in the judgments of their lordships in Dallah , and that of Prakash J in Insigma . Although the question in issue before the court in Dallah was whether the defendant was a party to the arbitration agreement, such that the arbitrators had no power to make the award against it (under section 103 (2) (b) of the 1996 Act), the observations made by the English Supreme Court are in my view just as relevant and applicable to a case where the court is asked to consider the general question of whether the arbitrators had jurisdiction and power to make the award, by reason of the fact that there is no valid arbitration agreement, or that the award deals with a dispute not falling within the terms of the submission to arbitration. Arbitration is based on consensus and the parties’ agreement to submit their dispute to the arbitral tribunal. When the jurisdiction of the tribunal is challenged, the issue in dispute is whether there was initial consent to the submission of the dispute to arbitration and to the tribunal’s determination. Since Article 16 provides for the court to decide the matter of the tribunal’s jurisdiction, the court must independently determine for itself whether or not the parties had consented to the submission of the dispute to the tribunal, and should not be bound or restricted by the tribunal’s preliminary decision on its own jurisdiction. The court should not be in a worse position than the arbitrator in its determination of the challenge. Natural justice also requires such independent review, as otherwise the tribunal would be the final judge of its own powers and cause. 36. The independent decision required to be made by the court under Article 16 should not differ, merely because the scrutiny by the court is exercised at the stage when a party applies for the tribunal’s award to be set aside or not to be enforced under Article 34 or Article 36 of the Model Law. Article 16 empowers the arbitral tribunal to rule on the challenge to its jurisdiction either as a preliminary question, or in its award on the merits. The tribunal should not be able to avoid an independent, de novo review by the court of its ruling on jurisdiction, simply by deferring such ruling to the making of the award on the merits. The standard of the court’s scrutiny should be the same, when it is recognized that a party which objects to the jurisdiction of the tribunal has the option, either to challenge jurisdiction in the courts of the arbitral seat, or to resist enforcement in the court before which the award is brought for recognition and enforcement ( Paklito Investment Ltd v Klockner East Asia Ltd [1993] 2 HKLRD 39 , 48). 37. I agree with Mr Wong, however, that the de novo review of the tribunal’s ruling on its jurisdiction simply means that the court considers the challenge on its own, and on the facts and evidence presented to the court. A party is still entitled to argue that the party raising the challenge to jurisdiction is estopped from complaining of some alleged irregularity, or raising some completely new objection, not on the basis that it had never been raised before the tribunal, but because the party had by its own conduct in the arbitration waived such irregularity. 38. Further, as Mr Wong emphasized, the challenge to jurisdiction should not be a mere guise for challenging the tribunal’s findings on the merits of the case. As the Court of Appeal for Ontario held in United Mexican States v Cargill, Inc 2011 ONCA 622, the courts are to be circumspect in their approach to determining whether an error alleged under Article 34 (2) (iii) of the Model Law properly falls within that provision and is a true question of jurisdiction. The Court of Appeal highlighted in its judgment that courts are obliged to take a narrow view of the extent of any question of jurisdiction, and must carefully limit the issue they address to ensure that they do not stray into the merits of the question that was decided by the tribunal (see paragraphs 44, 45 and 47 of the judgment, set out in paragraph 29 above). I agree that is the proper approach which should be taken. Mode of determination of the challenge 39. In this case, after S Co had filed challenge to the Tribunal’s jurisdiction on 9 April 2010, the Tribunal directed that the challenge should be dealt with together with the substantive hearing on the merits. In the Interim Award of 5 April 2003 (“ Award ”), the Tribunal dismissed S Co’s jurisdictional challenge, setting out its reasons at paragraphs 63 to 116. The Tribunal then proceeded to deal with the parties’ substantive arguments on the merits of the claims made in the Arbitration. 40. Leading Counsel for S Co explained that the Article 16 OS was issued as a matter of caution, as both the Article 16 OS and the Article 34 OS adopt essentially the same grounds, for challenging the jurisdiction of the Tribunal and for setting aside the Award and the Costs Award. S Co seeks to set aside the Award on the basis that it deals with a dispute not contemplated by or falling within the terms of the submission to arbitration, or contains decisions on matters beyond the scope of the submission to arbitration, or the arbitral procedure was not in accordance with the parties’ agreement. Hence, it was argued that S Co had been unable to present its case on the matters outside the terms of the submission and on the arbitral procedure, and for those reasons, it is contrary to public policy to enforce the Award. If the Award is set aside, S Co argues that the Costs Award, which is premised upon the findings in the Award, should also be set aside. 41. I agree with Mr Wong that it is totally unnecessary and inappropriate in the circumstances for S Co to issue the Article 16 OS in addition to the Article 34 OS. Article 16 (3) clearly provides that the arbitral tribunal may rule on a plea that the arbitral tribunal does not have jurisdiction “ either as a preliminary question or in an award on the merits ”. It goes on to provide: “ If the arbitral tribunal rules as a preliminary question that it has jurisdiction , any party may request, within 30 days after having received notice of that ruling, the court specified in article 6 to decide the matter, which decision shall be subject to no appeal; while such a request is pending, the arbitral tribunal may continue the arbitral proceedings and make an award.” (Emphasis added) 42. The request to the court, which may be made by the challenging party within 30 days after having received notice of the tribunal’s ruling, applies to the situation when the tribunal has ruled on the challenge to its jurisdiction as a preliminary question. When the tribunal decides to take the option of ruling on the challenge in an award on the merits, that ruling becomes part of its award on the merits. The party which had made the challenge is then able, in the event that it is dissatisfied with the tribunal’s ruling on jurisdiction, to apply under Article 34 to set aside the award on any applicable ground, including Article 34 (2) (i), (iii) or (iv) which are relevant to the question of jurisdiction. The time for making the application under Article 34 is as stated in Article 34 (3), ie within 3 months of the date on which the party making the application had received the award. 43. Bearing in mind that the object of the Arbitration Ordinance (enshrined in section 2AA of Cap 341 which applies to the Arbitration in this case, and section 3 of Cap 609 ) is to facilitate the fair and speedy resolution of disputes by arbitration without unnecessary expense, and that so far as court procedure is concerned, the underlying objectives emphasized by the Civil Justice Reform are to increase the cost effectiveness of any practice and procedure, to ensure expeditious disposal of cases and to promote procedural economy, it makes no sense to require a party to make an application under Article 16 to challenge a tribunal’s ruling on jurisdiction within 30 days of a party’s receipt of notice of the ruling in the award on the merits, and then to make a separate application under Article 34 for setting aside the award on the merits on the same ground as the challenge on jurisdiction, within 3 months of the receipt of the award. 44. The parties have not referred to any authority which deals specifically with the question of whether the challenge to jurisdiction to be resolved by the court, when the tribunal has ruled on its jurisdiction in its award on the merits, should be made under Article 16 (3), or under Article 34. 45. In support of the argument that a tribunal’s ruling on jurisdiction is only a preliminary decision, and not an “award”, Ms Cheng referred to Born’s International Commercial Arbitration 2 nd Edition 2014, para 7.03[A]. Mr Wong, on his part, highlighted passages in Born which support his contention that where the jurisdiction ruling is made in the final award, the avenue to challenge should properly be made under Article 34 (2) (a) (i) and (iii): “The better reading of the Model Law is that an arbitral tribunal’s jurisdictional decision under Article 16 (3) is an award (regardless whether it is a positive or negative jurisdictional decision). It is true that characterizing a jurisdictional ruling as an award is in tension with the text of Article 34, which provides that the only recourse against an “award” is set forth exclusively in Article 34 (thus arguably not catering for the review of jurisdictional rulings that is available under Article 16 (3)). A few national court decisions (in Singapore and Hong Kong) have adopted this view of the Model Law. The more persuasive view, however, is that Articles 16 (3) and 34 can, and should, be read together. The general terms of Article 34 impliedly permit the expedited judicial review that is provided for by the specific terms of Article 16 (3), while Article 34 provides the substantive and choice-of-law standards that must be applied under Article 16 (3). The two propositions not only can be reconciled, but failing to do so would leave each partially incomplete. A systematic interpretation prevents these deficiencies, while giving effect to the Model Law’s objectives of ensuring prompt judicial review, and subsequent enforcement, of arbitrators’ decisions. At the same time, a systematic interpretation admits the same standards to be applied to judicial review of jurisdictional rulings by arbitral tribunals regardless whether they are made in preliminary rulings (under Article 16 (3)) or reserved for the tribunal’s final award (and judicial review under Articles 34 (2) (i) and (iii)). Indeed, it would be anomalous, at best, to conclude that a jurisdictional ruling in a final award is (part of) an award, but that a preliminary jurisdictional ruling is not an award. ” (Emphasis added) 46. Further, Mr Wong referred to the “ Analytical Commentary on Draft Text of a Model Law on International Commercial Arbitration ” (United Nations document A/CN.9/264) (“ Commentary ”). According to section 2 (3) and the Sixth Schedule to Cap 341 , regard may be had to the Commentary in interpreting and applying the provisions of the Model Law. The Commentary on Article 16 reads as follows: “11. Objections to the arbitral tribunal’s jurisdiction go to the very foundation of the arbitration. Jurisdictional questions are, thus, antecedent to matters of substance and usually ruled upon first in a separate decision, in order to avoid possible waste of time and costs. However, in some cases, in particular, where the question of jurisdiction is intertwined with the substantive issue, it may be appropriate to combine the ruling on jurisdiction with a partial or complete decision on the merits of the case. Article 16 (3), therefore, grants the arbitral tribunal discretion to rule on a plea referred to in paragraphs (2) either as a preliminary question or in an award on the merits. 12. As noted earlier, the power of the arbitral tribunal to rule on its own competence is subject to judicial control. Where a ruling by the arbitral tribunal that it has jurisdiction is, exceptionally, included in an award on the merits, it is obvious that the judicial control of that ruling would be exercised upon an application by the objecting party for the setting aside of that award ….” (Emphasis added) 47. The Hong Kong cases cited in para 7.03[A] of Born , namely, The Incorporated Owners of Tak Tai Building v Leung Yau T Buildings Limited [2005] 1 HKC 530 , CA, Brunswick (where the tribunal decided that it had no jurisdiction to arbitrate on the counterclaims, and made no award in respect of those claims) and Weltime Hong Kong Limited v Ken Forward Engineering Ltd [2001] 1 HKC 458 , are all distinguishable from the present case, since they involved tribunals’ preliminary rulings on their jurisdiction, or did not involve a decision on the claims. 48. In this case, the Tribunal decided that the determination of the jurisdictional challenges raised by S Co depended on its ascertainment and verification of the facts of the case (paragraph 63 of the Award). By its ruling on 13 September 2010, the Tribunal had made it clear to the parties that its decision on the jurisdictional challenge involved verification of the facts and was not appropriate for determination prior to hearing all the evidence on the dispute (paragraph 4 of the ruling of 13 September 2010). The Tribunal’s ruling was that it would make one award after hearing the substantial dispute. It did not rule on the jurisdictional challenge as a preliminary question. 49. Since there is no ruling on jurisdiction as a preliminary question, the request to the court for decision within 30 days as referred to in Article 16 (3) simply does not arise. Under section 2AA of Cap 341 (and section 3 (2) (b) of Cap 609 ), the court should interfere in the arbitration of the dispute only as expressly provided for in the Ordinance. The application made under the Article 16 OS should accordingly be dismissed, with costs on an indemnity basis. Since the Tribunal ruled on its jurisdiction with an award on the merits and the substance of the dispute, S Co’s challenge of the Tribunal’s jurisdiction should proceed as an application for setting aside the Interim and Costs Awards under Article 34, with reliance on Article 34 (2) (a) (i), (iii) or (iv) as appropriate. 50. As indicated in paragraphs 35 to 38 above, whether the application is made under Article 16 (3) or the relevant paragraphs of Article 34, the court’s review of the Tribunal’s decision on its jurisdiction should be de novo - in the sense that the court must be satisfied that the Tribunal was correct and that it did have jurisdiction. Is the Balance Payment Claim within the jurisdiction of the Tribunal under Article 34? 51. Under Article 34 (2) (a) (iii), an arbitral award may be set aside by the court if the award “deals with a dispute not contemplated by or not falling within the terms of the submission to arbitration, or contains decisions on matters beyond the scope of the submission to arbitration”. 52. Under Article 34 (2) (a) (iv), the court may likewise set aside an award if the composition of the arbitral tribunal or “the arbitral procedure was not in accordance with the agreement of the parties”. 1. Whether the Balance Payment Claim is a dispute arising in the course of performance of the Cooperation Agreement 53. S Co argued that it was not within the jurisdiction of the Tribunal to deal with the Balance Payment Claim because it was not within the scope of the Arbitration Clause; was based on the Letters of Undertaking which are separate from the Cooperation Agreement, and of which B Co is not a party in respect of the Letter of Undertaking issued on 26 March 2002; and it was not due at the time of the issue of Form 2. These arguments were all rejected by the Tribunal. 54. On the question of the scope of the Arbitration Clause, this provides for disputes arising in the course of execution, or performance, of the Cooperation Agreement (“雙方在執行本協議過程中如有爭執”) to be submitted to arbitration. S Co argued that the Tribunal was in error by construing the Arbitration Clause to mean and to cover “disputes arising out of or in connection with the Cooperation Agreement” (“所有因合作協議產生的或者與合作協議有關的爭議”), and in ruling that B Co’s claims for the amount due under the Letters of Undertaking are claims made under or derived from the Cooperation Agreement, so as to be within the scope of the Arbitration Clause. In so doing, the Tribunal rejected the arguments made on behalf of S Co, that the Cooperation Agreement could not be executed or performed for lack of certainty, that S Co had already executed or performed its obligations under clause 3.6 of the Cooperation Agreement by issuing the Letters of Undertaking, such that there was no further performance outstanding, and hence no dispute “in the course of the execution/performance of the Cooperation Agreement” by reason of any amount allegedly outstanding under any Letter of Undertaking. 55. It is S Co’s case that the dispute which was referred to the Tribunal for arbitration is set out in the notice of arbitration constituted by Form 2, and that the pleadings filed thereafter merely identify the issues to be resolved in the referred dispute or disputes. According to S Co, at the time when the arbitral proceedings commenced on the date of Form 2, ie 11 October 2007, there was no dispute in existence for reference to the Tribunal, as the amount claimed by B Co had not fallen due under the 2 relevant Letters of Undertaking. S Co’s case was that the consultancy fees for the Phase 1 Project only became due upon the issue of the Take Over Certificate on 23 September 2009, which was after 11 October 2007. This, S Co claims, is reinforced by the fact that Form 2 made no mention of the 2 Letters of Undertaking. 56. I reject S Co’s argument that B Co’s Balance Payment Claim is not within the scope of the Arbitration Clause, for reference to the Arbitration. 57. The Balance Payment Claim is for the outstanding sum of US$996,846 due under the 2 Letters of Undertaking issued by S Co pursuant to clause 3.6 of the Cooperation Agreement. It represents consultancy fees payable to B Co for services claimed to have rendered under and pursuant to the Cooperation Agreement. 58. Form 2 issued on behalf of B Co, dated 11 October 2007, identifies the dispute as follows: “The Claimant (claims) a sum of US$16,974,000 being the agency and consultancy fees due and owing by the Respondent under the Agreement dated 3 March 2002. The Agreement was for professional services for developing and facilitating the power plant project in Nigeria. The Phase II Power Plant Project contract was signed on 2 May 2002 (“the Phase II Project”). In the course of the Claimant performing its obligations for the Phase II Project under the Agreement, the Respondent in breach of the above Agreement appointed and engaged a F Ltd as consultant in place of the Claimant at the very final stage of the Phase II Project and failed and/or refused to pay to the Claimant the sum of US$16,974,000 being the agency and consultancy fees for the services rendered in the Phase II Project.” 59. It is clear from the above that Form 2 identifies the dispute being referred to the Arbitration, pursuant to the Arbitration Clause, as B Co’s claim for what it alleges to be sums due as “agency and consultancy fees”, and allegedly owing by S Co under the Cooperation Agreement, for services performed by B Co relating to the power plant project in Nigeria, ie the Project. It specifically refers to S Co’s breach of the Cooperation Agreement by its appointment and engagement of F Ltd, in place of B Co, at the final stage of the Phase 2 Project. 60. I reject S Co’s argument that the Balance Payment Claim is for sums due under the Letters of Undertaking, which Letters are separate from and independent of the Cooperation Agreement, and that by the issue of the Letters of Undertaking, S Co had been discharged from further obligations under the Cooperation Agreement in respect of the consultancy fees payable. Since the Letters of Undertaking were not honoured, and the sums due thereunder were not duly paid, I see no basis for S Co to claim that it was discharged from further liability and had been released from performance of its obligations under the Cooperation Agreement, for payment of the consultancy fees it contracted to pay under the Cooperation Agreement. The Letters of Undertaking provided a separate cause of action to B Co against the issuer of the Letters of Undertaking, to enforce the undertaking to pay the consultancy fees. However, in the event of S Co’s default of payment under the Letters of Undertaking, it remained open to B Co to take action under the Cooperation Agreement for recovery of the unpaid consultancy fees. There is nothing in the Cooperation Agreement which provides for the release of S Co’s liability upon the issue of the Letters of Undertaking. 61. The Tribunal rightly found that the mere issue of the Letters of Undertaking could not replace or affect the legal effects of the Cooperation Agreement and S Co’s obligation thereunder to pay consultancy fees. 62. The Balance Payment Claim, representing B Co’s claim for consultancy fees under the Cooperation Agreement, is not admitted by S Co. Hence, there was clearly a dispute which was in existence at the time of the commencement of the Arbitration on 11 October 2007 ( Tommy CP Sze v Li & Fung (Trading) Ltd [2003] 1 HKC 418 ). Whether the Balance Payment Claim is due when an alleged condition precedent for payment is not fulfilled, as S Co claims, by reason of the fact that the Take Over Certificate had not been issued; and whether it is due when B Co was itself in breach of the Cooperation Agreement, all go to the merits of B Co’s claim and S Co’s defence, and these are matters which are exclusively for the Tribunal to decide. 63. A dispute was in existence. Was such a dispute a referable dispute within the scope of the Arbitration Clause? 64. The dispute was over B Co’s entitlement to payment of consultancy fees, and whether S Co was in breach of the Cooperation Agreement. B Co claims that it had rendered consultancy services under the Cooperation Agreement, that it was entitled to the consultancy fees for the performance of the Cooperation Agreement, and that S Co had failed to perform its obligations under the Cooperation Agreement to make payment of the fees due to B Co. All of these are denied. In my view, upon a proper construction of clause 4.4 of the Cooperation Agreement, the dispute over the alleged non-payment of consultancy fees is a dispute which arises “in the course of the parties’ performance, or execution, of the Cooperation Agreement”. 65. I agree with Au, J when he found in Grant Thornton International Limited v JBPB & Co (A Partnership) , unreported, HCCT 13/2002, 5 April 2013 that the phrase “decisions on matters beyond the scope of the submission to arbitration”, as used in Article 34 (2) (iii) of the Model Law, should be narrowly construed, to include only decisions which are clearly unrelated to or not reasonably required for the determination of the subject disputes, matters or issues submitted to arbitration. As Au J pointed out, to construe these words otherwise would likely impede arbitration proceedings and increase costs, encouraging parties to segregate satellite or ancillary issues from an arbitration for separate court determination, and encourage unwarranted, microscopic and truncated challenges to an arbitral award, all of which is contrary to the objectives of the Arbitration Ordinance , to facilitate the fair and speedy resolution of disputes by arbitration without unnecessary expense. 66. In the determination of B Co’s claim for the amount of consultancy fees alleged by it to be due and payable under the Cooperation Agreement in respect of the Project, it is necessary for the Tribunal to decide whether S Co’s liability for the Balance Payment Claim had been discharged by its issue of the Letters of Undertaking, as S Co claims. The Tribunal found that the Letters of Undertaking were derived from the Cooperation Agreement. Whether such finding is right, or wrong as S Co claims, the decision is properly and reasonably related to, and required for, the Tribunal’s determination of the principal question as to S Co’s liability for the consultancy fees claimed to be due and unpaid under the Cooperation Agreement. In my view, the decision on the Balance Payment Claim and what was outstanding under the Letters of Undertaking is within the scope of the Arbitration clause, for the parties’ submission to the Tribunal. 2. Whether the Balance Payment Claim is referred to in Form 2 67. S Co argued that the Balance Payment Claim is not within the scope of the reference to the Tribunal in the Arbitration, as it was not referred to in Form 2. 68. First, I accept that by reference to its claim for “agency and consultancy fees due and owing by (S Co) under the (Cooperation Agreement)”, B Co had adequately included the Balance Payment Claim in the notice of arbitration constituted by Form 2. A claimant is only required to state in Form 2 brief particulars of the nature of the dispute and the claim referred to arbitration. Further and detailed particulars of the claim, the facts in support, the issues and the relief sought can be furnished in the statement of claim (as required under Article 23 of the Model Law). Article 3 of the UNCITRAL Arbitration Rules (1976 Edition) (“ Rules ”) which govern the Arbitration provides that the notice of arbitration should include “the general nature of the claim and an indication of the amount involved”, and the relief or remedies sought. It is not necessary for B Co to set out in Form 2 the details of the Project, its phases, or the detailed breakdown or calculation of the fees claimed to be outstanding. Bearing in mind the essential particulars required to be furnished in Form 2, I consider that it is not necessary for B Co as claimant to make reference to the Letters of Undertaking, particularly since it is B Co’s stance that its claim for fees is made under the Cooperation Agreement, and not the Letters of Undertaking. 69. B Co’s cause of action was the Cooperation Agreement, and its breach by S Co, as alleged by B Co. Such cause of action existed at the time of the commencement of the Arbitration on 11 October 2007. As Mr Wong submitted, any subsequent inclusion of omitted items in the claim, the amendment of the amount claimed and of the formulation of claim, would not affect the jurisdiction of the Tribunal over the same cause of action ( The World Era [1992] 2 Lloyd’s Rep 45, 51). 70. Secondly, despite the present review of S Co’s jurisdictional challenge being de novo, I agree with Mr Wong that it is perfectly open to the court to find that S Co had waived its objection to Form 2. The court considers the jurisdictional challenge afresh, but in so doing, it takes into account (as it is required to do by virtue of Article 4 of the Model Law) the conduct of the parties in the course of the arbitration, for the purpose of deciding whether or not a party has waived its right to object to any non-compliance with the provisions of the Model Law. 71. Article 4 provides: “A party who knows that any provision of this Law from which the parties may derogate or any requirement under the arbitration agreement has not been complied with and yet proceeds with the arbitration without stating his objection to such non-compliance without undue delay or, if a time-limit is provided therefor, within such a period of time, shall be deemed to have waived his right to object.” 72. It was argued on behalf of S Co that Article 4 of the Model Law deals with waiver of procedural irregularities only. S Co’s complaints include the fact that at the time of commencement of the Arbitration, the Balance Payment Claim had not fallen due as the Take Over Certificate had not been issued, and this is not a procedural irregularity which can be waived. 73. In Hebei Import & Export Corp v Polytek Engineering Co Ltd (1999) 2 HKCFAR 111 , the Court of Final Appeal dealt with the situation when enforcement of an arbitral award may be refused where: “… the factual foundation for the public policy ground arises from an alleged non-compliance with the rules governing the arbitration to which the party complaining failed to make a prompt objection, keeping the point up its sleeve, at least when the irregularity might be cured.” 74. In his judgment, Sir Anthony Mason observed : “… a failure to raise the public policy ground in proceedings to set aside an award cannot operate to preclude a party from resisting on that ground the enforcement of the award in the enforcing court in another jurisdiction. That is because each jurisdiction has its own public policy. What I have said does not exclude the possibility that a party may be precluded by his failure to raise a point before the court of supervisory jurisdiction from raising that point before the court of enforcement. Failure to raise such a point may amount to an estoppel or a want of bona fides such as to justify the court of enforcement in enforcing an award …” (Emphasis added) 75. Sir Anthony Mason NPJ explained in his judgment that if a respondent continued to participate in an arbitration, instead of raising any alleged irregularity or non-compliance, the respondent precluded an ascertainment in the arbitration of the alleged breach of process or irregularity, and made it impossible for action to be taken by the tribunal to remedy the situation. At page 138F of the report of the judgment, Sir Anthony Mason explained: “Whether one describes the respondent’s conduct as giving rise to an estoppel, a breach of the bona fide principle or simply as a breach of the principle that a matter of non-compliance with the governing rules shall be raised promptly in the arbitration is beside the point in this case. On any one of these bases, the respondent’s conduct in failing to raise in the arbitration its objection… was such as to justify the court of enforcement in enforcing the Award.” 76. What is clear from Hebei Import & Export Corp v Polytek Engineering Co and from Gao Haiyan v Keeneye Holdings Limited [2012] 1 HKLRD 627 is that a party to an arbitration should act promptly, if it alleges that there had been non-compliance with the rules governing an arbitration, or breach of some rule of law governing the arbitration, or breach of the rules of natural justice such as the requirement for the determination of the dispute by an impartial and independent tribunal. If any such objection is not raised promptly, so as to enable the alleged irregularity, breach or non-compliance to be considered and dealt with by the tribunal and cured, if possible, the party would be estopped from raising and relying upon such objection at a later stage, when it seeks to set aside or refuse enforcement of the award. The emphasis is on openness, fair dealing, and good faith, not keeping up one’s sleeve a point or matter which a party either knew or could have discovered with reasonable diligence, if the point or matter could have been rectified, or dealt with by the Tribunal (and the party against whom the complaint was made), to enable the arbitration to continue and to proceed in accordance with the parties’ initial agreement to refer their dispute to the tribunal for a speedy and fair determination. 77. In the present case, S Co did not in the Notice of Challenge raise any objection to Form 2 for its omission of the Balance Payment Claim. The challenge made by S Co to the jurisdiction of the Tribunal was only in respect of B Co not being a party to the S III Contract, and in respect of the Letters of Undertaking being the basis of B Co’s cause of action and the absence of an arbitration clause in the Letters of Undertaking. In these circumstances, the Tribunal rightly ruled in the Award that S Co’s objection to the scope of Form 2 had been waived, pointing out that if the objection had been raised before closing submissions by S Co’s counsel in the Arbitration, the Tribunal could have allowed B Co to amend its notice of arbitration, or to make a separate reference to arbitration for consolidation with the Arbitration before the Tribunal. 78. B Co had included the Balance Payment Claim in its Points of Claim filed in the Arbitration (paragraph 10 (e) and paragraph (3) of the prayer for relief). In its Defence, S Co did not dispute the claim on the basis that it was not included in Form 2. It participated in the Arbitration and fully argued, before the Tribunal, its challenge on jurisdiction in respect of the Balance Payment Claim, as well as its defence to B Co’s claims. I agree that S Co cannot rely now on the omission of the Balance Payment Claim from Form 2, and the effect that may have on the Arbitration, for the purpose of setting aside the Award under Article 34. 3. The Letters of Undertaking did not contain an arbitration clause; and 4. B Co is not privy to the Letters of Undertaking 79. Since I find that B Co’s Balance Payment Claim is made, not under the Letters of Undertaking, but under and by virtue of the Cooperation Agreement, and that the dispute in relation to the Balance Payment Claim arose in the course of the performance or execution of the Cooperation Agreement to be within the scope of the Arbitration Clause, the arguments that the Letters of Undertaking did not contain an arbitration clause, and that B Co is not a party to the Letters of Undertaking, do not assist S Co. Whether the Tribunal had jurisdiction to award unliquidated damages in respect of the S III Contract Claim 80. In relation to the S III Contract Claim, S Co argued that the US$7,537,500 awarded to B Co represents unliquidated damages not claimed in Form 2, and that in making such an award, the Tribunal had acted in excess of its jurisdiction, that it had no evidential basis to do so, and that it had not given reasons for making the award. 1. Whether B Co’s claim was for liquidated sum or unliquidated damages 81. I do not accept that B Co’s claim, as made in Form 2, is one for liquidated damages as S Co alleges. The sum of US$16,974,000 stated in Form 2 is referred to as “the agency and consultancy fees due and owing by (S Co) under the (Cooperation Agreement)”. Form 2 further sets out the breach of the Cooperation Agreement complained of by B Co, namely, S Co’s appointment and engagement of F Ltd as consultant in place of B Co at the final stage of the Phase 2 Project, and its refusal to pay the agency and consultancy fees of US$16,974,000 in respect of the services S Co rendered in the Phase 2 Project. The claim is clearly one for damages for breach of contract. Such damages are unliquidated in nature, to be proved to the satisfaction of the court or tribunal concerned. 82. A claim for liquidated damages is for enforcement of a specific term of the contract, whereby the parties agreed to fix the amount payable upon the occurrence of specific breaches ( Chitty on Contracts , Vol 1 31 st Edition, paras 26- 07, 26- 08; Hong Kong Civil Procedure 2014 Vol 1 para6/1/4; Bright Islands Corp v Chao [2002] 2 HKLRD 97 , at 103E-J, 111F-G). It was never B Co’s claim that the sum of US$16,974,000, which was the consultancy fee in respect of the Revised Phase 2 Project (assessed on the basis of 22.5 /kW x 754.4 MW), whether by itself or in conjunction with the amount of US$575,750 for site preparation work (assessed on the basis of 5% of the contract price), making the total sum of US$17,547,750, was part of any agreement reached between B Co and S Co as the fixed or determined amount payable upon the occurrence of a breach of agreement, or as the specific consultancy fee agreed in respect of the Revised Phase 2 Project. 83. Upon an analysis of the Amended Points of Claim, it can be seen that B Co had pleaded S Co’s obligations under the specific provisions of the Cooperation Agreement to pay consultancy fees, and the payment conditions; the performance of the Cooperation Agreement; the breach complained of on the part of S Co; B Co’s acceptance of S Co’s repudiatory breach; and in paragraph 19, B Co’s loss and damage suffered as a result. Particulars of the damage were said to be their loss of the consultancy fee of US$17,547,750, and loss of interest, with the manner of computation of such figure set out. That was amplified in the submissions made on behalf of B Co in the course of the Arbitration. 84. Submissions had been duly made on behalf of S Co in the Arbitration, as to the meaning and effect of clauses 3.3 and 3.5 of the Cooperation Agreement, in the context of how the fees payable to B Co were to be fixed, or agreed. After hearing submissions, the Tribunal ruled and proceeded on the basis that B Co’s claim was one for damages (paragraphs 223 and 226 of the Award), and not for a “debt”. It further concluded (in paragraph 222 of the Award) that S Co was in breach of clauses 4.1 and 4.2 of the Cooperation Agreement, in depriving B Co of the opportunity to represent S Co in completing negotiations for the Revised Phase 2 Project, and that B Co had suffered damages as a result. These are matters which go to the merits of the Tribunal’s decision and the Award, but I am satisfied that the Tribunal had jurisdiction to deal with B Co’s claim in the Arbitration for damages, which claim had been included in the reference to arbitration by Form 2. 85. Further, I consider that since S Co had fully argued in the Arbitration the matter of whether B Co was entitled to the sum of US$17,547,750 as unliquidated damages, it is not open to S Co at this stage to claim that the unliquidated damages claim was not included in Form 2, and hence outside the jurisdiction of the Tribunal. Such ground was not stated in the Notice of Challenge filed by S Co in the Arbitration. The reasons summarized in paragraphs 76 to 78 are applicable. 2. Whether the Tribunal awarded unliquidated damages without evidential basis and without reasoning 86. I have found that it was within the jurisdiction of the Tribunal to consider and decide B Co’s claim for damages alleged to have been sustained as a result of S Co’s breach of the Cooperation Agreement. The measure and assessment of damages is a matter clearly related to and required for the Tribunal’s determination of the dispute referred to it in the Arbitration ( Grant Thornton International Limited v JBPB & Co (A Partnership) , unreported, HCCT 13/2002, 5 April 2013). Proceeding further to consider the question of whether there was evidence to support the Tribunal’s Award on, and assessment of, damages is to review the merits of its award. 87. Ms Cheng argued that the Tribunal had exceeded its jurisdiction in awarding damages in the sum of US$7,537,500 to B Co on the basis of the Tribunal’s assessment of the value of the work rendered by B Co, when there was no evidence to support such an award. It was further argued that the Tribunal gave no proper or adequate reasons to justify the award, and as such, the Award should be set aside for breach of the parties’ agreement under Article 34 (2) (a) (iv) ( UNCITRAL 2012 Digest of Case Law on the Model Law on International Commercial Arbitration pp 155-158), and for breach of public policy ( Smart Systems Technology Inc v Domotique Secant Inc 2008 QCCA 444). 88. There is no basis for such contention. The Tribunal had set out on pages 229 to 233 of its Award the reasoning of and basis for its award of damages. The Tribunal found (paragraph 207 of the Award) that the S III Contract was derived from the Revised Phase 2 Project, which was in turn derived from the Phase 2 Project; that proposals had been discussed and put forward to the employer to compensate B Co for the fact that the Phase 2 Contract could not be completed; that the opportunity for the S III Contract had been obtained with B Co’s assistance; that S Co was in breach of clauses 4.1 and 4.2 of the Cooperation Agreement in procuring the appointment of F Ltd to replace B Co; and that the fee of US$7,537,500 payable to B Co under the Phase 2 Contract could be used as the basis for the computation of the damages sustained by B Co as a result of S Co’s breach. 89. The Tribunal is not bound by the parties’ submissions on quantum of damages. The fact that the Tribunal awarded damages for breach of contract on a basis other than that advocated by B Co is not a ground to set aside an award under Article 34 ( Brunswick Bowling & Billiards Corp v Shanghai Zhonglu Industrial Co Ltd [2011] 1 HKLRD 707 ). Nor can it be a ground to complain that the Tribunal had strayed beyond the scope of its jurisdiction and the parties’ submission to the Arbitration. The Tribunal had not referred to any new evidence, or any fact not known or disclosed to the parties. All the material facts in support of B Co’s claim of S Co’s alleged breach and its claim for damages had been pleaded. S Co had adequate notice of B Co’s contention of what it claims to be the damages payable, and submissions had been made by counsel for both parties in the course of the Arbitration on S Co’s liability, and on the damages payable. I reject the argument that S Co had been unable to present its case on its liability for damages, or the quantum of damages payable on the available evidence before the Tribunal. 90. As for S Co’s attack on the Tribunal’s failure to give reasons for its findings and Award, reading the Award and its context, I reject the complaint. The Tribunal had referred to the evidence in its analysis of B Co’s claim and S Co’s case, and explained its findings and its award of damages (paragraphs 207 to 227 of the Award). In R v F (arbitration: reasons) [2012] 5 HKLRD 278 , the court held that an arbitral award must be read and understood in its proper context, in particular against the context as to how the relevant issues were argued before the tribunal. Like a judgment of the court, it is not intended and should not be read as if it were a transcript of the proceedings before it. So long as the reasoning is expressed in an award to enable the parties to the award to understand how and why a conclusion is reached on a particular issue, the reasons for the award do not have to be elaborate. There is no need to give reasons to deal with each and every argument presented. It is sufficient if the award explains the basis on which a material finding was made ( Welltus Ltd v Fornton Knitting Co Ltd [2013] 5 HKC 106 , at 113A- 115A). Whether the Tribunal had exceeded its jurisdiction by finding S Co to be in breach of clauses 4.1 and 4.2 of the Cooperation Agreement 91. The substance of S Co’s complaint is that the Tribunal found S Co to be liable on an unpleaded case that S Co had breached clauses 4.1 and/or 4.2 (“ Non-exclusion Clauses ”) of the Cooperation Agreement, and that S Co had authorized Messrs X, Y and Z to act on behalf of S Co and S III jointly and severally, in relation to the S III Contract (“ Authority Issue ”). 92. On behalf of S Co, it was argued that the Authority Issue was never pleaded, and had never been raised by B Co in argument in the Arbitration, such that the Tribunal’s finding on the Authority Issue and its consequent finding that S Co was in breach of the Non-exclusion Clauses, were made in excess of its jurisdiction. 93. I agree with Mr Wong that these pleading points have little merit in a challenge under Article 34. 94. A claimant is only required to set out in Form 2 brief particulars of the general nature of the dispute and of the claim referred to arbitration, an indication of the amount involved, and the relief or remedies sought. Form 2 filed by B Co in the Arbitration referred to B Co’s claim for the agency and consultancy fees due under the Cooperation Agreement, and to S Co’s breach by its appointment and engagement of F Ltd as consultant in place of B Co at the final stage of the Phase 2 Project. It is not necessary for B Co to make specific reference in Form 2 to the Non-exclusion Clauses, or any other clause in the Cooperation Agreement alleged to have been breached. 95. Ms Cheng herself acknowledged that the Points of Claim and the Defence filed in the Arbitration serve only to identify the issues for determination by the Tribunal. As Mr Wong highlighted, strict rules of pleadings and procedures are not insisted upon for arbitration proceedings ( Unistress Building Construction Limited v Humphreys Estate (Forrestdale) Limited [1992] 2 HKLR 145 , Mustill & Boyd , pp 15, 18 and 19). Narrow and technical construction of the claims made in the pleadings filed in an arbitration should be discouraged, in order to give effect to the intention of the parties to use arbitration as the more informal manner of dispute resolution, as opposed to litigation in the courts. Moreover, even for pleadings filed in court proceedings, it is sufficient for a party to plead the material facts relied upon, and not the legal consequences. As Lam JA (as he then was) observed in Luck Continent Limited v Cheng Chee Tock Theodore and Others [2013] 4 HKLRD 181 in the context of a complaint on the pleadings filed in a petition for unfair prejudice: “… These authorities did not decide that all allegations in the petition must contain the precise legal formulation or characterisation of the forensic analysis relied upon. Once the factual allegations are pleaded and established, it is a question of law whether they are sufficient to support a case for relief under s 168A.” 96. The passages in PT Prima International Development v Kempinski Hotels SA [2012] 4 SLR 98 and London and North Western and Great Western joint Railway Companies v JH Billington, Limited [1899] AC 79 at 81, relied upon by Ms Cheng, only illustrate that a party cannot introduce “a new difference”, or a “new dispute” which was not within the scope of the original submission to arbitration, and that each party should be given the opportunity of responding to the points made by the other. I do not agree that the breach of the Non-exclusion Clauses, the claim for liquidated damages, and the Authority Issue were new disputes or differences which had not been included in the submission to the Arbitration by Form 2. 97. I am satisfied that S Co and B Co were fully appraised of the nature and issues of the dispute in the Arbitration, and had the full opportunity to ventilate before the Tribunal their arguments and submissions on these issues. B Co adequately pleaded in the Points of Claim: the Cooperation Agreement, the performance by B Co, the events leading to the Revised Phase 2 Project culminating in the award of the S III Contract to S Co or its nominee, the fact that B Co would have successfully performed its contractual obligations under the Cooperation Agreement but for S Co’s obstruction in respect of the Revised Phase 2 Project, the alleged breach by S Co’s appointment of F Ltd and its refusal to pay consultancy fees to B Co despite the signing of the S III Contract, and its alleged damages as a result. The material facts relied upon had been pleaded. As Mr Wong pointed out, S Co had not labored under any misconception with regard to B Co’s case in the Arbitration. Breach of the Non-exclusion Clauses had been referred to in the course of the hearing of the Arbitration, and submissions and arguments had been made by both parties on the effect and alleged breaches of the Non-exclusion Clauses. 98. In relation to the Authority Point, B Co pleaded that S III was specifically nominated by S Co and/or the affiliated and/or subsidiary company of S Co in respect of the Revised Phase 2 Project. In the Reply and Defence to Counterclaim, B Co pleaded that Y had signed correspondence with the Nigerian authorities as S III’s manager, and that B Co had liaised with S Co through S Co’s staff and through personnel of S III. It also pleaded that S Co had made requests to B Co to assist in enabling S III to sign the S III Contract. Full arguments had been made to on behalf of S Co in the Arbitration on the relationship between S Co and S III. Again, the material facts on the relationship between S Co and S III, in support of B Co’s claim that the S III Contract was entered into by S Co or on its behalf, had been adequately pleaded, and it was open to the Tribunal to come to its conclusions on the facts and on law, without further reference to the parties for submissions on any new case, issue, or evidence. Needless to say, the merits of the Tribunal’s findings on the substance of the dispute are outside the scope of review by the court. Whether the S III Contract was a dispute referred to the Arbitration 99. S Co argued that Form 2 made no reference to the S III Contract, and the Tribunal accordingly lacked jurisdiction over the S III Contract. 100. The claims made by B Co in the Arbitration, as identified in Form 2, were for damages sustained as a result of S Co’s alleged breach of the Cooperation Agreement. It was B Co’s case that S III was nominated by S Co, and/or the affiliated company and/or the subsidiary company of S Co, in entering into the S III Contract. Its claims for damages and for the fees it claims to be payable were directed against S Co, and not S III, pursuant to the Cooperation Agreement. B Co’s case is that the S III Contract derived from the original Phase 2 Contract for the Phase 2 Project, and that S III was merely the nominee of S Co. This was the substance and gist of the dispute between B Co and S Co in the Arbitration. The relationship between S Co and S III was fully ventilated, and submissions duly made, at the Arbitration hearing. 101. In determining B Co’s claims made against S Co for alleged breach of the Cooperation Agreement, which was the very dispute referred to the Tribunal in the Arbitration, it was necessary for the Tribunal to rule on the relationship between S Co and S III, the relationship between the Phase 2 Project and the Revised Phase 2 Project, and whether the S III Contract was entered into by S III as nominee or on behalf of S Co. This was what the Tribunal proceeded to do, and after hearing full submissions and considering all the evidence, the Tribunal found that S Co had, by conduct, authorized its personnel (X, Y and Z) to act in the name of S Co and S III jointly and individually, and that S Co had the authority to and did procure S III to enter into the S III Contract. Such findings are reasonably required for the determination of the dispute on the Cooperation Agreement which was referred to the Arbitration, and cannot be said to be unrelated to the matters or issues submitted to the Tribunal. Whether the Tribunal had jurisdiction to make an award against S III 102. This point is related to the last issue. For the reasons set out in the preceding 2 paragraphs, it was necessary for the Tribunal to decide on the relationship between S Co and S III, and the finding made by the Tribunal was that S Co was in breach of the Cooperation Agreement in procuring or nominating S III to enter into the S III Contract, and preventing B Co from obtaining payment of its consultancy fees. The Interim and Costs Awards were made against S Co, and not S III, for payment of damages to B Co, by reason of S Co’s breach of the Cooperation Agreement. Whether S Co was unable to present its case 103. I totally reject the argument that S Co had in any way been unable to present its case to the Tribunal: whether on B Co’s claim for damages, or on the case of breach of the Non-exclusion Clause, or on the Authority Issue, all of which had been known to S Co in the course of the Arbitration, and fully argued by its counsel. I fail to see how it can be said that S Co had been surprised, or prejudiced, by any new issue or claim made against it in the Arbitration. Whether the Tribunal had referred to any new authorities 104. S Co complains that in dismissing its jurisdictional challenge, the Tribunal had referred to authorities not cited by the parties, without giving the parties any opportunity to make submissions on the authorities. These authorities (“ Materials ”) are: (1) Report of the S-G on the Preliminary Draft Set of Arbitration Rules; and (2) Baker Davis, The Uncitral Arbitration Rules in Practice (1992) p 85. 105. S Co further claims that the Materials are not applicable to the Arbitration. 106. The Materials were referred to by the Tribunal in the Award, when it ruled that Form 2 served to inform a respondent of the commencement of the arbitration proceedings, and not to give particulars of the claim, and further, to distinguish an arbitration notice from a statement of claim. They are not matters of evidence, nor do they form part of the facts of the dispute. There is nothing “secret” about the Materials. The Tribunal’s reference to the Materials is totally distinguishable from the facts of Brunswick, Paklito Investment Ltd v Klockner East Asia Ltd and Hebei Import & Export Corp v Polytek Engineering Co Ltd, where the references were made to expert reports and/or other forms of primary evidence. 107. As Mr Wong highlighted, the comment made in the Materials is also made in the Commentary, also referred to by the Tribunal. The Commentary is one of the documents specified in the Sixth Schedule to Cap 341 , to which regard may be had in interpreting and applying the provisions of the Model Law, by the express provisions of section 2 (3) of Cap 341 . The Tribunal would have reached the same conclusion with regard to the scope of the Arbitration, by reference to the Commentary. 108. In Grand Pacific Holdings Limited v Pacific China Holdings Limited (In liq) (No 1) [2012] 4 HKLRD 1 (CA), the Court of Appeal made it clear: “The conduct complained of must be serious, even egregious, before a court could find that a party ‘was otherwise unable to present his case’. … An error would only be sufficiently serious if it has undermined due process… Even so, the Court may refuse to set aside the award if the court is satisfied that the arbitral tribunal could not have reached a different conclusion. How a court may exercise its discretion in any particular case will depend on the view it takes of the seriousness of the breach. Some breaches may be so egregious that an award would be set aside although the result could not be different.” 109. I have no doubt in my mind that the Tribunal’s reference to the Materials comes nowhere near being an irregularity in the procedure which is serious, let alone being egregious. Discretion 110. Even if a valid ground to set aside under Article 34 is proved, the court has a residual discretion to uphold an award. The court will take into consideration the conduct of the parties, the seriousness of the irregularity or defect complained of, and whether injustice has resulted. Bearing in mind the nature of the alleged irregularities complained of by S Co in this case, and the fact that full arguments had been made by the parties in the Arbitration on the issues and evidence raised, I would not have exercised my discretion to set aside the Interim and Costs Awards. Whether the Interim Award and Costs Award are in conflict with the public policy of Hong Kong 111. It is on the basis of S Co being unable to present its case, by virtue of its having been deprived of the opportunity to respond to the Materials, and on issues which S Co claims fell outside the scope of the reference to the Arbitration, that the public policy ground under Article 34 (2) (b) (ii) is invoked. S Co also relies on the fact that the Tribunal had failed to give reasons for its Award. 112. I reject the argument that S Co had been unable to present its case. I also reject the arguments that the Tribunal had decided matters which in any way fall outside the terms of the submission, and that the Award was unreasoned. Hence, there is no basis whatsoever to find that it is in any way “contrary to the fundamental conceptions of reality and justice of the forum” to enforce the Interim and Costs Awards in Hong Kong. 113. The courts have emphasised that a narrow approach is adopted in the construction of what constitutes “public policy” as a ground to set aside or refuse enforcement of an award. It “must not be seen as a catch-all provision to be used wherever convenient. It is limited in scope and is to be sparingly applied” ( Qinhuangdao Tongda Enterprise Development [1993] 1 HKLR 173 , 178). The term has been held by the Court of Final Appeal in Hebei Import & Export Corp v Polytek Engineering Co Ltd (1999) 2 HKCFAR 111 , 139F to mean “contrary to the fundamental conceptions of morality and justice” of the forum. In A v R (Arbitration: Enforcement ) [2009] 3 HKLRD 389 , at paragraph 23 of his judgment, Reye J observed: “If the public policy ground is to be raised, there must be something more, that is, a substantial injustice arising out of an award which is so shocking to the court’s conscience as to render enforcement repugnant.” The Award comes nowhere near the standards required by the court for setting aside on the ground of public policy. Conclusion 114. For all the above reasons, I dismiss the Article 34 OS, with a costs order nisi that S Co is to pay to B Co the costs of the application on an indemnity basis ( A v R (Arbitration: Enforcement) [2009] 3 HKLRD 389 ), with certificate for 2 counsel. 115. The costs order nisi for the dismissal of the Article 16 OS is that they are to be paid by S Co on an indemnity basis, as provided for in paragraph 49 above, with certificate for 2 counsel. 116. Finally, I thank counsel for their detailed submissions and their invaluable assistance. (Mimmie Chan) Judge of the Court of First Instance High Court Ms Teresa Cheng SC leading Mr Adrian Lai, instructed by CC Partners, for the plaintiff (under consolidated proceedings) Mr Wong Yan Lung SC leading Mr KM Chong and Mr Aidan Tam, instructed by Christine M Koo & Ip, for the defendant (under consolidated proceedings) Look up this case on Lawcite Noteup",
  "length": 93655,
  "headers_seen": [
    "Introduction",
    "Background",
    "The jurisdiction challenge",
    "The standard of review for jurisdiction challenge",
    "Mode of determination of the challenge",
    "Is the Balance Payment Claim within the jurisdiction of the Tribunal under Article 34?",
    "1. Whether the Balance Payment Claim is a dispute arising in the course of performance of the Cooperation Agreement",
    "2. Whether the Balance Payment Claim is referred to in Form 2"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2014/1436",
  "query": "Model Law",
  "ts": "2025-10-16T10:53:12",
  "ok": true
}