{
  "title": "HYALROUTE COMMUNICATION GROUP LTD V. INDUSTRIAL AND COMMERCIAL BANK OF CHINA (ASIA) LTD | [2025] HKCFI 2417 | HKLII",
  "court": null,
  "year": 2025,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2025] HKCFI 2417 HYALROUTE COMMUNICATION GROUP LTD V. INDUSTRIAL AND COMMERCIAL BANK OF CHINA (ASIA) LTD Judgment Information Date 31 Jul, 2025 Action No. HCCT155/2024 Neutral Cit. [2025] HKCFI 2417 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCCT155/2024 html PUBLIC \"-//W3C//DTD XHTML 1.0 Transitional//EN\" \"http://www.w3.org/TR/html4/loose.dtd\" HCCT155/2024 HYALROUTE COMMUNICATION GROUP LTD v. INDUSTRIAL AND COMMERCIAL BANK OF CHINA (ASIA) LTD HCCT 155/2024 [2025] HKCFI 2417 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO 155 OF 2024 ____________________ IN THE MATTER of Section 45 of the Arbitration Ordinance ( Cap 609 ) and IN THE MATTER of Section 21L of the High Court Ordinance ( Cap 4 ) and IN THE MATTER of Orders 29 & 73 of the Rules of the High Court ( Cap 4A ) and Inherent Jurisdiction ____________________ BETWEEN HYALROUTE COMMUNICATION GROUP LIMITED Plaintiff and INDUSTRIAL AND COMMERCIAL BANK OF Defendant ____________________ Before: Mr Recorder William Wong SC in Chambers (Not open to Public) Date of Hearing: 24 March 2025 Date of the Plaintiff’s Written Submission: 22 April 2025 Date of the Defendant’s Written Submission: 7 April 2025 Date of Decision: 1 August 2025 ____________________ DECISION ____________________ INTRODUCTION 1. This is an interesting and novel application. 2. The Plaintiff, a company incorporated in the Cayman Islands, by an originating summons (the “OS”) and a summons (the “Summons”) both dated 16 December 2024, applies to the Hong Kong Courts, for an anti-suit injunction to restrain the Defendant, a creditor, from presenting any winding-up petition against it in the Cayman Islands, on the grounds that the matter concerns disputes arising out of or in connection with the Term Facility Agreement dated 27 July 2018 (the “TFA”) which has an arbitration clause which mandates the parties to resolve such disputes by way of arbitration in the Hong Kong International Arbitration Centre (the “HKIAC”). 3. On 27 November 2024, the Defendant served a statutory demand (the “Statutory Demand”) on the Plaintiff. In the Statutory Demand, the Defendant claims that the Plaintiff owes the Defendant a debt of US$95,506,631.05 (the “Debt”) comprising two parts: (1) US$93,417,803.73 owed by the Plaintiff to the Defendant in respect of the TFA, and (2) US$2,088,827.32 owed by the Plaintiff to the Defendant in respect of an interest rate swap arrangement (“IRS Arrangement”). 4. The present proceedings arise against the context of the divergence between Re Guy Lam (2023) 26 HKCFAR 119 (in the CFA) ( Guy Lam CFA ) and Sian Participation Corp v Halimeda International [2024] UKPC 16 (in the Privy Council). While under Hong Kong law winding-up proceedings will be stayed in favour of arbitration unless there is abuse; English law now requires the debtor to show the usual bona fide dispute on substantial grounds to justify the creditor going through arbitration. 5. As a result of such divergence in legal approach, instead of applying to stay an intended winding-up proceedings in the Cayman Islands, the Plaintiff, a Cayman incorporated company opts to apply to this Court for an anti-suit injunction. These proceedings appear to be first case where the Hong Kong Court has to consider the circumstances in which it should restrain winding-up proceedings in a similar common law jurisdiction which may have gone down a different road on how to deal with winding-up proceedings in favour of arbitration. THE PLAINTIFF’S CASE 6. The Plaintiff’s case is that the Defendant has served a Cayman statutory demand against the Plaintiff in respect of, inter alia , sums allegedly due under the TFA which expressly provides for arbitration in Hong Kong: Clause 43.1 contains a broad arbitration agreement in favour of HKIAC, covering “ [a]ny dispute, controversy or claim arising in any way out of or in connection with ” the TFA (the “Arbitration Agreement”). 7. The Arbitration Agreement is valid and binding. The Plaintiff denies liability to pay the Defendant the alleged sums under the TFA. The dispute plainly falls within the ambit of the Arbitration Agreement – a point beyond serious argument. As such, the anti-suit injunction should be granted unless the Defendant can demonstrate strong reasons to the contrary (e.g. delay or other unconscionable behaviour). None have been seriously suggested in the Defendant’s evidence. 8. The courts have repeatedly held that, in an application for an anti-suit injunction on the basis of an arbitration agreement:- (1) It is irrelevant where the underlying merits of the dispute lie. (2) A foreign court’s approach including whether it would give effect to the arbitration agreement or grant a stay of the foreign proceedings is also irrelevant. 9. If the Defendant wishes to enforce the TFA through legal process, the proper procedure is to commence arbitration against the Plaintiff in Hong Kong. Indeed, given that the Defendant is a Hong Kong bank, this should pose no difficulty at all. 10. Instead, the Defendant is wrongfully attempting to circumvent the contractually agreed dispute resolution mechanism by diverting the case away from Hong Kong and into the Cayman court. Such actions undermine the parties’ contractual bargain and the integrity of the Hong Kong’s pro-arbitration framework. Plainly, an anti-suit injunction is warranted in the circumstances. The Court should exercise caution to avoid setting any such precedent that could inadvertently encourage parties to bypass Hong Kong’s arbitration regime in favour of foreign jurisdictions. 11. In essence, the Plaintiff’s case is that the Defendant would be acting in breach of the arbitration agreement between them by presenting a winding-up petition in the Cayman Islands. THE DEFENDANT’S CASE 12. The Defendant submits that the fundamental flaw in the Plaintiff’s case is that, on proper analysis, the Defendant will not be acting in breach of the arbitration agreement. There are three reasons. (1) One must start with the terms of the arbitration agreement. Whether there is any breach depends on the terms. The Plaintiff says there is a divergence between the Guy Lam and the Sian Participation lines of cases. A careful reading of the cases shows that it was the differences in the terms of the arbitration agreements which informed the Courts’ different approaches. In this case, the terms do not cover winding-up proceedings. There can be no breach. (2) In any case, presentation of a winding-up petition by itself is not a breach of the arbitration agreement. It would be wrong in principle to restrain the Defendant from doing an act when the act does not breach the agreement. This is all the more so since the injunction would prejudice a range of matters such as unfair preference and fraudulent conveyance. (3) Further, any eventual winding-up order by the Cayman Court will not, as a matter of Cayman law, have the effect of determining the parties’ rights and obligations. Thus, even the winding-up proceedings would not breach the parties’ arbitration agreement. 13. Without a breach, the Plaintiff’s application cannot even get off the ground. 14. Moreover, there are strong reasons for not granting an anti-suit injunction: (1) The effect of such an anti-suit injunction would be to shut out the Plaintiff’s “home court” from exercising its discretion under its public policy considerations, in accordance with the laws which the Plaintiff has voluntarily chosen to generally govern it. Hong Kong Courts should be very slow to do this to another Court. (2) In any event, under Guy Lam , the merits of the debtor’s defence remain relevant to the Bankruptcy/Companies Court’s exercise of discretion. The same, as a minimum, must also apply to the Court’s exercise of discretion on whether to grant an anti-suit injunction. In the present case, as the facts amply show, the Plaintiff’s defence is hopeless and frivolous. FACTUAL AND PROCEDURAL BACKGROUND 15. The underlying dispute may be summarized as follows:- (1) Myanmar Fiber Optic Communication Network Company Limited (“MFOCN”) is a fibre optic communications company in Myanmar and a subsidiary of the Plaintiff. (2) On or around 27 July 2018, MFOCN and another of the Plaintiff’s subsidiaries (“GTIHG”) entered into the TFA as borrowers, with the Defendant as lender and the Plaintiff as guarantor. (3) On or about 7 August 2018, MFOCN issued a request to draw down a loan of US$100 million under the TFA (“Term Loan”). Thus, MFOCN (but not GTIHG) became liable to repay the Term Loan, which was guaranteed by the Plaintiff. (4) The original repayment schedule was set out in Schedule 8 of the TFA, but was later varied by agreement (“Revised Payment Schedule”). (5) On 1 February 2021, a military coup d’état took place in Myanmar (“Military Coup”). This led to, inter alia :- (1) Over 70% of Myanmar being designated as armed conflict zones, causing extensive damage to MFOCN’s fibre optic infrastructure. (2) Severe currency controls, requiring MFOCN to (i) hold all funds in Myanmar Kyats and seek government approval to convert them into US dollars and/or (ii) obtain special permission to repay foreign-incorporated lenders. (6) As a result, MFOCN suffered:- (1) Significant damage to its assets and loss of revenue; and (2) Severe financial restrictions, making it impossible to comply with the Revised Payment Schedule from August 2021 onwards. (7) The Defendant was fully cognizant of the political and commercial risks of investing in Myanmar. In recognition of these risks, on or around 28 June 2018, the Defendant entered into an insurance contract (the “MIGA Insurance Contract”) with the Multilateral Investment Guarantee Agency (“MIGA”), a constituent organization of the World Bank. (8) While the Defendant was the named beneficiary under the MIGA Insurance Contract, the premiums were ultimately borne by the Plaintiff, MFOCN and/or GTIHG. (9) The MIGA Insurance Contract provided coverage for various specified risks (the “Covered Risks”), including:- (1) War and civil disturbance; and (2) Restrictions on transfer of currency. (10) The TFA provided that if the Plaintiff made an application to the Defendant in relation to a Covered Risk (a “Covered Risk Application”), its obligations as guarantor would be suspended in relation to any default caused by the relevant Covered Risk. This suspension would only cease if, among other things, (i) the Defendant rejected the Plaintiff’s Covered Risk Application, or (ii) MIGA determined that it was not liable to compensate the Defendant. (11) The Plaintiff’s position is that it made a Covered Risk Application to the Defendant as early as 11 February 2021 (i.e. 10 days after the Military Coup began), when it held a conference with the Defendant and MIGA during which:- (1) The Plaintiff, the Defendant and MIGA discussed the compensation claim under the MIGA Insurance Contract; and (2) MIGA provided guidance to the Plaintiff on, inter alia , the contents of the reports to be submitted to MIGA to facilitate such a claim. (12) It is undisputed that the Defendant proceeded to make several claims under the MIGA Insurance Contract. (13) It is said that accordingly, the Plaintiff’s obligations as guarantor under the TFA remain suspended and the Plaintiff is not liable to repay the Term Loan to the Defendant. 16. Despite this, on 22 November 2024, the Defendant served the Statutory Demand against the Plaintiff pursuant to section 93 of the Cayman Companies Act. Clearly, this was done in anticipation of commencing proceedings against the Plaintiff in the Cayman Court. 17. On 27 November 2024, the Defendant served the Statutory Demand on the Plaintiff’s registered agent, Vistra (Cayman) Limited (“Vistra”). However, due to Vistra’s slow and uncooperative response, the Plaintiff only became aware of the Statutory Demand on 10 December 2024, following which the Plaintiff immediately sought legal advice. 18. On 16 December 2024, the Plaintiff sought to bring the case back to Hong Kong where the parties had agreed to resolve it. To this end, the Plaintiff issued the OS for an anti-suit injunction and the Summons for interim relief. 19. On 19 December 2024, the matter was heard before this Court (“December Hearing”). Upon the Defendant giving an undertaking in substantially the same terms as the anti-suit injunction sought, the matter was adjourned for filing of further evidence and substantive hearing. 20. Following the December Hearing, on 30 December 2024, the Plaintiff commenced arbitration against the Defendant under HKIAC Case No. HKIAC/A24334 (“Arbitration”) by filing a Notice of Arbitration. 21. On 3 February 2025, the Defendant filed its Answer to the Notice of Arbitration. 22. On 6 February 2025, HKIAC invited the parties to comment on the constitution of the arbitral tribunal, enclosing inter alia the Defendant’s proposed arbitrator’s disclosure as to their availability, impartiality, and independence. 23. On 10 March 2025, HKIAC confirmed the appointment of the Defendant’s nominated arbitrator. HKIAC is now in the process of appointing the third and presiding arbitrator. LEGAL PRINCIPLES 24. The Plaintiff relies on the following general principles. First, it is trite that an anti-suit injunction operates in personam and “is directed only to the defendant and is in respect of the conduct of the defendant, and does not call into question the jurisdiction of the foreign court” : Giorgio Armani SpA v. Elan Clothes Co Ltd [2019] 2 HKLRD 313 at §2 per DHCJ Field. See also: Ever Judger Holding Co Ltd v. Kroman Celik Sanayii Anonim Sirketi [2015] 2 HKLRD 866 at §23 per G Lam J (as he then was). 25. The law draws a fundamental distinction in approach between two categories of anti-suit injunctions:- (1) Contractual: where foreign proceedings breach an arbitration agreement (as in the present case), or an exclusive jurisdiction clause (“EJC”); and (2) Non-Contractual: where no contractual breach is involved, the focus shifts to whether the foreign proceedings are vexatious, oppressive, or inconsistent with the principles of forum non conveniens . 26. In cases involving a breach of an arbitration agreement or EJC, the position is well-established:- (1) The general rule is that foreign proceedings in breach of an arbitration agreement (or EJC) will be ordinarily restrained unless strong reasons to the contrary are shown by the Defendant: Giorgio Armani at §27. (2) The Court’s primary focus is on enforcing the defendant’s contractual promise not to sue in a foreign jurisdiction. In such cases, considerations of forum conveniens or comity are irrelevant. (3) There is no justification for judicial diffidence in granting a contractual anti-suit injunction where it is clear that the defendant has breached their contractual obligation not to bring foreign proceedings. 27. These principles are distilled from the oft-cited judgment of Millett LJ (as he then was) in the landmark case of The Angelic Grace [1995] 1 Lloyds Rep 87 at 96, where Millett LJ stated:- “ In my judgment, the time has come to lay aside the ritual incantation that this is a jurisdiction which should only be exercised sparingly and with great caution. There have been many statements of great authority warning of the danger of giving an appearance of undue interference with the proceedings of a foreign Court. Such sensitivity to the feelings of a foreign Court has much to commend it where the injunction is sought on the ground of forum non conveniens or on the general ground that the foreign proceedings are vexatious or oppressive but where no breach of contract is involved. In the former case, great care may be needed to avoid casting doubt on the fairness or adequacy of the procedures of the foreign Court. In the latter case, the question whether the proceedings are vexatious or oppressive is primarily a matter for the Court before which they are pending. But in my judgment there is no good reason for diffidence in granting an injunction to restrain foreign proceedings on the clear and simple ground that the defendant has promised not to bring them. ” (emphasis added) 28. The approach in The Angelic Grace has been consistently applied in Hong Kong: see Giorgio Armani at §29. 29. The House of Lords expressed their agreement in Donohue v. Armco Inc [2002] CLC 440 (emphasis added):- (1) At §24 per Lord Bingham:- “But the general rule is clear: where parties have bound themselves by an exclusive jurisdiction clause effect should ordinarily be given to that obligation in the absence of strong reasons for departing from it.” (2) At §45 per Lord Hobhouse:- “The position of a party who has an exclusive English jurisdiction clause is very different from one who does not. The former has a contractual right to have the contract enforced. The latter has no such right…” (3) At §53 per Lord Scott:- “It is accepted that a contractual exclusive jurisdiction clause ought to be enforced as between the parties to the contract unless there are strong reasons not to do so. Prima facie parties should be held to their contractual bargain…” 30. In other words, the Court will generally uphold the parties’ contractual bargain where there exists a binding and valid arbitration agreement (or an EJC). The burden lies on the defendant to show compelling reasons why the anti-suit injunction should not be granted. 31. By contrast, where no breach of contract is involved, the Court evaluates the foreign proceedings on broader grounds, such as whether they are vexatious, oppressive, or inconsistent with principles of forum non conveniens . In such cases, the Court is mindful of international comity and adopts a more cautious and restrained approach: Giorgio Armani at §28; The Angelic Grace at 96. 32. As a contractual anti-suit injunction is premised upon an agreement not to sue, the requirements for its grant are correspondingly narrow. As Mimmie Chan J held in Bank A v. Bank B [2024] 5 HKLRD 250 at §59:- “In my judgment, what is pertinent is that the question for determination by the Court in this case is simply whether there is a valid and binding arbitration agreement between the plaintiff and the defendant, which covers the scope of the dispute between the two parties and the claims made by them in these proceedings and in the two sets of Russian Proceedings, and whether to grant the injunctions on the plaintiff's application.” (emphasis added) 33. Similarly, Foxton J in Riverrock Securities Ltd v. International Bank of St Petersburg JSC at §33 held:- “The applicant must show a ‘high probability of success’ that the pursuit of the foreign proceedings involves a breach of the arbitration agreement… This involves establishing to that standard both (i) the existence of an arbitration agreement binding between the applicant and the respondent, and (ii) that the subject-matter of the foreign proceedings falls within and is subject to that arbitration agreement.” (emphasis added) 34. Once the aforesaid requirements are satisfied, a contractual anti-suit injunction should be granted unless D demonstrates there are “strong reasons” not to do so. (See: The Angelic Grace at 96; Donohue v. Armco at §§24, 45, 53; Bank A v. Bank B at §34) 35. What constitutes “strong reasons” was considered by G Lam J (as he then was) in Ever Judger at §58:- “What is a \"strong reason\" has not been further elaborated in the authorities. In his speech in Donohue v Armco Inc at [24], Lord Bingham referred to \"dilatoriness and other unconscionable conduct\" , but added that the question will depend on all the facts and circumstances of the particular case. The power is ultimately a discretionary one, to be exercised in the interests of justice, and the factors raised against the injunction must be sufficiently strong to warrant not holding the opposing party to his contract.” (emphasis added) 36. Typical arguments raised to resist anti-suit injunctions, such as delay and unclean hands, are rarely persuasive unless supported by compelling evidence: see e.g. Ever Judger at §§46, 81. 37. Secondly, it is a well-established principle that, in proceedings to enforce an arbitration agreement, the court does not look at the substantive merits of the underlying dispute. 38. The rationale is obvious: the Court’s focus here is on enforcing the arbitration agreement, not to prejudge or evaluate the merits of the underlying dispute. This approach ensures respect for the parties’ contractual choice to arbitrate and avoids undermining the arbitral process by prematurely addressing issues that are properly reserved for the arbitral tribunal. 39. In Tai Hing Cotton Mill Ltd v. Glencore Grain Rotterdam BV (unrep., CACV 143/1995, 24 th November 1995), Bokhary JA (as he then was) made it unequivocally clear at p.16:- “Under article 8(1) of the Model Law, the court is not concerned with investigating whether the defendant has an arguable basis for disputing the claim. If a claim is made against him in a matter which is the subject of an arbitration agreement and he does not admit the claim, then there is a dispute within the meaning of the article. And if he seeks a stay of the action, the court must grant a stay unless the plaintiff can show that the arbitration agreement is null and void, inoperative or incapable of being performed.” (emphasis added) 40. Likewise, in Getwick Engineers Ltd v. Pilecon Engineering Ltd (unrep., HCA 558/2002, 28 th August 2002), Ma J (as he then was) emphasised at §23(3):- “The existence or non-existence of a dispute or difference as envisaged under the relevant arbitration agreement between the parties is crucial to the granting of a stay. For this purpose, a dispute will exist unless there has been a clear and unequivocal admission not only of liability but also quantum …Thus, finding out whether a dispute (as defined in this way) exists, is the only exercise that the court carries out in a stay application (apart of course from construing the arbitration agreement to discover its full ambit): it does not involve itself in evaluating the merits of the claim .” (emphasis added) 41. While Tai Hing and Getwick concerned applications for stays to arbitration, the principle applies equally in anti-suit injunctions, which have been described as the “ counterpart ” to stay applications and as “ opposite and complementary sides of the same coin ”. (See: X v. ZPRC [2020] HKCFI 631 at §38 per Mimmie Chan J; Tyson International Company Limited v. Partner Reinsurance Europe SE [2023] EWHC 3243 (Comm) at §1 per Deputy Judge Stephen Houseman KC) 42. This principle has been expressly adopted in anti-suit injunction cases. In Bank A v. Bank B [2024] 5 HKLRD 250 at §60, where Mimmie Chan J emphasized that:- “…and it should not be forgotten that the Court does not consider the merits of the underlying dispute when it decides the plaintiff's claim for the injunctions - which are made solely on the basis of a valid arbitration agreement. This is also a reason to reject the defendant's assertion that by granting the injunctions to the plaintiff, the Court is implementing or facilitating the EU Sanction. Any injunction which the Court grants in this case is to facilitate the arbitration agreement between the parties, and nothing else. ” (emphasis added) 43. The English courts have adopted the same approach. In Catlin Syndicate Ltd v. Amec Foster Wheeler USA Corp [2021] 2 CLC 15 at §76, Jacobs J emphasized:- “ It is therefore unsurprising that I was shown no authority in which the court's decision, as to whether or not to enforce a jurisdiction or arbitration agreement, depended upon an evaluation of the merits of the claim that a party would be required to bring in England (if the jurisdiction or arbitration agreement were to be enforced), in circumstances where that party had declined to bring such proceedings and was seeking to litigate elsewhere. I also consider it inherently undesirable for an application to enforce a jurisdiction or arbitration agreement by an anti-suit injunction to be transformed into a quasi-hearing of an application for summary judgment or an interim payment which the enjoined party, who seeks to sue elsewhere and under a different applicable law, has not actually made. The straightforward position is that the court should consider whether there are strong reasons not to enforce the jurisdiction agreement. If not, then the injunction should be granted and the enjoined party can then bring proper applications, in accordance with the CPR, for summary judgment or an interim payment.” (emphasis added) 44. Thirdly, it is also established that, in an application for a contractual anti-suit injunction, the approach of the foreign court, including whether it will give effect to the arbitration agreement or grant a stay of the foreign proceedings is irrelevant. 45. In Youell v. Kara Mara Shipping Co Ltd [2000] CLC 1058, Aikens J (as he then was) rejected the relevance of foreign law, emphasizing that the English court focuses on the contract’s governing law and the parties’ agreement. At §60:- “But in my view, contrary to the submission of Mr Boyd, there is no reason why the English court should have regard to the Louisiana law concept of whether an EJC in favour of the English courts is lawful, at least when, upon an English conflicts of laws analysis, the contract is governed by English law. Hence in Aggeliki Charis Compania Maritima SA v Pagnan SpA (‘The Angelic Grace’) [1995] 1 Ll Rep 87 the Court of Appeal held that it need not have regard to the fact that the Italian court might not give effect to the English arbitration clause (see p. 94 per Leggatt LJ; p. 96 per Millett LJ; p . 97 per Neill LJ). And in Akai Pty Ltd v People's Insurance Co Ltd [1997] CLC 1508, Thomas J disregarded the fact that the Australian High Court would not have given effect to the EJC in the insurance contract. ” 46. This principle has been consistently affirmed in Hong Kong, where the courts have made it clear that the foreign court’s attitude under its own law is irrelevant to applications for anti-suit injunctions. (See: Giorgio Armani at §30 (applying Youell ); Linde GmbH v Ruschemalliance LLC [2023] HKCFI 2409 at §58; Bank A v. Bank B at §66) 47. As explained by Mimmie Chan J in Linde at §§60-61:- “Whether there are indeed special circumstances, or strong reasons, which may justify a departure from the prima facie entitlement of a party to enforce the arbitration agreement, depends on all the circumstances of the case. However, the mere fact that the foreign court will not grant a stay of the proceedings instituted is not sufficient to refuse an injunction… …whether the foreign court has jurisdiction under its own law to determine the claims made in the proceedings brought in breach of the arbitration agreement is not a relevant question, as the essential point and rationale for the grant of the injunction is that since a party had agreed to the arbitration clause, it should not be allowed to invoke any other relevant jurisdiction. ” (emphasis added) 48. Fourthly, in Hong Kong, it has previously been held at first instance level that winding-up proceedings based on a disputed debt do not, in themselves, determine the dispute and therefore do not contravene a relevant arbitration clause (“No Determination Argument”): Re Asia Master Logistics Ltd [2020] 2 HKLRD 423 at §§70-72. 49. However, in Re Lam Kwok Hung Guy [2022] 4 HKLRD 793 ( Guy Lam CA ), G Lam JA specifically considered and rejected the No Determination Argument at §§67-73, holding, inter alia , that:- (1) Where the court finds against the company, concluding that its defences do not raise any bona fide disputes on substantial grounds, there is no reason why that should not be regarded as a determination of the dispute. (§68) (2) Even if no monetary judgement arises from such a determination, there is no reason in principle why it cannot, like a decision granting summary judgment, give rise to an estoppel in relation to the precise issues decided, if the usual conditions are satisfied. (§§69-70) 50. G Lam JA also noted that the No Determination Argument has been rejected by the Singapore Court of Appeal in AnAn Group (Singapore) Pte Ltd v. VTB Bank (Public Joint Stock Co) [2020] SGCA 33 . 51. Whilst the Defendant submitted that observations of G Lam JA in Re Lam Kwok Hung Guy is obiter , I am of the view that it is nevertheless a very strong dictum and importantly the reasoning was affirmed in the Court of Final Appeal which I am of the view is binding on this court. (See: Re Mega Gold [2024] 4 HKLRD 583 at §70) ANALYSIS AND DETERMINATION 52. I am of the view that first and foremost, whether foreign winding-up proceedings are in breach of an arbitration clause is a matter of proper construction of the terms of the clause. It is trite that the Court must start with looking at the clause itself. 53. Clause 43.1 of the TFA provides for an arbitration agreement in the following terms:- “43.1 Arbitration (a) Any dispute, controversy or claim arising in any way out of or in connection with this Agreement (including (i) any issue regarding contractual, pre-contractual or non-contractual rights, obligations or liabilities and (ii) any issue as to the existence, validity, breach or termination of this Agreement) (a “Dispute”) shall be referred to and finally resolved by binding arbitration administered by the Hong Kong International Arbitration Centre (“HKIAC”) … (c) The seat of the arbitration shall be Hong Kong. This arbitration agreement shall be governed by the laws of Hong Kong ...” 54. In essence, the Plaintiff’s case is that the dispute which will be raised in the Cayman winding-up proceedings concerns the Plaintiff’s guarantee obligation to repay under the TFA, which is a “ dispute, controversy or claim arising in any way out of or in connection with ” the TFA and thus within the scope of Clause 43.1. 55. Further, without expert evidence, Cayman law is presumed to be the same as Hong Kong law, or at least not shown by the Defendant to be different, on the point that the Cayman winding up proceedings can amount to a judicial determination of the dispute. 56. In any event, this court shall apply Hong Kong law, which is the governing law of Clause 43.1, to determine whether the Defendant in bringing the Cayman proceedings will be in breach of Clause 43.1. 57. Under Hong Kong law, the Defendant, in pursuit of the Cayman proceedings, is seeking to have the dispute determined and will thus be in breach of Clause 43.1. 58. Accordingly, the requirements for granting an anti-suit injunction at the “high probability of success” threshold are met. There is no strong reason shown to the contrary for the Court to not grant the injunction. 59. On the other hand, the Defendant submitted that, as a matter of Cayman law, both the presentation of the winding-up petition and a Cayman winding-up order will not have the effect of determining or resolving the parties’ rights and obligations under the TFA. 60. As such, Hong Kong law (which on this point would itself refer to Cayman law) cannot regard the Cayman winding-up proceedings as being capable of determining a dispute. 61. The Cayman proceedings therefore do not fall within the terms of Clause 43.1. Hence, the Defendant, in presenting the Cayman winding-up proceedings, will not be in breach of Clause 43.1. 62. As such, the threshold requirements for granting the anti-suit injunction are not met. (1) Identification of the Issue 63. The Plaintiff submits that a contractual anti-suit injunction may be granted if the arbitration agreement is valid and binding, and the subject matter or scope of the dispute raised in the legal proceedings falls within the arbitration agreement. Whilst this legal proposition is correct, it is not the real issue to be resolved by this court. 64. The starting point is that a pursuit of foreign proceedings in breach of an arbitration agreement would be liable to be restrained by an anti-suit injunction: Giorgio Armani at §27; Ever Judger at §30; The Angelic Grace at 96. 65. As the Plaintiff seeks a contractual anti-suit injunction by invoking the arbitration agreement contained in Clause 43.1., it has to establish a breach of Clause 43.1 by the Defendant. The burden is on the Plaintiff to show a “high probability of success” that the Defendant’s pursuit of the anticipated Cayman winding-up proceedings breaches Clause 43.1: Riverrock Securities Ltd v International Bank of St Petersburg JSC [2020] 2 CLC 547 at §33. 66. It is established that any claim for relief on the basis of a jurisdiction agreement must start by establishing its factual basis. Unless the issue is not in dispute, the Plaintiff needs to establish that (i) the agreement was valid and remains enforceable and (ii) that on its proper construction, the proceedings in question fall within the material and personal scope of the TFA. 67. In this case, it is not in issue that Clause 43.1 is valid and covers the dispute as to the Plaintiff’s indebtedness under the TFA, which will likely be raised in the Cayman winding-up proceedings. 68. However, that by itself is not sufficient to establish that the Defendant’s intended presentation of the Cayman winding-up proceedings amounts to a breach of Clause 43.1. This is because the Plaintiff must establish that, in addition to the dispute itself, the Cayman winding-up proceedings also fall within the arbitration agreement contained in Clause 43.1. This is an issue concerning the proper construction of Clause 43.1 by applying Hong Kong law. To me this is the real issue in this case. 69. Turning now to Clause 43.1, the starting point is to consider its express language — “ [a]ny dispute, controversy or claim arising in any way out of or in connection with [the TFA]… shall be referred to and finally resolved by binding arbitration …”. (emphasis added) 70. As such, Clause 43.1 imposes a positive obligation on the parties to have disputes within the scope of the clause (i.e. dispute, controversy or claim arising in any way out of or in connection with the TFA) finally resolved by arbitration. In addition, it imposes a negative obligation on the parties. This negative obligation precludes the parties from having disputes finally resolved in a non-contractual forum: Re Asia Master Logistics at§§66-67; Ever Judger at §30. 71. As the Privy Council has rightly held, an arbitration agreement such as Clause 43.1 is concerned with dispute resolution and the determination of disputed rights and obligations: Sian Participation at §66. In my view, under Clause 43.1, if a party commences legal proceedings to have disputes finally resolved at a non-contractual forum, it would be in breach of Clause 43.1; however, if such proceedings do not have the effect of finally resolving the disputes, then the negative obligation under Clause 43.1 is not infringed, and there would be no breach: Sian Participation at §§82, 88-89, 98; Re Asia Master Logistics at§§68-70. 72. In short, the real issue is whether the Defendant’s intended presentation of a Cayman winding-up petition will be in breach its obligation under Clause 43.1. This court must therefore ascertain whether the Cayman winding-up proceedings would have the effect of finally resolving the dispute on the Plaintiff’s indebtedness under the TFA within the meaning of Clause 43.1. “Finally Resolve”, Res Judicata and Estoppel 73. On this very issue, the Plaintiff submits that as Hong Kong law is the governing law of Clause 43.1, Hong Kong law takes precedence over Cayman law regardless of the position under Cayman law. 74. As Hong Kong law views winding-up proceedings as determining rights and obligations, then Defendant in bringing the Cayman proceedings would be in breach of its obligation under Clause 43.1 not to finally resolve the dispute in a non-contractual forum. 75. The Defendant, on the other hand, submits that when applying Hong Kong laws to decide whether the Cayman winding-up proceedings would finally resolve the dispute, the Cayman proceedings would only have such an effect if the rulings or findings of the Cayman Court would constitute res judicata and are capable of giving rise to an estoppel over the dispute. Further, whether the rulings or findings in the Cayman proceedings give rise to res judicata under Hong Kong law depends on what Cayman law says about the Cayman winding-up proceedings. Hong Kong law cannot regard the Cayman proceedings as finally resolving the dispute if Cayman law does not so regard. 76. In reply, the Plaintiff submits that the concept of estoppel is irrelevant, since the question is simply whether the foreign proceedings amount to a determination of the dispute under Hong Kong law but not whether they give rise to an estoppel. The concept of determination of a dispute is not contingent upon such determination giving rise to an estoppel, as the two concepts are distinct. 77. Upon careful consideration of the parties’ submissions, for the reasons set out below, I am of the view that the legal propositions advanced by the Defendant are correct and accord with common and commercial sense. 78. The starting point in considering the parties’ rival submissions is Guy Lam CA . 79. In Guy Lam CA , G Lam JA observed that, in relation to an exclusive jurisdiction clause, to determine or decide a dispute means that the process is capable of giving rise to an estoppel in relation to the precise issues decided: at §§68-70. 80. The learned judge’s analysis can be summarized as: (1) Drawing an analogy between a winding-up proceeding and a summary judgment, G Lam JA explained that both processes can determine a dispute because both of them can give rise to an estoppel over the precise issues decided, if the usual conditions are satisfied. This is so although a winding-up proceeding, unlike a summary judgment, will not produce a monetary judgment merging with the debt: at§§68-69. (2) This proposition is supported by several Australia and New Zealand authorities which suggest that a liquidator in adjudication of proofs may be bound by an estoppel arising earlier in the proceedings: at §70. (3) G Lam JA later said that it is unnecessary to decide whether the Australia and New Zealand approach accurately describes the approach that should be adopted in Hong Kong in relation to adjudication of proofs: at §70. In other words, his Lordship left open the point of whether the usual conditions are satisfied for an estoppel to be set up against the liquidator in adjudication of proofs. (4) But the fundamental point remains that a proceeding which determines a dispute is a proceeding which is capable of giving rise to an estoppel. 81. G Lam JA’s observation has been said to apply equally in the context of arbitration clauses: Re Simplicity & Vogue Retailing (HK) Co Ltd [2024] 2 HKLRD 1064 at §§34, 35(1). 82. Secondly, I am of the view that Clause 43.1 in expressly incorporating the concept of final resolution of a dispute necessarily engages the concepts of res judicata and estoppel. As a matter of context, it would be odd if the words “finally resolved” in Clause 43.1 do not connote the concepts of res judicata and estoppel. 83. In addition to the words “finally resolved”, the parties have throughout Clause 43.1 emphasized the finality of the resolution of their disputes by arbitration. The rest of Clause 43.1 provides:- “… (e) Any award of the Tribunal … shall be final and binding on the parties from the day it is made … (f) The parties waive any right to apply to any court of law and/or other judicial authority to … review any question of law and/or the merits, insofar as such waiver may validly be made …” 84. Thus, I am of the view that in giving proper effect to the express language of Clause 43.1, it would be appropriate and natural to incorporate the legal concepts of res judicata and estoppel to the requirement of finality in the disputes resolution obligations as stipulated under Clause 43.1. (2) Relevance of Cayman Law 85. Next, in applying the concepts of res judicata and estoppel to decide whether the Cayman winding-up proceedings would finally resolve the dispute within the meaning of Clause 43.1 or even simply in asking the question of whether the intended Cayman winding-up proceedings would have the effect of finally resolve the disputes between the parties, an important question is what law should this court consider and apply. 86. It is common ground that: - (1) The Court may understand the nature and effect of the Cayman proceedings by reference to Cayman law. (2) But whether those proceedings so understood would in turn breach Clause 43.1 is a matter of applying Hong Kong law, being the governing law of Clause 43.1. 87. The controversy stems from the application of Hong Kong law at the second stage: - (1) The Plaintiff submits that the Court should only apply Hong Kong law and consider no Cayman law at all. (2) The Defendant submits that the Court in applying Hong Kong law must necessarily consider Cayman law. 88. In this regard, the Defendant refers this Court to the case of The Kallang (No 2) [2009] 1 Lloyd’s Rep 124. At issue was whether the arrest proceedings in Senegal were not confined to the obtaining of security but extended to the determination of arbitrable issues, and were thus in breach of a London arbitration clause in the English law-governed bills of lading: at §§77-78. In answering whether the Senegalese proceedings amounted to such a determination, Deputy Judge Jonathan Hirst QC went on to consider the evidence on Senegalese law: at §§53-60, 80-83. 89. The Kallang (No 2) is, thus, an example that the Court may refer to the relevant foreign law in considering whether the effect of foreign proceedings is in breach of an arbitration agreement, even though the arbitration agreement itself is governed by a different law. This makes sense to me. 90. But beyond this example, I am of the view that there is a principled justification for referring to a foreign law which is different from the governing law of the arbitration agreement. 91. Fundamentally, when the Court interprets a contract and determines what legal rights and obligations are created by the words in the contract, it does so by reference to the system of law which governs it. As to the content of this system of law, it means the substantive law of the country which the parties have chosen as that by which their legal rights and obligations are to be ascertained. It excludes any renvoi that the courts of that country might themselves apply if the matter were litigated before them. 92. I have not lost sight of the fact that the construction of a contract by local law involves the application of the rules and implications of the local common law, including the rules of the conflict of laws. (See: Vita Food Products Inc v Unus Shipping Co Ltd [1939] AC 277 at 298). 93. However, in my view, what was referred to in Vita Food as “rules of the conflict of laws” are substantive rules which, though conveniently labelled as conflict rules , involve foreign elements or may in the course of their application require the consideration of foreign law. This type of rules forms properly part of the substantive or domestic law of the country which the parties have chosen as the applicable law. 94. This type of rules is also different from a pure conflict of laws rule understood in the choice of law rule sense, which only serves to select the system of law of a different country (i.e. other than the originally chosen system of law of which the choice of law rule forms part) as the applicable law. A choice of law rule does not form part of the substantive or domestic law of the country which the parties have chosen as the applicable law and is disapplied in the choice of law process to avoid renvoi. 95. The upshot is that the type of substantive rules recognised in Vita Food as involving international elements or requiring the consideration of a different law are part of the substantive or domestic law of the governing law of the contract . 96. For this reason, a law different from the governing law of the contract must be considered and applied if there is a relevant substantive rule within the governing law which properly calls for it. This process however does not involve the application of any choice of law rule or renvoi. 97. Lord Wright in Vita Food at 291said: - “ The proper law of the contract does indeed fix the interpretation and construction of its express terms and supply the relevant background of statutory or implied terms. But that part of the English law which is commonly called the conflict of laws requires, where proper, the application of foreign law ; e.g., English law will not enforce a performance contrary to the law of the place of performance in circumstances like those existing in Ralli Bros. v. Compania Naviera Sota y Aznar [1920] 2 K.B. 287 ... English law will in these and sometimes in other respects import a foreign law, but the contract is still governed by its proper law .” (emphasis added) 98. I am of the view that the correct legal position is that a foreign judgment is not given more conclusive force here than in its country of origin. The Court here cannot regard as conclusive something in a foreign judgment which the foreign court itself under foreign law would not regard as conclusive: Carl Zeiss Stiftung v Rayner & Keeler Ltd (No 2) [1967] 1 AC 853 at 919A-C per Lord Reid, at 927C-E per Lord Hodson; at 936A-B per Lord Guest, at 969G-970B per Lord Wilberforce. This makes perfect sense to me. This Court cannot make decision by blind-folding its eyes on the correct legal proposition as far as foreign law is concerned. 99. For a foreign judgment to give rise to an issue estoppel, the foreign legal system must regard the issues relied upon as forming the estoppel to formally have preclusive effect. It must have a doctrine of issue estoppel which covers the issues raised, or a doctrine with the same underlying basis and operation: MAD Atelier International BV v Manes [2020] QB 971 at §§47, 49-51, 61. Simply put, the issue in question must be treated as res judicata according to the law of the foreign jurisdiction: MAD Atelier at §59. 100. To determine the question of res judicata or finality in relation to a foreign judgment, the Court here would therefore refer to the relevant foreign law: Bank of China Ltd v Yang Fan [2016] 3 HKLRD 7 at §36. 101. Hence, in my judgment, the Court must refer to Cayman law in order to consider the effect of the Cayman winding-up proceedings under Clause 43.1. 102. For the sake of completeness, the emphasis which the Plaintiff has placed on Hong Kong law being the governing law of Clause 43.1 adds nothing to the analysis. Although, in Clause 43.1, the express choice of Hong Kong law clause is set out in Clause 43.1(c), I am of the view that it is difficult to read into Clause 43.1 the effect contended by the Plaintiff, namely, the parties have intended Clause 43.1 to define an absolute standard (by reference to Hong Kong law only, but no foreign law at all even when Hong Kong law would otherwise refer to it) against which the nature of foreign proceedings brought in relation to the TFA is to be assessed. 103. Further, even if the principles of res judicata and estoppel which apply to foreign judgments have a conflict of laws character, there is no reason to ignore them when the issue of construction squarely involves the final resolution of a dispute in foreign proceedings. The learned author of Private International Law in English Courts (2 nd Edition) at p.53 rightly comments:- “ [R]ules of the conflict of laws are rules of a legal system: they are part of English law, and they are part of every other civilized legal system. If the law of a particular country is … to apply in the individual case, it is rather surprising to think that material parts of that law—the very parts which explain what a court in the country whose law is to be applied to the actual case would actually do—are ignored; cut out and thrown away. The rationality of that is far from self-evident. It may be possible to look on the rules of the conflict of laws as being separate and distinct from the rest of law, but this is only an academic or pedagogic convenience, and to read any more into it than that is to risk damaging the coherence and integrity of the law … identified as applicable in the first place.” (emphasis added) (3) Legal Effects of Winding-up Proceedings Under Cayman Law 104. I agree with Mr Maurellet SC that this Court is not deferring to Cayman law or the Cayman court on whether it will give effect to the arbitration agreement in Clause 43.1 or grant a stay of the Cayman winding-up proceedings. Instead, this Court is going to make its own decision on the Cayman law in relation to the finality and conclusiveness of the Cayman winding-up proceedings on the central issue of the Plaintiff’s indebtedness under the TFA. 105. Before turning to Cayman law on this point, this Court needs to deal with a preliminary issue on the lack of Cayman law expert evidence. In the present case, Cayman cases and legal principles have been adduced by way of submissions from both the Plaintiff and the Defendant. 106. Nonetheless, the Plaintiff submits that since there is no expert evidence on Cayman law, Cayman law may not be proved and must be presumed to be the same as Hong Kong law. 107. The Plaintiff relies on the case of Hong Jing v Zhuhai Kwok Yuen Investment [2013] 1 HKLRD 441 , in which Cheung JA said at §73(7):- “In my view the Judge was correct. The starting point is that foreign law is a question of fact. It must be pleaded and proved by expert evidence. The court cannot take judicial notice of foreign law, though it be notorious law: Lazard Bros. & Co. v. Midland Bank Ltd. [1933] AC 289 at p. 297. In the absence of evidence, foreign law is presumed to be the same as English law: El-Ajou v. Dollar Land Holdings Plc (No. 1) [1993] 3 All E.R. 717 at 736. As held in MCC Proceeds Inc. v. Bishopsgate Investment Trust Plc & Ors. [1999] CLC 417, paragraph 10: ‘In the absence of expert evidence, or if the judge is unpersuaded by it, then he must resolve the issue by reference to English law, even if according to the rules of private international law the issue is governed by the foreign law.’” 108. However, I am of the view that Hong Jing is not authority for the proposition that expert evidence is strictly indispensable in every case. Where the foreign law in issue is a matter of common law, judges are entitled and indeed obliged to draw on their own knowledge of the common law if it bears on the resolution of the dispute. Judges must make a legal input, notwithstanding that it is an issue of foreign law: Perry v Lopag Trust Reg No.2 (Cayman Islands) [2023] 1 WLR 3494 at §12; Shenzhen Development Bank v New Century Holdings, HCA 2976/2001, unrep., 31 July 2002 at §25 per DHCJ Lam (as he then was). 109. Thus, as early as in Earl Nelson v Lord Bridport (1845) 50 ER 207 at 211, it was recognised that there is no need for utmost strictness in relation to expert evidence in every case, since judges may, with the assistance of the Bar and without impropriety, determine the application of a foreign law by applying their own knowledge and reasoning. 110. Recent authorities have indeed made it clear that it is not necessary in every case to adduce materials on foreign law through expert evidence. Depending on the nature of the issue and of the relevant foreign law, materials on foreign law may be readily adduced and made available as direct evidence, in which case the presumption of similarity would have no application: FS Cairo (Nile Plaza) LLC v Brownlie [2022] AC 995 at §§148-149; Gol Linhas Aereas SA v Matlin Patterson Global Opportunities Partners [2022] 2 All ER (Comm) 841 at §46; Soriano v Forensic News LLC [2022] QB 533 at §64. 111. Although it may not be orthodox to adduce materials on foreign law through submissions (See: Lim Yi Shenn v Wong Yuen Yee [2012] 3 HKLRD 505 at §60), pragmatic considerations as to time and costs would not be irrelevant. Courts in Hong Kong are perfectly capable of understanding the relevant legal principles in other common law jurisdictions. 112. In this case, the sole finding which this Court has to make in relation to Cayman law is an area of law which the Hong Kong Courts are very familiar with. The common law materials upon which the finding is to be made are clear cut. In fact, both the Plaintiff and the Defendant have sensibly made submissions on Cayman law in this case. 113. Hence, I am of the view that there is no predicament for this Court to directly consider the relevant materials on Cayman law and to apply its own knowledge and reasoning of the common law to analyse the position under Cayman law. (4) Position Under Cayman Law 114. The Defendant submits that, under Cayman law, the determination of the threshold question of the Plaintiff’s locus in the Cayman winding-up proceedings does not determine or resolve the substantive dispute concerning the Plaintiff’s indebtedness under the TFA. 115. The Defendant relies upon Sian Participation (a decision of the Privy Council) and Re BPGIC Holdings Ltd FSD 248 of 2023 (a decision of the Cayman Grand Court). 116. In Sian Participation , the Privy Council in approving the approach of the lower BVI courts held that, as a matter of BVI law and English law, a creditor’s winding-up petition (or similar liquidation application, including the ordering of a liquidation) does not resolve or determine anything about the petition debt nor the petitioner’s claim to be owed money, such as the existence or amount of the debt, which is not an issue for resolution in those proceedings: at §§88, 92, 125. 117. Thus, it may already be concluded that if the same point were to come again before the Privy Council on appeal from the Cayman Islands, the Privy Council would decide in the same way as it did in Sian Participation . 118. But that is not all. Re BPGIC , a decision given earlier than the Privy Council’s decision in Sian Participation , is also consistent with Sian Participation . 119. It is appropriate to cite in full the relevant passages in Re BPGIC . Ramsay-Hale CJ said at §§21-28:- “21. I say at once that the case of [ Sparkasse Bregenz Bank AG v. Associated Capital Corp , a decision of the BVI Court of Appeal] on which Foster J relied in [ Re Times Property Holdings Limited [2011] (1) CILR 223, a decision of the Cayman Grand Court] is not authority for the proposition that the Court should not determine whether the debt is disputed on substantial grounds where there is an agreement that some other body shall have jurisdiction to resolve the dispute. It is plain from paragraph 4 of the judgment of Byron CJ [in Sparkasse ] that the judge at first instance made inquiry and, having decided that there was a genuine and substantial dispute, then stayed the petition so the dispute could be resolved in the jurisdiction agreed by the parties: ‘[4] . . . The agreement between the parties clearly mandated that the agreement is subject to the law of Austria and that the Court … in Vienna has exclusive jurisdiction over any possible legal dispute arising out of the agreement … Austrian Law would be relevant to resolve the questions that were raised by the parties. It is not necessary to rely on Austrian Law to determine whether there was a dispute. One can conclude that a dispute exists without knowing how the dispute would be resolved. The learned trial Judge concluded that there were disputes of both a factual and legal nature and it is not for this Court to resolve those disputes. He concluded that the dispute between the parties should be settled in accordance with the terms of the agreement before it could be said that there was a debt which could ground a winding up order. The principles outlined above [relating to disputed debts] clearly indicate that it was his duty to determine whether there is a genuine and substantial dispute as to whether there is a debt. None of the jurisprudence indicates that it was his duty to resolve the dispute. I reject the contention that the failure to lead Austrian Law in evidence was an error or impacted on the burden of proof. The questions that the judge was required to answer, and those that he did answer did not require any knowledge of Austrian Law. If he had attempted to resolve the dispute he would have been improperly encroaching on and usurping a jurisdiction which the parties had conferred on the Austrian Court.’ 22. Bannister J’s decision in [ Pioneer Freight Futures Co. Ltd. v. Worldlink Shipping Ltd , a decision of the BVI High Court] to summarily dispense with what he accepted was his statutory duty to carry out the threshold inquiry on the ground that, if he did so, he would be pre-judging a dispute which the parties had agreed to refer to the High Court in London was plainly wrong. The learned Judge mistakenly elided the determination of the threshold question of whether there was a genuine dispute on substantial grounds with the resolution of that dispute. The distinction between them is clear, as was emphasised by Byron CJ in Sparkaase. 23. Bannister J himself acknowledged his error in his later decision in Alexander Jacobus De Wet v Vascon Trading Limited BVIHCV (COM) 2011/0129 … Bannister J said this at [16]: ‘Although I am satisfied that [Pioneer Freight] was rightly decided on its facts, I consider that my analysis … was wrong … I agree that the Court must first decide on the evidence before it, whether there is a dispute at all. If the evidence (as in this case) discloses no ground at all for challenging the debt, then it is irrelevant that there may be an exclusive jurisdiction or arbitration provision. It seems to me that insofar as I held otherwise in Pioneer I was misinterpreting, rather than following, the decision of the Court of Appeal in Sparkasse Bregenz Bank AG. Although it was not brought to my attention in Pioneer, I referred the parties in the present case to the decision of the England and Wales Court of Appeal in BST Properties v Reorg Apport Penzugyi RT. In that case the English Court of Appeal upheld a decision that there was no substantial dispute about the debt relied upon by the petitioning creditor … the Court of Appeal held that the exclusive jurisdiction clause was irrelevant to the question whether the debt was bona fide disputed on substantial grounds. Only if a substantial dispute is identified will the exclusive jurisdiction clause fall to be taken into account.’ 24. It follows that, insofar as Times Property is said to be authority for the proposition that once the debt is disputed the Court should not determine the threshold question as to the genuineness of the dispute, the decision is wrong… 27. In contradistinction to the position in the UK, the approach of the Cayman Courts, which is to determine the threshold question of whether the dispute is genuine and substantial before dismissing a petition in favour of arbitration …, is entirely consistent with the legislative policy in of the FAAEA. 28. I do not share the view that, in undertaking the threshold inquiry, the Court would be carrying out a summary judgment type analysis. The Court’s normal practice is not to resolve or determine the dispute in the petition (see Sparkasse supra) but rather to stay the petition if it finds that there is a genuine dispute of substance with respect to the debt, leaving the dispute to be resolved in a different action or in a different forum. That is not to say that in an appropriate case the Court could not resolve the dispute: see Vos JA in In the matter Of GFN Corporation Limited [2009 CILR 650] at [94], but there is a distinction between the resolution of the threshold question, which is being proposed by the Petitioner here, and the resolution of the substantive dispute for which proceedings by way of petition are ill-suited . ” (emphasis added) 120. Ramsay-Hale CJ also had earlier considered 2 Cayman authorities on stays of winding-up petition, and the legislative policy under the Cayman regime, at §§14-18:- “14. … Mr. Beswetherick KC, who appears for the Petitioner, relies on the decision of Parker J in Re Grand State Investments Limited (unreported, 28 April 2021, FSD 11 of 2021 (RPJ)) following the decision of Jones J in Re Duet Real Estate Partners 1 LP (unreported, 7 June 2011, FSD 77 of 2011 (AJJ)) in which the learned Judge proceeded on the basis that the court will need to be satisfied as to the existence of a bona fide dispute on substantial grounds prior to being able to exercise its discretion to stay proceedings in favour of arbitration : Parker J at [74]. 15. In Re Duet Real Estate , Duet disputed the debt and sought to restrain the petitioner from presenting a winding up petition until such time as the dispute about the existence of the debts was resolved by arbitration. Jones J considered the evidence presented and, having determined that there was no evidence from which to infer that there was a genuine and substantial dispute as to the debt, refused the injunction sought. … 17. In the Cayman Islands, by contrast, where the arbitral seat is in a foreign country, section 4 of the Foreign Arbitral Awards Enforcement Act (“FAAEA”) provides that the matter should not be referred to arbitration unless there is a dispute, where this has been interpreted by the Courts to mean a “genuine and serious dispute.” Unlike the UK provisions then, which limit the scope for court intervention where the parties have agreed to arbitrate, section 4 directs the Court to determine whether there is in fact a dispute which raises issues which ought to be determined by the arbitration. 18. The legislative policy in the Cayman Islands, unlike the UK following Salford Estates, is not that the Court should stay or dismiss a petition once the debt is disputed, but that it should inquire into the question of whether the debt is bona fide disputed on substantial grounds.” (emphasis added) 121. From the above passages of Ramsay-Hale CJ, the following propositions under Cayman law can be distilled:- (1) Under Cayman law, as with the position under BVI law, a consistent line of authorities hold that even where the petition debt (which is subject to an exclusive jurisdiction or arbitration agreement) is disputed, the Court should still determine the threshold question as to the genuineness of the dispute before deciding whether to grant, dismiss or stay the winding-up petition. (2) The underlying rationale is that there is a conceptual distinction between (i) the determination of the threshold question of whether there was a genuine dispute on substantial grounds and (ii) the resolution of the substantive dispute. In undertaking the threshold inquiry in a petition, the Court is not carrying out a summary judgment type analysis nor resolving or determining the substantive dispute. (3) Therefore, even where the petition is granted, the Court is not resolving the dispute in any substantive sense but is only resolving the threshold question. As such, in resolving the threshold question in favour of the petitioner, it is irrelevant that there is an exclusive jurisdiction or arbitration agreement. (4) The point can also be illustrated where the petition debt is governed by foreign law. Even if no evidence on foreign law is adduced in the petition, the threshold question can be decided without the need to resort to foreign law. 122. Re BPGIC further shows that Cayman law was the same as BVI law on this point even before the Privy Council’s decision in Sian Participation . Since the Privy Council in Sian Participation also approved the approach of the lower BVI courts, on balance, I am of the view that the Privy Council would decide the point in the same way for Cayman law. 123. The Plaintiff relies upon Re GFN [2009] CILR 650, where Vos JA held at §94:- “... I should summarize the principles that I believe emerge in relation to the present law as follows: (...) (b) The normal rule of practice is that the court will dismiss or stay a petition in circumstances where there is a bona fide and substantial dispute as to the existence of the debt upon which the petition is based. (c) In an appropriate case, however, the winding-up court can refuse to dismiss or stay the petition and can determine the question of a disputed debt in the petition itself. (d) Appropriate cases include those where the court doubts that the debt is actually disputed bona fide on substantial grounds ...” (emphasis added) 124. In my view, Re GFN does not assist the Plaintiff, as it is consistent with Re BPGIC. What Vos JA meant by §§94(c) and (d)is not that the substantive dispute as to the debt is at all determined even where the petition is granted, but only that the threshold question of whether the debt is bona fide disputed on substantial grounds is determined. As Ramsay-Hale CJ explained in Re BPGIC at §28 (importantly also referring to Re GFN at§94),the 2 types of determination are distinct. 125. As such, it does not assist the Plaintiff to rely upon Re HQP Corporation FSD 190 of 2021 on the point that the Cayman Court is not bound to follow English appellate decisions “ if there is some clear decision of a court of the Cayman Islands to the contrary ”: at §70(3)(b). No Cayman decision adduced before the Court is shown to be contrary to what the Privy Council in Sian Participation declared as the correct position in English law which also represents the current legal position in Cayman Islands. (5) Conclusion 126. Accordingly, I am of the view that upon a proper construction of Clause 43.1 under Hong Kong law:- (1) The Court cannot give more conclusive force than what Cayman law would give in the Cayman winding-up proceedings to the treatment of the dispute about P’s indebtedness under the TFA. (2) The Cayman proceedings would not have the effect of finally resolving the dispute within the meaning of Clause 43.1. (3) Hence, the Defendant in bringing the Cayman proceedings would not be in breach of its obligation under Clause 43.1 to not have the dispute finally resolved in a non-contractual forum. 127. On this ground alone, the Plaintiff’s application should be dismissed. OTHER REASONS NOT TO GRANT THE INJUNCTION 128. Mr Li SC for the Defendant submitted that even if winding-up proceedings were to fall within the scope of Clause 43.1 of the TFA, there are strong reasons for not granting the injunction. First, it is submitted that the anti-suit injunction which the Plaintiff seeks from the Hong Kong Court would in effect shut out its own home court from exercising its discretion under its public policy considerations, in accordance with the laws which the Plaintiff has itself voluntarily chosen to generally govern it. The Hong Kong Court must be slow to do this for a party against its natural home court and its home laws. This is a strong reason against granting the injunction. 129. In my view, it depends on the nature of proceedings that the Plaintiff applies to restrain. If it is a Cayman High Court proceedings which touches on the disputes squarely cover by Clause 43.1 of the TFA, I do not see why the Hong Kong should refrain from making a decision on an anti-suit injunction if there is a clear breach of an agreement to arbitrate. 130. However, if it concerns matters of public policy considerations in the subject company’s home jurisdiction, I agree that this is a factor to be taken into account when the Court exercises its discretion on whether to grant an anti-suit injunction. I do not agree with the Plaintiff’s submissions that public policy considerations do not arise because the Court’s jurisdiction has yet to be engaged. The anti-suit injunction is precisely what is going to prevent the Defendant from invoking that jurisdiction. The policy considerations of whether the court should decline its own jurisdiction and whether a creditor should be barred from invoking it in the first place are the same. 131. Secondly and I think more relevantly, Mr Li SC submitted that in Guy Lam CFA at §104, the Court of Final Appeal made clear that even if a dispute resolution clause applies to the insolvency proceedings before the Court, there is no automatic stay or dismissal. The Court continues to take into account a range of considerations, even though strong cause is needed to depart from the dispute resolution clause. 132. Notably, the merits of the defence may be so bad that it borders on the frivolous or abuse of process: Guy Lam CFA at §105. 133. In Re Simplicity , the Court of Appeal refused to dismiss or stay a winding-up petition in favour of arbitration. In doing so, the Court upheld the first instance finding that the defence in question is frivolous. It would be abusive for the company to rely on such a defence to resist the winding-up petition before the Court: see §47. 134. The Plaintiff submits that insofar as anti-suit injunctions are concerned, merits would be wholly irrelevant. I do not agree. That is wrong as a matter of principle. At §§30 to 31 of Guy Lam CA , G Lam JA made reference to two decisions concerning anti-suit injunctions. In particular reference was made to the House of Lords decision of Donohue v. Armco Inc , where it was established that a Court will grant an anti-suit injunction to restrain the breach of a dispute resolution agreement unless there are strong reasons not to do so. Then at §74 of Guy Lam CA , G Lam JA specifically asked whether the approach set out in, inter alia , Donohue should be applied to bankruptcy petitions. 135. I agree with Mr Li SC that in this specific context anti-suit injunctions and the Court’s own approach to staying insolvency proceedings should be treated alike. 136. On the facts of the present case, I am firmly of the view that the Plaintiff’s defence on the underlying merits is hopeless and frivolous. It is abusive for the Plaintiff to rely on such a defence to prevent the Defendant from invoking the Cayman Court’s winding up jurisdiction. 137. The Plaintiff’s defence to the underlying debt may be summarised as follows: (1) TFA concerned a loan advanced for investments in Myanmar, which is in the middle of a civil war. In order to protect itself from default, D had purchased insurance from the Multilateral Investment Guarantee Agency (“MIGA Insurance”). (2) Clause 19 of the TFA provides for a mechanism whereby the Plaintiff may make what is known as a “Covered Risk Application” to the Defendant. In short, the Plaintiff may request the Defendant to seek recourse under its MIGA Insurance for its default, as opposed to suing the Plaintiff for it. (3) Clause 19.1(b) of the TFA provides that where a Covered Risk Application is pending, the Plaintiff’s guarantee obligations would be suspended. 138. First, I agree that the Covered Risk Application is a formal document that has to comply with the requirements of Clause 19.2 of the TFA. The Plaintiff is required to provide details as to why the application is justified. This requirement is not complied with. 139. Secondly, I also agree that the Plaintiff is unable to pinpoint when the Cover Risk Application is made. It tries to rely on discussions between P, and D, and MIGA. The Plaintiff’s case is the parties have been proceeding as if a Covered Risk Application had been made. However, the Defendant is entitled to insist on strict compliance with the terms of the contract. 140. Thirdly and importantly, in any event, any suspension would have ceased by virtue of Clause 19.1(c)(iii) of the TFA because the MIGA Insurance has been terminated: (1) Clause 19(c)(iii) applies if the MIGA Insurance “is fully or partially void, withdrawn, suspended, repudiated, terminated or cancelled or otherwise ceases to be in full force and effect for any reason”. (2) MIGA terminated the MIGA Insurance on 11 Oct 2022. (3) The insurance was terminated because the Plaintiff failed to pay the premiums on time. Clause 23.16(b) of the TFA makes clear that it is incumbent on the Obligors of the TFA, including the Plaintiff, to ensure that the premium for the MIGA Insurance was paid on time. (4) In any event, the cause for termination is irrelevant. Under Clause 19(c)(iii), termination per se is sufficient. 141. Fourthly, the Defendant, being the Agent as defined in the TFA, is entitled to reject a Covered Risk Application under Clause 19.1(c)(i). If it does so, the suspension of the Plaintiff’s obligations ends. DISPOSITION 142. For all the reasons stated above, despite the very eloquent and learned submissions by Mr Maurellet SC and his juniors, I dismiss both the Summons and the OS dated 16 December 2024. 143. As far as costs is concerned, I make a costs order nisi that costs of and occasioned by the OS and the Summons are to be paid by the Plaintiff to the Defendant, on a party to party basis, to be taxed if not agreed. The said costs order nisi will be made absolute within 14 days from the date hereof unless an application is taken out to vary the same. 144. Finally, it remains for this Court to thank both counsel team for their very professional and learned assistance to this Court. (William Wong SC) Recorder of High Court Mr José-Antonio Maurellet, SC leading Ms Catrina Lam and Mr Lim Han Sheng, instructed by Haiwen & Partners LLP, for the Plaintiff Mr Laurence Li, SC leading Mr Sik Chee Ching, instructed by DLA Piper Hong Kong, for the Defendant Look up this case on Lawcite Noteup",
  "length": 73796,
  "headers_seen": [
    "INTRODUCTION",
    "THE PLAINTIFF’S CASE",
    "THE DEFENDANT’S CASE",
    "FACTUAL AND PROCEDURAL BACKGROUND",
    "LEGAL PRINCIPLES",
    "ANALYSIS AND DETERMINATION",
    "(1) Identification of the Issue",
    "“Finally Resolve”, Res Judicata and Estoppel"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2025/2417",
  "query": "anti-suit injunction",
  "ts": "2025-10-16T10:47:30",
  "ok": true
}