{
  "title": "DING YI V. SHUM TUNG | [2019] HKCA 1195 | HKLII",
  "court": null,
  "year": 2019,
  "date": null,
  "content": "HKLII Databases Court of Appeal [2019] HKCA 1195 DING YI V. SHUM TUNG Judgment Information Date 4 Nov, 2019 Action No. CAMP231/2019 Neutral Cit. [2019] HKCA 1195 Parallel Cit. [2019] HKCLC 1015 Download MS Word Judgment Reading Options Translation Toggle Highlight Appeal History CAMP231/2019 CAMP231/2019 DING YI v. SHUM TUNG CAMP 231/2019 [2019] HKCA 1195 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF APPEAL MISCELLANEOUS PROCEEDINGS NO 231 OF 2019 (ON AN INTENDED APPEAL FROM HCB 3318 /2016) ___________________ RE: DING YI (丁屹)(“the Bankrupt”) ___________________ BETWEEN DING YI (丁屹) Applicant and SHUM TUNG (沈棟) Respondent Before: Hon Poon Ag CJHC and Lam VP in Court Date of Hearing: 17 October 2019 Date of Judgment: 17 October 2019 Date of Reasons for Judgment and Decision on Costs: 5 November 2019 ___________________ REASONS FOR JUDGMENT AND DECISION ON COSTS ____________________ Hon Lam VP (giving the Reasons for Judgment and Decision on Costs of the Court): 1. On 7 May 2019, M Chan J (“the Judge”) refused to grant an anti-suit injunction to the applicant (a bankrupt) to restrain the respondent from enforcing an arbitral award of 28 March 2016 in the Mainland. The Judge dismissed the application on the ground that the applicant had no locus standi to seek such relief by reason of his bankruptcy and the title of his estate was vested on the trustees of bankruptcy (“the Trustee”). 2. Long after the prescribed appeal period, the applicant applied for leave to appeal out of time. That application was refused by the Judge on 6 September 2019. 3. The applicant renewed the application for leave to appeal out of time before us. The application was opposed. We heard the application on 17 October 2019. After hearing submissions, we refused to grant the extension and dismissed the applicant’s summons. Our reasons are set out below. 4. It is well established that the Court will take account of the following matters in considering if an extension of time should be granted, (a) The length of the delay; (b) The reason for the delay; (c) The chance of success of the intended appeal; and (d) The prejudice to the other party. 5. Further, if the delay is substantial and not wholly excusable, the applicant must show a real prospect of success: see Tang Chai On v Tang Sing Ki [2016] 5 HKLRD 104. 6. In the present case, the delay is substantial. The decision of the Judge refusing to grant the injunction was made on 7 May 2019. The summons seeking leave to appeal out of time was only filed by the applicant on 25 July 2019. Counsel and the Judge treated the decision of 7 May 2019 as interlocutory and applied 14 days as the relevant prescribed period. 7. The injunction sought in the summons of 20 March 2019 does not appear to be interim in nature. The anti-suit injunction sought is permanent in nature. On the other hand, it was a summons issued in the context of a bankruptcy petition and the bankruptcy order was made on 11 October 2016 by Ng J. The bankruptcy petition was brought by the applicant on 10 May 2016, shortly after the court made an enforcement order and judgment on 12 May 2016 in respect of the arbitral award of 28 March 2016 in favour of the respondent. The outcome of the summons would not affect the making of the bankruptcy order which was the relief sought in the petition, the originating process in this matter. 8. The applicable period depends on if the order of 7 May 2019 is a final or interlocutory order for the purpose of Section 14AA of the High Court Ordinance. That section has to be read together with Order 59 Rule 21. Since the underlying proceedings is a bankruptcy petition, it is not a determination of the rights of a party to an action. We do not think the order of 7 May 2019 comes within any sub-paragraphs under Order 59 Rule 21(1). 9. Hence, one falls back to the application approach to decide if the order is interlocutory or final, see Bright Shipping Ltd v Changhong Group (HK) Ltd [2019] 2 HKLRD220 outcome of the application is finally determinative of the entire cause or matter or finally determinative of a crucial or substantive issue in the cause or the matter, one has to examine what is the cause or matter in these proceedings by reference to its originating process: see Re LehmanBrown Ltd [2011] 5 HKLRD 668 at paragraphs 9 to 10. 10. In the present case, the matter is the bankruptcy petition. As mentioned above, the outcome of the application for anti-suit injunction would not be determinative of the bankruptcy of the applicant. Hence, for the purpose of Section 14AA, the order of 7 May 2019 is interlocutory in nature. Under Order 59 Rule 2B(1), the time limit for seeking leave to appeal is 14 days and in the present instance the period expired on 21 May 2019. The delay on the part of the applicant was more than 2 months. 11. In light of the evidence in the affirmation of the respondent of 30 September 2019, adverse inference can be drawn in these circumstances when the applicant and his wife did not put forward any evidence to support his assertion of financial constraint. We do not accept that financial constraints of the applicant’s family as the real excuse for the delay. Change of mind on the part of the applicant cannot be an acceptable excuse. 12. In the circumstances, we hold that the applicant must show a real prospect of success before extension of time to appeal would be granted. 13. We would accept that it is reasonably arguable that the legal title to the post-bankruptcy income of the bankrupt is not vested in the Trustees and a claim for anti-suit injunction to prevent the applicant from being personally restrained from leaving the Mainland may not be a chose in action coming within the rule of Heath v Tang [1993] 1 WLR 1421. Thus, it is reasonably arguable that the application should not be dismissed on the ground of lack of locus standi . 14. However, we do not think the appeal has a real prospect of success. We are of the clear view that we would dismiss the application for anti-suit injunction if this Court were to exercise the discretion afresh. 15. The jurisdiction to grant anti-suit injunction to restrain proceedings elsewhere against a company which had been wound up was examined by the Privy Council in an appeal from British Virgin Island in Stichting Shell Pensioenfonds v Krys [2015] AC 616. In that case, Lord Sumption and Lord Toulson JJSC explained the rationale and purpose of granting anti-suit injunctions in insolvency cases at [14] to [24]. In the context of insolvency cases, such injunctions are granted to uphold the integrity of the statutory trust imposed under the insolvency regime and the maintenance of fair and equal distribution of insolvent estate under such statutory regime according to the law of the place where the winding-up or bankruptcy jurisdiction is properly exercised. Thus, as their Lordships said at [18]: “ …the court has an equitable jurisdiction to restrain the acts of persons amenable to the court’s jurisdiction which was calculated to violate the statutory scheme of distribution.” 16. It was also held in that case that vexation and oppression are not a necessary part of the test for the exercise of such jurisdiction. At [24], the nature of the jurisdiction was expounded as follows: “ In protecting its insolvency jurisdiction … the court is not standing on its dignity. It intervenes because the proper distribution of the company’s assets depends on its ability to get in those assets so that comparable claims to them may be dealt with fairly in accordance with a common set of rules applying equally to all of them. There is no jurisdiction other than that of the insolvent’s domicile in which that result can be achieved.” 17. Given the protection of integrity of the statutory insolvency regime as the basis for the grant of insolvency anti-suit injunction, it is not surprising that their Lordship also endorsed at [40] the refusal of such injunction by Roth J in Kemsley v Barclays Bank plc [2013] BPIR 839 at [41] and [42] when a litigant undertook to bring into the estate of a bankrupt whatever assets recoverable from the foreign proceedings. 18. In the present case, the Trustees reported to the Court in a letter of 10 April 2019 that according to their understanding PRC courts give no recognition to the Bankruptcy Order made in Hong Kong and the status of Trustees over the assets of the bankrupt. In light of that, it is unlikely that the Trustees could take any action in the Mainland to investigate the affairs of the applicant or bring in any assets. 19. They also reported that the respondent is the most substantial creditor of the applicant and over 99% of the liabilities of the applicant are owed to the respondent. 20. The Trustees had no objection to the enforcement actions taken by the respondent at his own costs in the Mainland on the understanding that he is willing to bring any assets realized in such actions into the bankruptcy (after deducting his reasonable costs) so that he would take no advantage over other creditors. 21. At the hearing before us, Mr Phang, counsel representing the respondent gave an undertaking to the same effect on behalf of the respondent to this Court. 22. In the circumstances, the proceedings taken by the respondent in the Mainland would not subvert the fair and equal distribution of assets under the statutory insolvency regime in Hong Kong. 23. Mr Ho, counsel for the applicant, submitted that there is still inconsistency with the Hong Kong bankruptcy as the enforcement proceedings in the Mainland are targeted at the post-bankruptcy income of the applicant. 24. We do not accept this submission for the following reasons, (a) It is factually incorrect to suggest that the Mainland proceedings are targeted at post-bankruptcy income though up to now the Mainland proceedings only managed to recover such income; (b) Given that the Trustees cannot effectively investigate into the affairs of the applicant in the Mainland, there is no good reason why the respondent should not be allowed to do so in the context of the Mainland proceedings; (c) As discussed above, the purpose of the anti-suit injunction in insolvency cases is to ensure fair and equal distribution of assets. Provided that such objective is secured (as it has been in the present instance by virtue of the respondent’s undertaking, we do not see any justification for extending the purpose to protect a bankrupt against enforcement proceedings in a jurisdiction where the bankruptcy order is not recognized and affairs and assets of the bankrupt has not been subject to effective control of the Trustees by virtue of the bankruptcy. 25. The applicant also alluded to the potential restrictions on his travel that could be imposed by the courts in the Mainland due to the enforcement actions by the respondent. He said he was put on the List of Dishonest Persons subject to Enforcement. Due to his fear of being subject to travel restriction or arrest and detention, he has refrained from going back to the Mainland and this has prevented him from performing his family duty and undertaking jobs for his employer. Mr Ho characterized the enforcement actions in the Mainland as vexatious harassment and restrictions on personal liberty. 26. We are not impressed by this submission. As analysed above, it is not an abuse for the respondent to pursue whatever legal remedies available in the Mainland. In light of the inability of the Trustees to conduct meaningful inquiries in the Mainland regarding the estate and affairs of the applicant and the undertaking proffered by the respondent, it is actually in the interest of the general body of creditors of the applicant to permit the respondent to take enforcement actions in the Mainland. 27. If the Mainland legal system permits the prohibition of travel or even detention of the applicant in certain circumstances, this Court should not readily come to the view that resorting to such measures are harassment or vexatious. After all, prohibition orders or imprisonment of debtor who refused to disclose his means are measures also available in our own enforcement regime. There is no evidence before us as to the circumstances under which such orders would be made in the Mainland. So far, no such order has been made. We see no reason why the applicant cannot resist any applications in the Mainland proceedings if he has valid ground(s) to oppose the same. 28. On the materials available, we are not satisfied that the enforcement actions in the Mainland are not pursued legitimately for the purpose of recovering the debt due to the respondent. In light of the history of the applicant’s and his wife continued involvement in North Asia Strategic Holdings Limited (and her deriving substantial benefit from such involvement as evidenced in the affirmation of the respondent of 30 September 2019), we do not accept the applicant’s assertion that the Mainland proceedings only served to harass him. We do not find any basis for Mr Ho’s submission that the enforcement process in the Mainland amounted to sharp practice. 29. For these reasons, we refused to grant leave to appeal against the refusal to grant anti-suit injunction by the Judge. The summons of 19 September 2019 is dismissed with costs. 30. Mr Phang sought costs against the wife (as the financial backer who funded the present application) on indemnity basis. Mr Ho (who confirmed that he has instructions to act for the wife for this purpose) did not contest costs order made against the wife. However, Mr Ho submitted that costs should not be awarded on indemnity basis. 31. Since we dismissed the application on a basis different from the one on which the Judge rejected the application, we are not minded to order costs on indemnity basis though the respondent had already made known his arrangement with the Trustees. Having regard to the statement of costs lodged on behalf of the respondent and the submissions of Mr Ho on the same, we summarily fix the costs payable by the wife to the respondent at $150,000. (Jeremy Poon) (M H Lam) Acting Chief Judge of the Vice President High Court Mr Look-Chan Ho, instructed by ONC Lawyers, for the applicant Mr Roger Phang, instructed by King & Wood Mallesons, for the respondent Attendance of the Official Receiver and the Joint and Several Trustees was excused Look up this case on Lawcite Noteup",
  "length": 14432,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkca/2019/1195",
  "query": "anti-suit injunction",
  "ts": "2025-10-16T10:47:04",
  "ok": true
}