{
  "title": "SUN TIAN GANG V. HONG KONG & CHINA GAS (JILIN) LTD | [2024] HKCFI 1597 | HKLII",
  "court": null,
  "year": 2024,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2024] HKCFI 1597 SUN TIAN GANG V. HONG KONG & CHINA GAS (JILIN) LTD HCCT64/2023 HONG KONG & CHINA GAS (JILIN) LTD V. SUN TIAN GANG HCCT84/2023 Collapse Titles Judgment Information Date 12 Jun, 2024 Action No. HCCT64/2023 HCCT84/2023 Neutral Cit. [2024] HKCFI 1597 Parallel Cit. [2024] 3 HKLRD 340 Download MS Word Judgment Corrigendum Reading Options Translation Toggle Highlight Case History HCCT64/2023 HCCT84/2023 HCCT 64/2023 HCCT 84/2023 (dealt with together) [2024] HKCFI 1597 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO 64 OF 2023 ____________________ IN THE MATTER OF the Partial Final Award dated 8 August 2023 (subsequently amended by a Corrigendum / Clarification dated 26 September 2023) and the Second Partial Final Award dated 14 February 2024 in HKIAC/PA17144 and IN THE MATTER OF section 81 of and sections 5 and 6 of Schedule 2 to the Arbitration Ordinance (Cap. 609) ____________________ BETWEEN SUN TIAN GANG Plaintiff and HONG KONG & CHINA GAS (JILIN) LIMITED Defendant ____________________ AND CONSTRUCTION AND ARBITRATION PROCEEDINGS NO 84 OF 2023 ____________________ IN THE MATTER OF the Partial Final Award dated 8 August 2023 (subsequently amended by a Corrigendum / Clarification dated 26 September 2023) and the Second Partial Final Award dated 14 February 2024 in HKIAC/PA17144 and IN THE MATTER OF section 84 of the Arbitration Ordinance (Cap. 609) ____________________ BETWEEN HONG KONG & CHINA GAS (JILIN) LIMITED Applicant and SUN TIAN GANG Respondent ____________________ Before: Hon Mimmie Chan J in Chambers Date of Hearing: 22 April 2024 Date of Decision: 22 April 2024 Date of Reasons for Decision: 13 June 2024 _____________________ C O R R I G E N D U M _____________________ On page 7 of the Reasons for Decision, at line 2 of paragraph 15, “section 100(1)” should read “section 100(a)”. Dated the 22 nd day of July 2024. (Joanne Ma) Clerk to Hon Mimmie Chan J HCCT64/2023 SUN TIAN GANG v. HONG KONG & CHINA GAS (JILIN) LTD HCCT 64/2023 HCCT 84/2023 (dealt with together) [2024] HKCFI 1597 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO 64 OF 2023 ____________________ IN THE MATTER OF the Partial Final Award dated 8 August 2023 (subsequently amended by a Corrigendum / Clarification dated 26 September 2023) and the Second Partial Final Award dated 14 February 2024 in HKIAC/PA17144 and IN THE MATTER OF section 81 of and sections 5 and 6 of Schedule 2 to the Arbitration Ordinance ( Cap. 609 ) ____________________ BETWEEN SUN TIAN GANG Plaintiff and HONG KONG & CHINA GAS (JILIN) LIMITED Defendant ____________________ AND CONSTRUCTION AND ARBITRATION PROCEEDINGS NO 84 OF 2023 ____________________ IN THE MATTER OF the Partial Final Award dated 8 August 2023 (subsequently amended by a Corrigendum / Clarification dated 26 September 2023) and the Second Partial Final Award dated 14 February 2024 in HKIAC/PA17144 and IN THE MATTER OF section 84 of the Arbitration Ordinance ( Cap. 609 ) ____________________ BETWEEN HONG KONG & CHINA GAS (JILIN) LIMITED Applicant and SUN TIAN GANG Respondent ____________________ Before: Hon Mimmie Chan J in Chambers Date of Hearing: 22 April 2024 Date of Decision: 22 April 2024 Date of Reasons for Decision: 13 June 2024 ________________________ REASONS FOR DECISION ________________________ Background 1. There are two sets of proceedings relating to a Partial Final Award on merits dated 8 August 2023 (“ Award ”) made in an arbitration commenced by Mr Sun (“ Sun ”) in Hong Kong against the Hong Kong & China Gas (Jilin) Limited (“ Gas ”) on 29 June 2017 (“ Arbitration ”). HCCT 64/2023 is Sun’s application to, firstly, set aside the Award on the ground that the tribunal had exceeded its jurisdiction in awarding an equitable set-off invoked by Gas in the Arbitration, and secondly, for leave to appeal against the Award on questions of law pursuant to sections 5 and 6 of Schedule 2 (“ Schedule ”) to the Arbitration Ordinance (“ Ordinance ”). HCCT 84/2023 is Gas’ application for leave to enforce the Award as a judgment of the Court. 2. Under section 6 of the Schedule, an appeal under section 5 may not be brought except with the leave of the Court, and further, an application for leave to appeal must be determined without a hearing, unless it appears to the Court that a hearing is required. 3. Before the joint substantive hearing of the originating summonses, the Court gave directions that the hearing will be confined to the consideration of: (1) whether leave to enforce the Award should be granted; (2) the setting aside application; and (3) for the application for leave to appeal, the issue only of whether the Schedule applies to the arbitration agreement under which the Arbitration was commenced. 4. In the skeleton submissions filed for Counsel for Sun prior to the hearing, it was indicated that Sun will not pursue the setting aside application. 5. The essential question for determination in Sun’s challenge to the Award is, accordingly, whether the arbitration agreement in the underlying contract between the parties (“ Contract ”), entered into before the commencement of the Ordinance, is one which “ provides that arbitration under the agreement is a domestic arbitration ”, for the Schedule to apply by virtue of section 100 of the Ordinance. If the Schedule does not apply, then Sun has no right to appeal against the Award. 6. At the conclusion of the hearing on 22 April 2024, I dismissed the application to set aside and for leave to appeal against the Award, and gave leave for the Award to be enforced. The following sets out the reasons for my decision. The arbitration agreement 7. The arbitration clause in question provides for Hong Kong law to apply to the resolution of disputes, and for all disputes arising out of the performance or interpretation of the Contract or relating to the Contract to be resolved by HKIAC arbitration in Hong Kong, in accordance with the current UNCITRAL Arbitration Rules. 8. There is no dispute, that there is no express provision in the relevant arbitration clause that the arbitration is domestic, and no mention or reference made in the clause at all to domestic arbitration. 9. On behalf of Sun, it was argued that if Sun and Gas had arbitrated their dispute before the commencement of the Ordinance on 1 June 2011, it would have been a domestic arbitration, because: (1) Sun held a Hong Kong identity card, and had provided a Hong Kong business address in the Contract for correspondence; and Gas (despite being a BVI company) had a telephone and fax number in Hong Kong, had a legal representative who had an office and a team of assistants in Hong Kong, had provided in the Contract a correspondence address of Gas’s parent company in Hong Kong, and was managed and controlled by its parent company with headquarters in Hong Kong; such that both Sun and Gas had places of business in Hong Kong; (2) the place of arbitration would be Hong Kong; (3) Hong Kong was where a substantial part of the obligations of the commercial relationship was performed, or the place with which the subject matter of the dispute was most closely connected, since the Contract for the sale and purchase of shares in a BVI company was signed by the parties in Hong Kong, and the transaction was to be completed in Hong Kong; (4) the parties did not expressly agree that the subject matter of the arbitration agreement related to more than one country; (5) the parties did not expressly agree that their arbitration agreement was to be treated as an international arbitration agreement, or that their dispute was to be arbitrated as an international arbitration. 10. Mr Wong, Counsel for Sun, argued that at the time when the parties entered into the arbitration agreement, they had agreed and intended that there would be a right to apply for leave to appeal on questions of law arising out of the Award, as they had not at the time of the Contract chosen the arbitration to be international, and had not choosen to opt out of Part II of the repealed Ordinance providing for international arbitrations under the Model Law. 11. On the above basis as to the contractual bargain at the time of the Contract, and before the enactment of the Ordinance, it was argued for Sun that the parties had intended, and their arbitration agreement had impliedly provided, that the arbitration would be a domestic one. 12. What Mr Wong for Sun sought to do, therefore, was to revert to making submissions and raising arguments on matters which had to be debated before the Ordinance came into effect - when the very aim of the Ordinance was to dispense with the need to make such arguments by dispensing with the distinction between domestic and international arbitrations. The Ordinance introduced a unitary regime as from 1 June 2011, and all provisions of the Ordinance are applicable to arbitrations in Hong Kong, whether they were formerly regarded as international, or domestic. The provisions in the Schedule only apply if parties choose to make them applicable, as section 99 of the Ordinance states: “An arbitration agreement may provide expressly that any or all of the following provisions are to apply - (a) section 1 of Schedule 2; (b) section 2 of Schedule 2; (c) section 3 of Schedule 2; (d) sections 4 and 7 of Schedule 2; (e) sections 5, 6 and 7 of Schedule 2.” 13. In turn, section 100 of the Ordinance provides for an automatic opt-in of the Schedule: “All the provisions in Schedule 2 apply, subject to section 102, to - (a) an arbitration agreement entered into before the commencement of this Ordinance which has provided that arbitration under the agreement is a domestic arbitration; or (b) an arbitration agreement entered into at any time within a period of 6 years after the commencement of this Ordinance which provides that arbitration under the agreement is a domestic arbitration.” 14. It is recognized that the purpose of section 100 was to address the concern which had been raised by the construction industry, because main construction contracts in Hong Kong use standard form agreements which include a reference to “domestic arbitration”, and it was recognized that users of these standard form contracts may continue to employ the term “domestic arbitration” in these contracts for some time after the commencement of the Ordinance. If they so do, then by virtue of section 100, the Schedule automatically applies since the term “domestic arbitration” is so used. 15. In A v D [2017] 1 HKLRD 779 , this Court considered sections 99 and 100 of the Ordinance, and held that section 100(1) refers to an arbitration agreement “ which has provided that ” arbitration is a domestic arbitration, and that the Schedule only applies in those circumstances. The fact that the parties to the arbitration agreement are Hong Kong residents, or have a place of business in Hong Kong, such that the arbitration would have been domestic under the repealed Ordinance, cannot per se mean that they have “provided” for a domestic arbitration, and that the Schedule should apply. This is contrary to the intention of and purpose for the Ordinance, to do away with the distinction between domestic and international arbitrations, and to provide for a unitary regime. It cannot be the intention of the legislature for section 100 to be used as an avenue, after 2011, for the parties once again to delay the enforcement of awards by making the distinction in legal proceedings by reference to the characteristics of the parties and the manner of performance of the underlying contract, when the very purpose for introducing a unitary regime is to facilitate the speedy resolution of disputes by arbitration, and to cut out unnecessary expenses and delay. 16. At paragraph 23 of the decision in A v D , it was observed: “ If the intention behind the transitional provisions contained in Part 11, and in particular section 100 of the Ordinance, is that Schedule 2 is to apply to domestic arbitrations, or domestic arbitration agreements within the meaning of the repealed Cap 341 , section 100 could simply have provided for Schedule 2 to apply to “ domestic arbitrations ”, or to “ domestic arbitration agreements ”. As presently drafted, section 100(a) and (b) refer, not only to an arbitration agreement, but also to provision having been made in the agreement, that the arbitration is a domestic one.” (Emphases added) 17. In Employer v Consultant [2022] HKCFI 887 , this Court held on the particular facts of the case that since the arbitration agreement in question expressly provided for the 1993 Domestic Rules (for domestic arbitration) to apply to the arbitration, there was implied provision for the arbitration to be a domestic arbitration, and section 100 applies. At paragraph 36 of the Decision, this Court made it clear that it was not a case of the Employer simply relying on the arbitration agreement being domestic by operation of the law at the time of the agreement, under the repealed Ordinance, to claim that the parties had “provided” for a domestic arbitration – as is the case here. 18. There is nothing in the arbitration clause agreed between Sun and Gas, from which this Court can find that there is any implied provision for the arbitration to be domestic. 19. Mr Wong referred to the fact that when the Consultation Paper on the Reform of the Law of Arbitration was issued by the Department of Justice in 2007, the language proposed for the intended section 100 was: “where an arbitration agreement entered into before, or at any time within a period of 6 years after, the commencement of the new Ordinance stipulates that an arbitration under the arbitration agreement shall be a domestic arbitration, then the Schedule shall automatically apply…” When enacted, section 100 was changed to “an arbitration agreement… which has provided …”. 20. Mr Wong pointed out that there is a difference between the words “stipulate” and “provide”, and that the latter is wider, as “stipulate” suggests something said expressly. The argument therefore is that the present language of section 100 does not require any express provision for the arbitration to be a domestic one. 21. “Provide” is defined in the Oxford Dictionary to mean “stipulate”, so I am not persuaded that there is any material or real distinction between “provide” and “stipulate”. Even if there was any distinction, I do not accept that any such distinction can take this case further. Properly construed, the arbitration clause in the Contract cannot be read to provide, either expressly or by implication, that the arbitration under the clause would be a domestic arbitration. Principle of legality 22. Nor am I not persuaded by Counsel for Sun in this case, that I should depart from the findings and analyses made in A v D and Employer v Contractor , to conclude that the Schedule applies to the Arbitration in this case by invoking the principle of legality, or on the basis that the Court should uphold the contractual bargain between the parties in this case. 23. Counsel argued that the right to access to the Court is a fundamental right entrenched under Article 35 of the Basic Law, and that section 100 (a), read together with section 81 (2)(c) and (3) of the Ordinance, has the effect of abrogating the fundamental right of access of parties to agreements made before 1 June 2011, where the conditions set out for the application of the Schedule are not satisfied. Applying the common law principle of legality, Counsel argued that the conditions set out in section 100 (a) of the Ordinance should be construed in such a way so as not to abrogate the right of access to the courts, as the rule requires that any abrogation or restriction of fundamental rights by statute should be done clearly and unmistakably. Quoting from the judgment of the Court of Final Appeal in A v Commissioner of Independent Commission Against Corruption [2015] 15 HKCFAR 362 , reliance is placed on the following observation: “By virtue of the principle of legality, human rights and fundamental principles of law, even where derogable, cannot be overridden except by express words or necessary implication.” 24. Mr Wong argued that there is nothing to suggest that the Ordinance intended to abrogate or reduce in scope the right of access to the court for leave to appeal on questions of law in domestic arbitrations, which existed before the enactment of the Ordinance. He contended that section 100 confirms that the right should continue, if the agreement has provided that the arbitration is a domestic one. 25. I cannot agree with these arguments, that Part 11 of the Ordinance was intended to generally retain the right of appeal for parties to arbitration agreements. The whole scheme under the Ordinance is to exclude the distinguishing features of domestic arbitrations and to provide that particular features and provisions which only applied to domestic arbitrations under the repealed Ordinance could continue to apply only where parties expressly and clearly choose to adopt the provisions of the Schedule. The provisions in the Schedule only apply automatically , where section 100(a) or (b) is satisfied. 26. In China International Fund Limited v Dennis Lau & Ng Chun Man Architects & Engineers (HK) Limited HCMP 2472/2014, the Court of Appeal considered the scheme of the Ordinance, and the constitutionality of the limitation on the rights of appeal (albeit the right of appeal under section 81(4) in particular) of the Ordinance. Hon Lam VP (as he then was) was satisfied that the limitation on the rights of appeal under the Ordinance is consistent with the philosophy underpinning arbitration, and that the limitation is proportionate, ie not more than what was necessary to achieve the legitimate aims, and falls within the reasonable range of options for achieving same. In arriving at such conclusion, His Lordship noted that although the right of appeal under the scheme of the Ordinance is more limited than in usual proceedings before the High Court, parties are able under section 99 to opt for some, or all, of the provisions in the Schedule to apply to their arbitration agreement. Whether the Court of Appeal may play a greater role than the one under the primary scheme of the Ordinance is entirely a matter of the parties’ choice. 27. In the light of the analysis undertaken by the Court of Appeal, and also in view of what I regard to be the clear and express language used in section 100(a) of the Ordinance, I do not consider that it is justifiable to read down or limit the scope of section 100(a), by adopting a construction which is contrary to the plain meaning of the subsection and the entire legislative intent of the Ordinance: to limit the role and intervention of the courts in arbitrations (as stated in section 3 and in particular section 3(2)(b) of the Ordinance). As Mr Li contended for Gas, fundamental rights can be abrogated by statute, and section 100 is clear and unambiguous in the exclusion of the right of appeal provided for in the Schedule. Where the parties have chosen arbitration as the agreed manner of resolution of their disputes, their right of access to the courts is understood and accepted to be limited. There is nothing unfair or unjust to hold these parties to their agreement. This is also part of the contractual bargain, on which Mr Wong placed much emphasis in his submissions. 28. Mr Li also draws support from the observations made by the Court of Appeal in Maeda Kensetsu Kogyo Kabushiki Kaisha v Bauer Hong Kong , HCMP 1342 of 2017, 4 September 2017 (at paragraph 13): “Mr Pennicott rightly reminded us that the application is made in the context of an intended appeal against an arbitration award and in line with the underlying rationale for arbitration, there should be a presumption of finality for arbitration . We wholeheartedly endorse arbitration as an alternative dispute resolution process and there are regimes in the Arbitration Ordinance substantially limiting the rights of the parties coming to court to challenge an arbitration award. Such regimes have been held repeatedly by this Court to be proportionate and constitutionally sound ...” (emphases added) 29. I do not consider the English case of Shell Egypt West Manzala GmbH v Dana Gas Egypt Ltd [2010] 2 All ER (Comm) 442, to be helpful in supporting Sun’s argument, that his right of appeal should not be excluded. Shell Egypt holds that the parties’ agreement to the arbitration award being final, conclusive and binding, and the provision in the UNCITRAL Arbitration Rules (which refer to an award being final and binding, and under which the Arbitration was conducted in this case) should not be construed as excluding a right of appeal against the award. The provisions on appeal under the UK Arbitration Act are different to those under the Ordinance. Under the UK Arbitration Act, the parties have the right to appeal on a question of law, unless otherwise agreed. In contrast, the right of appeal is excluded under the Ordinance, unless the parties have opted for the Schedule to apply or the Schedule applies by virtue of section 100. The issue in this case is whether or not the parties to the arbitration agreement have opted for the Schedule to apply, under the Ordinance. 30. The arbitration agreement between Sun and Gas must be determined by the governing law at the date when the dispute is decided and the agreement construed, namely the Ordinance and the regime now provided by the Ordinance. Section 100(a) only makes exception for agreements made before the commencement of the Ordinance, but only if such an agreement has provided that arbitration under the agreement is a domestic arbitration. In my judgment, the arbitration agreement in the Contract makes no such provision. The contractual bargain? 31. The submission made by Counsel, that the Court should respect and uphold the contractual bargain between Sun and Gas as to the nature and manner of their arbitration, begs the question of what their alleged bargain is. Whilst Sun argued that at the time when the Contract and arbitration agreement was made, the parties had intended the arbitration to be domestic because of the matters on which he now relies, this is not unequivocal. Gas is a company incorporated in the BVI, and its registered address is a PO Box in the BVI. Its representative had a telephone and fax number in Hong Kong only. The Hong Kong address given for Gas is one for service of notice and communication, pursuant to clause 10 of the Contract. It is still arguable whether Gas itself had or has a place of business in Hong Kong. The Contract is for the sale and purchase of shares of a BVI company, and although completion of the sale and purchase was to take place in Hong Kong, any shares sold and bought have to be registered in the register of the BVI company. There may be other relevant factors, such as Sun’s place of residence, which have to be taken into consideration, in an exercise of determining where the respective places of business of the parties were, where a substantial part of the obligations of the parties was to be performed, or where the subject matter of the dispute was most closely related. 32. These are matters which would have been the subject of debate under the repealed Ordinance, to decide whether the Arbitration is domestic, or international, and are far from being beyond dispute. It is therefore not clear, as Sun would suggest, that if the dispute was to be arbitrated before 1 June 2011, it would have been a domestic arbitration as the parties had intended, and that he would have had the right to seek leave to appeal on questions of law. 33. According to Counsel for Sun, for parties to agreements made before the commencement of the Ordinance, the Court should not look at whether they had expressly provided for their arbitration to be domestic - as such a provision was unnecessary under the repealed Ordinance, but should instead ascertain the parties’ intention by looking at whether the domestic parties had agreed to make their arbitration international, and if they had not, their intention must have been to have a domestic one. 34. In my judgment, the approach advocated by Mr Wong is against the express language of section 100 and is inappropriate, bearing in mind the scheme introduced by and the legislative intent and purpose for the amendments made under the enactment of the Ordinance. 35. I accept the submissions made by Mr Li, that if the legislative intent for the enactment of the Ordinance was to recognize that, for agreements made before the commencement of the Ordinance, parties who had not opted for international arbitration in their agreements should somehow be presumed to have agreed to domestic arbitration, section 100 would have provided for this, and would not be in the present terms. In its present form, section 100(a) does not state that the Schedule applies to an arbitration agreement entered into before the commencement of the Ordinance “which has not provided that arbitration under the agreement is an international arbitration”. Nor does it state that the Schedule applies to an arbitration agreement made between domestic parties before the commencement of the Ordinance. Disposition 36. Having considered all the submissions made by Counsel, I am not persuaded that the arbitration agreement between Sun and Gas has provided that their Arbitration is a domestic arbitration, for sections 5 and 6 of the Schedule to apply. There is no permissible appeal against the Award, and the application for leave to appeal made in the Originating Summons must be dismissed. 37. The setting aside application was not pursued, and no valid ground was shown that enforcement of the Award should be refused. It follows that leave should be granted to enforce the Award. 38. The costs of the Originating Summonses (including any costs reserved) were ordered to be borne by Sun, to be paid to Gas on indemnity basis. (Mimmie Chan) Judge of the Court of First Instance High Court Mr Stewart Wong SC, Mr Frederick HF Chan, and Mr Dexter Leung, instructed by Tanner De Witt, for the plaintiff in HCCT 64/2023 & for the respondent in HCCT 84/2023 Mr Laurence Li SC, Mr Martin Ho, and Mr Sik Chee Ching, instructed by Mayer Brown, for the defendant in HCCT 64/2023 & for the applicant in HCCT 84/2023 Look up this case on Lawcite Noteup",
  "length": 26602,
  "headers_seen": [
    "Background",
    "The arbitration agreement",
    "Principle of legality",
    "The contractual bargain?",
    "Disposition"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2024/1597",
  "query": "arbitration",
  "ts": "2025-10-14T11:20:36",
  "ok": true
}