{
  "title": "YU TAI HING CO. LTD. V. SOLAR LIGHT INVESTMENT LTD. AND OTHERS | [2001] HKCFI 34 | HKLII",
  "court": null,
  "year": 2001,
  "date": "2025-10-08",
  "content": "HKLII Databases Court of First Instance [2001] HKCFI 34 YU TAI HING CO. LTD. V. SOLAR LIGHT INVESTMENT LTD. AND OTHERS Judgment Information Date 19 Jul, 2001 Action No. HCA6681/1998 Neutral Cit. [2001] HKCFI 34 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCA6681/1998 HCA006681/1998 XCHRX YU TAI HING CO. LTD. v. SOLAR LIGHT INVESTMENT LTD. AND OTHERS HCA006681/1998 HCA6681/1998 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE ACTION NO.6681 OF 1998 -------------------- BETWEEN YU TAI HING COMPANY LIMITED Plaintiff AND SOLAR LIGHT INVESTMENT LIMITED 1st Defendant HERO NETWORK LIMITED 2nd Defendant IP LAM ON 3rd Defendant LI HUNG HON JOHNNY 4th Defendant TSE CHING YIN NANCY 5th Defendant MAN SAI KWONG PHILIP 6th Defendant LI HUNG FU REDY 7th Defendant MAJESTIC LIMITED 8th Defendant -------------------- Coram: Deputy High Court Judge Poon in Chambers Date of Hearing: 20 July 2001 Date of Judgment: 20 July 2001 Date of Handing Down Reasons for Judgment: 26 July 2001 -------------------------------------------------------- REASONS FOR JUDGMENT -------------------------------------------------------- Introduction 1. This is an appeal against the master's order dated 14 May 2001 ordering the 8th defendant to pay the plaintiff interim payment on account of its liability in respect of the use and occupation of Unit Nos. 1 and 2, 1/F, Fortune Court, Nos. 4 - 6 Tak Hing Street, Kowloon (\"the Property\"): (a) for the period between 1 February 2001 and 31 March 2001 in the sum of $152,000 as mense profit; and (b) from 1 April 2001 onwards until final judgment or further order a periodical sum of $76,000 per month. 2. On 20 July 2001, after hearing the parties, I dismissed the appeal with costs. The reasons appear below. Background facts 3. On 28 April 1998, the plaintiff commenced the present proceedings to enforce two mortgages and a related guarantee against various parties. One of the mortgages was made between the 1st defendant as mortgagor and the plaintiff as mortgagee on 19 April 1997 in respect of the Property. On 22 May 2000, the plaintiff obtained an order for vacant possession of the Property against the 1st defendant (\"the Possession Order\"). 4. On 17 August 2000, the 8th defendant applied to join as a defendant on the basis that it was a tenant of the 1st defendant pursuant to a tenancy agreement dated 30 April 1998. The application was allowed on 1 December 2000. Shortly thereafter, the plaintiff amended the Statement of Claim to claim against the 8th defendant vacant possession of the Property. It is the plaintiff's case that it had no knowledge of and had not given any consent to the alleged tenancy between the 1st and 8th defendant. In its defence filed on 30 December 2000, the 8th defendant alleged that the plaintiff had given oral consent to the tenancy or alternatively, the plaintiff had waived its right to recover vacant possession of the Property prior to the termination of the tenancy on the basis that it had knowledge of the tenancy and allowed the 8th defendant to remain there for more than two years. 5. On 5 January 2001, the plaintiff's solicitors wrote to the 8th defendant's former solicitors asking if the 8th defendant was prepared to pay interim payment for the use and occupation of the Property since 1 August 2001 until trial and for that purpose to execute a consent summons. The 8th defendant's former solicitors replied on the following day stating that the 8th defendant had paid rent to the 1st defendant until then and suggesting that the interim payment to be commenced from the date of the proposed consent summons. On 21 February 2001, the plaintiff's solicitors proposed to the 8th defendant's former solicitors that the 8th defendant was to pay as interim payment $76,000 per month from 1 February 2001 pending the outcome of the trial. However, there was no reply from the 8th defendant's former solicitors. Accordingly, on 16 March 2001, the plaintiff took out the summons for interim payment. In the event, the master allowed the application. 6. Subsequent to the learned master's order for interim payment, the 8th defendant had repeatedly applied for a stay of the order pending appeal but was unsuccessful. Its application for extension of time to make the payment also failed. On 29 May 2001, the plaintiff obtained an unless order whereby if the 8th defendant failed to make the interim payment by 9 June 2001, its defence be struck out and the plaintiff be at liberty to enter judgment. The 8th defendant did not comply with the unless order. In the end, on 12 July 2001, default judgment was entered against the 8th defendant for vacant possession of the Property and mense profit and damages to be assessed. Submissions of the 8th defendant 7. The notice of appeal filed on 15 May 2001 contained three grounds of appeal. At the hearing before me, Mr Lam, counsel for the 8th defendant, did not seek to rely on any of them. Instead, he sought to argue his case along the following lines. 8. The 8th defendant claimed under the 1st defendant as mortgagor and could not dispute its title as landlord. Accordingly, in order to remain on the Property, the 8th defendant must continue to pay rent to the 1st defendant. The plaintiff, having by consent or acquiescence allowed the 1st defendant to remain in physical possession of the Property, should not be allowed to recover mense profits from those claiming under the 1st defendant. Counsel complained that the learned master's order would oblige the 8th defendant to pay twice for occupying the Property. He therefore contended that the first part of the learned master's order should be set aside and the second part be varied to the extent that the plaintiff was to receive the payment as receiver. Submissions of the plaintiff 9. Mr Leung, counsel for the plaintiff, submitted that the appeal was misconceived. The interim payment was for use and occupation of the Property. The 8th defendant paid the rent to the 1st defendant with notice of the Possession Order at its own peril: Moss v Gallimore [1775-1802] All ER Rep 102 , 1 Doug KB 279. No merits shown 10. In my view, Mr Lam's submissions did not sit well with the 8th defendant's pleaded case in its defence. There it was alleged that either the tenancy agreement was binding on the plaintiff either it had given consent or had by conduct waived the right to recover possession from the 8th defendant. In short, for one reason or another, the 8th defendant was entitled to remain in possession of the Property. Naturally, it had to pay for the use and occupation of the same. When the plaintiff had obtained the Possession Order and after the 8th defendant had notice of it, the 8th defendant should make payment to the plaintiff who, the 8th defendant said, was bound by the tenancy. The 8th defendant should have no objection to make the interim payment as suggested by the plaintiff's solicitors in January 2001. That was apparently the position taken by its former solicitors in their correspondence with the plaintiff's solicitors. On this analysis, there was no basis for resisting the plaintiff's subsequent application for interim payment. 11. Mr Lam's contention premised on the assertion that the plaintiff had allowed the 1st defendant to be in physical possession. That was not correct. The plaintiff had already obtained the Possession Order but had been unable to obtain vacant possession yet, apparently because of the dispute raised by the 8th defendant. That was quite different from allowing the 1st defendant to remain in physical possession. Further, on the evidence before me, the 8th defendant had not explained why it considered legally bound to continue to pay the rent to the 1st defendant after it had notice of the Possession Order. Mr Lam submitted that the 8th defendant was so bound under the tenancy. But he could not answer the question why after the Possession Order, the 1st defendant was entitled to receive rent from the 8th defendant. Indeed, there was nothing in the evidence before me to suggest that the 1st defendant had ever demanded the 8th defendant to continue to pay the rent or had made such a claim. On the contrary, the plaintiff's solicitors had invited the 1st defendant to take part in the application before the master if it considered that the plaintiff was not entitled to the interim payment. Neither did the 1st defendant respond to this invitation nor appear at the hearing below. 12. Mr Lam complained that the interim order made the 8th defendant pay twice. I did not consider it a valid complaint. As rightly pointed by Mr Leung, if the 8th defendant had ever paid the rent to the 1st defendant after notice of the Possession Order, it did it as its own peril. It simply did not affect the plaintiff's right to interim payment. Conclusion 13. For the foregoing reasons, this appeal must fail. I dismissed it accordingly with costs. (J. Poon) Deputy High Court Judge Representation: Mr Richard Leung, instructed by Messrs Fairbairn Catley Low & Kong, for the Plaintiff Mr Lam Shun Chiu, instructed by Messrs Christopher K.Y. Wong & Associates, for the 8th Defendant Look up this case on Lawcite Noteup",
  "length": 9248,
  "headers_seen": [
    "Introduction",
    "Background facts",
    "Submissions of the 8th defendant",
    "Submissions of the plaintiff",
    "No merits shown",
    "Conclusion"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2001/34",
  "query": "possession order",
  "ts": "2025-10-17T10:41:38",
  "ok": true
}