{
  "title": "RUSCHEMALLIANCE LLC V. LINDE GMBH AND ANOTHER | [2025] HKCFI 3720 | HKLII",
  "court": null,
  "year": 2025,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2025] HKCFI 3720 RUSCHEMALLIANCE LLC V. LINDE GMBH AND ANOTHER Judgment Information Date 5 Aug, 2025 Action No. HCCT11/2025 Neutral Cit. [2025] HKCFI 3720 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCCT11/2025 html PUBLIC \"-//W3C//DTD XHTML 1.0 Transitional//EN\" \"http://www.w3.org/TR/html4/loose.dtd\" HCCT11/2025 RUSCHEMALLIANCE LLC v. LINDE GMBH AND ANOTHER HCCT 11/2025 [2025] HKCFI 3720 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO 11 OF 2025 ____________________ IN THE MATTER of a Partial Award dated 17 May 2024 in HKIAC/A23039(A23104) made at the HKIAC and IN THE MATTER of section 81 of the Arbitration Ordinance ( Cap 609 ) and Article 34 of the UNCITRAL Model Law on International Commercial Arbitration and IN THE MATTER of Order 73 of the Rules of the High Court ( Cap 4A ) ____________________ BETWEEN RUSCHEMALLIANCE LLC Plaintiff and LINDE GMBH 1st Defendant LINDE PLC 2nd Defendant ____________________ Before: Hon Anthony Chan J in Chambers Date of Hearing: 6 August 2025 Date of Ruling: 6 August 2025 ________________________ D E C I S I O N ________________________ 1. The main issue in the Hadkinson application is about the lack of compliance with this court’s Order dated 4 January 2024 made in HCCT 19/2023. The position maintained by the Plaintiff is that it is unable to comply with the Order. However, the arguments advanced by Mr So on behalf of the Plaintiff seem to suggest that it is not a matter of being unable to comply with the Order, but that compliance will disadvantage the Plaintiff. 2. Compliance with a court order is strict. Prima facie , the only relevant issue is whether compliance is possible under Russian law. I disagree with the Plaintiff’s formulation of the expert issues. In short : (1) Many of the issues seek to rekindle arguments which were previously raised before Mimmie Chan J or this court and were rejected. (2) Some of the issues go back to historical events which are not relevant to the compliance of the Order. (3) With the exception of two minor points, the issues are simply not relevant. The points being : (a) the Ruling of the Russian court dated 8 January 2023, which should be supplied to the SJE; and (b) the available procedural mechanisms for the Plaintiff to withdraw or abandon the Russian proceedings in question, which can be incorporated in a properly formulated issue. (4) In respect of the suggestion that claims against third parties may be compromised if existing Russian proceedings are terminated, I understand from para 76 of the Decision of Mimmie Chan J dated 27 September 2023 that it was alleged by the Plaintiff that the third parties were jointly and severally liable to it. There is no evidence of any action taken by the Plaintiff to bring separate proceedings against the third parties to preserve its rights. In any case, I am unable to see how issue 3.2(e) proposed by the Plaintiff deals with the point. (5) Finally, about the alleged potential liability on the part of the Plaintiff’s directors, the point is not properly supported by evidence. (Anthony Chan) Judge of the Court of First Instance High Court Mr Wing So, instructed by Chan Ching Man & Co, for the Plaintiff Mr Mohammed Talib (Solicitor Advocate), of Pinsent Masons, for the Defendants Look up this case on Lawcite Noteup",
  "length": 3455,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2025/3720",
  "query": "Model Law",
  "ts": "2025-10-16T10:53:38",
  "ok": true
}