{
  "title": "DONALD W. SHIELDS V. MARY CHAN (OTHERWISE KNOWN AS GING TAK CHOW OTHERWISE KNOWN AS MARY CHAN PO MAN) | [1972] HKCA 248 | HKLII",
  "court": null,
  "year": 1972,
  "date": null,
  "content": "HKLII Databases Court of Appeal [1972] HKCA 248 DONALD W. SHIELDS V. MARY CHAN (OTHERWISE KNOWN AS GING TAK CHOW OTHERWISE KNOWN AS MARY CHAN PO MAN) Judgment Information Date 23 Feb, 1972 Action No. CACV30/1971 Neutral Cit. [1972] HKCA 248 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History CACV30/1971 CACV30/1971 DONALD W. SHIELDS v. MARY CHAN (otherwise known as GING TAK CHOW otherwise known as MARY CHAN PO MAN) Coram: Blair-Kerr, S.P.J., Briggs and Pickering, JJ. ________________________ JUDGMENT ________________________ Briggs J: 1. The Respondent is the registered owner of a house which is built on Section 8, Lot 351, Clearwater Bay Road, in the New Territories. 2. The Appellant is employed by a well known charitable organisation called the Oxford Committee for Famine Relief, better known as Oxfam. He holds the position of Field Director in the Far East. 3. On 9 August 1968 the Respondent let the first floor of her house to the Appellant for a period of two years at the rent of $1,000 per month, payable in advance. This storey is a self contained flat. 4. The lease contained an option to renew in the following terms:– “The Landlord will, on the written request of the Tenant made not less than one calendar month before the expiration of the term hereby created, if there shall not at the time of such expiration be any breach or non-observance of any of the covenants and conditions on the part of the Tenant hereinbefore contained, grant to the Tenant a lease of the said demised premises for a further term of TWO (2) years from the date of expiry of the term hereby created at the same rent and subject to the same conditions and provisions, other than the present provision for renewal, as are herein contained. Provided that in the event of a devaluation of the Hong Kong dollar taking place the rent for the further term of TWO (2) years shall be adjusted by negotiation.” 5. The lease also contained the following two provisions which are material to this appeal:– “The Tenant hereby agrees with the landlord:– (1) not to do or suffer to be done anything in the said demised premises which might cause or lead to the ................. the forfeiture of the lease under which the said building is held ............................. (2) to pay all charges in respect of gas, water and electricity used in the said premises.” 6. On July 9, the Appellant wrote to the Respondent seeking to exercise his option to renew the lease. This however the Respondent declined to do alleging that the Appellant was in breach of the lease inasmuch as he was using part of the premises as an office for his employers’ affairs. Later it was alleged that he was in breach of other conditions or covenants in the lease. We are here only concerned with one of these – it was alleged that the Appellant had not paid anything for the amount of water he had consumed during the two years period of the lease. 7. The Appellant brought proceedings against the Respondent for specific performance. The Respondent counterclaimed for possession and mesne profits. The Trial Judge held that the Appellant was in breach of his lease in that he had been using the premises as an office. He refused to grant a decree or specific performance to the Appellant, and made an order in favour of the Respondent for possession and mesne profits. Against this decision the Appellant appeals. 8. In addition the Trial Judge held that the Appellant was not in breach of the provision to pay for the water consumed. He held that the parties had agreed that a nominal sum should be paid for the water consumed only and he assessed this at $60 i.e. at $30 per annum. There is a cross appeal against this finding of the judge by the Respondent. I will first deal with the appeal and then with the cross appeal. 9. The lot on which the premises stands forms part of the subject matter of a Crown Grant dated March 25, 1966. There is no formal lease from the Crown but the Crown Grant contains the following special condition – “the lot shall be used for private residential purposes only”. 10. The Respondent’s case is that the Appellant used one room in the premises as an office for Oxfam and thus created a situation which would allow the Crown to exercise the power to re-enter the lot by virtue of the special condition in the Crown Grant set out above. 11. The relevant words of the actual provision of the Appellant’s lease are “not to do anything in the demised premises which might cause the forfeiture of the lease under which the building is held”. 12. There is no such lease but the case has been argued as if the words “Crown Grant” were substituted for “lease” in that provision. 13. In the course of his argument for the Respondent Mr. Mills-Owens referred to a passage in the judgment of Lord Denning in United Dominions Trust (Commercial) Ltd. v. Eagle Aircraft Services Ltd. [1] in which he said that when a tenant is given an option to renew for a further term and there is a covenant to repair during such term, in order to exercise the option he must fulfil the covenant to repair according to the terms contained in the lease. “He is not entitled to excuse himself by saying that the want of repair is trifling”. 14. That case concerned the repurchase of certain aircraft and the above statement was made obiter. However it was based on the case of West County Cleaners v. Saly [2] where the tenant was in breach of a covenant to repair. We were also referred to Hare v. Nicholl [3] which was concerned with an option to repurchase shares of a highly speculative nature. Payment was to be made before a certain date. It was made 6 days late. It was held that time was of the essence of the contract in such a case, the option to repurchase had not been exercised in accordance with the conditions stipulated. 15. It will be seen that though it is true that an option to purchase or renew a lease must be exercised strictly in accordance with the conditions stipulated, each case depends very much on its own facts. 16. The evidence in the present case is that the Appellant and his family which consists of a wife and three daughters aged 15, 17 and 19 years, resided in the premises. The premises consist of three bedrooms, a dining and sitting room on an open plan, a kitchen and the usual offices. In addition, adjoining the kitchen is a small room, which was designed as a servant’s room. It can only be entered through the kitchen. 17. This room was furnished with a desk and two filing cabinets by the Appellant. And the Appellant used the desk when he wrote letters relative to his office as the Field Director of Oxfam. But other members of the family used this room for their own purposes. Any letters that came to him concerning Oxfam affairs would have come to this address. The telephone directory gives this address for “Oxfam”. The Appellant is the sole Field Director for Oxfam in the Far East and Oxfam rent no offices in Hong Kong or elsewhere in this part of the world. There is no evidence that the Appellant has any other paid occupation than his position with Oxfam. 18. There was also exhibited a visiting card and a report of Oxfam affairs for the year 1969 and 1970. The visiting card is the visiting card of the Appellant and bears his address. It also bears the address of Oxfam and the statement that the Appellant is the Field Director. However it is the Appellant’s visiting card not that of Oxfam. The report merely gives the address of the Field Director for the Far East as the premises in question. 19. The duties of the Appellant require him to travel in the Far East very extensively. And when he is in Hong Kong he has to inspect and supervise projects with which his organisation is connected. This is not a case where a man has to sit behind a desk for regular periods of time: it is not primarily an office job. There was no evidence that the Appellant worked at his desk for regular periods of time. There was no indication from the outside of the premises to connect them with Oxfam. There is no evidence of any business activity as such. No person was interviewed on the premises in connection with the Appellant’s work. There is no evidence that the premises were used to solicit assistance for Oxfam. 20. If a judge leased premises with a like term I do not think he would be in breach if he were to use a room to write his judgments. Nor do I think that a composer in similar circumstances would be in breach if he used a room for occasional composition. 21. I do not think that the Trial Judge with respect, drew a correct inference from the evidence. A person who came to the premises from the outside would see a family residing in a private flat. They would not see any signs of any activity other than domestic. Nor would such a person see any such activity if he entered the flat unless he penetrated through the kitchen into the servant’s room. 22. It is very material to consider the Crown Grant. At the time it was signed the lot was vacant. No buildings had been built upon it. The Grant gives permission to build three houses. And it is obvious that the purpose of the special condition that the lot shall be used for “private residential purposes only”, is that it was the intention that the area should be and remain a residential area. It was inserted to ensure that no factory, shop or similar building would be erected on the lot so as to mar the residential character of the area. 23. In my view there is no evidence that the Appellant used the premises in a manner other than for “private residential purposes”. The evidence comes to this, that the Appellant from time to time used a room in his residence for carrying on correspondence in connection with his employment. I do not consider that that, in the particular circumstances shown here, can result in an inference that the Appellant was in breach of this particular covenant in the lease. It follows therefore that I would allow this appeal. 24. Mr. Lee relied upon a second ground of appeal which was based upon the pleadings. He claimed that the Appellant’s tenancy was within the protection of the Tenancy (Notice of Termination) Ordinance. I do not think it necessary to deal with this ground of appeal having held that this Appellant must succeed on the first ground raised. 25. I will now deal with the cross appeal. For the purposes of the judgment I will continue to refer to Mr. Shields as the ‘Appellant’ and to refer to Mary Chan or Ging Tak Chow as the ‘Respondent’: though of course Mrs. Chow is the Appellant and Mr. Shields is the Respondent in the cross appeal. 26. As I have said, the Respondent has appealed against the finding of the Trial Judge that the Appellant was not in breach of the covenant to pay all charges in respect of water. 27. The premises were supplied with water from a well owned by a Mr. Lam who is a respected relative of the Respondent. He is a solicitor and she referred to him in her evidence as her “legal adviser”. He was present and took a major part in the negotiations between the Appellant and Respondent for the lease. And he drew up the written lease itself. 28. Mr. Lam in evidence said that during the negotiations preliminary to the signing of the lease, he agreed with the Appellant that the charges for water would be “reasonable”. Mr. Lam was to supply the water to the Respondent who would bill the Appellant for the amount. The Appellant’s evidence was that only a “nominal” charge would be made for the water. He said he was expressly told this by Mr. Lam. As I have said the Appellant sought to exercise his option to renew. 29. June 9th 1970. The Respondent refused to consider this request and on June 26, 1970 wrote and told the Appellant so. The reason for refusal was that the Appellant was in breach of the conditions of the lease is that the premises were being used for purposes other than domestic or residential. There is no mention of any failure to pay for water supplied. 30. No demand for payment was sent until July 7, 1970 when 23 months of the two years lease had already run. The sum of $1,840 was then demanded. The Appellant at once objected and stated that when the lease had been negotiated it was understood between the parties that only a nominal sum would be charged for water. 31. The Trial Judge pointed out that this matter depends entirely on the evidence. He found as a fact that Mr. Lam had played a considerable part in the negotiations for the lease and he accepted the evidence of the Appellant that the understanding was that there would only be a nominal charge for water. Indeed he went further. He was left, he said, with a strong impression that Mr. Lam’s action is billing the Respondent for $1,840 for water at that date was a strategic move to supply the Respondent with grounds for avoiding the renewal of the lease. 32. Mr. Mills-Owens first point is that the finding of the Trial Judge necessitated a finding that Mr. Lam was the agent of the Respondent. He, Mr. Mills-Owens said that to succeed on this point agency must be pleaded in the Statement of Claim or an agreement between the landlord and tenant to pay a nominal sum for the water supplied must be proved. No such agreement was proved and so the Appellant must rely on agency. This, he said, the Appellant should not be allowed to do since there is no pleading to this effect. 33. I think it is too late to take this objection in this Court. It should have been taken in the Court below. The result would have been, as Mr. Lee pointed out, an application to amend the pleadings which would not have been refused. However a more cogent point was taken by Mr. Mills-Owens. He admits that the Respondent never asked for any payment for the water supplied but, he says, the Appellant was not entitled to sit back and do nothing. He must at least tender the amount. And no tender was in fact made. 34. To support his contention he referred to Leung Yuk Pui v. Ko Chi Pang [4] and to two later cases Lam Sou Kan v. Siu Sing Sheung [5] and Wong Cheong Yue v. Fu Yuen Hing Kee [6] . 35. These three cases were brought under the Landlord and Tenant Ordinance. The decision in each case depends upon the particular facts and an interpretation of the relevant provision of the Ordinance. However the principle behind the decisions is that a tenant of premises protected by the Ordinance is not permitted to sit back and do nothing. He is not entitled to wait for the Landlord to apply to the Tenancy Tribunal to have the standard rent fixed and in the meantime pay no rent. His duty is to tender a reasonable amount. By analogy in the present case the Appellant was not entitled to sit back and wait until a demand for payment for water charges is made – he must tender a reasonable amount. 36. I do not think that these decisions assist the Respondent. In each case the tenant had agreed to pay a certain sum as rent. What the cases decide is that a tenant is not justified in withholding the payment of rent on the ground that it may be in excess of the standard rent when the standard rent is fixed. 37. In the present case the lease is silent as to the amount of water charges to be paid. The tenant remained there on the assurance that there would be only a nominal charge. 38. As soon as the Appellant received the demand for $1,840 for water he wrote to the Respondent asking for an explanation stating that the charge was to have been nominal. Indeed he wrote other letters later to the Respondent and to Mr. Lam but no explanation relative to his queries was given. 39. As the Trial Judge said “There was a perfectly legitimate dispute between (the Appellant) and Mr. Lam concerning the quantity (of water) supplied and the proper price to be charged therefor and until agreement had been reached upon the figure, or until the matter had been satisfactorily adjudicated by a competent court it could scarcely be said that (the Appellant) was unjustified in resisting the charge or that his failure to pay amounted to a breach of his covenant”. 40. I agree with those words of the Trial Judge. At the relevant time the Appellant had not committed a breach. Nor do I think that it was his duty to tender the nominal sum agreed upon. To hold otherwise would to give altogether an artificial interpretation to the words of the lease. 41. The lease does not specify the person whom the tenant is to pay for his water or electricity. Supposing at the time he sought to exercise the option to renew there was a dispute with the Electrical Company as to the amount of their charges, could it be said that the tenant was in breach? I think not. 42. I would dismiss the cross appeal. There can no longer be a decree of specific performance. But there will be judgment for the Appellant on the appeal with costs here and below. The order for payment of mesne profits is set aside. The cross appeal is dismissed with costs. M. Lee (Peter Mo & Co.) for Appellant. R. Mills-Owens (P.H. Sin & Co.) for Respondent. IN THE SUPREME COURT OF HONG KONG (APPELLATE JURISDICTION) CIVIL APPEAL NO. 30 OF 1971 (ON APPEAL FROM O.J. 1259/70) ________________________ BETWEEN DONALD W. SHIELDS Appellant (Plaintiff) and MARY CHAN otherwise known as GING TAK CHOW otherwise known as MARY CHAN PO MAN Respondent (Defendant) ________________________ ( G.G. Briggs ) Puisne Judge 24th February, 1972 [1] 1968 1 W.L.R. 74 at p. 81 [2] 1966 3 All E.R. 210 [3] 1966 1 All E.R. 285 [4] 1955 H.K.L.R. 124 [5] 1962 H.K.L.R. 215 [6] 1967 H.K.L.R. 265 Look up this case on Lawcite Noteup",
  "length": 17573,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkca/1972/248",
  "query": "mesne profits",
  "ts": "2025-10-16T12:11:11",
  "ok": true
}