{
  "title": "NG CHI WING AND ANOTHER V. MOK CHUNG TIM T/A MOK KIM KEE | [1982] HKCFI 83 | HKLII",
  "court": null,
  "year": 1982,
  "date": null,
  "content": "HKLII Databases Court of First Instance [1982] HKCFI 83 NG CHI WING AND ANOTHER V. MOK CHUNG TIM T/A MOK KIM KEE Judgment Information Date 2 May, 1982 Action No. HCA3826/1981 Neutral Cit. [1982] HKCFI 83 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCA3826/1981 HCA003826/1981 NG CHI WING AND ANOTHER v. MOK CHUNG TIM t/a MOK KIM KEE HCA003826/1981 H. C. No. 3826 of 1981 Final judgment entered for mesne profits at a given rate - Whether landlord entitled to have mesne profits assessed later at a higher rate. IN THE SUPREME COURT OF HONG KONG HC No. 3826 of 1981 BETWEEN NG CHI WING Plaintiffs LEUNG HOI CHING AND MOK CHUNG TIM trading as MOK KIM KEE Defendant ____ Coram: Rhind, J. Date: 3 May 1982 ____________ JUDGMENT ____________ 1. On the 18th January 1982 the plaintiffs obtained a default judgment against the defendant in the following terms - \" FINAL AND INTERLOCUTORY JUDGMENT No defence having been served by the defendant herein, IT IS THIS DAY ADJUDGED that the de endant do deliver to the plaintiff vacant possession of the quit premises known as No. 48 Reclamation Street, Ground Floor, Kowloon, in the Colony 'of Hong Kong erected upon the piece of parcel of ground registered in the Land Office as Kowloon Inland Lot No. 9072 and that the defendant do pay the plaintiffs arrears of rent and/or mesne profits at the rate of $4,200 per month from the 1st day of June, 1981 until the day of vacant possession is delivered up to the plaintiffs and that the defendant do pay the plaintiffs damages to be assessed and that costs of this action to be taxed\". 2. That default judgment stemmed from a statement of claim dated the 9th June 1981. The material facts pleaded were extremely simple. They merely were to the effect that the plaintiffs had let the suit premises to the defendant for three years from the 1st June 1978 at a rental of $4,200 per month. That term had expired by effluxion of time on the 31st May 1981, and the defendant had failed to vacate. 3. The relief sought by the plaintiffs in that statement of claim was as follows - \" (1) Vacant possession of the said premises; (2) Arrear of rent and/or mesne profits at the rate of $4,200 per month from the 1st day of June, 1981 until the date of vacant possession is delivered up to the plaintiffs: (3) Damages; (4) Costs of this action; and (5) Further and/or other reliefs.\" 4. It is common ground that \"mesne profits\" is the term used to describe the damages for trespass to which a landlord is entitled against a Former tenant who holds over after the expiration of the term. 5. The defendant obtained a stay of execution which enabled him to remain in possession of the suit premises until the end of March 1982. 6. On the 10th March 1982, the hearing of the assessment of damages took place before a registrar. It turned out that the only damages the plaintiffs were claiming were for the defendant's trespass in wrongfully holding over, the measure being the difference between the market rental value of the land which the plaintiffs contended was $10,000 per month and the figure of $4,200 per month which was the former rental of the land. For the period of the defendant's wrongful holding over, the plaintiffs wanted this difference amounting to $5,800 per month, in addition to the $4,200 per month which the defendant had already been ordered to pay. What the plaintiff claimed was nothing other than additional mesne profits. The defendant's counsel took objection to the claim for mesne profits on the basis that the plaintiffs had already obtained final judgment for mesne profits at the rate of $4,200 per month, so that there no longer existed any scope for claiming mesne profits at any higher rate. The learned registrar upheld the defendant's counsel's submission, with the result that the plaintiffs got no award of damages, there being no head of damages advanced other than trespass for wrongful holding over. 7. The plaintiff being dissatisfied with the learned registrar's ruling, appealed to me. I dismissed the appeal, giving brief oral reasons and indicating that I would, in due course, give my reasons in writing. 8. As I see the problem, it is simply one of interpretation of the judgment of the 18th January 1982. In considering that judgment, it is useful to bear in mind that it was the plaintiffs' legal advisers, not the defendant's, who drew up and entered that judgment. 9. That judgment is of the mixed variety, part o￡ it being final and part interlocutory. Within the final part is an award of mesne profits at the rate of $4,200 per month from the 1st June 1981 until vacant possession is delivered up. 10. Strictly speaking, mesne profits are unliquidated damages, but in practice the law allows them to be treated as liquidated damages if the landlord claims for them at the same rate as the former rent. The practice of entiring final judgment for mesne profits as if they were liquidated damages is described in the 1982 edition of the White Book at para 13/4/3. The plaintiffs followed that practice and now wish to be relieved of the consequences of so doing. 11. I do not see how the plaintiffs can be entitled to impugn the final judgment which they themselves obtained. The final judgment said that mesne profits were at the rate of $4,200 per month. Being final, the judgment means that there is no longer any scope for going on to say that the mesne profits should really be at some different rate. Were it possible to treat final judgment in that way, they would lose their essential quality of finality. 12. Looking at the statement of claim, one sees that the action was brought on the explicit basis that mesne profits were to be at the rate of $4,200 per month until the plaintiffs obtained vacant possession, so it would be unfair at this stage to permit the plaintiffs to alter the nature of their claim. A defendant who allowed judgment to go by default when the claim for mesne profits was at the rate of $4,200 per month might have adopted a different course if he had known that the claim was really for $10,000 per month. 13. For the plaintiffs to obtain mesne profits at a higher rate than the former rental of $4,200 per month, they should have omitted any reference to the figure of $4,200 per month in the context of the prayer for mesne profits in the statement of claim. In the judgment, instead of a reference to mesne profits at the rate of $4,200 per month, there should have been a part to the effect that mesne profits were to be assessed. 14. Having specified the rate at which mesne profits were to be calculated, the prayer for damages in the statement of claim and the reference to damages to be assessed in the judgment turned out to be mere surplusage. I saw no merit in the argument that the defendant should have realised that when the plaintiffs made a reference to damages in the statement of claim the plaintiffs must have meant the difference between the market rental and the former rental of $4,200 per month. I do not see haw it could be reasonable to expect a defendant to engage in that type of obscure reasoning process when it would have been so much simpler for the plaintiffs merely to state that they were claiming mesne profit, without specifying any amount. 15. The strained meaning of \"damages\" which the plaintiffs wish to contend for cannot be allowed to fly in the face of the actual wording of the judgment which is what mesne profits are at the rate of $4,200 per month. 16. In dismissing the appeal, I also ordered that the plaintiffs should pay the costs. (J.J. Rhind) Judge of the High Court Representation: Mr. B. Bernacchi, Q. C. and Mr. P. Woo (Tsang, Chau and Shuen) for plaintiff Mr. P. Wei (Tai, Tang, and Chong) for defendant Look up this case on Lawcite Noteup",
  "length": 7800,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/1982/83",
  "query": "mesne profits",
  "ts": "2025-10-16T12:11:13",
  "ok": true
}