{
  "title": "GRAND UNION INSURANCE CO LTD V. CLYDE & CO (A FIRM) AND OTHERS | [1988] HKCFI 421 | HKLII",
  "court": null,
  "year": 1988,
  "date": null,
  "content": "HKLII Databases Court of First Instance [1988] HKCFI 421 GRAND UNION INSURANCE CO LTD V. CLYDE & CO (A FIRM) AND OTHERS Judgment Information Date 1 Jun, 1988 Action No. HCMP2110/1987 Neutral Cit. [1988] HKCFI 421 Parallel Cit. [1988] HKC 464 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCMP2110/1987 HCMP002110/1987 GRAND UNION INSURANCE CO LTD v. CLYDE & CO (a firm) AND OTHERS HCMP002110/1987 1987 No. MP2110 IN THE SUPREME COURT OF HONG KONG HIGH COURT MISCELLANEOUS PROCEEDINGS _____________ IN THE MATTER of an application by Grand Union Insurance Company Limited against Clyde & Company, Aegian Insurance Company Limited and Ray Sigorta A.S. for Orders in respect of their Contempt of Court and IN THE MATTER of Miscellaneous Proceedings No. 351 of 1987 ____________ BETWEEN GRAND UNION INSURANCE COMPANY LIMITED Applicant AND CLYDE & COMPANY (a firm) 1st Respondent AEGIAN INSURANCE COMPANY LIMITED 2nd Respondent RAY SIGORTA A.S. 3rd Respondent ____________ Coram: Hon. Mr. Justice Mayo in Court Date of Hearing: 16 - 20 May 1988 Date of Delivery of Judgment: 2 June 1988 ___________ JUDGMENT ___________ 1. This is an application for Contempt of Court. The 1st Respondent (Clyde & Co.) are a firm of Solicitors and the 2nd and 3rd Respondents were Defendants in Miscellaneous Proceedings 351 of 1987. The Plaintiff was also the Plaintiff in Miscellaneous Proceedings 351 of 1987. 2. It was the intention of the 1st and 2nd Respondents to commence winding up proceedings against the Plaintiff. With the knowledge of this and the consequences which would probably ensue in such an event, the Plaintiffs applied Ex-parte to Mr. Justice Jones for an injunction to restrain the 1st Respondent and the 2nd Respondent from proceeding with action to wind up the Plaintiffs. 3. The operative part of the order reads: \" 1. That the said Aegian Insurance Company Limited and the said Ray Sigorta A.S. be restrained until the conclusion of the inter-partes hearing of the Notice of Originating Motion to be issued herein from presenting whether by themselves, their servants or agents or otherwise howsoever any petition or petitions under the Companies ordinance to wind up Brand Union Insurance Company Limited in respect of any debt due or alleged to be due to them or either of them. 2. That the Applicant have leave to serve a sealed copy of the Notice of Originating Motion upon Aegian Insurance Company Limited and Ray Sigorta A.S. accompanied by a prescribed form of Acknowledgment of Service by serving the same on their solicitors, being the said Messrs. Ince & Co. 3. That the time for acknowledgment of service in the Motion be 14 days after service of the same as aforesaid. 4. That there be liberty to apply to discharge or vary the terms of this Order and that the date for an application to discharge or vary the terms of this Order be fixed in consultation with Counsel. 5. That these proceedings be marked \"Confidential\" in the Registry of the Supreme Court. 6. That the costs of this application be reserved. \" 4. It is significant to note from the supporting affidavit of Mr. Sheppard, an Assistant Solicitor with Messrs. Clifford-Turner, the Solicitors who were representing the Plaintiffs that no claim to confidentiality was made in the application. 5. However as an afterthought, Mr. Sheppard wrote to Mr. Justice Jones's Clerk on 18th February 1987 stating that he and his counsel Mr. Allman-Brown had omitted to request that measures should be taken to ensure that confidentiality should be maintained and suggested that the file should be marked \"confidential\" in the Registry. 6. Mr. Justice Jones did not require Mr. Sheppard or Mr. Allman-Brown to appear again before him but it will be noted from paragraph 5 of the order that a provision was included in the order that the proceedings were to be marked \"confidential\" in the Registry of the Supreme Court. 7. At the time of the Ex-parte Order, the 1st Respondent and 2nd Respondent were respresented by Messrs. Ince & Co. Solicitors. However consequent upon pressure being brought to bear upon Messrs. Ince & Co. by Mr. Sheppard they decided to withdraw from representing the 1st and 2nd Respondents and arrangements were made for Messrs. Clyde & Co. to represent them. This was done in London where Messrs. Clyde & Co. also have offices. 8. Mr. Brook of Clyde & Co. who is a partner in the firm had the conduct of the matter. 9. He gave evidence of the inquiries he caused to be made. His principal clients were two firms of Insurance Brokers Messrs. Sedgwick and Messrs. Seascope. 10. In the normal course of events where Solicitors undertake Re insurance work, it is their practice to take instructions from Brokers. If a claim included the claims of Re insurers the Brokers would make the necessary arrangements to ensure that their Solicitors also acted for the Re insurers. The 1st Respondent and the 2nd Respondent's claims against the Plaintiffs were in connection with Re insurance claims when Sedgwicks had acted as Brokers. 11. The inquiries undertaken by Mr. Brook indicated that a number of other parties had claims against the Plaintiff. 12. At the hearing before me, Mr. Brook was cross-examined by Mr. Diamond for the Plaintiff on his affidavit evidence. 13. I had no doubt after hearing his evidence that he was a reliable and truthful witness and I have no hesitation in accepting his testimony. 14. I accept that Mr. Brook was concerned about the financial situation of the Plaintiff and that he did devise a strategy on behalf of Sedgwick's clients the Re insurers who had claims against the Plaintiff. 15. The strategy devised by Mr. Brook was to coordinate the efforts of the various claimants and bring pressure to bear upon the Plaintiff by advising them to serve a series of notices for the winding up of the Plaintiff. 16. On 17th August 1987 Mr. Brook wrote a letter to Sedgwick's clients along the following lines: \"Interested Assureds & Reassureds Dear Sirs, Grand Union Ins. Co. Ltd. This report is being circulated to various creditors of Grand Union, principally clients of Sedgwicks and Seascope. 1. The Background Until earlier this year, various creditors of Grand Union were represented by Messrs. Ince & Co. They made use of Hong Kong legislation whereby a company which fails to pay a debt within 21 days may be wound-up by the Court. They gave the requisite 21 days' notice in respect of the claims of two particular creditors, Ray Ins. Co. and Aegian. However Grand Union obtained an injunction from the Court to block these applications, on the basis that the claims were disputed: various questions had not been answered. Messrs. Ince & Co. had to withdraw because of an alleged conflict of interest, and we have taken over conduct of the matter. 2. The current position Since we were instructed we have investigated the practices of Grand Union, and their financial position. It emerges that the company was struck off the security lists of most London brokers by 1985, and thereafter the company's premium income has fallen, so that it can no longer fund claims payments out of income. The result has been that Grand Union now agree very few claims, and settle virtually none. Their 1986 accounts, recently filed, show that gross premium income has fallen from around to HK$90m HK$38m in the space of one year. Furthermore long term reserves have declined markedly. The accounts also show claims, but these figures are unreliable because Grand Union make no provision for claims advised but not yet agreed - in other words the bulk of their exposure. The company does have cash reserves, but it is a moot point whether these are sufficient to cover all claims. Grand Union and their consultants, Conocean, have developed an art of delaying agreement of balances by seeking further information, most of which is not necessary and/or not required by the policy wording. The brokers have done their best to deal with these queries. 3. Future strategv The injunction against Aegian and Ray still stands, and to set this aside we would need to apply for a two-day hearing in the Hong Kong Courts. We consider that this would not be the most efficient way of imposing pressure upon Grand Union. Instead, we recommend that further notices of winding-up should be issued. There are few creditors who have very significant balances outstanding; most are owed well under ￡50,000. Individually, these creditors cannot put much pressure on Grand Union to pay; collectively they can. The sums owed to clients of Sedgwicks and Seascope together amount to over ￡1,500,000. Accordingly we suggest that creditors pool their resources to impose the maxium pressure upon Grand Union. They can do this by submitting a series of notices, of winding-up. Then if Grand Union wish to avoid being put into liquidation, they must either pay each creditor in full within the 21 day period, or alternatively seek an injunction - which they can obtain only by showing the beginnings of a defence. Eventually we would hope to persuade. Grand Union to come to the negotiating table. To minimise the risk of an injunction, we should of course use the cleanest and most straightforward claims for the initial notices of winding-up. However, since this approach would be a collective one, we also recommend that any proceeds be shared rateably between all creditors who actively support the strategy. In all probability Grand Union will seek to raise \"queries\" in order to delay matters, as they did last time. We would therefore need the active co-operation of all underwriters who subscribe to this proposal, as well as the brokers, with a view to disposing of the \"queries\" by return. We consider that applications for winding-up are the speediest and most efficient way of imposing pressure on Grand Union. We are therefore inviting creditors to agree to their claims being put forward as suggested, and to pooling of the proceedings. If you are happy with this proposal, please respond by Wednesday 26th August at latest. We would hope to serve the first notices during the following week. If you have any queries, please feel free to contact us. Yours very truly, CLYDE & CO\" 17. This is the letter upon which this motion for contempt of Court is based. 18. More particularly it is claimed in the Statement to Order 52 that the grounds upon which the motion is based are: \" (a) Publishing and/or causing and/or allowing and/or suffering to be published to clients of Sedgwick Marine Ltd. and also to various persons unknown to the Applicant a letter dated 17th August 1987 a copy of which is exhibited to the affirmation of Wong Chee Chor, Johney and marked \"CCW-6A\", such publication was calculated and intended to inhibit the Applicant from availing itself of its rights to have its legal rights determined by this Honourable Court in M.P. No. 351 of 1987 and/or to pressurize the Applicant into a settlement with the 2nd and/or 3rd Respondent without any or any sufficient and Justifiable cause. (b) Publishing and/or causing and/or allowing and/or suffering to be published the letter dated 17th August 1987 aforesaid which publication is:- (i) contrary to the Onder of Jones J dated 17th February 1987, and/or (ii) is calculated to frustrate or to defeat the purpose of M.P. No. 351. of 1987 and/or the Order of Jones J dated 17th February 1987. \" 19. Mr. Brook agreed that he was fully aware of Mr. Justice Jones's order when he wrote this letter. Indeed he had discussed the contents of the order with a colleague of his Miss Fruin-Ball, an Assistant Solicitor with Messrs. Clyde & Cos. Hong Kong office on 15th May 1987. He was also aware that Mr. Sheppard was contending that any publication of the subject matter of Miscellaneous Proceedings 351 of 1987 would constitute a violation of Mr. Justice Jones's said order and this would be a contempt of Court. 20. Mr. Brook gave evidence that while he was aware of this he did not and does not for one moment accept the validity of this contention. 21. In his affidavit, Mr. Brook deposed to the fact that neither the 1st Respondent nor the 2nd Respondent was consulted on the publication of the 17th August letter and it was on this basis that the Plaintiffs discontinued the present motion against them. 22. I accept the submission of Mr. Thompson for Clyde & Co. that the Order 52 Statement should be treated in a similar manner to an indictment in Criminal Proceedings having regard to the penal nature of the sanctions for contempt of Court. 23. Accordingly it is my view that the issues before me must be confined to the complaints which are made in the said Statement which are of a fairly narrow compass. 24. It is common ground between the parties that the Ex-parte application before Mr. Justice Jones was heard in camera. The position concerning the publication of information relating to the proceedings is governed by section 5 of the Judicial Proccedings (Publication of Reports) Cap. 287 which reads: \"5. (1) The publication of information relating to proceedings before any court sitting in private shall not of itself be contempt of court except in the following cases, that is to say - (a) where the proceedings relate to the wardship or adoption of an infant or wholly or mainly to the guardianship, custody, maintenance or upbringing of an infant, or rights of access to an infant; (b) where the proceedings are brought under Part II or IV of the Mental Health Ordinance ; (c) where the court sits in private for reasons of national security during that part of the proceedings about which the information in question is published; (d) where the information relates to a secret process, discovery or invention which is in issue in the proceedings; (e) where the court, having power to do so, expressly prohibits the publication of all information relating to the proceedings or of information of the description which is published. (2) Without prejudice to subsection (1), the publication of the text or a summary of the whole or part of an order made by a court sitting in private shall not of itself be contempt of court except where the court, having power to do so, expressly prohibits the publication. (3) Nothing in this section shall be construed as implying that any publication is punishable as contempt of court which would not be so punishable apart from this section. \" 25. I accept the correctness of the submission made by Mr. Diamond that it will constitute a contempt to publish matters which the Court has decided; should be kept confidential if (a) the Court expressly prohibits publication or there is an obvious implication that publication is probibited from what the Court has expressly order; (b) if the Defendant knew of the ruling of the Court and its purpose or had a proper opportunity of knowing of them and (c) if publication thereby interferes with the due adminstration of justice. I have taken this from part of the skeleton argument which was very helpfully provided to me by him. 26. The vital question I have to determine is whether the Plaintiffs have been able to discharge the burden of establishing any of these matters. 1. Did Mr. Justice Jones expressly prohibit publication of information relating to the proceedings? 27. I accept the submission Mr. Thompson that the prohibition must be in clear terms and that it is not enough to say that an obvious inference should be drawn from the terms of the order. All that Mr. Justice Jones ordered was that the file should be marked \"confidential\" in the Registry. 28. The position is not entirely dissimilar to the situation which arose in Attorney General v. Leveller Magazine Ltd. and others (1) . There the magistrates had ordered that the name of a witness should be referred to at the trial as \"Colonel B\". During the course of the trial B's identity became known and the Defendants published material which resulted in Colonel B's cover being blown. 29. It is evident to me from a perusal of the speeches of all of the Law Lords that it was necessary to establish the existance of an express order. 30. I am satisfied that the order made by Mr. Justice Jones was a most unusual order. It was certainly not expressly ordered that no one should publish information relating to the proceedings. 31. I do not consider that it is sufficient to say that an inference could be drawn from marking the file in the Registry \"confidential\" that no one should publish any information relating to the proceedings. In this connection I accept Mr. Brook's evidence that he did not draw any such inference himself. 2. Did the publication of the letters in any way interfere with the administation of justice? 32. I accept Mr. Brook's evidence to the effect that the said letter was addressed to his intended clients. They had a legitimate interest in being advised on a suitable strategy for the prosecution of their prospective claims against the plaintiff. 33. Their claims were separate and distinct from the 1st Respondent and the 2nd Respondent's claims against the Plaintiff and certainly did not form any part of the proceedings in Miscellaneous Proceedings 351 of 1987. 34. It is also instructive to have regard to the contents of the said letter. 35. While I accept that the Plaintiffs do not accept the truth or accuracy of all of the contents of the letter it is nonetheless correct to state that it is couched in moderate terms and addresses itself to a proposed future course of conduct which is intended to vindicate the clients legitimate claims. 36. Even though the strategy was adopted I do not see how this of itself could affect the outcome of the issues being ventilated in Miscellaneous Proceedings 351 of 1987. 37. Any litigation arising out of the strategy would be independent of the issues being determined in Miscellaneous Proceedings 351 of 1987. Everything proposed related to the future not the past. 38. I am satisfied that the test to be adopted is the common law rule which was laid down in Scott v. Scott (2) . That is that the interference must be such as to render impracticable the adminstration of justice or to frustrate the attainment of justice. 39. The publication of the letter could not in my view be said to constitute such interference. 40. So far as the scheme proposed was concerned, I do not think that it could be said to be different in nature from the type of action complained of in Re London Flour Co. (3) and re New Gold Coast Exploration Co. (4) . In neither of these cases did the conduct amount to a contempt of Court. 41. The final matter I will deal with is the question as to whether the proposal made by Mr. Brook in his letter would have any effect upon the conduct of the litigation in Miscellaneous Proceedings 351 of 1987. 42. Here I have derived some assistance from the speeches of Lord Diplock and Lord Cross in Attorney General v. Times Newspapers (5) . Lord Diplock said at page 313. \"In my opinion, a distinction is to be drawn between private persuasion of a party not to insist on relying in pending litigation on claims of defences to which he is entitled under the existing law, and public abuse of him for doing so. The former, so long as it is unaccompanied by unlawful threats, is not, in my opinion, contempt of court; the latter is at least a technical contempt, and this whether or not the abuse is likely to have any effect upon the conduct of that particular litigation by the party publicly abused. For the public mischief in allowing a litigant to be held up to public obloquy for availing himself in a court of justice of rights to which he is entitled under the law as it stands at the time, lies in the inhibiting effect which it might have upon all potential suitors if it were to become the common belief that to have recourse to the established courts of law for the ascertainment and enforcement of their legal rights and obligations would make them a legitimate target of public abuse. If laws are unjust they ought to be changed. Under our constitution it is for Parliament to decide whether any change is needed. A campaign to change them should be directed to persuading parliament of the need, not to vilifying individual litigants for exercising their rights under the law as it stands. If a campaign directed to the latter object were to succeed in deterring litigants from enforcing their legal rights in courts of law which are under a constitutional duty to enforce them, the practical result would be to substitute government by the enforce \"media\" for government by parliament in the particular field of legislation with which the campaign was concerned. \" and Lord Cross said at page 326. \"A layman who reflected on the matter might well be prepared to agree that a rule that the issues in pending proceedings should not be prejudged by discussions in the media was justifiable; but I am sure that he would consider that a rule prohibiting the publication of any statement likely to influence a party, in the conduct of litigation, even though it did not relate to the issues in the action, was an unwarranted interference with freedom of expression. \"Surely\", he would say, \"it ought to depend on the way in which the influence is exerted\". That is, I think, in fact the legal position. To seek to dissuade a litigant from prosecuting or defending proceedings by threats of unlawful action, by abuse, by misrepresentation of the nature of the proceedings or the circumstances out of which they arose and such like, is no doubt a contempt of court; but if the writer states the facts fairly and accurately, and expresses his view in temperate language the fact that the publication may bring pressure - possibly great pressure - to bear on the litigant should not make it a contempt of court\". 43. As I have stated earlier in my judgment I have found as a fact that Mr. Brook was writing a letter addressed to his intended clients advising them on a course of action. He did not propose anything illegal or improper and he expressed himself in a moderate fashion. 44. I do not think that what he said could in any way be said to prejudice or impede the course of justice nor could it be said to constitute an attempt to pressure the Plaintiffs into a settlement of their claims against the 1st Respondent and the 2nd Respondent in Miscellaneous Proceedings 351 of 1987. 45. For the reasons I have given I am satisfied that the Plaintiffs have failed to prove beyond a reasonable doubt that Clyde & Co. have been guilty of contempt of Court. Accordingly this motion is dismissed. I will hear the parties on costs. (Simon Mayo) Judge of the High Court Representation: Mr. Anthony Diamond, Q.C. & Mr. Edward Chan (Ng, Lie, Lai & Chan) for plaintiffs/applicant Mr. Anthony Thompson, Q.C. & Mr. Clifford Smith (Clyde & Co.) for 1st respondent (1) [1979] AC 440 (2) [1913] AC 417 (3) Vol. 17 Law Times 1868 (4) [1901] 1 Ch. 860 (5) [1974] AC 273 Look up this case on Lawcite Noteup",
  "length": 22968,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/1988/421",
  "query": "contempt of court",
  "ts": "2025-10-16T12:11:39",
  "ok": true
}