{
  "title": "JUICY COUTURE, INC. V. BELLA INTERNATIONAL LIMITED T/A JUICY GIRL AND OTHERS | [2010] HKCA 95 | HKLII",
  "court": null,
  "year": 2010,
  "date": null,
  "content": "HKLII Databases Court of Appeal [2010] HKCA 95 JUICY COUTURE, INC. V. BELLA INTERNATIONAL LIMITED T/A JUICY GIRL AND OTHERS Judgment Information Date 25 Mar, 2010 Action No. CACV19/2010 Neutral Cit. [2010] HKCA 95 Download MS Word Judgment Reading Options Translation Toggle Highlight Appeal History CACV19/2010 CACV000019/2010 JUICY COUTURE, INC. v. BELLA INTERNATIONAL LIMITED t/a JUICY GIRL AND OTHERS CACV 19/2010 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF APPEAL CIVIL APPEAL NO. 19 OF 2010 (ON APPEAL FROM HCA NO. 1764 OF 2008) ______________ BETWEEN JUICY COUTURE, INC. Plaintiff and BELLA INTERNATIONAL LIMITED trading as JUICY GIRL 1st Defendant YANG CHING PING, JESSICA （楊青萍） 2nd Defendant SUEN LUI （孫磊） 3rd Defendant ______________ Before: Hon Rogers VP and Le Pichon JA in Court Date of Hearing: 26 March 2010 Date of Judgment: 26 March 2010 ______________ J U D G M E N T ______________ Hon Rogers VP: 1. This is an appeal from a decision of Yam J given on 4 December 2009, whereby the judge granted an injunction to restrain the plaintiff, until judgment in this action or further order, from proceeding further with arbitration proceedings arising out of the complaint filed by the plaintiff against the firstdefendant on 11 September 2009, with the Hong Kong International Arbitration Centre regarding the domain name ‘juicygirl.com.hk’. 2. Quite simply, the plaintiff and the defendants are locked in litigation over the use of trademarks by the first defendant. The first defendant has raised a vigorous defence. This action was started as long ago as September 2008. The action concerns the use of various trademarks on clothing apparel and there is, clearly, a strong dispute which needs to be resolved, as to whether or not the first defendant can continue doing that to which the plaintiff objects. 3. The first defendant has registered a domain name and the plaintiff has objected to that. That has given rise to the arbitration proceedings which are before the Hong Kong International Arbitration Centre which is subcontracted by the Hong Kong Domain Name Registration Company Limited (“HKDNR”) to conduct arbitration proceedings when there is a dispute about the use of a domain name. 4. Quite clearly, the judge, in my view, was correct in granting the injunction. He has not prevented the arbitration proceeding once the litigation has concluded but, as was pointed out by Mr Chow on behalf of the plaintiff, when there is a dispute which is subject to an arbitration, the dispute resolution policy of the HKDNR provides, in paragraph 4, that: “This paragraph sets forth the type of disputes for which you are required to submit to a mandatory arbitration proceeding. These proceedings will be conducted before one of the Dispute Resolution Service Providers approved by us (each, a ‘Provider’) a. Applicable Disputes. You are required to submit to a mandatory arbitration proceeding in the event that a third party (a ‘Complainant’) asserts to the applicable Provider, in compliance with the Rules of Procedure and Supplemental Rules of such Provider, that: (i) your Domain Name is identical or confusingly similar to a trademark or service mark in Hong Kong in which the Complainant has rights; and (ii) you have no rights or legitimate interests in respect of the Domain Name; and (iii) your Domain Name has been registered and is being used in bad faith.” 5. These are matters which will be inevitably resolved as part of the litigation which the plaintiff has started. They are eminently not suitable for resolution in an arbitration of the nature which is provided. The order which the judge made, as I have said, does not prevent the arbitration proceeding once the court has resolved the issues between the parties which will encompass what I have just referred to. 6. On this appeal, Mr Chow, who has manfully said all he could on behalf of his client, has relied upon the fact that the first defendant is contractually bound to arbitrate. The point which arises on that is that the contract to arbitrate is not one between the first defendant and the plaintiff; it is between the first defendant and some other party and hence it is not a contractual matter which the plaintiff is entitled to enforce as such. In any event, the injunction granted does not cause any breach of that contractual requirement; it simply defers the day on which the arbitration will take place. 7. Turning to this appeal, it is an appeal against an exercise of discretion by a judge and what an appellant has to show is that the judge has gone clearly wrong or made some mistake as to the evidence or as to the law which would enable this Court to set aside the order which has been made. 8. I cannot see any ground for saying that the judge has gone wrong in this case. In my view, he made an eminently sensible order and this appeal should never have been brought. Hon Le Pichon JA: 9. I agree. (Submissions on costs) 10. It is the view of this Court that this appeal should never have been brought. There were no grounds for it. It was an eminently sensible order and all that proceeding with the arbitration at the same time as the litigation would have done would have been to add expense and aggravation. In those circumstances, in my view, the costs should be on an indemnity basis. (Anthony Rogers) (Doreen Le Pichon) Vice-President Justice of Appeal Mr Enzo W H Chow, instructed by Messrs Wilkinson & Grist, for the Plaintiff/Appellant Mr John M Y Yan SC and Ms Yu-wing Man, instructed by Messrs Benny Kong & Yeung, for the 1st Defendant/Respondent Look up this case on Lawcite Noteup",
  "length": 5639,
  "headers_seen": [
    "(Submissions on costs)"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkca/2010/95",
  "query": "domain name",
  "ts": "2025-10-17T10:43:53",
  "ok": true
}