{
  "title": "HKSAR V. YEUNG TIN CHUNG | [2022] HKCFI 2365 | HKLII",
  "court": null,
  "year": 2022,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2022] HKCFI 2365 HKSAR V. YEUNG TIN CHUNG Judgment Information Date 10 Aug, 2022 Action No. HCMA450/2021 Neutral Cit. [2022] HKCFI 2365 Parallel Cit. [2024] 1 HKLRD 174 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCMA450/2021 HCMA450X/2021 HKSAR v. YEUNG TIN CHUNG [English Translation – 英譯本] HCMA 450/2021 [2022] HKCFI 2365 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE MAGISTRACY APPEAL NO 450 OF 2021 (ON APPEAL FROM STCC 1488/2020) ____________ BETWEEN HKSAR and YEUNG TIN CHUNG （楊天聰） Appellant ____________ Before: Hon Barnes J in Court Date of Hearing: 18 July 2022 Date of Judgment: 11 August 2022 JUDGMENT A. Introduction 1. The appellant was charged with one count of “possession of offensive weapon in public place”, contrary to sections 33 (1) and (2) of the Public Order Ordinance , Cap 245 , Laws of Hong Kong. Before the plea was taken, the appellant applied for a permanent stay of proceedings before Magistrate Veronica Heung (“the magistrate”). The magistrate dismissed the appellant’s application on 8 January 2021. The appellant later pleaded not guilty to the charge before Magistrate Stephanie Tsui. After the trial, he was convicted on 8 July 2021 and sentenced to a rehabilitation centre. The appellant appeals against the ruling on the stay of proceedings and the conviction. The appellant has served the said rehabilitation centre order. 2. In the appeal hearing, the appellant’s representative confirmed that the appellant had abandoned the appeal against conviction. I dismissed the appellant’s appeal against conviction. The following is my judgment of the appellant’s appeal against the ruling on the stay of proceedings. B. Facts of the case 3. The appellant was charged that on 8 December 2019 ( “the day in question”), in a public place in Chik Fu Street Rest Garden, Chik Fu Street, Tai Wai, New Territories, Hong Kong, without lawful authority or reasonable excuse, he had with him an offensive weapon, namely an extendable baton. C. Facts against the appellant 4. In summary, a few days before the day in question, there was a large amount of online propaganda calling on the people to participate in the International Human Rights Day March with the theme “Five demands, not one less” to be held at Victoria Park in Causeway Bay on the day in question. 5. At 0018 hours on the day in question, the appellant was stopped and searched by the police in the garden at Chik Fu Street, Tai Wai, New Territories. The following articles were found inside the rucksack at his feet: (1) a steel extendable baton with a case weighing 782 grams (prosecution exhibit “P-3”), measuring 25 cm and 65 cm respectively in collapsed and expanded conditions; (2) a black helmet; (3) a respirator; (4) a respirator filter; (5) a knee guard; (6) a pair of elbow guards; (7) six rolls of gauze; and (8) a black face scarf. 6. It was the prosecution position that the extendable baton was an offensive weapon per se and the appellant was charged for having with him, without lawful authority or reasonable excuse, an offensive weapon, namely an extendable baton in public place on the day in question. D. Chronology 7. The magistrate set out the chronology of the events in the Reasons for Ruling on the Stay of Proceedings ( “the Reasons for Ruling”): “ 15. The chronology of the events, from the defendant’s arrest to the present application before me, have been set out in the annex to the defence supplemental written submission [1] . In summary: 8 December 2019 The defendant was arrested. 15 May 2020 The defendant was formally charged. 3 June 2020 The case was brought before the court for the first time, the defence applied for an adjournment for plea taking. 20 July 2020 The defence wrote to the Department of Justice for the first time asking for O.N.E./B.O. [2] (“the defence’s first letter”). 22 July 2020 The case was brought before the court for the second time, the defence again applied for an adjournment for the prosecution to consider the proposal of O.N.E./B.O. The trial magistrate then enunciated on whether O.N.E./B.O. order should be made for the defendant 23 July 2020 The defence wrote again to the Department of Justice to ask for O.N.E./B.O. because on 22 July 2021, the Department of Justice stated in court that they had never received the defence’s first letter. On the same day, Mr Cheng, Senior Assistant Director of Public Prosecutions, called the defence to ask for some information about the defendant’s school performance. The defence provided Mr Cheng with the same on the same day. 1 September 2020 Mr Cheng, Senior Assistant Director of Public Prosecutions, wrote to the defence (“the prosecution’s first letter”) stating that the prosecution was prepared to accept O.N.E./B.O. to the defendant on certain conditions which were set out in the letter (faxed at 3:17 pm). 2 September 2020 Mr Cheng, Senior Assistant Director of Public Prosecutions, wrote to the defence for the second time (“the prosecution’s second letter”) stating that the prosecution was not going to allow O.N.E./B.O. and decided to proceed with the prosecution (faxed at 6:20 pm). 4 September 2020 The case was brought before the court for the third time. The defence asked for an adjournment for the defendant to seek legal advice. 16 October 2020 The case was brought before the court for the fourth time. The defence submitted that an application for a permanent stay of proceedings would be made. 8 January 2021 The case was brought before the court for the fifth time. Submission from both the prosecution and the defence on the application for a permanent stay of proceedings was heard and the application was refused on the same day. ” E. Grounds of appeal 8. The grounds of appeal put forward by Mr Franco Kuan and Ms Naomi Chan, counsel for the appellant, can be divided into two stages: (1) The magistrate was wrong in requiring the appellant to prove on the balance of probabilities that the prosecution had abused the judicial process (standard of proof); and (2) The magistrate wrongly exercised her discretion (wrong exercise of discretion). 9. The appellant agreed that an appeal from the exercise of discretion by the magistrate to refuse the appellant’s application for a permanent stay of proceedings was governed by the following well-settled principles [3] . (1) The judge acts on a wrong principle; (2) It must appear that the exercise of discretion was based upon a misunderstanding of the law or evidence, or upon evidentially unsupported inferences that particular facts existed or did not exist; or (3) It must appear that the exercise of discretion miscarried because it was based upon an irrelevant consideration or it failed to take into account a relevant consideration. Failure to give weight or sufficient weight to relevant considerations will also vitiate the exercise of a judicial discretion but only if that failure is central to the exercise of the discretion; or in other words, where it amounts to a failure to exercise the discretion entrusted to the court; or (4) The exercise of discretion is plainly wrong in the sense that on the facts the order made is so unreasonable or plainly unjust, even if the nature of the error is not discoverable, the order made will be reviewed; (5) It is never enough to justify the review that the appellate court itself would have exercised the discretion differently. Error on the part of the primary judge is an indispensable condition of review. F. Standard of proof 10. First, the appellant emphasized that the magistrate had erred in law; therefore, this court could review the facts, reconsider the case and exercise the discretion afresh. 11. The appellant cited paragraph 11(3) of the magistrate’s “Reasons for Ruling”: “ (3) In most such cases, the court only grants the stay because, notwithstanding the range of remedial measures available at the trial, a fair trial for the accused is found to be impossible and continuing the prosecution would amount to an abuse of process. According to this principle, if the accused wants to successfully stay the proceedings, the accused must prove on the balance of probabilities that a fair trial has become impossible and that the continuation of the prosecution amounts to an abuse of the process of the court.” 12. The magistrate later concluded at paragraph 31: “31. I am of the view that all the arguments put forward by the defence for a permanent stay of proceedings in the present case, whether considered alone or as a whole, fail to prove on the balance of probabilities that the prosecution, from the prosecution’s initial indication of consent to O.N.E/B.O. the defendant to a later change of mind to continue the prosecution, has abused the judicial process, let alone the extent of the abuse will make one believe that the continuation of the prosecution will damage the integrity, fairness and appropriateness of the justice system. Considering the nature and the circumstances of the offence, regardless of the guilt of the defendant, a continuation of the prosecution of the charge of the present case is required for the interest of the public.” 13. The appellant submitted that the magistrate wrongly adopted in the present case the standard of proof for the first limb of stay of proceedings application (the first limb) (namely, having a fair trial has become impossible) as referred to in Lee Ming Tee [4] . The issue in the present case belongs to the second limb of stay of proceedings application in Lee Ming Tee (the second limb) (namely, the trial of the defendant under the circumstances of the case is contrary to the court’s sense of justice and propriety that the entire prosecution is tainted as an abuse of process). 14. The appellant submitted that it was necessary for the magistrate to balance the public interest instead of applying the said wrong standard of proof in her consideration of the appellant’s application. G. Respondent’s reply 15. Ms Lam Hiu Man, Human, Senior Public Prosecutor, for the respondent submitted that the appellant was interpreting it “out of the context”. In paragraph 11 of the Reasons for Ruling, the magistrate set out the correct legal principles pertaining to the application for permanent stay of proceedings. The magistrate reiterated in paragraphs 16 and 17 that the court has “residual discretion” and “such discretion can be exercised only in highly exceptional circumstances”, and the conclusion was only given in the end at paragraph 31. 16. The respondent cited HKSAR v Yip Kim Po & anor [5] and submitted that even though the appellant did not rely on the first limb, the magistrate had properly considered the application in accordance with the legal principles. The magistrate found that the appellant failed to prove on the balance of probabilities that the continuation of the prosecution against the appellant was an abuse of court’s process, which was a consideration and finding for the first limb. 17. The respondent also cited the magistrate’s oral ruling and submitted that the magistrate was completely conversant with the relevant legal principles. H. Discussion 18. I will first talk about the magistrate’s oral ruling： “Judge: Yes, yes, my ruling and brief reasons for the defence’s application for permanent stay of proceedings are as follows. The relevant legal principles pertaining to the permanent stay of proceedings have been stated clearly in the case of Lee Ming Tee that only in highly exceptional circumstances will there be enough reasons to justify a stay of criminal proceedings. The stay will be granted in the following circumstances. Firstly, despite different remedial measures available, a fair trial for the suspect is impossible, and also the continuation of prosecution will lead to an abuse of process where a fair trial becomes impossible, but this is not the ground for the defence’s application in the present case. Secondly, in highly exceptionally circumstances, even though a fair trial undoubtedly remains possible, the circumstances involve an abuse of process which offends the court’s sense of justice and propriety, the whole prosecution is tainted as an abuse of process. The defence relied on this ground in the present application. The Court of Final Appeal also pointed out that when a fair trial is feasible, even though there may be official misconduct in the course of the prosecution, the court will not exercise its power to stay the proceedings in order to discipline the said officer and the prosecution. If a fair trial has not been jeopardized, even though the prosecution has been delayed, the court ought not to allow the stay. It can be seen that the threshold required by the court is extremely high. In the present case, I have given careful consideration to the detailed submissions of the prosecution and the defence as well as many relevant decided cases. For submissions, written and oral submissions are included which I will not repeat. To put it briefly, the present application arises from the so-called inconsistency of the prosecution. The prosecution agreed in its letter to deal with the defendant by way of a bind over, but sent a letter the next day stating that the prosecution had changed its mind. The defence considered and suspected that the prosecution was abusing the process and the proceedings should be stayed permanently. The arguments of the defence are set out in great detail in the submissions, written and oral submissions, I will not repeat them. After careful consideration of all the submissions and decided cases, I believe that the defendant, after a number of hearings, knew that the prosecution had given consent in its first letter to the defence’s proposal, and the defendant would be in the hope of being bound over. However, he would be disappointed when he became aware that bind-over was no longer possible as stated in the letter sent by the prosecution the next day. But, after applying the relevant legal principles in the defence submissions, I am of the view that the overall circumstances in the present case do not involve any abuse of process, and they are far from offending the court’s sense of justice and propriety which will cause the entire prosecution to be tainted as an abuse of process. I agree entirely with the prosecution submissions and will not repeat them. Undoubtedly, the prosecution’s change of mind has caused concern of the court but, as stated in its submissions, the prosecution has immediately reviewed the matter. In conclusion, the defence’s application is refused.” 19. It is correct for the magistrate to cite the legal principles in Lee Ming Tee . However, I also note that the magistrate did not mention the standard of proof in the brief oral ruling above. 20. I agree with the respondent that the magistrate was only stating the relevant legal principles in paragraph 11(3) of the Reasons for Ruling. 21. In paragraph 11, the magistrate stated that: “ Legal Principles 11. The Court of Final Appeal explains clearly in HKSAR v Lee Ming Tee and another [6] the legal principles for stay of criminal proceedings, which can be summarized as follows: (1) The decision whether or not to bring a prosecution falls entirely within the province of the Secretary for Justice: Basic Law, Art 63. In general, if a prosecution is brought, the court’s duty is to try the case. A prosecutor has as much right as a defendant to demand a verdict of a jury on an outstanding indictment, and where either demands a verdict a judge has no jurisdiction to stand in the way of it. (2) The trial proceeds in the vast majority of cases. However, the court also unquestionably has jurisdiction to stay criminal proceedings brought by the Secretary for Justice in the exceptional cases where such a course is justified. That jurisdiction rests on the court’s inherent power to prevent abuse of its own process. (3) In most such cases, the court only grants the stay because, notwithstanding the range of remedial measures available at the trial, a fair trial for the accused is found to be impossible and continuing the prosecution would amount to an abuse of process. According to this principle, in order to succeed in the stay application, the accused must prove on the balance of probabilities that a fair trial has become impossible and the continuation of the prosecution amounts to an abuse of the process of the court. (4) In addition, in some exceptionally rare cases, even though a fair trial undoubtedly remains possible, the court is prepared to grant a stay because the circumstances involved an abuse of power which so offended the court’s sense of justice and propriety that the entire prosecution was [tainted] as an abuse of process. (5) While the jurisdiction on this dual basis clearly exists, it is only most sparingly exercised as it is only in very unusual circumstances that a court can properly be satisfied that a fair trial is ‘impossible’. The ‘fairness’ achievable is judged in practical and not absolute terms. More importantly, the court’s primary endeavour is to ensure that a fair trial takes place, employing the law’s available resources, and not to abort it on the ground that fairness cannot be attained, save as a last resort. (6) In cases where a fair trial remains possible even though official misconduct is involved in the bringing of the prosecution, the court does not exercise the jurisdiction to stay proceedings as a means of disciplining the police or prosecuting authorities. Accordingly, if the prosecuting authorities have been guilty of culpable delay but the prospect of a fair trial has not been prejudiced, the court ought not to stay the proceedings merely ‘pour encourager les autres’. (7) In cases where the ground on which a stay is sought concerns alleged unfairness in the use of particular classes or items of evidence, the courts, for procedural reasons, are extremely reluctant to determine the evidential questions on a stay application. This is because the fairness of using the evidence may be incapable of evaluation prior to the trial itself. The impact of such evidence on the fairness of the trial may need to be considered in the context of the evidence as a whole so that the question may best be dealt with as a question of admissibility to be determined by the trial judge and possibly made subject to his residual discretion to exclude the same.” [emphasis added by the magistrate] 22. In paragraph 12, the magistrate also stated that the relevant principles have been confirmed and adopted in many cases: “12. The said legal principles are confirmed and adopted in many cases such as HKSAR v Chow Yiu Man Raymond [7] ; HKSAR v Hon Ming Kong & Others [8] . The Court of Appeal further explained in Hon Ming Kong that when the court is satisfied that the accused could not possibly have a fair trial or even though a fair trial remains possible, the continuation of the prosecution would cause irreparable prejudice to the integrity of the judicial system; if either of the two points is established, the court ought to order a stay of the criminal proceedings, and it is not necessary for the court to consider if the said circumstances are caused by the malicious intention of the prosecution.” 23. It was also noted that in paragraph 14 the magistrate said as follows: “14. As stated above, the defence made it clear right at the outset in the submission that it may be possible for the defendant to have a fair trial if the prosecution is to continue. Therefore, for the present application, the court is only required to consider whether the circumstances of the case involve an abuse of power. If an abuse of power [is involved], whether such abuse has so offended the court’s sense of justice and propriety that the entire prosecution is tainted as an abuse of process and the continuation of the prosecution would cause irreparable prejudice to the integrity of the judicial system before making the decision as to whether or not to grant the application of the defence.” 24. I concur with the appellant’s submission that as the magistrate knew well and made it clear that she was only required to consider the second limb, the standard of proof mentioned in the conclusion appears to be relating to the second limb. The appellant’s complaint is not unreasonable. I. Discretion 25. In view of the fact that the magistrate might have applied the wrong standard of proof, I would consider afresh how to exercise the discretion and whether or not the appellant should succeed in his stay application. 26. The appellant submitted and agreed that the decision whether or not to bring a prosecution falls entirely within the province of the Secretary for Justice (see Basic Law, Art 63 and Lee Ming Tee ). 27. The appellant contended that the prosecution department consented in writing to deal with the case by way of binding over, but retracted the decision later without any change of circumstances or any explanations given. The continuation of the trial under these circumstances obviously offended the court’s justice and propriety, and the faith and respect of the public with the judicial system might be shaken. 28. The appellant submitted that the court, in the exercise of the discretion afresh, ought to [9] : (1) take account of the important public interest in the detection and punishment of crime, namely the crime causing hazard to public safety; (2) take account of the public expectation that persons charged with serious criminal offences will be brought to trial unless there is some powerful reason for not doing so; (3) have regard to preserving the integrity of the criminal justice system; (4) consider the serious burden imposed upon the young defendant of facing a trial. 29. It was submitted that apart from requiring the appellant to face a trial for the said charge for the sake of public interest, the court also ought to give weight to the following public interest: (1) government official being faithful to one’s promise; (2) maintaining the integrity of the criminal justice system; (3) maintaining public confidence in preserving the integrity of the criminal justice system; (4) maintaining public confidence in the appropriateness of the acts of the prosecuting department. 30. The appellant pointed out that the public interest mentioned above played a crucial part in considering and exercising the discretion. 31. Although a number of local and overseas cases have been cited, the appellant admitted that none of them is similar to the present case. In my view the other cases (including plea bargaining; the accused or others having been told that the accused would not be prosecuted and so on) are not of much help when taking into account the special circumstances of the present case. Those cases only show how the relevant principles are applied by the court to deal with the application under the special circumstances of each individual case. Therefore, under the special circumstances in the present case, I must consider how to apply the relevant principles in order to decide whether the court ought to exercise its discretion to permanently stay the proceedings. J. Relevant principles 32. I concur entirely with the legal principles set out by the magistrate in paragraph 11 of her Reasons for Ruling. 33. When a “fair trial” is not impossible, I have to consider how to balance two items of conflicting public interest: (1) to ensure the prosecution for those who have committed serious crime; (2) to be fair to the defendant and to preserve the integrity of the criminal justice system (see: R v LatiF [10] , Warren & others v Attorney General for Jersey [11] , R v Horseferry Magistrates’ Court, Ex parte Bennett [12] ). J.1. Public interest (1): to ensure the prosecution for those who have committed serious crime 34. It is not disputed that on the day in question, the appellant was in possession of an extendable baton, an offensive weapon per se, in a public place. At the material time, it was the high point of the violent social protest, while the appellant was in possession of the equipment (a helmet, a respirator, a knee guard and so on) similar to that possessed by the general violent protestors. If the extendable baton in the case were used, it would have inflicted serious bodily harm to those being attacked. The Court of Appeal points out in many cases that a deterrent sentence is necessary for those who have committed the crime of possession of offensive weapon under this social background and a custodial sentence is a must even for a young offender who has no previous convictions. 35. It is obvious that the crime involved in the present case is serious (although the appellant submitted that it took place at a time and place at a distance from the public procession held at the Victoria Park). For the sake of public interest, the prosecution of the present case ought to be continued. J.2. Public interest (2) to be fair to the defendant and to preserve the integrity of the criminal justice system J.2.1. Appellant’s submission 36. The appellant submitted that the prosecution had made clear promise in “the prosecution’s first letter”. Moreover, when the promise was made, the prosecution knew well about the facts of the case against the appellant. Without any change of circumstances, the prosecution retracted the promise 27 hours later which made the appellant feel disappointed at once. The appellant pointed out that it was improbable for the appellant to refuse the conditions of the binding over offered by the prosecution, which would have resulted in the “criminal record” being dispensed with at the end. 37. It was pointed out that the prosecution had gone back on its words. If the court allowed the prosecution to continue with the proceedings, it would be unfair to the appellant and the people would lose faith in the justice system. 38. The appellant contended that if the court ruled that the prosecution might go back on its words before a defendant attending court for binding over, it would bring about undesirable consequences. It might be necessary for a defendant to attend court to accept the offer of bind over as soon as possible before the prosecution changed its position. However, the defendant could not ask the court for an earlier hearing date. The appellant submitted that the prosecution’s going back on its words would cause difficulties in plea bargaining between the prosecution and the defence. 39. The appellant also pointed out that the prosecution’s going back on its words had not only made the defendant lose the chance of having “no conviction recorded”, the court also could not give the appellant any reduction in sentence when he was found guilty as the law imposes restrictions on sentencing. The appellant cited the appeal case that I mentioned above: Lam Chi-hong Patrick [13] . J.2.2. Respondent’s position 40. The respondent’s position was that the “prosecution’s first letter” was not an undertaking. It was only an indication that if the appellant was willing to abide by the four conditions suggested by the prosecution, the prosecution was prepared to accept the appellant’s being bound over. The letter was not the same as the unconditional undertaking or guarantee mentioned in McFadden’s [14] . 41. The respondent also submitted that in the present case the prosecution had changed its position without bad faith. Under the circumstances of the present case, it would be against public interest if the prosecution were not allowed to correct an earlier mistake. J.2.3. Discussion 42. Having balanced the above two items of public interest, I am of the view that the hearing of the case ought to continue for the sake of public interest. 43. I understand that the appellant was disappointed as the prosecution had gone back on its words. But the prosecutorial power lies with the prosecution. In all circumstances in the present case, when the prosecution was “prepared to” accept the appellant to be bound over in the “prosecution’s first letter”, it was focused obviously on the appellant’s age and clear record, whereas the gravity of the offence was overlooked or neglected. Therefore, the prosecution made an erroneous decision to suggest to the appellant that the prosecution was “prepared to accept” the appellant to be bound over on certain conditions. It is obvious that later after reconsideration the prosecution was aware of the mistake, and notified the defence at once within a short period of time (27 hours) of the prosecution’s changed position. The prosecution was indeed not acting in bad faith. 44. Taking into account the fact that the prosecution did not go back on its words before the court, I concur with the submission of the respondent that it would be against public interest if the prosecution was not allowed to correct a mistake and let the defendant of a serious crime go free without a trial. 45. Moreover, even if the prosecution had not changed its mind and gone back on its words, the court might not agree to order the appellant to be bound over. Although, a magistrate had said in court that bind over might be a way to deal with the present case, the question remains whether the case would be handled finally by the same magistrate. I cannot rule out the possibility that the court might consider the offence too serious and refuse the proposal of bind over. 46. It was submitted that the disappointed appellant was prosecuted and found guilty, and he did not receive any discount in sentence which was different from Lam Chi-hong Patrick where the defendant’s sentence was slightly reduced. In my view, the offence of possession of offensive weapon in public place is so serious that it is the legislative intent to specifically provide that it calls for a custodial sentence. The appellant is sentenced to a rehabilitation centre because of his age and background and there is no room for any reduction. It does not constitute any reasons that the appellant shall not or should not stand a trial in the present case. 47. Although I took the view that the magistrate might have applied the wrong standard of proof, upon consideration I make the same ruling. In my view, the facts and all circumstances in the present case are not sufficient to justify the exercise of my discretion to permanently stay the proceedings. K. Conclusion 48. For the reasons given above, I dismiss the appellant’s appeal against the ruling of the stay of proceedings. (Judianna Barnes) Judge of the Court of First Instance Ms Lam Hiu Man, Human, Senior Public Prosecutor of the Department of Justice, for the respondent. Mr Bak On Franco Kuan and Ms Shue Ting Naomi Chan instructed by H.M. Tsang & Co, for the appellant. Translated by the Judgment Translation Unit of the Judiciary and vetted by Ms. Jenny Chung, Solicitor. [1] Dated 4 January 2021. [2] O.N.E. means “offer no evidence”; B.O. means “bind-over”. [3] See HKSAR v Lee Ming Tee FACC1/200, paragraph 68; HKSAR v Lee Ming Tee and another, FACC 8/2020, paragraphs 164 to 166. [4] HKSAR v Lee Ming Tee , FACC 1/2003；English translation HKSAR v Lee Ming Tee (2003) HKCFAR 336. [5] (2014) 17 HKCFAR 202 , paragraph 25. [6] (2001) 4 HKCFAR 133 . [7] CACC445/2011. [8] [2014] 3 HKC 160 . [9] See HKSAR v Lee Ming Tee FACC 1/2003, paragraph 187 of the judgment. [10] [1996] 1 WLR 104 . [11] [2012] 1 AC 22 . [12] [1994] 1 AC 42 . [13] HKSAR v. Lam Chi-hong Patrick [2012] 2 HKLRD 1264 . [14] Re McFadden’s Application for Judicial Review [2002] NI 183. Look up this case on Lawcite Noteup",
  "length": 31663,
  "headers_seen": [
    "A. Introduction",
    "B. Facts of the case",
    "C. Facts against the appellant",
    "D. Chronology",
    "E. Grounds of appeal",
    "F. Standard of proof",
    "G. Respondent’s reply",
    "H. Discussion"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2022/2365",
  "query": "stay of proceedings",
  "ts": "2025-10-14T11:22:58",
  "ok": true
}