{
  "title": "JIANGXI PROVINCIAL METAL AND MINERALS IMPORT AND EXPORT CORPORATION V. SULANSER CO. LTD. | [1995] HKCFI 449 | HKLII",
  "court": null,
  "year": 1995,
  "date": "2001-07-02",
  "content": "HKLII Databases Court of First Instance [1995] HKCFI 449 JIANGXI PROVINCIAL METAL AND MINERALS IMPORT AND EXPORT CORPORATION V. SULANSER CO. LTD. Judgment Information Date 5 Apr, 1995 Action No. HCMP887/1994 Neutral Cit. [1995] HKCFI 449 Parallel Cit. [1995] 2 HKC 373 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCMP887/1994 HCMP000887/1994 XCHRX JIANGXI PROVINCIAL METAL AND MINERALS IMPORT AND EXPORT CORPORATION v. SULANSER CO. LTD. HCMP000887/1994 1994, No. MP 887 IN THE SUPREME COURT OF HONG KONG HIGH COURT MISCELLANEOUS PROCEEDINGS ____________ IN THE MATTER of the Arbitration Ordinance , Chapter 341 , Section 2H and IN THE MATTER of an Award dated the 23rd day of August 1993 __________ BETWEEN JIANGXI PROVINCIAL METAL AND MINERALS IMPORT AND EXPORT CORPORATION Plaintiff and SULANSER COMPANY LIMITED Defendant __________ Coram: The Hon. Mr. Justice Leonard in Chambers Date of hearing: 6 April 1995 Date of delivery of judgment: 6 April 1995 ________________________ REASONS FOR DECISION ________________________ 1. These are my reasons for dismissing an application by the defendant for the setting aside of an order made by me on 5th December 1994 giving leave to enforce an arbitration award made against the defendant made by the China International Economic Trade Arbitration Commission (CIETAC), as well as the judgment which as a result of my order was entered on 5th December 1994. 2. The defendant's grounds for the application to set aside were in essence as follows: - 1. There was no written agreement between the parties. 2. There was no Arbitration Agreement and accordingly CIETAC had no jurisdiction. 3. The composition of the arbitral authority or the arbitral procedure was not in accordance with the law of the country where the arbitration took place, namely the People's Republic of China. 3. On 18th March 1990 the plaintiff and the defendant entered into a contract for the sale and purchase of cement. The terms of the contract were reduced into writing but the written terms were not signed. 4. When the plaintiff tried to deliver the cement by sea, there was a delay and the plaintiff had to pay demurrage. Claiming that the delay in delivery was due to the default of the defendant, the plaintiff considered that it had a claim for damages against the defendant. It therefore instituted legal proceedings in the Wuhan Admiralty Court on 30th June 1991 against the defendant claiming damages for the detention of the vessel which the plaintiff had chartered for the carriage of the cement. 5. The defendant then wrote to the Wuhan Admiralty Court on 2nd August 1991 saying that it had not entered into any charterparty with the plaintiff. That was true. It went on to say: - \"The sale of goods contract both parties entered into is the C&F contract; and accordingly matters relating to the charterparty should not concern us. Consequently, the plaintiff do not have legal standing (locus standi) to commence this action. Secondly, the contract between us and Jiangxi expressly provides for arbitration by CIETAC; any dispute arising out of and in connection with this contract should be referred to arbitration by CIETAC.\" 6. The defendant went on to submit that the Wuhan Admiralty Court had no jurisdiction. 7. Clause 6 of the written record of the agreement between the parties reads:- \"(6) ARBITRATION: all disputes arising in connection with this sales contract or the execution thereof shall be settled amicably by negotiation. In case no settlement can be reached, the case under dispute shall then be submitted for arbitration to the Foreign Trade Arbitration Commission, of the China Council for the promotion of International Trade in accordance with the Provisional Rules of Procedure of the Foreign Trade Arbitration Commission of the China Council for the Promotion of International Trade. The decision of the Commission shall be accepted as final and binding upon both parties.\" 8. In view of the defendant's argument, the plaintiff on 10th January 1992 submitted to CIETAC a written application for arbitration. On 26th February 1992 the Wuhan Admiralty Court ruled that the dispute between the parties was covered by the arbitration clause and should be resolved by arbitration. It therefore declined jurisdiction. Neither party appealed. 9. What happened next is apparent from the arbitration award made in due course by CIETAC. The matter was accepted by CIETAC on 1st July 1992. The defendant then challenged CIETAC's jurisdiction on the basis that the parties had never signed any written contract and had not entered into any Arbitration Agreement. That submission was made after the plaintiff and the respondent had each appointed an arbitrator for the proposes of the arbitration. 10. CIETAC made an interim award on 14th November 1992, holding that there was a contract between the parties and that the contract had been performed. It was further found that in its written defence submitted to the Wuhan Maritime Court the defendant had confirmed in writing that there was a binding arbitration clause. CIETAC held that it did have jurisdiction over the dispute. 11. Following that interim award, the defendant submitted a substantive defence and made submissions to the tribunal in the arbitration proceedings. 12. After hearing and considering the evidence and submissions of both parties the tribunal made an award for damages against the defendant in the sum of USD198,000.00 and Renminbi 90,000.00 with interest. The defendant was also ordered to pay arbitration fees and expenses in the sum of Renminbi 33,070.00. The date of the final award was the 23rd August 1993. 13. Before this court, the defendant has relied upon Section 43 of the Arbitration Ordinance , Cap 341 (the Ordinance), which is in the following terms: \"43. Evidence The party seeking to enforce a Convention award must produce - (a) the duly authenticated original award or a duly certified copy of it; (b) the original arbitration agreement or a duly certified copy of it; and (c) where the award or agreement is in a foreign language, a translation of it certified by an official or sworn translator or by a diplomatic or consular agent.\" 14. The defendant's argument is that no original arbitration agreement has been produced because that which purports to be a record of the agreement was not signed and whilst there was a business transaction between the parties, there was no arbitration agreement. 15. By virtue of section 2(1) of the Ordinance \"arbitration agreement\" has the same meaning as in Article 7(1) of the UNCITRAL Model Law\" 16. Article 7(1) reads:- \"Article 7. Definition and form of arbitration agreement (1) \"Arbitration agreement\" is an agreement by the parties to submit to arbitration all or certain disputes which have arisen or which may arise between them in respect of a defined legal relationship, whether contractual or not. An arbitration agreement may be in the form of an arbitration clause in a contract or in the form of a separate agreement.\" 17. Section 2(2) of the ordinance provides \"Article 7(2) of the UNCITRAL Model Law shall apply to every arbitration agreement\". Article 7(2) reads:- \"(2) The arbitration agreement shall be in writing. An agreement is in writing if it is contained in a document signed by the parties or in an exchange of letters, telex, telegrams or other means of telecommunication which provide a record of the agreement, or in an exchange of statements of claim and defence in which the existence of an agreement is alleged by one party and not denied by another. The reference in a contract to a document containing an arbitration clause constitutes an arbitration agreement provided that the contract is in writing and the reference is such as to make that clause part of the contract.\" 18. Section 2(2) came into force on 6th April 1990, after the date when the arbitration agreement was made, but before the application to this court on 5th December 1994. Article 7(2) deals with the evidential question of proof of the existence of a contract and does not affect the contractual relationship between the parties. The transitional provisions in Section 26 of the Arbitration (Amendment) Ordinance 1989 are not relevant since they specify the law governing an arbitration. The ordinance did not govern the arbitration in China which led to the Convention award in this case. 19. It is provided in Section 2(1) of the Ordinance that \"'Convention award' means an award to which Part IV applies, namely an award made in pursuance of an arbitration agreement in a state or territory other than in Hong Kong, which is a party to the New York Convention;\" 20. The People's Republic of China is a signatory to the New York Convention. Part IV includes Section 43 and the definition in Section 2(1) of \"arbitration agreement\" applies to that phrase in Section 43. 21. If one looks at Article II of the New York Convention as set out in the 3rd Schedule to the Arbitration Ordinance , one sees at paragraph 2 the following words: 'The term \"agreement in writing\" shall include an arbitral clause in a contract or an arbitration agreement, signed by the parties or contained in an exchange of letters or telegrams.' That definition is not exclusive and is not a bar to the application of Article 7(2), which does not exclude any arbitration agreement covered by Article II of the New York Convention. 22. The defendant has expressly alleged the existence of the arbitration agreement. In addition to the defendant's letter to the Maritime Court, there was a letter by way of defence sent to that Court by a firm of Hong Kong Solicitors acting for the defendant in that matter. It is dated 2nd August 1991 and paragraph 6 is in the following terms:- \"6. Finally, according to the sales contract, any contract disputes should be submitted to arbitration by the Foreign Trade Arbitration Commission of the China Council for the promotion of International Trade in Beijing. Also, in accordance with \"foreign economic contract\" (Article 38) only if a contract does not contain any arbitration clause, can the contracting parties commence court proceedings. Therefore, this matter should now be referred to arbitration by the Foreign Trade Arbitration Commission in Beijing.\" 23. By those letters the defendant affirmed the existence of the contract, including the arbitration agreement and claimed that the matter should go to arbitration. The plaintiff accepted the allegation and produced the written record to the Wuhan Court. The matter did go to arbitration, and after a preliminary argument as to jurisdiction, the defendant submitted to the jurisdiction of CIETAC and proceeded to contest the plaintiff's claim on its merits. I find that the production of this court of the written terms of the contract, which include an arbitration clause, taken together with the defendant's letter and defence submitted to the Wuhan Maritime Court satisfy the requirements of Section 43 of the Ordinance. 24. The defendant has argued that if there is to be reliance upon an exchange of letters, these must have been exchanged between the plaintiff and defendant. Accordingly, the defendant says that a letter sent by the defendant to the Wuhan Maritime Court does not satisfy the requirement of an exchange of letters. 25. Article 7(2) of the UNCITRAL Model Law does not specify an exchange directly between the parties. It simply specifies an exchange, as does Part II Article 2 of the Convention. It is clear that copies of documents submitted by each party to the Wuhan Court and to CIETAC were received by the other. Section 44(1) of the Ordinance provides that \"enforcement of a Convention award shall not be refused except in the cases mentioned in this Section.\" 26. It has been suggested on the part of the defendant that the Arbitration Agreement was not valid under Chinese Law. One of the grounds for refusing enforcement is set out in Section 44(2)(b) as follows \"That the arbitration agreement was not valid under the law to which the parties subjected it or, failing any indication thereon, under the law of the country where the award was made;\" 27. The defendant wanted to call evidence as to Chinese Law in order to show that the arbitration agreement was invalid. I ruled that the defendant was estopped from claiming in this Court that the arbitration agreement was invalid. 28. The question of estoppel was discussed by Kaplan J. as he then was in the unreported case of China Nanhai Oil Joint Service Corporation Shenhzen Branch v. Gee Tai Holdings Co. Ltd. 1992 No. MP 2411 at pages 15 - 21 of the judgment. I respectfully agree with what he said there and, just as Kaplan J. felt able to apply the doctrine of estoppel to the conduct of the defendant in that case so I find that the doctrine applies here and it is not now open to the defendant to take a point as to the validity of the arbitration agreement in Chinese Law. Not only the Wuhan Maritime Court but also the CIETAC Arbitration Tribunal, one of the members of which had been appointed by the defendant, held that the agreement was valid and the defendant then defended the claim on the merits. 29. An example of the application of the doctrine of issue estoppel in relation to arbitration is to be found in the decision of the Privy Council in South British Insurance Company Ltd v. Gauci Bros. & Co. [1928] AC 352 where it was held that when an action on a contract has been dismissed upon a contention by the defendant that an award is a condition precedent to the right to sue, and the claim is then submitted to arbitration, the defendant is precluded from contending that the award is bad in that the arbitrators had not jurisdiction to construe the contract, but only to determine the sum (if any) due. See also The Sennar (2) [1995] 1 WLR 490 where it was held in the House of Lords that issue estoppel is applicable to an award resulting from arbitration proceedings. In the present case, the award was made by a tribunal with jurisdiction, was final and conclusive and was made on the merits. 30. The defendant has attempted to re-open the issues decided by the Arbitral Tribunal but this is not an appeal from the decision of the tribunal. It does appear that the defendant still believes that it has been ordered to pay demurrage under the terms of the charterparty between the plaintiff and a 3rd party. It is perfectly clear that such is not the case. The award is for damages for breach of the contract between the plaintiff and the defendant. I am quite satisfied that this is not a case contemplated in Section 44(2)(d), which envisages a situation where the award deals with a difference not contemplated by or not falling within the terms of the submission to arbitration or contains decisions on matters beyond the scope of the submission to arbitration. 31. Nor is this a case covered by Section 44(2)(e), which the defendant prayed in aid on the basis that there was no arbitration agreement, for I have found that there was such an agreement. 32. I was not in the circumstances of this case prepared to set aside my earlier order and to refuse enforcement of this Convention award. The defendant's case is without merit. 33. For these reasons I dismissed the application. (D.J. Leonard) Judge of the High Court Representation: Mr. Peter Ng inst'd by M/s. Ince & Co. for Plaintiff. Ms. YU Kwong Sen, representative of the defendant. Look up this case on Lawcite Noteup",
  "length": 15502,
  "headers_seen": [
    "Article 7(2) reads:-",
    "Section 44(1) of the Ordinance provides that"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/1995/449",
  "query": "arbitration",
  "ts": "2025-10-14T11:20:50",
  "ok": true
}