{
  "title": "KLÖCKNER PENTAPLAST GMBH & CO KG V. ADVANCE TECHNOLOGY (HK) CO LTD | [2011] HKCFI 458 | HKLII",
  "court": null,
  "year": 2011,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2011] HKCFI 458 KLÖCKNER PENTAPLAST GMBH & CO KG V. ADVANCE TECHNOLOGY (HK) CO LTD Judgment Information Date 13 Jul, 2011 Action No. HCA1526/2010 Neutral Cit. [2011] HKCFI 458 Parallel Cit. [2011] 4 HKLRD 262 Download MS Word Judgment Reading Options Translation Toggle Highlight Appeal History HCA1526/2010 HCA1526/2010 KLÖCKNER PENTAPLAST GMBH & CO KG v. ADVANCE TECHNOLOGY (HK) CO LTD HCA 1526/2010 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE ACTION NO. 1526 OF 2010 ____________ BETWEEN KLÖCKNER PENTAPLAST GMBH & CO KG Plaintiff and ADVANCE TECHNOLOGY (H.K.) COMPANY LIMITED Defendant ____________ Before: Hon Saunders J in Chambers Date of Hearing: 6 July 2011 Date of Decision: 14 July 2011 ______________ D E C I S I O N ______________ Introduction 1. Klöckner manufactures plastic cards and plastic films which are used in the manufacture of credit cards and other similar card products. Advance Technology buys Klöckner’s products to resell to customers in the mainland. Between late 2007 and mid-2008, Advance Technology bought goods from Klöckner by way of a series of purchases, each giving rise to a contract of sale and purchase evidenced by a sales invoice supplied with the goods to Advance Technology. 2. On 12 October 2010, the Klöckner issued a writ and statement of claim against Advance Technology seeking to recover the sum of some US$1 million for goods supplied. 3. Following service of the writ, and before taking any other steps in the proceedings, Advance Technology issued a summons pursuant to O 12 r 9, RHC and s 6 Arbitration Ordinance , Cap 341 , (AO), seeking to stay the proceedings on the grounds that the dispute between the parties should be submitted to arbitration pursuant to an arbitration agreement. The arbitration agreement 4. Klöckner and Advance Technology have been in a business relationship since 2002. In August 2006, they entered into a Memorandum of Understanding (MoU), which dealt with four principal points (Mr Khaw’s summary): (i) Advance Technology was appointed by Klöckner as an official distributor; (ii) the goods supplied and sold by Klöckner to Advance Technology under the distributorship arrangement were defined as “KP card and capsule films” (i.e. materials used for printing and packaging for the production of cards and capsules); (iii) the roles and responsibilities of each party in respect of different categories of customers under the distributorship arrangement were set out; and (iv) Klöckner and Advance Technology agreed on what should be the governing law in general and, more importantly the applicability of the UN Convention on International Sales of Goods. 5. This latter provision was contained in the final part of the MoU in the following terms: “ Governing Law and Jurisdiction This MOU and all of the obligations contained herein shall be governed in its entirety by the laws of the Federal Republic of Germany. The application of the UN Convention on the International Sales of Goods (CISG) is excluded. Any dispute, controversy, or claim between the parties hereto arising out of or relating to this MOU shall be submitted to an arbitral tribunal comprising of three (3) arbitrators and the arbitration venue shall be in Shanghai, China. Either party initiating an arbitration proceeding shall give notice to the other party. The arbitration proceedings shall be held in accordance with the arbitration rules of the International Chamber of Commerce (“ICC”) in effect on the date of the signing of this MOU. (Klöckner) and (Advance Technology) shall each appoint one (1) arbitrator, and these two arbitrators shall jointly select the third arbitrator which shall be admitted to practice law in the Federal Republic of Germany. If a party does not appoint an arbitrator within thirty (30) days after the selection of the first arbitrator, the relevant appointment shall be made by the chairman of the International Court of Arbitration. The arbitration shall be final and binding on the parties. The arbitration proceedings shall be conducted in English. For the purpose of this arbitration clause (Advance Technology) and (a subsidiary of Advance Technology) shall be considered as being one party.” (sic) 6. Mr Khaw for Advance Technology says that the MoU applies to the transactions which are the subject of the writ, and that accordingly, the proceedings must be stayed for arbitration. Mr Jat SC for Klöckner says first, that the claim for the cost of goods sold is a matter outside the scope of the MoU, and is not subject to the arbitration clause, and second, that if the arbitration clause does apply, it is governed by PRC law, and under that law the clause is null and void, inoperative or incapable of being performed. It is settled law that a stay will be refused in such circumstances: see Tommy CP Sze & Co v Li & Fung (Trading) Ltd & Ors [2003] 1 HKC 418 . 7. The issues to be determined therefore are: (i) are the sale and purchase of the goods within the provisions of the MoU and accordingly subject to the arbitration clause; (ii) what is the governing law of the arbitration agreement; (iii) if that law is PRC law is the clause null and void, inoperative or incapable of being performed. Are the sale of goods subject to the MoU: 8. Mr Jat argues that the claim in respect of the sale of goods is quite independent of the MoU, and is accordingly not covered by the arbitration agreement. The MoU, he contends, simply regulates the extent by which Advance Technology could participate in the distribution and sale of Klöckner’s goods to third-party customers in China, and nothing more. It does not in any way, he says, regulate between Klöckner and Advance Technology, the sale and purchase of the goods, the subject of the distribution agreement. 9. The individual invoices for the sales contained no arbitration clause, and there is no reference in the invoices to the MoU. The question must be whether or not the sale and purchase of KP cards and capsule films, those being plainly the subject of the MoU, and the subject of the sales and purchases, fall within the expression: “Any dispute, controversy, or claim between the parties hereto arising out of or relating to this MoU…” 10. The essential words that Mr Khaw must rely upon to link the sales to the MoU is the expression “arising out of or relating to”. This and other similar expressions were the subject of the decision in Fiona Trust & Holding Corp & Ors v Privalov & Ors [2007] 4 All ER 951 HL, [2008] 1 Lloyd’s Rep 254, in which the court held that an arbitration clause should be construed in accordance with the presumption that the parties intended any dispute arising out of the relationship into which they had entered or purported to enter to be decided by the same tribunal, unless the language made it clear that certain questions were intended to be excluded from the arbitrator’s jurisdiction. 11. Bearing that in mind, there are a number of features of the MoU which compel me to conclude that disputes between Klöckner and Advance Technology over the sale and purchase of the very items that were to be the subject of the distributorship were intended to go to arbitration. 12. First, the MoU plainly sets out and regulates the business relationship between Klöckner, as a supplier and manufacturer of goods, and Advance Technology, as an official distributor of Klöckner’s goods. 13. Second, although Advance Technology were not obliged to make any or a minimum purchase from Klöckner, under a clause in the MoU entitled “Competitive Products”, Advance Technology was not permitted to sell any products conflicting with the portfolio or interests of Klöckner without joint consent. While it is right that they could purchase Klöckner products from someone other than Klöckner, (probably an uneconomic proposition), they could not, except with the consent of Klöckner, purchase and distribute similar products. The unlikelihood of Klöckner agreeing to Advance Technology purchasing and distributing similar products from another supplier, together with the likely uneconomic nature of sourcing product elsewhere effectively ties Advance Technology to purchase from Klöckner. 14. The MoU, the being a distributorship agreement, whilst not absolutely binding Advance Technology to source all its product from Klöckner, is plainly designed to encourage Advance Technology to use Klöckner as its sole source of product. It is right that on its face Klöckner’s claim is a simple claim for monies due for goods supplied, but the evidence plainly establishes that as long ago as July 2008, Advance Technology’s solicitors were writing to Klöckner making a complaint as to the quality of the goods. Complaints were also made of a breach of the MoU by failing to supply goods, and a further breach of the MoU by Klöckner covertly soliciting Advance Technology’s clients in China. 15. It is right, as Mr Jat says, that the proceedings as they presently stand do not show any dispute in respect of the monies due. But that is only because Advance Technology must make this application before taking any steps on the proceedings. The existence of a dispute is demonstrated on the evidence. 16. If there is no stay, and Advance Technology are required to join in the substantive proceedings, there is no reason to doubt that even if the claim cannot properly be opposed, there will be a counterclaim and a claim to set off in respect of the disputes raised. In such circumstances all of the issues will be determined together. 17. Consequently, both Klöckner’s claim, and both elements of the intended counterclaim, breach of the MoU and issues of quality, may properly be described, as the transactions were in Princeton Technology Corp v Vector Electronic Company Ltd , (unreported, 23 December 1999, CACV 288/1999), as arising out of an under the umbrella of a formal distributorship agreement. It is illogical to think that businessmen entering into a distributorship agreement, containing an arbitration provision, would have intended that a question of quality of goods would not be determined by the same tribunal that would determine complaints of the breach of the MoU. 18. I am accordingly satisfied that the dispute falls within the scope of the arbitration agreement. The lex arbitri 19. The onus is on Klöckner, as the party seeking to resist going to arbitration, to prove that the arbitration agreement is null and void, inoperative or incapable of being performed: see Overseas Union Insurance Ltd v AA Mutual International Insurance Co Ltd [1988] 2 Lloyd’s Rep 63 at 70. The standard of proof in this respect is high: see Gatoil International Inc v National Iranian Oil Company , (unreported, 22 February 1990, Lexis Transcript p 2, English CA) per Bingham LJ (as he then was): “The words ‘incapable of being performed’ are a strong expression, in my judgment denoting impossibility, or practical impossibility, and certainly not mere inconvenience or difficulty. A mere change of circumstances rendering arbitration a less attractive mode of resolving a dispute or rendering the forum or procedural rules chosen for any reason unattractive, could never be enough. For a party who has agreed to resolve any dispute by arbitration to be freed from his obligation under s. 1(1) it is, in my judgment, necessary for him to show that the arbitration agreement simply cannot, with the best will in the world, be performed. I am satisfied that the words of exception should be strictly construed so as to reflect the intention of the Convention and the Act.” 20. The case advanced by Mr Jat is that the arbitration clause is governed by PRC law, and that the provision in the MoU as to governing law, set out in §5 above is restricted to defining the proper law of the contract. Mr Jat says that if the arbitration is governed by PRC law then, because the arbitration clause fails to particularise a designated arbitration institution, the clause is invalid and unenforceable under PRC law. 21. Mr Khaw says that a proper reading of the governing law provision leads inevitably to the conclusion that the law of the Federal Republic of Germany governs not only the contract between the parties, but also the arbitration provision. If he is right, then strictly, I do not need to consider the question of PRC law. 22. Mr Jat puts the submission this way: when the express choice of the seat of the arbitration differs from that of the proper law, the le arbitri should follow that of the seat of the arbitration. In support of that submission a number of authorities were cited including §16-016, Dicey & Morris, on The Conflict of Laws, 14 Ed. 2006. With respect to Mr Jat, his formulation of the proposition does not properly reflect the statement made in the textbook which reads: “It is submitted that in most cases the correct solution will be found in the construction of the agreement as to the parties’ choice of law. This respects the fact that what is in issue is a contractual question, on which the parties enjoy autonomy of choice of law, whether under the common law or under the Rome Convention. If no such choice, express or implied, can be discerned, then it will often be the case that the arbitration agreement will be found to be most closely connected with the law of the place where the arbitration has its seat, which is also the place where the award is to be treated as “made” for the purpose of the New York Convention.” 23. There is no doubt that the proper law of the contract and the lex arbitri may be different. There is no doubt too, that practical difficulties may arise when the lex arbitri is different to that of the seat of the arbitration. If there is, as Mr Jat suggested, a modern trend in the recent authorities to find that the governing law of the arbitration should be the law of the seat of the arbitration, it is a trend which certainly reflects a desire to avoid those practical difficulties. 24. But there is no rule that the lex arbitri must be the law of the seat of the arbitration. That is especially so where the law is chosen by the parties. That appears from Dicey and Morris, §16-017: “ The law chosen by the parties . If there is an express choice of law to govern the arbitration agreement, that choice will be effective, irrespective of the law applicable to the contract as a whole. If there is an express choice of law to govern the contract as a whole, the arbitration agreement will also normally be governed by that law: this is so whether or not the seat of the arbitration is stipulated, and irrespective of the place of the seat.” (My emphasis) 25. Mr Jat says that the seat of the arbitration being Shanghai, the parties must have implicitly chosen PRC law to govern the arbitration agreement. It is right that, taking the separability of the arbitration clauses as the starting point, a number of decisions, in different jurisdictions, have concluded that the law of the seat of the arbitration is the appropriate law to govern the parties’ arbitration agreement: see e.g. C v D [2008] 1 Lloyd’s Rep 239 CA; XL Insurance Ltd v Owens Corning [2000] 2 Lloyd’s Rep 500, and Black Clawson Int’l Ltd v Papierwerke Waldhof-Ashaffenburg AG [1981] 2 Lloyd’s Rep 446. In the latter case the court went so far as to say that it would be a rare case in which the law of the arbitration agreement was not the same as the law of the place as the seat of the arbitration. 26. But the starting point must be the terms of the particular clause and the contract in question. First, the contract between the parties including the arbitration clause must be examined to see if there is any agreement, express or implied, by the parties as to both the proper law of contract, or the lex arbitri. It is only if agreement cannot be found that the implication arises from the choice of seat, that the law of that place will be the lex arbitri. 27. It has been held that to determine the governing law it is not permissible to look at the arbitration agreement in isolation, but that regard should be had to the surrounding circumstances including the law governing the substantive contract.: see Deutsche Schachtbau v Shell International Petroleum Company Ltd [1990] 1 AC 295 (CA) [1] . 28. There are three factors in the MoU which lead me to conclude that in this case the parties impliedly intended that the lex arbitri is the law of the Federal Republic of Germany. 29. First, the MoU records that “all of the obligations contained herein shall be governed in its entirety by the laws of the Federal Republic of Germany”. The two expressions, “all of the obligations”, and “in its entirety”, are both expressions which on their face plainly refer to the whole of the contract, including the arbitration clause. I accept, as Mr Jat points out, that in the next sentence the paragraph goes on to exclude the UN Convention on the International Sales of Goods, a matter quite unrelated to the conduct of the arbitration. However the location of that sentence does not, in my view, detract in any way from the plain meaning of the two expressions to which I have referred. 30. Second, the arbitration clause provides that the third arbitrator shall be admitted to practice law in the Federal Republic of Germany. That requirement is entirely consistent with the proposition that the law of the Federal Republic of Germany should be the law to govern the arbitration agreement. It would be illogical for the parties to specifically provide that a German qualified lawyer should conduct an arbitration, the lex arbitri of which is PRC law. It is entirely logical that the parties should seek to have a German qualified lawyer as an arbitrator in a contract in which the proper law of the contract and the arbitration was German law. 31. Third, both the statement as to the governing law and the arbitration clause are contained under the same heading “Governing Law and Jurisdiction”. Were they under separate headings, and without the two expressions to which I have referred, the inference that the law of the Federal Republic of Germany was to govern the arbitration would not be so strong. 32. I accordingly conclude, that although the parties have agreed that the arbitration shall take place in Shanghai, they have agreed that it shall be conducted under the law of the Federal Republic of Germany. 33. There is no evidence as to the law of the Federal Republic of Germany in relation to the validity of an arbitration agreement and I proceed on the basis that it is the same as the law in Hong Kong. Mr Jat was unable to dispute the proposition that under Hong Kong law the arbitration agreement was perfectly valid. 34. It follows that Klöckner and Advance Technology are bound by their agreement to proceed to arbitration and the stay sought must be granted. Validity under Chinese law 35. In case I am wrong in concluding that the lex arbitri is the law of the Federal Republic of Germany, the only other viable law for the lex arbitri is the law of the seat of the arbitration, Shanghai, China. It is accordingly appropriate that I should comment briefly on the position as I see it under PRC law. 36. Article 16 of the PRC Arbitration Law provides that an arbitration agreement must contain three particulars namely, an expression of intention to apply for arbitration, matters for arbitration, and a designated arbitration institution. Article 18 provides: “If an arbitration agreement contains no or unclear provisions concerning the matters for arbitration or the arbitration institution, the parties may reach a supplementary agreement. If no such supplementary agreement can be reached, the arbitration agreement shall be null and void.” 37. Effective 8 September 2006, Article 4, constituting an Interpretation of the Supreme People’s Court of the Arbitration Law of the PRC came into effect: “Where an arbitration agreement only includes the arbitration rules applicable for the dispute at issue, the parties concerned shall be deemed not to have agreed upon the arbitration institution, unless the parties have reached a supplementary agreement or the arbitration institution can be identified through their agreed-upon arbitration rules.” 38. I accept Mr Jat’s proposition that the supplementary agreement provision cannot be invoked, even using the “best will in the world” concept as enunciated by Bingham LJ in Gatoil . That proposition is applicable to matters such as the appointment of an arbitrator which requires merely an act by a party and not a matter requiring further agreement between parties. 39. I am satisfied from the evidence of the PRC law experts that the failure of the arbitration clause to specify a particular arbitration institution is fatal, at PRC law, to an arbitration clause, unless the arbitration institution can be identified through the agreed-upon arbitration rules in accordance with the interpretation set out in §38 above. If I were to approach the matter from the point of view of a common lawyer I would have little difficulty at all in concluding that the reference to the arbitration rules of the ICC, in the arbitration clause, would be sufficient to identify the International Court of Arbitration as the arbitration institution agreed upon by the parties. 40. However, there has been produced to me a decision from the Supreme People’s Court in response to a request for instructions concerning the validity of an arbitration clause by the Higher People’s Court of Fujian Province. The decision records the arbitration clause at issue as being in the following terms: “Any disputes arising out of or in connection with the present contract shall be finally settled under the Rules of Arbitration of the International Chamber of Commerce, and the place of arbitration shall shift between Xiamen and Brussels. The arbitral award shall be final and binding upon the two parties, and the judgment over the arbitral award enforcement may be given by any court that has the jurisdiction.” 41. The court held that since Xiamen China was stipulated as one of the arbitration venues, PRC laws were the applicable law to determine the validity of the arbitration clause. The court said this: “In the present case, although the arbitration clause has stipulated that the arbitration shall be under the Rules of International Chamber of Commerce , the arbitration commission is still not expressly stipulated. The International Chamber of Commerce recommends that in cases where the arbitration place agreed upon by the parties is mainland China, all parties wishing to make reference to ICC arbitration shall use and cite the clause of the ICC International Court of Arbitration in their contracts. However, the parties in the present case did not use such standard clause. Since the arbitration institution cannot be determined according to the Rules of the International Chamber of Commerce and the parties did not reach a supplementary agreement to specify the arbitration institution, therefore, according to Article 4 of “Interpretation of the Supreme People’s Court on Certain Issues Concerning the Application of the Arbitration Law of the People’s Republic of China”, the arbitration institution is not expressly designated by the parties in the arbitration clause in the present case. According to Article 18 of the Arbitration Law of People’s Republic of China, the arbitration clause in the present case is invalid.” 42. Although no reference has been made to the last part of Article 4, which, to a common lawyer permits the implication of an arbitration institution by reference to the rules, I must assume that the Supreme People’s Court were fully aware of all of the provisions of Article 4. Notwithstanding the implication provision, the court was not prepared to hold that the reference to the rules of the ICC were sufficient to identify the arbitration institution. 43. I am accordingly of the view that as a matter of PRC law, the arbitration clause does not identify an arbitration institution, and at PRC law the clause would be invalid. The clause being invalid, Klöckner would meet the required standard of proof to establish that the arbitration clause is null and void, inoperative or incapable of being performed. In those circumstances, a stay would be refused, and Klöckner would be entitled to proceed with the action. Costs 44. There will be an order nisi that the plaintiff must pay the defendant’s costs of and incidental to the summons, to be taxed on a party and party basis. Costs in the substantive proceedings are reserved pending such orders as the arbitrators may ultimately make. (John Saunders) Judge of the Court of First Instance High Court Mr Jat Sew Tong, SC leading Mr Alfred C P Cheng, instructed by Messrs DLA Piper Hong Kong, for the Plaintiff Mr Richard Khaw and Ms Angel Mak, instructed by Messrs Patrick Mak & Tse, for the Defendant [1] The decision was reversed on other grounds in the House of Lords, see p 329. Look up this case on Lawcite Noteup",
  "length": 25077,
  "headers_seen": [
    "Introduction",
    "The arbitration agreement",
    "The lex arbitri",
    "Validity under Chinese law",
    "Costs"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2011/458",
  "query": "arbitration",
  "ts": "2025-10-14T11:20:33",
  "ok": true
}