{
  "title": "COMPANIA SUD AMERICANA DE VAPORES S.A V. HIN PRO INTERNATIONAL LOGISTICS LTD | [2015] HKCA 107 | HKLII",
  "court": null,
  "year": 2015,
  "date": null,
  "content": "HKLII Databases Court of Appeal [2015] HKCA 107 COMPANIA SUD AMERICANA DE VAPORES S.A V. HIN PRO INTERNATIONAL LOGISTICS LTD Judgment Information Date 10 Mar, 2015 Action No. CACV243/2014 Neutral Cit. [2015] HKCA 107 Parallel Cit. [2015] 2 HKLRD 458 [2015] 2 HKC 436 Download MS Word Judgment Reading Options Translation Toggle Highlight Appeal History CACV243/2014 CACV243A/2014 COMPANIA SUD AMERICANA DE VAPORES S.A v. HIN PRO INTERNATIONAL LOGISTICS LTD CACV 243/2014 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF APPEAL CIVIL APPEAL NO 243 OF 2014 (ON APPEAL FROM HCMP NO 1449 OF 2014) --------------------------- BETWEEN COMPANIA SUD AMERICANA DE VAPORES S.A. Plaintiff (Appellant) and HIN-PRO INTERNATIONAL LOGISTICS LIMITED Defendant (Respondent) (in Receivership) --------------------------- Before : Hon Lam VP, Barma JA and Poon J in Court Date of Hearing : 21 January 2015 Date of Judgment : 11 March 2015 ________________ J U D G M E N T ________________ The Court: 1. This is a judgment to which all members of the court have contributed. 2. From 16 June to 30 July 2014, Deputy High Court Judge Saunders (“DHCJ Saunders”) made a series of orders on the application of the plaintiff which we shall identify as the Hin-Pro Mareva, Hin-Pro Receivership Order, Soar Mareva and Soar Receivership Order. Those orders were discharged by Deputy High Court Judge Wilson Chan (“DHCJ Chan”) on 15 October 2015. The details of those orders and the background leading to the grant of the same by DHCJ Saunders were set out in the judgment of DHCJ Chan of 15 October at paras 1 to 25. 3. The defendant Hin-Pro International Logistics Limited (“Hin-Pro”) is a Hong Kong company. Disputes arose between Hin-Pro and the plaintiff in respect of a series of contracts of carriage by sea from ports in mainland China to ports in Venezuela. The contracts were embodied in bills of lading issued by the plaintiff. Hin-Pro claimed to be “the legal and actual shipper and enjoyed ownership of the cargoes” [1] and that the plaintiff, as carrier, had wrongfully released the cargoes without the production of the bills of lading. The plaintiff disputed the claims of Hin-Pro on a number of substantive grounds. For present purposes, it is not necessary for us to go into those grounds. It suffices for us to proceed on the basis that there are bona fide disputes to the claims by Hin-Pro. 4. In 2012 Hin-Pro commenced proceedings in the Wuhan Maritime Court against the plaintiff under 5 bills of lading. Since then further actions were commenced by Hin-Pro and such proceedings were continued at various courts in mainland China despite the orders made by English courts mentioned below. The plaintiff had contested the jurisdictions of the Chinese courts by reference to what it regarded as an exclusive jurisdiction clause in the bills of lading issued by the plaintiff. The courts in China applied PRC law in rejecting the challenge and some actions proceeded to trial in which the plaintiff took part. 19 judgments were entered in the Ningbo Maritime Court. The plaintiff is taking steps to appeal against those judgments. 5. The orders granted by Deputy Judge Saunders were made under section 21M of the High Court Ordinance in aid of proceedings in England. The proceedings in England were brought by the plaintiff to enforce its case based on the jurisdiction clause in the bills of lading issued by the plaintiff. 6. There have been two English actions. The first one was an action in 2012. In November 2012, the plaintiff commenced action 2012 Folio No 1519 in the English Commercial Court, seeking an anti-suit injunction prohibiting Hin-Pro from pursuing or taking any further steps in the Wuhan proceedings. Burton J granted an ex parte interim injunction, and that was continued as an inter partes hearing by order of Andrew Smith J at the end of November 2012. Hin-Pro did not take part in this English action. Those orders were ignored by Hin-Pro as it proceeded with the actions in mainland China. The plaintiff applied for committal against Hin-Pro. On 21 March 2013, the English Commercial Court found that both Hin-Pro and its sole director, Miss Sui Wei were in contempt of court. Miss Wei was sentenced to imprisonment for 3 months, and permission was given for writs of sequestration to be issued against Hin-Pro. 7. Apparently, these orders did not have much impact on Hin-Pro and it continued with its legal actions in the PRC. Further, it commenced new proceedings in Guangzhou, Qingdao, Tianjin, Ningbo and Shanghai. As mentioned it was the actions in Ningbo which had run their full courses to judgments though the plaintiff is still trying to appeal against the same. 8. In view of these new proceedings, the plaintiff commenced another action 2013 Folio No 1248 in the English Commercial Court. On 29 November 2013 Blair J granted an inter partes anti-suit injunction in this second action. Again that did not stop Hin-Pro from proceeding with the legal actions in the PRC. 9. On 27 May 2014, Ningbo Maritime Court entered the first judgment after trial against the plaintiff for the sum USD360,000 and costs in the sum of RMB100,000. Before that, the plaintiff had attempted to apply for a world-wide freezing order (“WWFO”) from the English court in the second action. However, according to the plaintiff, due to the non-availability judges and counsel, it only managed to obtain an ex parte WWFO on 13 June 2014 from Walker J. That WWFO was for the sum of USD27,835,000 and there was also order requiring the disclosure of assets by Hin-Pro. 10. Based on the order granted by Walker J, the plaintiff applied ex parte for the Hin-Pro Mareva on 16 June in Hong Kong. The order was granted by DHCJ Saunders on that date. On 17 July, DHCJ Saunders granted an ex parte receivership order against Hin-Pro, appointing accountants from Deloitte as receivers and managers of Hin-Pro. On 18 July, on another ex parte application, he granted the Soar Mareva on the basis that Soar was an alter ego and held assets of Hin-Pro as its nominee. On 30 July, he granted the ex parte Soar Receivership order. 11. On 5 August 2014, Hin-Pro issued a summons for the discharge of the orders made by DHCJ Saunders [2] . DHCJ Chan heard the summons on 11 September 2014 and further written submissions were filed on 15 September 2014. On 15 October 2014, DHCJ Chan discharged these orders. 12. At the time when the application was heard before DHCJ Chan, the proceedings in England were still at the interlocutory stage and the injunctions granted (including the anti-suit injunction) were interim injunctions. Since then, the second English action was tried before Cooke J who entered judgment in favour of the plaintiff on 14 October 2014. That judgment is under appeal and the up to the time of the hearing of the appeal in Hong Kong, that English appeal has not been heard. The significance of Hin-Pro’s failure to appear at the inter-partes hearings of 20 June and 25 July 13. Upon granting the ex parte Hin-Pro Mareva, the judge had set a return date for an inter-partes hearing on 20 June. However, Hin-Pro did not appear at that hearing. DHCJ Saunders continued the Hin-Pro Mareva. There was another inter-partes hearing before DHCJ Saunders on 25 July. This time, the defendant appeared by counsel, Mr George Chu. Mr Chu indicated to the court that the defendant would apply to discharge both the Hin-Pro Mareva and the Soar Mareva. He however agreed with the submission of Mr Hui, counsel for the plaintiff, that the application must be taken out by summons. Mr Chu then asked for directions for filing of evidence whereupon the judge continued the injunctions and gave directions. 14. Mr Scott SC (who together with Mr Hui appeared for the plaintiff) contended before DHCJ Chan that the failure of Hin-Pro to secure a discharge of the orders at these hearings barred it from doing so pursuant to the summons of 5 August. Counsel relied on Chanel Ltd v FW Woolworth & Co Ltd [1981] 1 WLR 485 at 492 to support this contention. The contention was rejected by DHCJ Chan in light of the express provision in the orders for liberty to apply for the discharge of the Hin-Pro Mareva, see paras 28 and 29 of the judgment of 15 October. 15. Before us, Mr Scott repeated the same submission, also citing Chanel Ltd v FW Woolworth & Co Ltd in support. With respect, we disagree. 16. The principle derived from Chanel Ltd v FW Woolworth & Co Ltd is that if a point was open to a party on an earlier interlocutory application and was not pursued, then it is not open to him to take the point at a later application when there has been no material change of circumstances and no new facts. This principle applies when the mareva injunction is continued inter partes , or where an undertaking is given in equivalent terms, which is expressed to be until further trial or further order, and no specific reservation is made before the court. See Gee on Commercial Injunctions , 5 th Edition, at para 20.061 at pp.632-633. 17. The Chanel Ltd v FW Woolworth & Co Ltd principle is founded on the basis that the party has a responsibility to take the point when it is first reasonably available to him before the court and that it would be an abuse of process to delay taking it until a subsequent application: Gee , ibid . Where, as is here, the interlocutory injunction is continued at the return date but there had been an express intimation that the defendant was contemplating an application to discharge once his evidence is in order, he is not guilty of any abuse of process as envisaged by the Chanel Ltd v FW Woolworth & Co Ltd principle. Cf. Gee , at para 23-015 at 714 (which concerns with undertakings but equally applies to injunctions). That principle does not apply to debar him from taking out the subsequent discharge application. 18. Here, the defendant was absent on the return date on 20 June. On the next return date on 25 July, when it appeared, Mr Chu expressly told the court that the defendant would apply to discharge the Hin-Pro Mareva. In other words, although the Hin-Pro Mareva was continued by DHCJ Saunders, it was continued on the basis of and with the express reservation by the defendant that it would move for a discharge. The defendant is not guilty of any abuse of process in the Chanel Ltd v FW Woolworth & Co Ltd sense and is not debarred from taking out the subsequent discharge application. We reject Mr Scott’s submission to the contrary. The authority of Hin-Pro to apply for discharge after the appointment of receivers 19. Mr Scott further submitted that Hin-Pro’s directors could not have applied for the discharge of the orders of DHCJ Saunders without leave of the court after the appointment of receivers and managers over Hin-Pro, and that as such leave had not been sought or obtained, DHCJ Chan should have refused to accede to the application for discharge. 20. Mr Scott submitted that this was the consequence of the proviso at the end of paragraph 1 of the Hin-Pro Receivership Order. Paragraph 1 of the Hin-Pro Receivership Order provided for the appointment of receivers over Hin-Pro and all of its assets, and specified certain powers to be granted to such receivers. It was, however, subject to the proviso which was in the following terms: “without prejudice to the authority of the directors or officers of [Hin-Pro] to cause [Hin-Pro] to take steps in this legal action to resist the Plaintiff’s claims or otherwise with the leave of the Court, pending the final determination of this action”. 21. This involves reading the reference to “the leave of the Court” as being applicable both to the taking of steps to resist these proceedings and to any other actions that Hin-Pro’s directors or officers might wish to take. Mr Scott submitted that such a reading of the proviso was in accordance with the principle that the appointment of the receivers had the effect of putting into abeyance the powers of Hin-Pro’s board in respect of management of the company (see McDonald v Golden Dynasty Enterprises Ltd [2008] 5 HKLRD 569 at paras 34-37 of the judgment, and the cases there cited). It followed, said Mr Scott, that the proviso did no more than make explicit what was in any case the effect of the receivership order. 22. Mr Barlow, however, contended that no leave was required. He submitted that: (1) The proviso, properly understood, did not impose a requirement to obtain leave in order to take steps to resist these proceedings, but only in respect of the taking of other action by the directors. (2) Even if it purported to impose such a requirement, this was wrong in principle, as the appointment of receivers did not displace the ability of the company concerned to defend itself against the making of the order or the proceedings in which it was made (and in this respect the position was similar to that where provisional liquidators were appointed in respect of a company that was the subject of a winding up petition, as to which see, e.g. Re Surplus Trader Ltd [2005] 4 HKLRD 436 at para 16). (3) This was also in accordance with the principle that the board’s powers were only displaced in respect of the aspects of the company’s business that were the subject of the receivership order (see Newhart Developments Ltd v Co-Operative Commercial Bank Ltd [1978] 1 QB 814 at 819C-820B). Here, therefore, so long as the directors did not seek to make use of the company’s assets (which were the subject of the receivership order) it was open to them to take steps to resist the proceedings, including seeking to discharge the order by which the receivers were appointed. 23. In our view, the Hin-Pro Receivership Order, properly construed, does not require leave to be obtained before the company itself can resist the proceedings. The more natural reading of the proviso is, we think, that the company’s board retains the power to act on its behalf in order to resist the proceedings, and also to act for it otherwise where it obtains the leave of the court to do so. 24. This reading of the proviso is, we think, consonant with the principles established in the cases relied upon by Mr Barlow. Those principles are well-established, and accord with common notions of fairness and justice. It is difficult to see why a company faced with litigation should not be free to defend itself as best it can, particularly where orders with potentially draconian effects have been made against it. Where such resistance is unjustified, the court has at its disposal the means to deal with it, for example by dealing with matters summarily, or by making suitable orders as to costs, if necessary against the persons who are behind the company’s actions, even if they are not themselves parties to the proceedings. The imposition of a leave requirement before a company can defend itself would hamper and delay its ability to do so, even in circumstances where the order that it is sought to challenge might cause serious adverse consequences for the company, so that a prompt challenge to it is clearly in the company’s interests. 25. Even if the proviso were to be read in the manner suggested by Mr Scott, it seems to us that the principles established in the authorities which Mr Barlow relies upon would mean that, in our view, leave would almost inevitably have been given if it were applied for, so that it would be wrong to have refused to entertain the application for discharge on the basis that leave had not been applied for in advance. We therefore reject Mr Scott’s submissions on this point. The substantive grounds for the discharge: judicial conflicts 26. Turning now to the substantive grounds given by DHCJ Chan in discharging the orders of DHCJ Saunders: though DHCJ Chan referred to material non-disclosure by the plaintiff, the main ground is what His Lordship referred to as judicial conflicts between the orders made by the English court and the PRC judgments. At paras 38 to 39 of the judgment of 15 October, the learned judge said: “38. I agree with Mr Barlow SC's submissions. The defendant sues the plaintiff in the PRC courts to enforce its BL contracts. The plaintiff sues the defendant in the English court to enforce its interpretation of the JC contained in the same BL contracts. The Ningbo court has heard the plaintiffs challenge to its jurisdiction and given final judgment that it has jurisdiction to try and determine the defendant's claims. On the other hand, the English court has provisionally ruled upon an interlocutory basis that the plaintiff has a good arguable case that the JC is an exclusive jurisdiction clause and it has provisionally ruled that it has jurisdiction to hear and determine the defendant's claims. 39. By these proceedings, the plaintiff is seeking to have this court assist the English court in thwarting the defendant's claims in the PRC courts. As the two courts are in clear conflict over the question of jurisdiction, I agree that the policy of section 21M(4) and this court's policy of judicial comity require this court to refuse to make any order.” 27. In this appeal, Mr Scott accepted that judicial conflicts is a relevant consideration when a Hong Kong court exercises the power under section 21M. Counsel however submitted there is no real conflict in the present instance because: (a) The PRC judgments did not enter on the basis that the relevant clause was not an exclusive jurisdiction clause. (b) Enforcement of an exclusive jurisdiction clause is not to be regarded as a breach of international judicial comity. 28. Section 21M provides as follow: “(1) Without prejudice to section 21L(l), the Court of First Instance may by order appoint a receiver or grant other interim relief in relation to proceedings which- (a) have been or are to be commenced in a place outside Hong Kong; and (b) are capable of giving rise to a judgment which may be enforced in Hong Kong under any Ordinance or at common law. (2) An order under subsection (1) may be made either unconditionally or on such terms and conditions as the Court of First Instance thinks just. (3) Subsection (1) applies notwithstanding that- (a) the subject matter of those proceedings would not, apart from this section, give rise to a cause of action over which the Court of First Instance would have jurisdiction; or (b) the appointment of the receiver or the interim relief sought is not ancillary or incidental to any proceedings in Hong Kong. (4) The Court of First Instance may refuse an application for appointment of a receiver or interim relief under subsection (1) if, in the opinion of the Court, the fact that the Court has no jurisdiction apart from this section in relation to the subject matter of the proceedings concerned makes it unjust or inconvenient for the Court to grant the application. (5) The power to make rules of court under section 54 includes power to make rules of court for- (a) the making of an application for appointment of a receiver or interim relief under subsection (1); and (b) the service out of the jurisdiction of an application or order for the appointment of a receiver or for interim relief. (6) Any rules made by virtue of this section may include such incidental, supplementary and consequential provisions as the Rules Committee considers necessary or expedient. (7) In this section, ‘interim relief’ includes an interlocutory injunction referred to in section 21L(3).” 29. In the recent judgment of another division of this court in Pacific King Shipping Holdings Pte Ltd v Huang Ziqiang CACV 94 of 2014, it was held that in exercising the power under section 21M, the court is required to abide by the general principles governing interim relief. In the context of Mareva type of relief, a plaintiff must show a good arguable case. 30. In that connection, Mr Barlow SC (appearing with Mr Chu for Hin-Pro and Soar) drew our attention to the judgment of the court in Motorola Credit Corporation v Uzan (No 2) [2004] 1 WLR 113 at para 102, which concerned an application under s 25 of the Civil Jurisdiction and Judgments Act 1982, the English equivalence of our section 21M: “Mr Leggatt argues that, in the context of proceedings under section 25 of the 1982 Act, where (as here) the foreign court in interlocutory proceedings has itself determined that a good arguable case exists against the defendants, that is, or falls to be treated as, a final decision upon that issue for the purposes of the section 25 jurisdiction of this court. We do not think that is correct. The requirement that the claimant must establish that Mareva -type relief would be granted if the substantive proceedings were brought in England requires a decision of the judge based on English procedures and the approach of the English court to the nature and sufficiency of the evidence in a situation where the claimant has come to England to obtain a remedy unavailable to him in the substantive foreign proceedings. It is frequently, indeed usually, the position that section 25 proceedings are brought following issue and service of the foreign proceedings but before there has been any decision of the foreign court which examines the strength or arguability of the claimant's substantive case. However, whether or not that is the position, in our view the English court is required, once issue is joined in the section 25 proceedings, to make a separate exercise of judgment rather than a simple acceptance of the decision of the foreign court in interlocutory proceedings decided on the principles applicable, the evidence then available, and the levels of proof required in that jurisdiction.” 31. In Refco Inc v Eastern Trading Co [1999] 1 Ll Rep 159, Morritt LJ said at p.170-171: “For present purposes it is sufficient to point out that it was implicit in all the judgments that the approach of the Court in this country to an application for interim relief under s. 25 is to consider first if the facts would warrant the relief sought if the substantive proceedings were brought in England. If the answer to that question is in the affirmative then the second question arises, whether, in the terms of s. 25(2), the fact that the Court has no jurisdiction apart from the section makes it inexpedient to grant the interim relief sought.” 32. Thus, even before one comes to the second stage in terms of consideration under section 21M(4), the court must ask itself whether the facts of the case warrants the grant of interim relief if substantive proceedings were brought in Hong Kong. This entails the judge hearing the application to examine the strength and arguability of an applicant’s claim in the context of Hong Kong law rather than simply accepting a decision of the foreign court. 33. Such an approach is consistent with the rationale behind the enactment of section 21M in Hong Kong which was to deal with the problem highlighted by Mercedes Benz AG v Leiduck [1996] 1 AC 284 , see the discussion in the Final Report of the Working Party on Civil Justice Reform, section 12.2. 34. For present purposes, the substantive proceedings are the proceedings in England though there were other proceedings dealing with the claims on the bills of lading in the PRC courts. The cause of action in the English proceedings is based on a clause in the bills of lading which the English courts have held to be an exclusive jurisdiction clause. The primary relief sought is anti-suit injunction. As we have seen from the above discussion, the courts in Hong Kong must examine the plaintiff’s claim independently. 35. Counsel have not referred us to any authority in which application was made under section 21M (or its equivalent) in aid of foreign proceedings in which the claim is for breach of an exclusive jurisdiction clause. Nor are we able to find such authority. The anti-suit nature of the English proceedings presents a special problem because if the substantive anti-suit proceedings were brought in Hong Kong, we have to be cautious in light of the requirement of judicial comity and the lack of primary jurisdiction over the subject matter in our courts. In Airbus Industrie GIE v Patel [1999] 1 AC 119 , Lord Goff formulated this principle at p.138G to H: “As a general rule, before an anti-suit injunction can properly be granted by an English court to restrain a person from pursuing proceedings in a foreign jurisdiction in cases of the kind under consideration in the present case, comity requires that the English forum should have a sufficient interest in, or connection with, the matter in question to justify the indirect interference with the foreign court which an anti-suit injunction entails.” 36. His Lordship also endorsed the stricter approach in the American courts encapsulated in the judgment of Judge Wilkey in Laker Airways Ltd v Sabena, Belgian World Airlines (1984) 731 F2d 909 at p.926-7, that anti-suit injunctions are most often necessary (a) to protect the jurisdiction of the enjoining court, or (b) to prevent the litigant’s evasion of the important public policies of the forum. See Airbus Industrie GIE v Patel , supra, at p.136E to F, 139H, 140B to D. 37. At p.138B to D, Lord Goff alluded to a hypothetical scenario where the English court were asked by an Indian bank to grant an anti-suit injunction to restrain a defendant from proceedings in the United States against the bank in respect of a transaction in India on the basis that the defendant was amenable to be sued in England due to its presence there. His Lordship said his immediate reaction was that it would be surprising if the English court would grant such injunction. 38. At the same time, Lord Goff emphasised that this is only a general rule and it must not be interpreted too rigidly. At p.140D, His Lordship made provision for exceptional cases: “Indeed there may be extreme cases, for example where the conduct of the foreign state exercising jurisdiction is such as to deprive it of the respect normally required by comity, where no such limit is required to the exercise of the jurisdiction to grant an anti-suit injunction.” 39. In Airbus Industrie GIE v Patel , supra, the English courts were asked to grant an anti-suit injunction to restrain proceedings in Texas by English residents in respect of aircraft crash in India. Texas did not recognise the principle of forum non conveniens. There were parallel proceedings in India, the natural forum for the dispute, and the Indian court had granted injunction to restrain the defendants from pursuing their claims except in the courts of India. That injunction was ineffective against Mr Patel. Airbus therefore issued proceedings in England (where Mr Patel resided) to prevent Mr Patel to pursue his claims in Texas. The House of Lords held that an anti-suit injunction should not be granted in England as the English court had no interest in the matter and the grant of such injunction would be inconsistent with comity. 40. Neither the fact that Mr Patel was resident in England (thus an English anti-suit injunction would be more effective than the Indian judgment) nor non-recognition of Texan court to the doctrine of forum non conveniens was sufficient to persuade the House of Lords that English court should intervene in that case. 41. That was not a case on the equivalent English provision of section 21M. Lord Goff also highlighted that in that case the jurisdiction of the English court was not invoked in terms of assistance being provided to enforce the Indian judgment, see p.140H. Yet, since we have to consider whether the relief would be granted if the substantive proceedings were brought in Hong Kong, we cannot disregard the general rule in Airbus Industrie GIE v Patel , supra. 42. Another point to note is that Lord Goff did not consider the scenario where there is a choice of forum binding on the parties, see p.138F. This may have some significance since Mr Scott contended that the enforcement of exclusive jurisdiction clause is consistent with the principle of comity. We note however that Airbus Industrie GIE v Patel , supra, had been applied in a case in Singapore where there was a choice of forum provision, see People’s Insurance Co Ltd v Akai Pty Ltd [1998] 1 SLR 206 . 43. In respect of judicial comity, Millett LJ made the following observations in Refco Inc v Eastern Trading Co , supra, at p.175: “… judicial comity requires restraint, based on mutual respect not only for the integrity of one another’s process, but also for one another's procedural and substantive laws. The test is an objective one. It does not depend upon the personal attitude of the judge of the foreign court or on whether the individual judge would find our assistance objectionable. Comity involves respect for the foreign Court's jurisdiction and process, not respect for the foreign judge's feelings.” 44. Lord Goff had this to say in Airbus Industrie GIE v Patel , supra, at p.141B: “In a world which consists of independent jurisdictions, interference, even indirect interference, by the courts of one jurisdiction with the exercise of the jurisdiction of a foreign court cannot in my opinion be justified by the fact that a third jurisdiction is affected but is powerless to intervene. The basic principle is that only the courts of an interested jurisdiction can act in the matter; and if they are powerless to do so, that will not of itself be enough to justify the courts of another jurisdiction to act in their place.” 45. Having regard to the principle of judicial comity, had the plaintiff commenced a claim for anti-suit injunction in Hong Kong, it is doubtful whether our court would grant such injunction to prohibit proceedings in another jurisdiction when it does not have a sufficient interest in, or connection with, the matter in question to justify the indirect interference with the foreign court. In the present context, the court in Hong Kong is not a natural forum for the disputes in relation to the bills of lading. Nor is it designated as a forum for the disputes in the bills of lading. Neither have the parties come to Hong Kong to litigate on such disputes. 46. Lord Goff referred to the extreme case when the conduct of the foreign state exercising jurisdiction is such as to deprive it of the respect normally required by comity. Mr Scott did not suggest (nor do we see any basis for him to suggest) that the PRC courts had conducted the cases in such a manner. As far as we can see, those courts only applied the conflicts of law rules in the PRC in holding that the clause relied upon by the plaintiff did not oust the jurisdiction of the PRC courts. 47. In Masri v Consolidated Contractors (No 3) [2009] 2 WLR 669 , Lawrence Collins LJ (as he then was) accepted that international comity is an important consideration at para 81 though on the facts of that case it was held that anti-suit injunction should be granted to protect the plaintiff in that case from conduct which was designed to interfere with the process of the English court in litigation to which the defendant had submitted: “… In modern times the courts have often emphasised the importance of comity in the exercise of the discretion to grant anti-suit injunctions. Although the injunction is directed to the parties it involves an indirect interference with the foreign court, and caution is required before the injunction is granted … Comity may be decisive where the English court is asked to grant an anti-suit injunction when the case has no relevant connection with England, since to grant an injunction in such a case may be a breach of international law: Airbus Industrie GIE v Patel [1999] 1 AC 119 .” 48. As in the case of Airbus Industrie GIE v Patel , supra, the following facts cannot be sufficient ground for intervention by Hong Kong court: (a) anti-suit injunctions granted in the English courts could not effectively prevent Hin-Pro from pursuing the actions in the PRC; and (b) as Hin-Pro is a Hong Kong company, orders made by a Hong Kong court are more effective. 49. Though the plaintiff come here to seek relief under section 21M instead of making a substantive claim for anti-suit injunction in Hong Kong, we do not think it makes any difference in view of the first stage of inquiry under the test laid down in Refco Inc v Eastern Trading Co , supra. An English anti-suit injunction with respect of legal proceedings in another jurisdiction cannot be enforced in Hong Kong. 50. In the present case, the plaintiff did not ask for section 21M relief in the form of an interim anti-suit injunction. Instead, it sought a Mareva injunction (and receivership order based on it) to protect its claim for reflective damages based on the clause in the bills of lading. We have explained in our judgment of 18 December 2014 what we meant by describing the claim for damages as reflective. It should be noted that the damages claimed by the plaintiff (by reference to which the limit of the Mareva injunction was set in England as well as the ex parte orders granted by DHCJ Saunders) were not confined to costs incurred by the plaintiff in the PRC proceedings, but also extended to the potential amount of judgments that could be entered in favour of Hin-Pro in the PRC cases. 51. The anti-suit nature (and thus the indirect interference with proceedings in the PRC courts) is manifested in the claim that the damages was sought to reverse the effect of whatever judgments which might be issued by the courts in the PRC instead of an investigation of the underlying claims on the bills of lading (which the English proceedings were not concerned with). Whilst there are authorities supporting award of damages for breach of exclusive jurisdiction clause or arbitration clause in respect of costs incurred in foreign proceedings and judgments in the same amount as the foreign judgments when they had actually been paid by a plaintiff suing for such breach [3] , the grant of a pre-emptive Mareva injunction based on such a claim when the foreign judgments have not been satisfied went beyond any cases that we are aware of (except the decision of Cooke J in the present case). 52. Though the calculation of the limit for the Mareva injunction in the present case does include a sum representing the amount paid by the plaintiff to satisfy a Ningbo judgment and another sum representing costs incurred by the plaintiff, it cannot be disputed that it went far beyond the total of those two sums. The pre-emptive nature of the pre-trial Mareva injunction granted in the English proceedings is beyond dispute. 53. Further, based on the English Mareva injunction, the plaintiff obtained the Hin-Pro Mareva and Hin-Pro Receivership Order in Hong Kong. Then, based on such receivership order, the receivers attempted to stop the proceedings in the mainland courts. Viewed in this light, these orders had been obtained by the plaintiff for the purpose of implementing the anti-suit injunctions granted in England though they had not (and could not have) applied for such injunctions in Hong Kong. We do not think one can side-step the requirement to have regard to judicial comity in this way. 54. Mr Scott submitted that there was no conflict between the proceedings in the PRC and the proceedings in England. The cause of action in the English proceedings was the breach of the exclusive jurisdiction clause whilst the cause of action in the PRC proceedings was the breach of the contract of carriage. 55. Given our above analysis as to the effect of these orders, we cannot accept this submission. In assessing whether there is any conflict, it would not be right to narrowly focus on whether the PRC court had decided on the exclusive nature of the clause in question. In terms of international comity, both the PRC courts and the English courts are entitled to apply their respective conflicts of law rules in resolving dispute on jurisdiction in their own courts [4] . From the perspective of comity, the conflicts stemming from such rules are conflicts even though it does not involve a disagreement over the construction of the clause in question. Hong Kong court cannot decide which set of rules on conflicts should prevail. 56. Mr Scott further contended that the enforcement of an exclusive jurisdiction clause is not breach of judicial comity, citing The Angelic Grace [1995] 1 Ll Rep 87 in support. See also Deutsche Bank AG v Highland Crusader Partners LP [2010] 1 WLR at para 51 where Toulson LJ observed: “An injunction to enforce an exclusive jurisdiction clause governed by English law is not regarded as a breach of comity, because it merely requires a party to honour his contract.” 57. We accept this proposition as far as an English court enforcing an exclusive jurisdiction clause in favour of the English court goes. The same can be said for a case where Hong Kong court enforces an exclusive jurisdiction clause in favour of the Hong Kong forum. But this is not situation before us. The plaintiff asked the court in Hong Kong to enforce an exclusive jurisdiction clause in favour of English court. In such context, by reason of the indirect interference with proceedings in the PRC courts, we must pay regard to the principle in Airbus Industrie GIE v Patel , supra. 58. In so holding, we do not overlook the rationale for the enforcement of exclusive jurisdiction clause as a matter of contract. As Millett LJ held in The Angelic Grace , supra, at p.96: “The justification for the grant of the injunction … is that without it the plaintiff will be deprived of its contractual rights in a situation in which damages are manifestly an inadequate remedy.” 59. Nor had it escaped our attention that the cause of action of the plaintiff can be described as a right not to be sued abroad. Such right can be derived from contract, as in the case of an exclusive jurisdiction clause. It can equally be derived from other equitable considerations and as illustrated by Masri v Consolidated Contractors (No 3) , supra, those considerations may support a claim for anti-suit injunction on the ground of unconscionable conduct. 60. In the present context, however, we have to bear in mind that different jurisdictions could legitimately have different rules on enforceability of exclusive jurisdiction clauses and we are back to the conundrum of mutual respect for differences in conflicts of law rules in different regions. First of all, the approach to construction of a clause may differ according to the laws of different countries. Secondly, there are legitimate differences in terms of the extent to which the law may recognise an exclusive jurisdiction clause. Thirdly, given that the plaintiff had participated fully in the PRC proceedings, there could be submission to jurisdiction implications even though unsuccessful challenge to jurisdiction had been made. Again different jurisdictions may have different rules to deal with such question. Mr Scott did not contend that there is a set of uniform rules in customary international law in these regards. 61. Though Mr Scott adopted the construction on the clause in question by Cooke J, we do not think it is appropriate for us to express any view in that regard. There is a pending appeal in the English Court of Appeal and it is not for us to second guess the outcome in that appeal. In any event, whatever construction we place on such a clause is not important because our view on construction cannot remove the conflicts between the PRC law and English law on the effectiveness of such clause. Given the rationale behind the principle of international comity, there is no justification for us to proceed on the basis that, as between PRC law and English law, whichever regime yielding a result closer to one prescribed by the application of Hong Kong law should prevail. 62. At the court below, DHCJ Chan reached the same conclusion by reference to section 21M(4). Mr Barlow, as he did before the judge, referred us to the following observation of the English Court of Appeal in Motorola Credit Corporation v Uzan (No 2) , supra, at para 115 to support this conclusion: “As the authorities show, there are five particular considerations which the court should bear in mind, when considering the question whether it is inexpedient to make an order. First, whether the making of the order will interfere with the management of the case in the primary court e.g. where the order is inconsistent with an order in the primary court or overlaps with it. That consideration does not arise in the present case. Second, whether it is the policy in the primary jurisdiction not itself to make worldwide freezing/disclosure orders. Third, whether there is a danger that the orders made will give rise to disharmony or confusion and/or risk of conflicting inconsistent or overlapping orders in other jurisdictions, in particular the courts of the state where the person enjoined resides or where the assets affected are located. If so, then respect for the territorial jurisdiction of that state should discourage the English court from using its unusually wide powers against a foreign defendant. Fourth, whether at the time the order is sought there is likely to be a potential conflict as to jurisdiction render inappropriate and inexpedient to make a worldwide order. Fifth, whether, in a case where jurisdiction is resisted and disobedience to be expected, the court will be making an order which it cannot enforce.” 63. Mr Barlow placed emphasis on the third and fourth propositions. As we see it, the third proposition is not germane since we are dealing with Hin-Pro, a company registered in Hong Kong and Hong Kong court certainly has in personam jurisdiction over it and it have assets here. But the fourth proposition is engaged. The conflict as to jurisdiction is, as discussed above, between the outcome of the PRC courts’ application of the PRC law on the effect of the jurisdiction clause in the bills of lading and the outcome of the English courts’ application of English law on the same. 64. We are therefore in agreement with the DHCJ Chan that Hong Kong court should not exercise its section 21M jurisdiction in the present case. Our views are broadly in line with the views expressed by Thomas Raphael in his book on The Anti-Suit Injunction (2008), at paras 7.29 to 7.33 and 13.13 and Briggs & Rees, Civil Jurisdiction and Judgments 5 th Edn, para 5.41. Discretionary considerations as to the grant of Hin-Pro Mareva and Hin-Pro Receivership Order 65. Further, even assuming the courts in Hong Kong can exercise their section 21M jurisdiction despite the judicial conflicts in the present case, we do not think it warrants the grant of the Hin-Pro Mareva in terms of the order of DHCJ Saunders or the Hin-Pro Receivership Order. 66. As we observed, the extent of the Hin-Pro Mareva went beyond the actual damages suffered by the plaintiff and the monetary limit was set partly by reference to the total claims advanced by Hin-Pro in the mainland proceedings. Many of those claims have not yet resulted in any judgments and the plaintiff is participating in those actions. As far as proceedings in Hong Kong are concerned, subject to costs already incurred in the mainland proceedings and judgments already satisfied, we do not see why an interim injunction restraining Hin-Pro from proceeding further with the mainland litigations and from enforcing the mainland judgments could not give the plaintiff all the protection it needs. For the reasons given by this court in the judgment of 18 December 2014, the undertakings offered by Hin-Pro to this court (which Mr Barlow confirmed to be continuing until the final determination of HCMP 1449 of 2014) effectively provide similar protection. 67. In respect of costs already incurred, this was not the basis upon which the Mareva was sought before DHCJ Saunders nor was it the basis upon which the discharge was resisted before DHCJ Chan. Though Mr Scott invited us to consider a Mareva based on the quantum of such costs if we were not with him on the original Mareva, in view of our earlier conclusion on judicial conflicts, we would not grant any Mareva afresh. 68. The plaintiff obtained the Hin-Pro Receivership Order for the purpose of preserving and locating assets and meeting the disclosure requirements under the Hin-Pro Mareva. At para 20 of the decision of DHCJ Saunders of 17 July 2014, the learned judge said the following when he granted the Hin-Pro Receivership Order: “Receivers will be in a position to effectively locate and preserve Hin-Pro’s assets for the purpose of complying with the Mareva injunction and the world wide freezing order, and to ensure that Hin-Pro properly complies with the disclosure orders made in the English and Hong Kong courts.” 69. However, the order as granted also contained the following empowering provisions: “(c) intervene and take any necessary steps on behalf of the defendant in the PRC legal actions … and if thought fit, withdraw and discontinue the said legal actions”. 70. Such order went beyond the scope of the intended purpose for which the order was made. It is more draconian than an anti-suit injunction and Mr Scott has not shown us any authority where such an order had been made in the context of a section 21M application. There was no consideration by DCHJ Saunders of the implications on comity and judicial conflicts stemming from the grant of such a power. 71. In any event, as we have observed, apart from the question of costs already incurred, the undertakings offered by Hin-Pro had sufficiently addressed the concerns of the plaintiff. Mr Scott basically repeated the submissions he had advanced before us in the application for stay in contending that the undertakings could not to be relied upon. In addition, he referred us to the history of service by the plaintiff’s solicitors on Hin-Pro. We have considered the matter in that light but we are not persuaded that DHCJ Chan had made any error which warrants our intervention of his conclusion that, quite apart from the consideration as to judicial conflicts, on such undertakings the orders made by DHCJ Saunders should be discharged. Soar Mareva and Soar Receivership Order 72. DHCJ Saunders granted the Soar Mareva and Soar Receivership Order on what the learned judge referred to as the Chabra jurisdiction. By reference to the discussion in Gee, Commercial Injunctions 5 th Edn, para 13.007, the judge identified at para 3 of his Reasons for Decision of 21 July 2014 the basis on which the plaintiff sought the Soar Mareva before him as the third limb discussed in that paragraph: “Although the defendant to the substantive claim has no legal or equitable rights to the assets in question, the defendant has some right in respect of, control over, or other right of access to the assets. If a defendant has set up a network of trusts and companies to hold assets over which he has control, and he has apparently done this to make himself judgment-proof, this would be an appropriate case for the granting of Mareva relief against the relevant non-party. If the defendant is a shareholder in a private company and was left free to deprive the company of assets to which it may be entitled, this could affect the value of his shareholding and so an injunction can be granted against non-parties to preserve those assets.” 73. The crux of DHCJ Saunders’ findings upon which the Soar Mareva was grounded were set out at para 14: “Mr Scott submits, and I am satisfied, that there are good reasons to suppose that Hin-Pro has some right in respect of, control over, or other right of access to assets which apparently belong to Soar. The evidence establishes that Ms Su Wei is the sole director and shareholder of both Hin-Pro and Soar, and that she and the two companies are involved in the scheme which leads to Hin-Pro’s multiple legal proceedings … in which Hin-Pro falsely alleges that it was the seller of cargoes. The involvement of Soar in the shipment from Hin-Pro to Raselca is commercially unusual giving rise to a strong inference that Soar was inserted m the shipping chain in order to collect payments which should have accrued to Hill-Pro.” 74. That finding was based on the evidence referred to at paras 11 and 12 of that judgment. 75. DHCJ Chan discharged the Soar Mareva and Soar Receivership Order on the basis that as the Chabra jurisdiction is founded upon the Hin-Pro Mareva, these orders should also be discharged upon the discharge of the latter. Mr Scott had not advanced any submissions against that analysis. Therefore, it follows from our upholding DHCJ Chan’s decision to discharge the Hin-Pro Mareva that we should uphold the discharge of the Soar Mareva and Soar Receivership Order. 76. In the circumstances, we do not find it necessary to deal with Mr Barlow’s other grounds for attacking the Soar Mareva and Soar Receivership Order. However, we must say we do not find much merit in Mr Barlow’s contention that the appeal regarding Soar Mareva and Soar Receivership Order is incompetent due to the fact that Soar was not joined as a party to the appeal. It is a mere technical point as it has been clear to all parties Soar is a party to the appeal. Mr Barlow had lodged a separate set of skeleton submissions on behalf of Soar and we have considered the same. If necessary, we can give leave for Soar to be formally added as a party to the appeal. 77. Though Mr Barlow referred to China Ocean Shipping Co v Mitrans Shipping Co Ltd [1995] 3 HKC 123 in his written submissions, counsel did not address us on the evidence and the finding at para 14 in the decision of DHCJ Saunders. Since it is not necessary to do so, we prefer not to express any view on this aspect of the case in this judgment. The costs of the notice of motion of 20 Jan 2015 78. On 20 Jan 2015, Hin-Pro issued a notice of motion seeking the following relief: “The Plaintiff and/or its solicitors herein be ordered to desist from obstructing and/or impeding the Defendant from carrying out the Defendant’s undertaking …” 79. What happened was that after the refusal of stay by this court, the defendant tried to utilise the funds in the defendant’s bank accounts to make a payment into court in accordance with its undertaking. Such attempts were hampered by representations from the plaintiff’s solicitors to the banks that the Hin-Pro Mareva had yet to be lifted as the undertaking had not been complied with. Details of such correspondence were set out in the 2 nd affirmation of Shea Ying Fai. 80. We are of the view that the plaintiff’s solicitors should not have done so. The discharge of the Hin-Pro Mareva took effect when the court granted the order for discharge. Though there had been a short interim stay pending application to the Court of Appeal for stay, upon our refusal to grant a stay pending appeal there was no further basis for suggesting that Mareva had not yet been lifted. 81. It is not necessary for us to grant any relief on the Notice of Motion since solicitors for the plaintiff undertook to this court that they would clarify the position with the banks by letters. However, we have to deal with the costs of the motion. 82. We have no doubt whatsoever that the plaintiff should bear the costs of the motion. As we said, there is no ground for advancing the contention that the Hin-Pro Mareva had not been lifted. Yet due to the representations from the plaintiff’s solicitors, the funds in the bank accounts of Hin-Pro remained frozen. In effect, the plaintiff had achieved what it had failed to get before us in terms of a stay of the discharge of the injunction pending the appeal. We take a very serious view of the matter as it is bordering on the interference with the due administration of justice. 83. Mr Scott submitted that the matter could have been resolved without troubling the court had the solicitors written to the plaintiff’s solicitors about it before the issue of the notice of motion. With due respect, we cannot accept this as a good excuse for not ordering costs against the plaintiff. Solicitors for the plaintiff were aware of Hin-Pro’s request through their solicitors to demand the unfreezing of the accounts as they referred to it in their letter of 9 January 2015. There is absolutely no reason why solicitors for the plaintiff should persist in adopting a stance which flies in the face of the court’s refusal of stay of execution pending appeal. Solicitors for the plaintiff should not need a direct letter from the solicitors for Hin-Pro complaining about such wrongful act before desisting from it. 84. Given the serious nature of the matter, to mark our strong disapproval of the conduct in question, we order the plaintiff to pay the costs of Hin-Pro on the Notice of Motion on the indemnity basis. Disposition 85. We shall dismiss the appeal and order the plaintiff to pay the costs of Hin-Pro and Soar. Such costs are to be taxed with certificate for two counsel. Subject to what we said above in respect of the costs of the Notice of Motion of 20 Jan 2015, the costs are to be taxed on the party-to-party basis. (M H Lam) (AARIF BARMA) (J. POON) Vice-President Justice of Appeal Judge of the Court of First Instance Mr John Scott SC, leading Mr John Hui, instructed by Stephenson Harwood, for the plaintiff/appellant Mr Barrie Barlow SC, leading Mr George Chu, instructed by Damien Shea & Co, for the defendant/respondent [1] See the summary of Hin-Pro’s case in the judgment of Ningbo Maritime Court in case (2013) YHFSCZ No. 507, Bundle B12 p.2601. [2] The summons only referred to 3 orders. At the hearing before DHCJ Chan, Hin-Pro applied to include the Hin-Pro Receivership Order in the application for the discharge of the orders. [3] Ellerman Line Ltd v Read [1928] 2 KB 144 ; Union Discount Co Ltd v Zoller [2002] 1 WLR 1517 ; Donohue v Armco Inc [2002] 1 All ER 749 . [4] In this connection, we are aware that in the United Kingdom, the Supreme Court in The Alexandros T [2013] UKSC 70 reached the conclusion that stay would not be required under Article 27 of the Brussels Regulation due to a similar difference in the causes of action. However, the regime under the Brussels Regulation and EU law is not applicable in Hong Kong. Understandably counsel had not referred us to this decision. Look up this case on Lawcite Noteup",
  "length": 54325,
  "headers_seen": [
    "The Court:",
    "The significance of Hin-Pro’s failure to appear at the inter-partes hearings of 20 June and 25 July",
    "The authority of Hin-Pro to apply for discharge after the appointment of receivers",
    "The substantive grounds for the discharge: judicial conflicts",
    "Discretionary considerations as to the grant of Hin-Pro Mareva and Hin-Pro Receivership Order",
    "Soar Mareva and Soar Receivership Order",
    "The costs of the notice of motion of 20 Jan 2015",
    "Disposition"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkca/2015/107",
  "query": "anti-suit injunction",
  "ts": "2025-10-16T10:47:34",
  "ok": true
}