{
  "title": "X AND ANOTHER V. ZPRC AND ANOTHER | [2020] HKCFI 631 | HKLII",
  "court": null,
  "year": 2020,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2020] HKCFI 631 X AND ANOTHER V. ZPRC AND ANOTHER Judgment Information Date 6 May, 2020 Action No. HCCT60/2019 Neutral Cit. [2020] HKCFI 631 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCCT60/2019 HCCT60A/2019 X AND ANOTHER v. ZPRC AND ANOTHER HCCT 60/2019 [2020] HKCFI 631 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO 60 OF 2019 ______________ IN THE MATTER of an Arbitration and IN THE MATTER of Order 73 of the Rules of High Court, Cap 4A and Section 21L of the High Court Ordinance , Cap 4 and IN THE MATTER of Section 45 of the Arbitration Ordinance , Cap 609 ________________________ BETWEEN X 1st Plaintiff Y 2nd Plaintiff and ZPRC 1st Defendant ZHK 2nd Defendant ________________________ Before: Hon Mimmie Chan J in Chambers Dates of Written Submissions: 26, 27, 28 & 30 March 2020 Date of Judgment: 7 May 2020 ________________ J U D G M E N T ________________ Background 1. This Judgment relates to the substantive hearing of the Originating Summons (“ OS ”) issued by the 1 st Plaintiff (“ X ”) and 2 nd Plaintiff (“ Y ”) against the two Defendants, seeking permanent injunctions to restrain the Defendants from pursuing two sets of proceedings before the Mainland court, in breach of an arbitration agreement which the Plaintiffs claim to have been made and exist with the Defendants. The first set of proceedings were commenced in June 2019 by the 1 st Defendant (“ ZPRC ”) against both X and Y in the Mainland Court, with case number xxx (“ PRC1 ”) and the second set of proceedings were instituted by ZPRC and the 2 nd Defendant (“ ZHK ”) against Y only, in the Mainland Court with case number xxx (“ PRC2 ”), in July 2019. The Plaintiffs were only informed of the institution of PRC2 in December 2019. 2. What is not disputed is that in March 2018, X and ZHK entered into an ISDA Agreement (“ Agreement ”) in respect of derivative trading transactions to be entered into between them. ZHK is a subsidiary of ZPRC, and ZPRC issued a Guarantee in favour of X dated 16 March 2018 (“ Guarantee ”), whereby in consideration of X entering into the Agreement with ZHK, ZPRC guaranteed payment and performance by ZHK of its obligations and liabilities under the Agreement. 3. The Guarantee was expressed to be governed by English law and provides for arbitration in Hong Kong of disputes which arise out of and relating to the Guarantee. The relevant parts of the arbitration clause state as follows: “(i) Any dispute, claim, difference or controversy arising out of, relating to or having any connection with this guaranty, including any dispute as to its existence, validity, interpretation, performance, breach or termination or the consequences of its nullity and any dispute relating to any non-contractual obligations arising out of or in connection with it (a “Dispute”), shall be referred to any finally resolved by arbitration administered by the Hong Kong International Arbitration Centre. (ii) The arbitration shall be conducted in accordance with the Hong Kong International Arbitration Center Administered Arbitration Rules (the “Rules”) in force when the Notice of Arbitration is submitted. Capitalised terms used in this section which are not otherwise defined in the Agreement have the meaning given to them in the Rules.” 4. The Agreement itself between X and ZHK also has a clause providing for arbitration in Hong Kong. The language is identical to the arbitration clause in the Guarantee, covering any disputes, claims, difference or controversy “arising out of, relating to or having any connection with” the Agreement, including any dispute as to its existence, validity, interpretation, performance, breach or termination, and “any dispute relating to any non-contractual obligations arising out of connection with” the Agreement, and providing for English law to be the governing law. 5. Disputes arose as to the liability of ZHK under the Agreement, and demand for payment was made by X against ZPRC under the Guarantee. In January 2019, X commenced an arbitration against ZPRC under the Guarantee, and a separate arbitration against ZHK under the Agreement, for amounts due under the respective transactions (the 2 arbitrations are referred to collectively as the “ Arbitration ”). On its part, in June 2019, ZPRC commenced PRC1 against both X and Y, after service of its Answer in the Arbitration. According to ZPRC, PRC1 does not concern the substantive disputes between the parties in the Arbitration, but concerns only whether there was a valid arbitration agreement between ZPRC and X under the Guarantee. 6. It is the Defendants’ case that the Guarantee which was signed by ZPRC was not intended to create any legal or binding relationship, as it was the understanding of the parties, and a condition precedent to the coming into effect of the Guarantee and the transactions under the Agreement, that approval had to be given by the State Administration of Foreign Exchange (“ SAFE ”) for registration of the Guarantee (“ SAFE Approval ”), and SAFE Approval was not in fact obtained. 7. The Plaintiffs made an application to the tribunal in the Arbitration in July 2019 for an anti-suit injunction against ZPRC, to restrain ZPRC from continuing with PRC1 (“ Anti-suit Injunction ”). The determination of that application was held up, pending a challenge made by the Plaintiffs to the status of the presiding arbitrator of the tribunal. 8. Application for interim relief was made instead to the Court, and on 14 November 2019, this Court granted on the Plaintiffs’ application an interim injunction (“ Interim Injunction ”) under s 45 of the Arbitration Ordinance (“ Ordinance ”), restraining ZPRC from commencing or pursuing PRC1 or any other proceedings otherwise than by arbitration in accordance with the Guarantee, and ordering ZPRC to withdraw or seek a stay of PRC1, until the conclusion of the substantive hearing of the OS. It is not disputed, that unbeknownst to the Plaintiffs, PRC2 had in fact been commenced against Y by ZPRC and ZHK in July 2019, but at the time of the commencement of these proceedings by the issue of the OS on 28 October 2019, and up to the grant of the Interim Injunction in November 2019 affecting PRC1, neither the Plaintiffs nor the Court had been informed of the existence of PRC2. 9. The challenge against the presiding arbitrator was dismissed by the HKIAC in November 2019. 10. On 24 January 2020, after Y received documents in connection with PRC2, the Plaintiffs applied to the Court in these proceedings to join ZHK as 2 nd Defendant, and to amend the OS to include a claim for an injunction against ZHK as well as ZPRC as the original sole Defendant, to restrain them from pursuing or commencing any proceedings relating to the Guarantee and the Agreement otherwise than by arbitration in accordance with the arbitration agreement contained in the Guarantee and in the Agreement, and to require ZPRC as well as ZHK to discontinue or withdraw PRC2 as well as PRC1. 11. The Defendants consented to the application for joinder of ZHK and for amendment to the OS, which amendments were duly made on 12 March 2020 (“ Amendments ”). 12. The substantive hearing of the OS was scheduled for hearing on 30 March 2020. The application was, by consent, dealt with on papers without a hearing during GAP. The Plaintiffs maintain that a permanent injunction should be made by the Court against the Defendants, and that they were not pursuing their application to the tribunal for the Anti-suit Injunction. They highlight the fact that an injunction in respect of PRC2 is required, as they had not known of the existence of such proceedings at the time the Interim Injunction was applied for and granted, covering PRC1 only. The Plaintiffs also emphasized that despite the Interim Injunction, ZPRC had failed to take the necessary action to discontinue or withdraw PRC1. On the other hand, the Defendants dispute the Court’s jurisdiction to grant the permanent injunctions sought against ZPRC and ZHK. 13. In gist, the Defendants claim that the Court has no jurisdiction under s 21L of the High Court Ordinance (“ HC Ordinance ”) to grant the permanent injunctions sought, as the Plaintiffs cannot show that their case against ZPRC comes within the gateways of Order 11 rule 1 RHC, and as against ZHK, that it has no arbitration agreement with either Plaintiff. They further claim that ZPRC’s institution of PRC1 is neither a breach of agreement nor oppressive/vexatious, and that the Defendants’ institution of PRC2 is not a breach of any agreement, as Y (as the party sued) is not a party to either the Guarantee nor the Agreement. The Defendants also argued that the Court should not exercise its jurisdiction to grant any injunction to restrain any breach of arbitration agreement as may subsist, as such jurisdiction is only ancillary to the jurisdiction of the arbitral tribunal to determine its own jurisdiction. They further maintain that the arbitral tribunal does not have exclusive jurisdiction to determine the existence of the arbitration agreement alleged by the Plaintiffs, and that the Mainland court has parallel jurisdiction to determine such a question. In particular, it was argued on behalf of the Defendants that it is against comity and a “disrespectful interference of the law and procedures of the Mainland court” for this Court to grant an anti-suit injunction to prevent a party from invoking the relevant procedures under PRC law to challenge the jurisdiction of the tribunal. Comity and whether disrespectful 14. The last point should be, and is immediately, rejected at the forefront. It is indeed surprising that such suggestion should still be made, when the many leading cases have made it clear, that the basis of an anti-suit injunction is the Court’s upholding of a contract between consenting parties, and there is no suggestion at all of disrespect to any foreign court, nor is there interference with the foreign court, or disregard of comity principles. See for example the judgment in The Angelic Grace [1995] 1 Lloyd’s Rep 87 (cited in para 7 of the Decision on the Interim Injunction dated 14 November 2019), and the judgement in Ever Judger Holding Co Ltd v Kroman Celik [2015] 3 HKC 246 . The Mainland courts which have experience in dealing with foreign related disputes and commercial arbitration agreements are fully familiar with such principles, and they certainly need no reminder from the Hong Kong courts. The proposition made by the Defendants may be more “disrespectful” per se , as it is based on the presumption that the Mainland courts lack understanding of these principles. Jurisdiction under s 21L and O 11 r 1 RHC 15. On behalf of ZPRC, it was argued that the only jurisdictional basis on which the permanent injunction sought against ZPRC is section 21L of the HC Ordinance and the inherent jurisdiction of the Court, rather than section 45 of the Ordinance, which only deals with interlocutory injunctions by way of interim measures in aid of arbitrations. As such, the Plaintiffs must establish that their claims fall within the jurisdictional gateways provided for in Order 11 rule 1 (1) (c) (claim is brought against ZHK duly served and ZPRC is a necessary or proper party to the proceedings), or rule 1 (1) (d) (iii) (a claim to enforce a contract governed by Hong Kong law). According to the Defendants, the Plaintiffs’ claims do not fall within either of these gateways. 16. It is trite, that for the purposes of Order 11 rule 1 and whether leave may be granted for service of proceedings outside the jurisdiction, the applicant for leave has to show that there is a “good arguable case” that the claim falls within one or the other of the subparagraphs of rule 1 (1). The court takes jurisdiction not on it being shown conclusively that the case is within a gateway, but on a “good arguable case” being made out, to the effect that the court will not at the stage of jurisdiction require proof to its satisfaction on the balance of probabilities, but will require something better than a mere prima facie case. This was described in GDH Ltd v Creditor Co Ltd [2008] 5 HKLRD 895 as higher than the other interlocutory tests of prima facie case, triable issue, reasonable/real prospect of success and serious issue to be tried, and is an argument on jurisdiction with a good prospect of success. An arguable case is not enough; the plaintiff must show that the case is more than barely capable of serious argument, and yet not necessarily one which the judge believes to have a better than 50%. (See paras 11/1/8, 11/1/8AA & 11/1/8A, Hong Kong Civil Procedure 2020) The same test applies, whether or not the jurisdictional fact to be established for the purposes of the gateway will be an issue in the trial later ( Four Seasons Holdings Inc v Brownlie [2017] UKSC 80 [6]). 17. By order of the Court made on 11 March and amended on 12 March 2020 on the parties’ consent application, the OS was amended by inclusion of ZHK as 2 nd Defendant and the addition of the Plaintiffs’ claim for an anti-suit injunction extending to PRC2. These amendments date back to 28 October 2019, as the date of the original issue of the OS, with the proceedings continuing as though the amendment had been inserted from the beginning (para 20/8/2 Hong Kong Civil Procedure 2020), namely as if ZHK had been a defendant from the commencement of the proceedings and as if the Plaintiffs’ claim for an injunction to restrain the continuance of PRC2 had been included from the commencement. ZHK is a necessary and proper party to these proceedings for anti-suit injunctive relief to which the Plaintiffs claim they are entitled. 18. The real issue under Order 11 rule 1 (c) is whether ZPRC is a necessary or proper party to proceedings brought against a party duly served. I agree that the proper approach and the real question to be determined is that adopted in Massey v Heynes (1888) 21 QBD 330 , per Lord Esher: “The question is, what is the true construction of rule 1 (g) of Order XI [the then equivalent of our rule 1 (1) (c)]. … To what period of time does the rule in question apply? It must certainly apply to the time of the service of the writ or notice of the writ. How can the Court deal with the case then? Not according to the results of the trial of the action; they cannot take into account what may be the result of the trial, or they could never decide who would be a ‘proper party’ to the action until the trial was over. The question, whether a person out of the jurisdiction is a proper party to an action against a person who has been served within the jurisdiction, must depend on this, - supposing both parties had been within the jurisdiction would they both have been proper parties to the action? If they would, and only one of them is in this country, then the rule says that the other may be served, just as if he had been within the jurisdiction. That is the legislation on the subject, and we are bound by it.” 19. That test was adopted by the Court in New Link Consultants Ltd v Air China & Ors [2005] 2 HKC 260 , in the context of Order 11 rule 1 (1) (c) RHC. The Court in New Link also considered the technical objection raised in the case, that the plaintiff had not yet served the 2 nd and 3 rd defendants (as the “anchor defendants”) at the time when the overseas 1 st defendant was served. The defendants in that case were served simultaneously, as opposed to the 2 nd and 3 rd defendants being served first. The technical objection was dismissed by the Court, as a mere irregularity which can be cured and was cured under Order 2 rule 1, had there been an application for leave to serve outside jurisdiction. 20. On the facts of this case, I am satisfied that had both ZPRC and ZHK been served within the jurisdiction, they would both have been proper parties to the proceedings at the time of the issue of the OS, since X and Y were entitled to state facts which, if their allegations are true, would show that they are entitled to the anti-suit injunction against both ZPRC and ZHK. Had the Plaintiffs been duly notified, at the time of the issue of the OS in October 2019, that PRC2 had already been commenced by ZPRC and ZHK against Y in July 2019, there is no reason at all to suppose that X and Y would not have included a claim for the injunction to extend to and include PRC2, and to have served ZHK in Hong Kong and (had there been an application for leave to serve ZPRC outside Hong Kong) to obtain leave on the basis of ZHK having been served in Hong Kong. In my judgment, the spirit and intention of Order 11 rule 1 (1) (c) is the identification of the necessary and proper parties to the proceedings, rather than the more peripheral question of the timing or sequence of service of the necessary and proper parties, which in any event are curable irregularities, as held in New Link - bearing in mind the underlying objectives of the Rules. ZHK is a necessary or proper party, which had commenced PRC2 against Y and which X and Y claim to be a breach of the arbitration agreement, and was an oppressive maneuver to avoid the effect of the arbitration agreement. ZHK’s presence before the Court is necessary to ensure that all matters in dispute in the cause or matter may be effectually and completely determined and adjudicated upon, and there are issues affecting ZHK which arise out of and are connected with the relief claimed by the Plaintiffs in these proceedings. 21. For the above reasons, I find that the Plaintiffs’ case would have come within the ambit of Order 11 rule 1 (1) (c) RHC, to vest jurisdiction in the Court. 22. It is sufficient for the Plaintiffs to show that their case comes within one of the sub-paragraphs of rule 1 (1). In brief, I am also satisfied that the Plaintiffs have established to the requisite standard set out in paragraph 16 above that they have a claim to enforce a contract governed by Hong Kong law, to come within rule 1 (1) (d) (iii). The contract contended by the Plaintiffs is the arbitration agreement contained in the Guarantee between X and ZPRC and the Agreement between X and ZHK. Although Y is not an express party to the Guarantee and the Agreement, the Plaintiffs’ case against the Defendants is that the arbitration agreement can be construed to extend to claims made by and against the contracting affiliates and associates of the contracting parties. 23. On behalf of the Defendants, it was argued that the governing law of the Guarantee and the Agreement is English law, and that as a starting point, and in the absence of indications to the contrary, the parties to these contracts are assumed to have intended that the arbitration agreement contained therein should likewise be governed by English law. Leading Counsel relies on Sulamerica Cia Nacional de Seguros SA v Enesa Engelharia SA [2012] EWCA Civ 638 , and Kabab-Ji SARL (Lebanon) v Kout Food Group (Kuwait) [2020] EWCA Civ 6 . It was emphasized that the choice of a seat of arbitration different from the law of the governing contract would not, in itself, be sufficient to displace the starting point and the “strong indicator” of the governing law of the main or underlying contract. 24. What is clear from the decisions cited by both parties is that the determination of the governing law of the arbitration agreement is a question of construction, a matter of interpretation of the relevant clauses of the underlying contract, and of the arbitration agreement. That was the conclusion made and the analyses undertaken by the courts in Klockner Pentaplast GmbH & Co KG v Advance Technology (HK) Co Ltd [2011] 4 HKLRD 262 , Sulamerica , and Kabab-Ji SARL, to ascertain the express choice (if any), the implied choice and the presumed common intention of the parties. The governing law of the underlying contract, and the law with the closest and most real connection with the agreement to arbitrate, such as the chosen seat of the arbitration, are all matters to be taken into consideration in the process of construing and interpreting the parties’ agreements. In this case, the chosen mode of dispute resolution, the designation of Hong Kong as the seat of arbitration and the selection of the Hong Kong International Arbitration Center Administered Arbitration Rules to govern the conduct of the arbitration, all support the good arguable case of Hong Kong law being the governing law of the arbitration agreement contained in the Guarantee and the Agreement. As the cases cited in paras 11/1/8 – 11/1/8A of the Hong Kong Civil Procedure 2020 highlight, for jurisdiction purposes, the court does not require proof to its satisfaction on the balance of probabilities, and should hesitate to express a concluded view as to merits. 25. In summary, I conclude that the Court has jurisdiction to grant relief under section 21L of the HC Ordinance. Whether the jurisdiction of the Court should be exercised under s 21L 26. What is pertinent as a distinction from the Court’s decision on the grant of the Interim Injunction in November 2019 is that the Plaintiffs now seek final and permanent relief in the proceedings they instituted by the OS. The relief now sought is a permanent injunction restricting the Defendants from pursuing any proceedings other than by arbitration in accordance with the relevant arbitration clauses in the Guarantee and the Agreement, and an order requiring the Defendants to discontinue or withdraw PRC1 and PRC2. By way of contrast, the Interim Injunction was granted in aid of the Arbitration, and made under section 45 of the Ordinance as an interim and temporary measure pending the issuance of an award or other order of the tribunal, or of the Court in substantive proceedings. At the time of the Interim Injunction, the composition of the tribunal was under challenge and the tribunal was not able to deal with the interim measure sought by the Plaintiffs. 27. Although the Plaintiffs have indicated that they will not be pursuing, before the tribunal, the application for injunctive relief in respect of the Mainland proceedings, the Defendants have highlighted that the issue of the existence and validity of the Guarantee and the arbitration agreement contained in the Guarantee is denied in the Arbitration. The question of the existence and validity of the arbitration agreement and the jurisdiction of the tribunal over the parties are the questions put before and to be decided by the tribunal, and which the Plaintiffs themselves say should be submitted to arbitration. As such, the Defendants claim that the Court should not exercise its jurisdiction to grant any injunction sought by the Plaintiffs, and various arguments have been raised in support. They contend that the jurisdiction of the Court under s 21L of the HC Ordinance is only ancillary to the jurisdiction of the tribunal, and should not be exercised when the tribunal is able to act and is the most appropriate forum to decide the issues between the parties as to the existence of the Guarantee in these proceedings, such that it is not just and convenient for the Court to grant any final injunctive relief to the Plaintiffs on these claims. The same argument applies to the Agreement and the validity of the arbitration agreement contained therein. The Defendants also claim that there is no breach of any arbitration agreement in any event, as the issues in PRC1 and PRC2 are different to the parties’ dispute under the Guarantee and the Agreement, and that the Defendants are entitled to invoke the jurisdiction of the Mainland court. Whether jurisdiction of the Court under s 21L is ancillary only 28. The Defendants rely on the decision in Leviathan Shipping Co Ltd v Sky Sailing Overseas Co Ltd [1998] 4 HKC 347 , where the Court observed in the context of the Arbitration Ordinance Cap 341 (“ Cap 341 ”) that the jurisdiction of the Court to exercise its concurrent jurisdiction to grant interim measures and to intervene in arbitral proceedings should be exercised “sparingly”, and only where there are “special reasons” to utilize such power. The observations were made in the context of interim relief granted under the former section 2GC of Cap 341 , the equivalent of the current section 44 of the Ordinance. The Court referred to the duty of the Court under section 6 (1) of Cap 341 (and the current section 20 of the Ordinance) to stay proceedings before the Court brought in a matter which is the subject of an arbitration agreement. 29. Since the date of the decision in Leviathan and the commencement of the Ordinance in 2011, the concurrent jurisdiction and power of the Courts under section 21L of the HC Ordinance and its English equivalent in section 37 of the Senior Courts Act 1981 (formerly the Supreme Court Act), in the context of the scheme under the Ordinance and the Arbitration Act 1996, has been examined and considered by the English court in cases such as UST-Kamenogorsk Hydropower Plant JSC v AES Ust-Kamenogorsk Hydropower Plant LLP [2013] UKSC 35 and Nori Holding Limited v Public Joint Stock Company [2018] EWHC 1343 (Comm). 30. In UST-Kamenogorsk Hydropower Plant JSC v AES Ust-Kamenogorsk Hydropower Plant LLP (“ AES ”), Lord Mance highlighted the fact that an agreement to arbitrate disputes has positive and negative aspects: “A party seeking relief within the scope of the arbitration agreement undertakes to do so in arbitration in whatever forum is prescribed. The (often silent) concomitant is that neither party will seek such relief in any other forum. If the other forum is the English court, the remedy for the parties agreed is to apply for a stay under section 9 of the Arbitration Act 1996.” 31. The Supreme Court held in AES that as a matter of interpretation of a straightforward agreement to arbitrate disputes in a particular forum, there is no basis for any limitation argument, that any negative obligation inherent in the arbitration agreement is a “mere ancillary to current or intended arbitration proceedings”. Nor is there any support from the case law for the proposition that the negative aspect of an arbitration agreement is enforceable only when an arbitration is on foot or is proposed. At paragraph 23 of his judgment, Lord Mance observed: “Both prior to the Arbitration Act 1996 and indeed subsequently - until the present case - the negative aspect was well recognized, and it was well established that the English courts would give effect to it, where necessary by injuncting foreign proceedings brought in breach of either an arbitration agreement or an exclusive choice of court clause. Further, such relief was treated as the counterpart of the statutory power to grant a stay of domestic proceedings to give effect to an arbitration agreement. A stay is not made conditional upon arbitration being on foot, proposed or brought.” 32. Lord Mance reiterated the principles and reasoning in The Angelic Grace , that the court should feel no diffidence in the grant of an anti-suit injunction to restrain foreign proceedings in breach of an arbitration agreement on the simple and clear ground that the defendant has promised not to bring such proceedings, referring also to Donahue v Armco [2001] UKHL 64 , that strong reasons are required to outweigh the prima facie entitlement to an injunction in the case of an exclusive choice of court clauses. In particular, His Lordship referred to the West Tankers case at first instance ([2005] EW HC 454 (Comm)), where the learned judge granted a permanent injunction to restrain the pursuit of Italian legal proceedings held to be in breach of a London arbitration agreement, and the judgment of Lord Hoffman on appeal, where he observed at [2007] 1 Lloyd’s Rep 391, para 10: “By section 37 (1) of the Supreme Court Act 1981 the High Court has jurisdiction to grant an injunction (whether interlocutory or final) ‘in all cases in which it appears to the court to be just and convenient to do so’. The English courts have regularly exercised this power to grant injunctions to restrain parties to an arbitration agreement from instituting or continuing proceedings in the courts of other countries: see The Angelic Grace [1995] 1 Lloyd’s Rep 87.” 33. Lord Mance in AES then proceeded to consider the scheme of the Arbitration Act 1996 and the co-relationship between the 1996 Act and section 37 of the Supreme Court Act. He reviewed section 9, section 30, section 32, and section 44 of the 1996 Act, which have their corresponding provisions in section 20 (stay of legal proceedings and reference to arbitration), section 34 (adopting Article 6 of the Model Law, on the tribunal’s ruling on its own jurisdiction and the court’s decision on such issue), and section 45 (interim measures) of the Ordinance. His conclusions were that the negative right not to be vexed by foreign proceedings is a right of a different character to the mainly “procedural rights” in section 44 of the 1996 Act, and that the reference in section 44 (2) (e) to interim injunctions was not intended to exclude the general power of the court to act under section 37 in circumstances outside the scope of section 44. Of significance is the conclusion that the source of the power of the court to grant injunctions is to be found in section 37 of the Supreme Court Act, and not section 44 of the 1996 Act, which is at paragraph 48 of the judgment: “The better view, in my opinion, is that the reference in section 44 (2) (e) to the granting of an interim injunction was not intended either to exclude the Court’s general power to act under section 37 of the 1981 Act in circumstances outside the scope of section 44 of the 1996 Act or to duplicate part of the general power contained in section 37 of the 1981 Act. Where an injunction is sought to restrain foreign proceedings in breach of an arbitration agreement - whether on an interim or a final basis and whether at a time when arbitral proceedings are or are not on foot or proposed - the source of the power to grant such an injunction is to be found not in section 44 of the 1996 Act, but in section 37 of the 1981 Act.” 34. Although there are differences between the Arbitration Act 1996 and the Ordinance, there are also many similarities. The provisions of the Arbitration Act 1996 and section 37 of the Senior Courts Art/Supreme Court Act 1981 which were examined in detail by the Supreme Court in AES are largely the same as their corresponding provisions in the Ordinance and section 20L of the HC Ordinance. The general principles of the Arbitration Act, which are referred to in paragraph 31 of the judgment of Lord Mance, are likewise very similar to the object and principles of the Ordinance, as set out in section 3 (1) and (2). I can see no difference in the scheme of the English Acts, to justify any departure in the analysis of the jurisdiction of the Court under section 20L of the HC Ordinance, and its relationship with the powers of the Court and of the tribunal under the Ordinance. 35. In Nori Holdings , the English Court followed the finding in AES that there is nothing in the 1996 Act to abrogate the power to grant an anti-suit injunction or to qualify the established principles for the exercise of that power. At paragraph 42 of the judgment, Males J pointed out that the availability of anti-suit relief from the arbitrators is not a reason for the court to refuse an injunction, nor is it appropriate to grant only a limited injunction, in force only until such time as the arbitrators have had a chance to consider whether to grant equivalent relief. The appropriate order should be a final mandatory order requiring the party to discontinue the court proceedings commenced in breach of the arbitration clause. 36. It is pertinent, as pointed out by the Court in Nori Holdings , that whilst a dispute as to whether the pursuit of foreign court proceedings is a breach of an arbitration clause is a matter which falls within the scope of a conventional arbitration clause, and is a matter which should be referred to arbitration, when a defendant in the court proceedings claims that it is not in breach of the arbitration clause, it is hard to see how such a defendant to a claim for anti-suit relief could assert that it was entitled to a stay, while at the same time denying any breach of the arbitration clause. 37. This is exactly the position of the Defendants here. They deny that they are in breach of any arbitration agreement, and have not applied for a stay under section 20 of these proceedings for the Plaintiffs’ claims to be referred to arbitration. When they have not sought a stay, there is no reason why the Court should not exercise the jurisdiction under section 20L of the HC Ordinance to grant anti-suit relief. As the Court also explained in AES , by denying that the Court has jurisdiction to intervene by the grant of an injunction, the Defendants are in effect seeking to benefit from the Plaintiffs’ reliance on an arbitration agreement, whilst themselves denying its existence. That should not be condoned under the label of a “just” exercise of the Court’s power. Whether just and convenient to grant the permanent injunction 38. In AES , the conclusion of Lord Mance’s judgment (at para 60) states: “The power to stay domestic proceedings under section 9 and the power to determine that foreign proceedings are in breach of an arbitration agreement and to injunct their commencement or continuation are in truth opposite and complementary sides of a coin… The general power provided by section 37 of the 1981 Act must be exercised sensitively and, in particular, with due regard for the scheme and terms of the 1996 Act when any arbitration is on foot or proposed. It is also open to a court under section 37, if it thinks fit, to grant any injunction on an interim basis, pending the outcome of current or proposed arbitration proceedings, rather than final basis.” 39. The jurisdiction and power of the Court under section 21L of the HC Ordinance applies “in all cases in which it appears to the Court to be just or convenient to do so”, and such order may be made either unconditionally or on such terms and conditions as the Court thinks just. 40. On behalf of the Defendants, Leading Counsel argued that on the facts of this case, it is not just or convenient for the Court to grant the permanent injunction sought by the Plaintiffs. The grant of a permanent injunction to restrain the Defendants from pursuing PRC1 and PRC2 and acting in breach of the arbitration agreement relied upon by the Plaintiffs depends and is premised on the Court’s finding on the existence of a valid agreement made between X and ZPRC on the one hand, and X and ZHK on the other hand. The Defendants claim that the determination of these issues should be left to the arbitral tribunal which is now properly constituted (although the Defendants maintain that there is no agreement by them to submit any dispute to arbitration). 41. I accept that since the conclusion of the Guarantee as a final and operative agreement is disputed on the facts, the decision on the existence and validity of the Guarantee and the arbitration agreement incorporated in the Guarantee depends on findings of facts and on the credibility of the witnesses, and the arbitral tribunal is obviously in the best position to hear the evidence and to determine these issues, relating to the liability of ZPRC and ZHK under the Guarantee and the Agreement. Evidentiary hearings in the Arbitration have apparently been fixed to take place before the tribunal in July 2020. This is in the near future. 42. The decision in Giorgio Armani SPA & ors v Elan Clothes Co Ltd & ors [2019] HKCFI 2983 is distinguishable, since there was no dispute raised in that case as to the existence of a valid and binding agreement made between the 1 st Plaintiff and the Defendant in the case. The disputed issue was whether, as a matter of construction of the relevant agreement and the arbitration clause, the arbitration agreement extended to the other parties as affiliates of the 1 st Plaintiff. In the absence of any dispute as to the existence of an arbitration agreement, there was no hurdle to the grant of a permanent injunction in Giorgio Armani to restrain the defendants’ breach of the covenant contained in the arbitration agreement, which was held to extend to affiliates. 43. A decision as to whether Y is a proper party in the Arbitration for the tribunal to grant the relief Y seeks against ZPRC and ZHK (in relation to PRC2) depends on the construction of the arbitration agreement contained in the Guarantee and the Agreement. That is a matter of the jurisdiction of the tribunal, which the tribunal has competence to decide. 44. On the question of the grant of a permanent injunction to restrain the breach of the arbitration agreement contained in the Guarantee and the Agreement, I conclude that it is not just and convenient on the facts of this case to accede to the grant, as it has the effect of interfering with the arbitral process and the jurisdiction of the tribunal to decide on the questions put before the tribunal in the Arbitration, namely the existence and validity of the Guarantee and the Agreement, which the tribunal is more able to decide by hearing the witnesses whose evidence can be tested on cross-examination, and by reference to the contemporaneous documents to be produced in the Arbitration. 45. In the interim and until the determination of the above questions by the tribunal, it is just and convenient under section 21L of the HC Ordinance, and also appropriate under section 45 of the Ordinance, to continue the Interim Injunction already granted by the Court against ZPRC, which extends to PRC1, and by its express terms continues until the conclusion or determination of the OS - or until further order of the Court. As the Court concluded in AES , the Court may decide to grant an injunction under section 21L on an interim rather than final basis, pending the outcome of current arbitration proceedings, or until further orders are made by the tribunal. Further, an anti-suit injunction may be granted under section 21L, whether or not there are existing arbitral proceedings, brought or anticipated ( AES ). 46. Whether an interim injunction, pending the determination and further orders of the tribunal in the Arbitration, is appropriate in relation to PRC2, will be considered below. Whether there was arbitration agreement between Y and the Defendants 47. There is a serious question to be tried, and a strong prima facie case if required for a mandatory injunction, that the arbitration agreement contained in the Guarantee and the Agreement with X extends to Y, when the arbitration clause is construed in the context of its wide scope, the relationship between X and Y, the nature of the transactions entered into by ZPRC and ZHK, and the nature and substance of the claims which have been made by ZPRC and ZHK against Y in PRC2. 48. It is not disputed, that Y and X are affiliated companies within the same group. According to the Statement of Petition filed in PRC2, the Defendants claim that they were induced, by representations made by the officers of Y in relation to the benefits of their derivative and financial products (“ Products ”), and were persuaded (1) to enter into transactions “with Y’s subsidiary in Hong Kong”, X, for trading in the Products and to sign the Agreement with X, on the direction and arrangements made by Y; and (2) to provide the Guarantee by ZPRC. The Defendants claim that the trades entered into by ZHK on such basis were in fact unlawful and illegal under PRC law, that Y’s conduct constituted fraud, and that the Defendants had sustained loss and damages as a result thereof. 49. PRC2 is for recovery of alleged damages sustained as a result of the allegedly unlawful trades made with X. The Defendants claim that this is not a contractual claim made under ZPRC’s Guarantee or ZHK’s Agreement with X, to be caught by the arbitration clauses contained therein. 50. The arbitration clause governing the Agreement is wide in scope, extending to “ any dispute , claim , difference or controversy arising out of , relating to or having any connection with (the Agreement), including any dispute as to its existence, validity, interpretation, performance , breach or termination … and any dispute relating to any non-contractual obligations arising out of or in connection with it ” (emphases added). The Agreement between X and ZHK was made for and in anticipation of transactions being entered into for the Products. The trades made by ZHK and the transactions entered into relating to the Products (referred to as the “target redemption forwards TARF”), and guaranteed by ZPRC, were transactions which by definition fall within the ambit of and are governed by the Agreement. Any claim or dispute relating to these trades, to the effect that they were unlawful, falls within the scope of the arbitration clause as a dispute or controversy which arose out of the same facts as, related to, or having connection with the Agreement, and is a dispute as to the performance of the Agreement and the transactions made thereunder. Even if the claim as formulated in the Statement of Petition in PRC2 can somehow be categorized as tortious in nature, it remains to be a dispute relating to a “non-contractual obligation” arising out of or in connection with the Agreement. The Defendants seek from Y the damages and loss they sustained under the trades made and governed by the Agreement. The claims made by the Defendants against Y in PRC2 are certainly not unrelated to the Agreement. 51. My conclusion is that the claims made by the Defendants in PRC2 fall within the scope of the arbitration clause incorporated in the Agreement between X and ZHK. Whether ZHK is liable for the trades covered by the Agreement also relates to whether ZPRC is liable to X under the Guarantee, so the claims made in PRC2 also fall within the scope of the arbitration clause in the Guarantee. Although Y is not a party to the Guarantee and the Agreement, I consider that the arbitration agreement between X and the Defendants can and should be construed to cover the claims made by the Defendants against the non-contracting affiliates or associates of X such as Y. As explained in paragraph 25 of the decision on the Interim Injunction, rational businessmen cannot reasonably have intended that disputes, claims, differences or controversies which fall within the scope of the arbitration clause of the underlying contracts should be decided by a different forum in a different manner of dispute resolution. 52. The imposition of Y as defendant in the tortious claims made in PRC2 and which fall within the scope of the arbitration agreement was clearly “a procedural manoeuvre” and an attempt to bypass and evade the arbitration agreement ( Clearlake Shipping Pte Ltd, Gunvor Singapore Pte Ltd v Xiang Da Marine Pte Ltd [2019] EWHC 2284 (Comm)), to subject X and Y to duplicative costs and inconvenience of the vexatious and oppressive proceedings. It would indeed be oppressive and vexatious for the Defendants to seek to enforce a claim arising out of the Agreement and related to the Guarantee, without respecting the arbitration clauses contained in those contracts ( Dell Emerging Markets (EMEA) Limited, Dell SA (A Body Corporate) v IB Maroc.com SA (A Body Corporate) [2017] EWHC 2937. In my judgment, it is appropriate and just to grant the anti-suit relief against the Defendants in respect of the continuance of PRC2, at least on an interim basis pending the tribunal’s determination of the issues in the Arbitration, or further order of the tribunal. Whether breach of arbitration agreement and concurrent jurisdiction of the PRC court 53. The main thrust of the Defendants’ opposition to the grant of the injunctions sought by the Plaintiffs is that there was no breach on their part of any arbitration agreement, since they have the right to invoke the jurisdiction of the Mainland court by PRC1, in order to challenge the jurisdiction of the arbitral tribunal over their dispute, as the tribunal does not have the exclusive jurisdiction to determine the existence of the arbitration agreement between the parties. I have little hesitation in dismissing such argument. 54. Leading Counsel for the Defendants places reliance on the leading texts on arbitration, and on the judgments in Dallah Real Estate and Tourism Holding Co v Ministry of Religious Affairs of the Government of Pakistan [2011] 1 AC 763 , on the “non-exclusive” jurisdiction of the tribunal, but such reliance is misplaced. There is no dispute on the general principles, that arbitration is a matter of contract, and that the tribunal has the power to determine disputes on its jurisdiction under the principle of competence-competence. It is also indisputable that the tribunal does not have the exclusive power to determine its own jurisdiction, as the Courts have the power, and duty, in the appropriate situation to review the correctness of the tribunal’s decision in relation to its own jurisdiction. This Court made observations on this at paragraphs 20 and 21 of the Decision on the Interim Injunction. 55. Even the passages and judgments cited by Leading Counsel make it clear, when read in their proper context, that the jurisdiction of the courts to consider the existence and validity of the arbitration agreement are confined to the particular situations of the review provided for in the statutory scheme. These situations are firstly, the review by the supervisory court at the seat of the arbitration of the tribunal’s preliminary decision on a challenge to its jurisdiction arising out of the arbitration agreement, which decision can be in the form of the tribunal’s preliminary decision on jurisdiction, or incorporated in its award on the merits: in the case of Hong Kong, under Article 16 (3) of the Model Law, adopted under section 34 of the Ordinance; or when an application is made to the supervisory court to set aside the award as the exclusive recourse under Article 34 of the Model Law, which has effect in Hong Kong under section 81 of the Ordinance. Finally, there may be review at the enforcement stage, when the court of enforcement in any jurisdiction may consider whether to recognize the arbitral award which has been made, on the grounds provided for in Article V of the New York Convention and as set out in section 89 of our Ordinance, or under sections 86 and 95 of the Ordinance when they apply. These grounds include the invalidity of the arbitration agreement relied upon. 56. In Dallah , the Court was examining the jurisdiction of the English court under section 67 of the Arbitration Act 1996, in a challenge to the jurisdiction of the tribunal, and under Article V of the New York Convention, when the award was sought to be recognized and enforced. At paragraphs 26 - 28 of the judgment of Lord Mance, the following observations were made: “26 An arbitral tribunal’s decision as to the existence of its own jurisdiction cannot therefore bind a party who has not submitted the question of arbitrability to the tribunal. This leaves for consideration the nature of the exercise which a court should undertake where there has been no such submission and the court is asked to enforce an award. Domestically, there is no doubt that, whether or not a party’s challenge to the jurisdiction has been raised, argued and decided before the arbitrator, a party who has not submitted to the arbitrator’s jurisdiction is entitled to a full judicial determination on evidence of an issue of jurisdiction before the English court, on an application made in time for that purpose under section 67 of the Arbitration Act 1996 … 27 The question is whether the position differs when an English court is asked to enforce a foreign award …. 28 It is true that article V (1) (e) of the Convention and section 103 (2) (f) of the 1996 Act recognize the courts of “the country in which, or under the law of which” an award was made as the courts where an application to set aside or suspend an award may appropriately be made; and also that article VI and section 103 (5) permit a court in any other country where recognition or enforcement of the award is sought to adjourn, if it considers it proper, pending resolution of any such application. But article V (1) (a) and section 103 (2) (b) are framed as freestanding and categorically alternative grounds to article V (1) (e) of the Convention and section 103 (2) (f) for resisting recognition or enforcement . Neither article V (1) (a) nor section 103 (2) (b) hints at any restriction on the nature of the exercise open, either to the person resisting enforcement or to the court asked to enforce an award, when the validity (sc resistance) of the supposed arbitration agreement is in issue …” (Emphasis added) 57. Paragraph 85 of the judgment of Lord Collins also makes it clear that the observations made on the jurisdiction of the court were made in the context of article 16 (1) of the Model Law, which provides that the tribunal may rule on its own jurisdiction including any objections with respect to the existence or validity of the arbitration agreement, at the preliminary stage of the challenge, or in the award on the merits, and in the context of article 34 (2), which provides for setting aside of arbitral awards by the court of the seat of the arbitration, where an applicant can furnish proof that the agreement is not valid under the law to which the parties have subjected it, or under the law of the seat. At paragraph 86, His Lordship noted: “Consequently in most national systems, arbitral tribunals are entitled to consider their own jurisdiction, and to do so in the form of an award. But the last word as to whether or not an alleged arbitral tribunal actually has jurisdiction will lie with a court, either in a challenge brought before the courts of the arbitral seat , where the determination may be set aside or annulled , or in a challenge to recognition or enforcement abroad . ” (Emphasis added) 58. The fact that the Court in Dallah was considering the validity of the arbitration agreement and the jurisdiction of the tribunal in the context of deciding whether the award should be enforced, is made clear in paragraph 160 of the judgment of Lord Saville of Newdigate JSC: “The starting point in this case must be an independent investigation by the court of the question whether the person challenging the enforcement of the award can prove that he was not a party to the arbitration agreement under which the award was made. … Whether the arbitrators had jurisdiction is a matter that in enforcement proceedings the court must consider for itself. ” 59. It was in such context that the English Supreme Court found in Dallah that the tribunal does not have “exclusive” power to determine its own jurisdiction, and that the tribunal’s decision on its jurisdiction is not final, and can be reviewed by the court hearing an action for the setting aside of the award, or in enforcement proceedings. It is not authority for the proposition that the court has jurisdiction over the dispute in any other action or proceedings. 60. With the only exception of the situation provided for under section 20 of the Ordinance, I am not persuaded that there is any authority for the proposition that the court has general jurisdiction over the dispute which is the subject matter of an arbitration agreement, entitling the court to intervene - when an arbitration has been commenced under a purported arbitration agreement, and before a decision on jurisdiction or an award on the merits is made by the tribunal. Indeed, under Article II of the New York Convention, each contracting state to the Convention has the duty to recognize an agreement in writing under which the parties undertook to submit the differences to arbitration, whether contractual or not, and the court of a contracting state has the duty, when seized of an action in a matter in respect of which the parties have made an arbitration agreement, to refer the parties to arbitration, unless it finds the agreement to be null and void, inoperative or incapable of being performed. This is reflected in section 20 of the Ordinance, when the Court determines, on an application for stay of the legal proceedings, whether the arbitration agreement governing the subject matter of the dispute is inoperative, incapable of being performed etc. 61. China is a party to the New York Convention and is bound by the duties assumed under Article II (3). Under the Arrangement Concerning Mutual Enforcement of Arbitral Awards Between the Mainland and the Hong Kong SAR, China also recognizes and enforces arbitral awards made in Hong Kong, pursuant to arbitration agreements entered into by parties. 62. The expert evidence adduced on behalf of the Defendants did not adequately address the above issues, when opining that the Mainland court has the jurisdiction and power to decide on the arbitration agreement relied upon by the Plaintiffs and to declare that it is invalid. The application to the Mainland court in PRC1 and PRC2 was not made to resist enforcement of any arbitral award, as none has yet been made. Nor is the Mainland court the supervisory court at the seat of the Arbitration, which is in Hong Kong. There is no review of any award or order of the tribunal on its jurisdiction. 63. The expert evidence adduced by the Defendants is to the effect that the Mainland court has jurisdiction to review and to decide on the validity of the arbitration agreement, citing article 124 of the Civil Procedure Law, the Civil Procedure Law Judicial Interpretation Article 215, and Article 21 (1) of the PRC Arbitration Law. The expert explained that under the Civil Procedure Law, where there is a lawful and valid arbitration agreement between the parties, the jurisdiction of the Mainland court over the dispute prescribed in the arbitration agreement shall be prohibited, but if the parties have disputes over the arbitration agreement itself, such as its formation and validity, the Mainland court shall have jurisdiction over such issue. Article 21 (1) of the PRC Arbitration Law provides that if a party challenges the validity of an arbitration agreement, it may request the arbitration commission to make a decision, or apply to the people’s court for a ruling. It further provides that if one party requests the arbitration commission to make a decision, and the other party applies to the people’s court for a ruling, the court shall give the ruling. 64. However, the expert expressly states in paragraph 6 of his report that arbitral tribunals outside the Mainland (and hence arbitrations outside the Mainland) are not subject to or governed by either the Civil Procedure Law or the Arbitration Law. The expert further states that in such situation, and in normal circumstances, the overseas arbitral tribunal may make its own determination on its jurisdiction, and the Mainland courts will not interfere. This appears to be a concession on the limited powers of the Mainland court so far as international or foreign-related arbitrations conducted by tribunals outside the Mainland are concerned - which is consistent with the New York Convention and the obligations imposed on and assumed by the contracting states. 65. In conclusion, I reject the Defendants’ argument, that there is no case at all of any breach by the Defendants of any arbitration agreement, in their institution of PRC1 relating to the Mainland court’s jurisdiction to determine the existence and validity of the arbitration agreement. 66. Even if the Mainland court truly has jurisdiction, I accept the submissions made by Mr Gearing on behalf of the Plaintiffs, that the Defendants should not be allowed, in view of the arbitration agreement, to invoke such jurisdiction. As held by the Court in Tamil Nadu Electricity Board v ST-CMS Electric Company Private Ltd [2007] EWHC 1713 (Comm), the fact that a foreign court has jurisdiction and may insist on its own jurisdiction is irrelevant to the court of the seat of the arbitration, when it deals with an arbitration provision governed by its own law. The very object and intent of the arbitration clause is that notwithstanding that another court may have jurisdiction, the parties agree with one another to submit their differences to the chosen tribunal, and not any other court. Balance of convenience 67. I reject the Defendants’ argument, that they would suffer irreparable harm if they should have to withdraw PRC1 and/or PRC2, as there is a serious risk that the grounds on which they rely to challenge the jurisdiction of the tribunal may not be entertained by the Mainland court at the stage of enforcement. If an award is made in the Arbitration, and the Defendants maintain that the tribunal has no jurisdiction in the absence of a valid arbitration agreement, they will still be entitled to oppose enforcement of the award on the Mainland, and the Mainland court is entitled at that stage, as the court of enforcement, to consider the recognized ground of the non-existence or invalidity of the arbitration agreement, and to refuse enforcement of the award if there are grounds made out. The position of the Defendants can obviously be preserved by challenging the jurisdiction of the tribunal at an early stage. Conclusion 68. For all the reasons stated above, I continue the Interim Injunction against ZPRC pending determination by the arbitral tribunal in the Arbitration, or until further order of the tribunal. I also make a Supplemental Order against ZPRC, that it shall do or perform all and any further acts required to be done or performed by and in accordance with paragraph 1 (a) of the Interim Injunction, within 7 days from the date of service of the order under this Judgment. Any further arguments as to whether ZPRC has complied with the orders of this Court will have to be pursued in such contempt or other enforcement proceedings as may be necessary. 69. I further grant an injunction in terms of paragraph 1 (a) and (b) of the draft annexed as Schedule 3 to the Plaintiffs’ summons dated 24 January 2020, pending the determination by the arbitral tribunal in the Arbitration, or until further order of the tribunal. 70. I see no justification at this stage to dispense with personal service of the Orders of this Court. 71. As I have granted relief substantively in terms of the OS and the Plaintiffs’ applications, the order nisi is that the costs of these proceedings (including the costs reserved under the Order of 11 March 2020) are to be paid by the Defendants to the Plaintiffs. (Mimmie Chan) Judge of the Court of First Instance High Court Mr Matthew Gearing (Solicitor-Advocate), of Allen & Overy, for the 1 st & 2 nd plaintiffs Mr Anson Wong SC and Ms Stephanie Wong, instructed by Stevenson Wong & Co, for the 1 st and 2 nd defendants Look up this case on Lawcite Noteup",
  "length": 59184,
  "headers_seen": [
    "Background",
    "Comity and whether disrespectful",
    "Jurisdiction under s 21L and O 11 r 1 RHC",
    "Whether the jurisdiction of the Court should be exercised under s 21L",
    "Whether jurisdiction of the Court under s 21L is ancillary only",
    "Whether just and convenient to grant the permanent injunction",
    "Whether there was arbitration agreement between Y and the Defendants",
    "Whether breach of arbitration agreement and concurrent jurisdiction of the PRC court"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2020/631",
  "query": "seat of arbitration",
  "ts": "2025-10-16T10:49:49",
  "ok": true
}