{
  "title": "ITIRO CORPORATION BVI V. THE OWNER AND/OR DEMISED CHARTERERS OF THE SHIP OR VESSEL “ANGELIC GLORY” | [2021] HKCFI 1192 | HKLII",
  "court": null,
  "year": 2021,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2021] HKCFI 1192 ITIRO CORPORATION BVI V. THE OWNER AND/OR DEMISED CHARTERERS OF THE SHIP OR VESSEL “ANGELIC GLORY” Judgment Information Date 12 Apr, 2021 Action No. HCAJ90/2020 Neutral Cit. [2021] HKCFI 1192 Download MS Word Judgment Reading Options Translation Toggle Highlight Appeal History HCAJ90/2020 HCAJ90/2020 ITIRO CORPORATION BVI v. THE OWNER AND/OR DEMISED CHARTERERS OF THE SHIP OR VESSEL “ANGELIC GLORY” HCAJ 90/2020 [2021] HKCFI 1192 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE ADMIRALTY ACTION NO 90 OF 2020 ____________________ Admiralty Action in rem against: the ship or vessel “ANGELIC GLORY” (IMO No. 9261798) BETWEEN ITIRO CORPORATION BVI Plaintiff and THE OWNER AND/OR DEMISED CHARTERERS OF THE SHIP OR VESSEL “ANGELIC GLORY” Defendants ____________________ Before: Hon Anthony Chan J in Court Date of Hearing: 13 April 2021 Date of Decision: 13 April 2021 ________________ DECISION ________________ 1. There are competing claims in respect of the proceeds of sale of “Angelic Glory” and it is incumbent upon the court to carefully scrutinize the Plaintiff’s claims here before the court. 2. I should say, firstly, that I have considerable misgivings about the evidence relied upon by the Plaintiff in the form of an affidavit by an English solicitor acting for the Plaintiff, Mr Seward. The affidavit, with respect, is consisted largely of submissions and plainly impermissible. Insofar as there is any suggestion that Mr Seward was providing his opinion on English law, such suggestion is ill-founded because there is no suggestion of any material difference between the law of the two jurisdictions. 3. I am satisfied on the material before the court that the Plaintiff’s claims, with two exceptions, are well-founded. 4. The first exception concerns the Plaintiff’s claim in respect of the difference in hire rate arising from an Addendum which the parties had agreed as a result of the Plaintiff’s request for the carriage of sugar. This claim is based upon the proposition that there was a total lack of consideration and/or duress on the part of the Defendants which ultimately produced the Addendum. I am not satisfied that this case is well-founded. In particular, the critical part of the Charterparty provided as follows : “O/W AS PER OWNERS CP PROFORMA (ATTACHED) MV ANGELIC PEACE – ITIRO 31 JAN 2019 WITH LOGICAL AMENDMENTS” The proforma which was attached to the email which contained that provision (“Provision”) did not allow the carriage of sugar. 5. Whilst there was a reference in the Provision to the Angelic Peace Charterparty, such reference cannot be divorced from the proforma which was attached to the email. I accept that in the Angelic Peace Charterparty the material clause had been amended so as to allow the carriage of sugar. However, I think that the point is at best arguable, and therefore I do not see why it can be said that the Defendants had provided no consideration and/or had exercised duress on the Plaintiff to produce the Addendum which provided for an increased hire. I think once it is accepted that the point is at best arguable, then clearly the Defendants had provided consideration by giving up the argument and agreeing to the carriage of sugar. 6. The rejection of this claim impacts upon another claim by the Plaintiff, namely, the costs of arbitration. That claim is based upon the proposition that the Defendants had no merit in its contention or in their dispute with the Plaintiff. The fact that I am not satisfied with the Plaintiff’s case on the additional hiring cost arising from the Addendum means that the Defendant must at least succeed in certain part of the arbitration. Insofar as any apportionment of costs is concerned, it is not really a matter which the court is in the position to adjudicate. Therefore, I am equally not satisfied that this head of claim is well-founded. 7. Accordingly, those two claims are to be deducted from the Plaintiff’s total claim. I have been advised by Mr Kirpalani, who appears for the Plaintiff, that after the deduction the Plaintiff’s total claim stands at US$108,475.07, and I would give default judgment in that sum. ( Anthony Chan ) Judge of the Court of First Instance High Court Mr Lavesh Kirpalani, instructed by Tsui & Co., for the Plaintiff Look up this case on Lawcite Noteup",
  "length": 4397,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2021/1192",
  "query": "costs of arbitration",
  "ts": "2025-10-16T10:45:11",
  "ok": true
}