{
  "title": "NG YUK KEUNG V. YAN XIAOJIE | [2018] HKDC 534 | HKLII",
  "court": null,
  "year": 2018,
  "date": "2025-12-08",
  "content": "HKLII Databases District Court [2018] HKDC 534 NG YUK KEUNG V. YAN XIAOJIE Judgment Information Date 17 May, 2018 Action No. DCCJ294/2018 Neutral Cit. [2018] HKDC 534 Parallel Cit. [2018] 6 HKC 338 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History DCCJ294/2018 DCCJ294/2018 NG YUK KEUNG v. YAN XIAOJIE DCCJ 294/2018 [2018] HKDC 534 IN THE DISTRICT COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION CIVIL ACTION NO 294 OF 2018 -------------------- BETWEEN NG YUK KEUNG (吳育強) Plaintiff and YAN XIAOJIE (閻小洁) Defendant -------------------- Before: Deputy District Judge Kate Li in Chambers (Open to public) Date of Hearing: 30 April 2018 Date of Decision: 18 May 2018 -------------------- DECISION -------------------- A. Introduction 1. This is a stay application made by the defendant by her summons dated 21 March 2018 as amended by Order dated 11 April 2018, for an order to stay the proceedings, and for “ a declaration that the Court should not exercise any jurisdiction it may have on the ground that in respect of the same cause of action to which the proceedings related, there are other proceedings pending between the Defendant and the Plaintiff and another court namely in the People’s Republic of China” . The facts of this matter concern cross border settlement enforcement. 2. The stay application is made on the ground of Order 12 Rule 8(2A)(c) of the Rules of District Court [1] which reads:- “(c) in respect of the same cause of action to which the proceedings relate, there are other proceedings pending between the defendant and the plaintiff in another court.” 3. The application for stay came before me for direction on 11 April 2018. The application was supported by the Affidavit of the defendant’s solicitors Ng Leuk Ching dated 21 March 2018. At the same hearing, the plaintiff’s summary judgment application by summons dated 29 March 2018 was also before me. I have directed that the summary judgment summons not to be proceeded with pending the determination of the stay application. I have also directed that the plaintiff’s affirmation in opposition of the stay summons, and the defendant’s affirmation in reply be filed. Accordingly, Ms Li Qian’s affirmation dated 16 April 2018 was filed in opposition by the plaintiff, and the defendant’s affirmation was filed on 25 April 2018 exhibiting two PRC lawyer opinions. 4. The defendant’s stay application was adjourned to this hearing for substantive arguments. At the hearing, no party has sought additional leave or time to put in further evidence. The hearing proceeded on the basis that each party had already put in the evidence they needed to sustain their positions for the stay application. B. Background 5. The plaintiff is a Hong Kong resident and the defendant resides in Beijing. They got married in Shanghai in 2002. In the course of the marriage, on 30 May 2013, they have acquired in their joint names a Hong Kong property known as Flat E, 31 st Floor, Tower 7, The Wings, No 9 Tseung Kwan O, New Territories (the “Property”) at a consideration of HK$6,046,800. In 2017, the plaintiff petitioned for divorce in the People’s Court of Republic in Chaoyang District, Beijing, PRC. 6. Upon mediation conducted by the Chaoyang Court, the parties have, on 14 July 2017, reached a settlement. A document entitled “民事调解书” (hereinafter the “Mediation Agreement”) was then issued. I will later turn to the nature and effect of the document (Section H below). As a general background, Clause 6 provides that the defendant shall voluntarily give up all the matrimonial properties in Hong Kong and in Australia, such to be owned by the plaintiff accordingly. It reads:- “六、被告阎小洁（英文名: YAN XIAOJIE）自愿放弃位于香港以及澳大利亚境内的全部夫妻共同财产，均归原告吴育强所有。” 7. By his Statement of Claim in this action, the plaintiff sought specific performance of the Mediation Agreement by the defendant to the effect that the defendant be ordered to transfer all her interest in the Property to the plaintiff. The plaintiff proceeds on the basis that the Mediation Agreement is a contract/agreement between the parties. He relied on Clause 6 of the Mediation Agreement. 8. The ground for stay relied on by the defendant was that to the same cause of action as in these proceedings, there was a pending parallel proceedings in PRC by way of an action commenced by the defendant in 北京市顺义区人民法院 (herein the “Shunyi case”) on 15 November 2017. The ground of the action was that the defendant had after the Mediation Agreement, discovered that the plaintiff held and had not disclosed assets in his sole name being 3,000,000 shares of and in a Hong Kong listed company. Many of the plaintiff’s arguments and the issues here turn on the interpretation, impact and scope of the Shunyi case. I set out the claim complaint of the defendant in full below. The defendant drafted it on her own without assistance of legal advice, a suggestion to which the plaintiff did not challenge. “ 民事起诉书 原告姓名：阎小洁，性别：女，年龄：38，住址：北京市顺义区后沙峪香蜜湾7号楼3单元501室，护照号码：PA2249616，电话：18721096978。 被告姓名：吴育强，性别：男，年龄：53，住址：北京市顺义区后沙峪优山美地C2103，香港身份证号码: C383814(3)，电话：18601211812。 案由：离婚后财产纠纷。 诉求请求：请求依法分割夫妻共同财产（北京金山软件有限公司的300万股权）。 事实及理由：本人与被告吴育强于2017年7月13日在朝阳区法院奥运村法庭通过调解解除了婚姻关系。之后通过调查发现被告有隐藏婚姻期间夫妻共同财产（股权）的行为，涉及金额上千万， 我与被告在离婚时我已经放弃了大部分的共同财产（房子，车辆，存款）和孩子的抚养权，现向顺义法院提出诉讼，希望法院能依法受理本案。 此致 北京市顺义区人民法院天竺法庭 具状人：阎小洁 2017年11月15日” C. Summary of key arguments 9. The parties’ counsel have argued their respective clients’ cases on multiple fronts. This is the case especially for Mr Siu who might have left few stones, if any, unturned. To keep one’s mind focused, I set out the key arguments related to the basis of my decision first. The fundamental issue is whether the Shunyi case is a parallel proceedings in the PRC for the same cause as in this action. This is squarely the ground of the defendant’s application. 10. Mr Patrick Siu for the defendant argues that they are not for the same cause; they are different for two reasons - first, this Hong Kong action is to enforce the Mediation Agreement as an agreement; there is no parallel attempt in the PRC by the plaintiff to enforce the Mediation Agreement as an agreement. Secondly, as he argued, the subject matter of the two cases are different - the subject matter in this action is the Property and in the Shunyi case the shares. [2] These two limbs of the argument will be examined and referred to in the later part of the decision (Sections H & I below). 11. Mr Paul Wong, for the defendant, argued that the action here and the Shunyi case concerned the same cause of action, ie the beneficial interest of the Property. He argued that it would open for the Shunyi Court to divide the matrimonial assets afresh, and that could impact upon the Property. It was argued that the Shunyi case was made under Article 47 of the Marriage Law, the express wordings of which empowered division afresh after divorce upon discovery of hidden assets. 12. I believe that the root of the heated arguments over whether there is a parallel proceedings of the same cause is that the Shunyi case is not a direct attempt to reopen the arrangement under the Mediation Agreement. It is an action in a different Beijing court, and it has not contained unambivalent language for reopening the scheme of things under the Mediation Agreement. 13. Added to this root problem is the additional problem that both sides’ PRC legal experts whose opinions were obtained specifically for these proceedings have not been able to state definitely whether the outcome of the Shunyi case will affect the scheme of things under the Mediation Agreement. The contemporaneous documents are also inconclusive on this issue. 14. Against this background, and as will be detailed below, I have not arrived at any conclusion as to whether the Shunyi case can affect the scheme in the Mediation Agreement. I cannot arrive at a conclusion on this issue (Section I below). 15. It also follows that the possibility of the Shunyi case affecting the Agreement and hence the Property cannot be ruled out. D. Stay ordered pending conclusion of Shunyi case; dubious foundation of Hong Kong action 16. I weigh such risk against the fact that the plaintiff’s Hong Kong action probably had made a wrong start, and is on dubious footing. I will explain this further below. 17. Weighing against this last factor, the risk of inconsistent rulings, though likelihood of which cannot be ascertained by me, exists and should favour staying of the problematic Hong Kong action of the plaintiff. The stay is pending conclusion of the Shunyi case. 18. I order the stay under Order 12 Rule 8(2A)(c) of the Rules of District Court as well as section 48(5) of the District Court Ordinance. 19. The case for staying this action is quite compelling. This is relevant to my decision that leave be granted for the defendant to file the application for stay out of time. In this case, it is a delay of 16 days. Mr Siu for the plaintiff strenuously objected to the extension of time application. 20. I will deal with the extension of time application first. E. Application for extension of time for making of stay application under Order 12 Rule 8 21. The first issue requiring my decision is whether extension of time should be granted to the defendant regarding her delay in making the application for stay of 16 days. 22. Under Order 12 Rule 8(2), application under Order 12 Rule 8 should be made within the time limited for service of a defence. The Writ was served on the defendant’s solicitors on 22 January 2018, and time for defence was by 5 March 2018. The defendant’s stay application under Order 12 Rule 8 was made only on 21 March 2018, hence a 16 day delay. The stay application summons sought also an extension of time for the making of the application, under Order 3 Rule 5. However, the defendant’s affirmation has not deposed to why there was such a lateness. Mr Wong for the defendant submitted at the hearing that the defendant was all along in Beijing and she was also preoccupied with the PRC proceedings. 23. Mr Siu for the plaintiff objected to the application for extension of time. He primarily relied on Yeung Fu Lin & Anor v Wong Kam Hung & Anor [1997] 2 HKC 809 to argue for near absolute strictness in compliance of time limit in Order 12 Rule 8 and no extension should be granted unless there was an acceptable explanation. In Yeung Fu Lin , the learned Judge Findlay refused to pardon a 3 day delay in the context of a setting aside of Writ application under Order 12 Rule 8. The service of a Writ had expired validity period for a few days. 24. Mr Siu did not argue that the 16 days caused prejudice to the plaintiff. 25. After hearing submissions at the beginning of the hearing, I reserved my decision. 26. I exercise my discretion under Order 3 Rule 5 to extend the time, granting leave to the defendant to make the stay application out of time. The reasons are twofold. F. Co-existence of inherent jurisdiction for forum stay 27. The first reason is specifically concerning application for stay in favour of another forum. 28. I believe that Order 12 Rule 8 has not abrogated the Court’s inherent jurisdiction to grant stay on the basis of forum non conveniens . To this, Mr Siu submitted that this was not right as the inherent jurisdiction could no longer be engaged after the Civil Justice Reform which has codified the forum non conveniens principles. He has not submitted authorities in this regard. 29. My observation on the availability of inherent jurisdiction is based on Xiang Jun v Cheng Chiu Tong Gregory, HCA 47 of 2017, dated 11 September 2017, para 4, and James Chor Cheung Wong & Anor v Hark Chung Wong, dated 4 July 2017, para 21-23. Stay application under common law is not subject to time limit, or time limit as tight as Order 12 Rule 8. In Xiang Jun, Master M Wong specifically observed that the co-existing inherent jurisdiction would be relevant when it came to the question of time limit for the making of application. In para 4, he stated:- “In fact, under Civil Justice Reform, forum non conveniens stays are granted under Order 12 rule 8(2) rather than inherent jurisdiction, although the inherent jurisdiction remains especially where circumstances change after the expiry of the Order 12, rule 8 time limit (see Hong Kong Civil Procedure 2017, paragraph 11/1/10).” 30. Mr Siu for the plaintiff argued that absent any explanation for the lateness, and where the Court did not condone tardiness of a 3 day delay in Yeung Fu Lin & Anor v Wong Kam Hung & Anor [1997] 2 HKC 809, the defendant’s lateness in this case was fatal. 31. However, Yeung Fu Lin was a case of application for setting aside service of writ which was a few days after the validity of the Writ expired. It was not a case of application for stay on forum ground. Before expiration, validity period of writ is capable of being extended, upon showing of good cause. I do not suggest that expiration of validity period is a defect less fundamental than the Hong Kong courts’ being an inappropriate forum. However, one cannot disregard that the defect in Yeung Fu Lin seemed to be more of procedural nature, and the fact that Hong Kong is not the appropriate forum seemed to be a ground more of substance. Moreover, Yeung is a 1997 pre-CJR case and no doubt, when making the decision and reasoning it, the learned Judge Findlay would not have Order 12 Rule 8(2A) [3] in mind. 32. I am of the view that I am not bound, in this case, by the strictness in Yeung Fu Lin. 33. The District Court should have the same ancillary jurisdiction as the High Court and the considerations in Xiang Jun and James Chor Cheung Wong should also apply to District Court. [4] I agree with the dicta in Xiang Jun and James Chor , and consider that the District Court also retains the inherent jurisdiction to stay proceedings in favour of a foreign forum. Both Xiang Jun and James Chor Cheung Wong are decisions on stay application under forum non conveniens principles. G. Broad and unrestricted approach to Order 3 Rule5 discretion, endorsed recently in Astro Nusantara v PT Ayunda 34. The second reason for granting extension of time is that Order 3 rule 5 confers a broad and unrestricted discretion; it also entitles the Court to take into consideration the substantive merit and strength of the applicant’s case, which is more than a secondary factor. 35. I am mindful of a recent Court of Final Appeal decision Astro Nusantara International B.V. & Ors vs PT Ayunda Prima Mitra & Anor , FACV 14 of 2017/[2018] HKCFA 12, dated 11 April 2018. It is a case decided on the issue of time extension application under Order 3 Rule 5, in the context of arbitration award debtor resisting a Singapore-seated award enforcement in Hong Kong, by applying to Hong Kong court to set aside the leave to enforce. The award debtor missed the 14 day time limit for application for setting aside leave for enforcement of award under Order 71 Rule 10(6) of the Rules of High Court. 36. The ground for setting aside concerned the arbitral tribunal’s decision to join additional parties to the arbitration, which was later held by the Singaporean Court of Appeal as wrong. The result of it went fundamentally to a lacking of tribunal’s jurisdiction as the invalid joinder was taken as a lack of valid arbitration agreement. Such ruling was made in Singapore in 2013; it was when the appeal was pending in 2012 that the award debtor decided to apply to set aside in Hong Kong the award made in Singapore. The application was 14 months late as the enforcement proceedings in Hong Kong commenced in 2010. 37. The Court of First Instance refused to extend time to condone the delay, and the Court of Appeal held the same view. The Court of Final Appeal overturned the decision. It held that the proper test for the Order 3 Rule 5 discretion is in accordance with the broad unrestricted approach. Furthermore, it held that matters of substantive merit is to be considered and it is more than something of secondary status. 38. The Honourable Mr Justice Ribeiro PJ stated, in paragraphs 53-55, 71:- “E.2 The appropriate test 53. It has often been emphasised that the discretion to extend time conferred by Order 3 r 5 is broad and unrestricted, designed to enable justice to be done between the parties. Thus, in Kwan Lee Construction Co Ltd v Elevator Parts Engineering Co Ltd, Litton VP in the Court of Appeal, stated: “The court's jurisdiction to extend time, as conferred by O 3 r 5, is as broad as it can come and, in the exercise of that discretion, the court would, generally speaking, have some regard to what might ultimately be in issue.” 54. In Costellow v Somerset County Council, dealing with the equivalent provision in England and Wales, Sir Thomas Bingham MR noted that the discretion involves the intersection of two principles. The first promotes the enforcement of time limits for the expeditious dispatch of litigation in the public interest and the second recognises that a plaintiff should not ordinarily be denied adjudication of his claim on the merits because of a procedural default “unless the default causes prejudice to his opponent for which an award of costs cannot compensate”. His Lordship noted that the second principle “is reflected in the general discretion to extend time conferred by Ord 3, r 5, a discretion to be exercised in accordance with the requirements of justice in the particular case.” 55. The approach advocated on First Media’s behalf as formulated by the Court of Appeal in The Decurion, is in line with the foregoing authorities. Citing Costellow, Cheung JA acknowledged the intersecting principles and stated: “It is clear that the applicable principle in deciding whether time should be extended is to look at all relevant matters and consider the overall justice of the case. A rigid mechanistic approach is not appropriate...” … 71. Even at a purely procedural level, cases in the Denton line (in which the parties’ substantive rights do not feature) sit uncomfortably with the procedural regime in this jurisdiction. Order 1A r 2(2) provides that: “In giving effect to the underlying objectives of these rules, the Court shall always recognize that the primary aim in exercising the powers of the Court is to secure the just resolution of disputes in accordance with the substantive rights of the parties.” This Court in Wing Fai Construction Co Ltd v Yip Kwong Robert, reiterated the importance of the primary aim of securing the just resolution of disputes in accordance with the parties’ substantive rights, stressing that compliance with the rules is not an end in itself and that a mechanistic approach is to be eschewed. The overriding objective in the English CPR r 1.1 emphasises procedural fairness and economy rather than the parties’ substantive rights.” 39. Merits and fairness to the applicant (for time) should be given proper consideration in a time extension application; in Astro , the fundamental absence of a valid arbitration agreement, being a matter going to the jurisdiction of the tribunal were matters of merits that should weigh properly in favour of granting extension of time. [5] 40. Whilst this Court of Final Appeal decision is recent, the principles of broad and unrestricted approach are not new. It is a case that none of the parties have mentioned to me. The defendant mentioned the broad and unrestricted approach in Mr Wong’s further submissions filed after the hearing. Mr Siu rightly complained about Mr Wong’s making further submissions after the hearing on matters not within my direction. (Mr Siu’s further submissions have also contained other arguments but I took it that Mr Siu was replying to Mr Wong’s new submissions to play safe.) 41. To avoid any doubt, I mention here that I have not relied on Mr Wong’s new materials on time extension in the further submissions. I have only directed for further submission on the issue of interpretation of “ same cause ” under Order 12 Rule 8(2A)(c). Nor have I relied on the 2 nd Affirmation of Ng Leuk Ching of the defendant filed after hearing without leave or consent from the plaintiff purportedly to advance evidence on reason for delay. 42. I exercised my discretion to extend time adopting the broad and unrestricted approach taking account of merits of the application and against the background that inherent jurisdiction, which does not have the time limit, co-exists. 43. In making my decision, I specifically take into account the merits of the application for stay, in that Hong Kong jurisdiction should be deferred to the PRC Shunyi Court jurisdiction, as will be analysed below. Overall justice in this case precludes the rigid and mechanical application of the 14 day time limit. Hence, this decision is made solely for this matter, and based on the circumstances before me. The 14 day time limit under Order12 Rule 8 is binding. Yet, it is upon consideration of these principles and the facts and merits of the application that I grant leave for the extension of time in this case. 44. At the hearing, on de bene esse basis , the Court has proceeded to hear the argument on the stay application. I now go into the analysis concerning the substantive stay application. H. Whether there is a parallel PRC proceeding for the “same cause”? 45. It is a necessary exercise to look into the nature and effect of the Mediation Agreement. I believe that this issue is apparent even when one has a first glance of the plaintiff’s statement of claim. Mr Siu however submitted to me that his client has no evidence to support that it is a contract / agreement as there is no need to look at the nature of the Mediation Agreement. He argued that we are considering the stay application only; the examination of this matter should be left to summary judgment proceedings or at trial. 46. I have tried hard to follow Mr Siu’s argument that it is irrelevant to look at the nature of the Mediation Agreement. But still I cannot agree with it. It is the plaintiff’s own reliance, in opposing the stay, on the nature of the Hong Kong action, and it was the plaintiff’s own submission that the Hong Kong action was a contract enforcement action not paralleled by another contract enforcement action in PRC (as the first limb of argument set out in paragraph 10 above). 47. Thus embedded in the plaintiff’s submissions in opposing stay is the position that the Mediation Agreement is a contract, not Court order. There is no basis for the plaintiff to avoid confronting the issue of the characterisation of the Mediation Agreement in the stay application stage. 48. Ms Li Qian, the PRC law expert for the plaintiff, had given evidence on this issue. But she is obviously ambivalent. She stated repeatedly that the Mediation Agreement is a legal instrument having the same effect as a judgment or order. She was ambivalent as to whether it was a Judgment or an agreement. In paragraphs 24 and 29 of her legal opinion, she stated:- “中国法律专家意见 24. 民事调解书为生效法律文书具有等同于生效判决、裁定的效力，具有强制执行力。” “总结 29. 总括而言，无论该顺义法院案的结果如何，均不会影响该朝阳法院案中《民事调解书》作为具有可执行效力的生效法律文书。” 49. On the other hand, Mr Alex Zhao, PRC legal expert, for the defendant opined and stated in clear terms that the Mediation Agreement was a judgment of the Chaoying Court. He stated in his opinion as follows:- ‘Question 1: The Legal Nature of the Mediation Agreement? The rules and practices of divorce proceedings are mainly governed and regulated by the “Civil Procedure Law of PRC” (“CPL”). The outcomes of a legal action are either a court judgment after a contested trial, or a settlement reached between the parties voluntarily without a contested trial. If a legal action is concluded at the latter situation, the settlement itself is as good as a court order. If a party breaches the settlement, he or she can enforce the settlement and/or seek relief in the PRC courts. The sources derive from articles 97 and 234 of CPL. Articles 97 provides that:- “调解达成协议，人民法院应当制作调解书。调解书应当写明诉讼请求、案件的事实和调解结果。调解书由审判人员、书记员署名，加盖人民法院印章，送达双方当事人。调解书经双方当事人签收后，即具有法律效力。“ “在执行中，双方当事人自行和解达成协议的，执行员应当将协议内容记入笔录，由双方当时人签名或者盖章。申请执行人因受欺诈、胁迫与被执行人达成和解协议，或者当时人不 履 行和解协议的，人民法院可以根据当事人的申请，恢复对原生效法律文书的执行。“ For the avoidance of doubt, any settlement made during a legal action shall become a court order binding upon the parties. The settlement is however not a private contract carrying any contractual effect. In other words, the parties cannot by themselves vary or cancel the settlement without court’s permission. In addition, the PRC courts will keep full control over how a settlement may be enforced or rescinded, if a party wishes to do so. Therefore, the Mediation Agreement in the present case is a valid and binding court order and judgment pronounced by the PRC court.” 50. That the Mediation Agreement is a PRC court judgment, rather than a contract/agreement of the parties is close to uncontested. I proceed with considering this application on the basis that it is a PRC court judgment/order. It is also consistent with the fact that both parties informed me at the hearing that there was a prior agreement for signing. The Court later sent them the Mediation Agreement as relied on by the plaintiff here. I set out the full terms of the Mediation Agreement as relied on by the plaintiff below. The features of the document were as described by Mr Zhao for the defendant in his opinion set out in paragraph 49 above. It also bears a chop of the Chaoyang Court. In another words, the Mediation Agreement is a Court judgment/order albeit that it bears the title of a Mediation Agreement (民事调解书). The plaintiff’s first limb of his arguments to argue for no same cause (as referred to in paragraph 10 above) cannot stand. “ 中华人民共和国 北京市朝阳区人民法院 民事调解书 (2017) 京0105 民初51102号 原告：吴育强，男，1964年9月2日出生，香港居民，北京金山软件有限公司董事兼财务总监， 住北京市海淀区小营西路33号金山软件大厦501，香港永久性居民身份证C383814(3)。 被告：阎小洁 (英文名: YAN XIAOJIE)，女，1979年12月31日出生，国籍：澳大利亚，无业，住北京市朝阳区东西环中路39号华业国际中心B座625，护照号PA2249616。 委托代理人：戚连峰，北京明航律师事务所律师。 案由：离婚纠纷 2002年3月30日原告吴育强（以下简称原告）与被告阎小洁（英文名：YAN XIAOJIE，以下简称被告）在上海市民政局办理结婚登记。婚姻存续期间双方共育一女吴蕊彤（出生日期：2002年7月6日）；及一子吴伟彤（出生日期：2004年4月26日）。现原告以双方性格不合，夫妻感情破裂为由诉至本院，要求判令：1、原、被告离婚；2、请求婚生子女归原告抚养；3、请求依法分割夫妻共同财产。 本案在审理过程中，经本院主持调解，双方当事人自愿达成如下协议： 一、原告吴育强与被告阎小洁（英文名：YAN XIAOJIE）自愿离婚。 二、婚生女吴蕊彤、婚生子吴伟彤均由原告吴育强抚养，原告吴育强不要求被告阎小洁（英文名：YAN XIAOJIE）支付抚养费。 三、被告阎小洁（英文名：YAN XIAOJIE）自2017年7月14日起于每周周六上午九点从原告吴育强住处将吴蕊彤、吴伟彤接走，与当日下午十九点前将吴蕊彤、吴伟彤送回原告吴育强住处，原告吴育强需积极予以配合。 四、位于上海市松涛路200弄59号101（1，2）室的房产归于原告吴育强所有，被告阎小洁（英文名：YAN XIAOJIE）于2017年7月20日前协助原告吴育强办理上述房屋产权过户手续。 五、车牌号京NNG818（车辆识别代号WDDBF5CB6GJ492559）奔驰牌小客车归原告吴育强所有，被告阎小洁（英文名：YAN XIAOJIE）于2017年7月20号前协助原告吴育强办理上述车辆产权过户手续。 六、被告阎小洁（英文名：YAN XIAOJIE）自愿放弃位于香港以及澳大利亚境内的全部夫妻共同财产，均归原告吴育强所有。 七、原告吴育强于2017年7月14日前归还被告阎小洁（英文名：YAN XIAOJIE）个人护照、香港居民身份证、港澳居民来往内地通行证。 八、原告吴育强于上述第四项、第五项履行完毕之日归还被告阎小洁（英文名：YAN XIAOJIE）钻戒一枚、百搭翡翠手表一块、宝格丽手表一块、尚美戒指一枚、梵克雅宝项链一条。 九、其它双方各自名下财产归各自所有。 十、原告吴育强与被告阎小洁（英文名：YAN XIAOJIE）无需为上述各项财产分割相互支付任何折价款。 案件受理费75元，由原告吴育强负担（已交纳）。 上述协议，不违反有关法律规定，本院予以确认。 本调解书已经双方当事人签字确定，具有法律效力。 （此页无正文） 审判员 王阳 （北京市朝阳区人民法院） 二〇一七年七月十四日 本件 与 原件核对无异 书记员 戴玥” I. Whether Shunyi case will affect the Property/the scheme under the Mediation Agreement? 51. The issue of whether Shunyi case will affect the Property or not is not so clear cut. 52. The claim document bears no specific reference to the Property. That was why the plaintiff argued that the claim was only about the shares, and the outcome of it would not affect the Mediation Agreement which concerned other properties. 53. Mr Alex Zhao, PRC expert for the defendant, has not given a clear answer. He stated in his opinion:- “Ms. Yan Xiaojie has the legal right to ask the PRC courts to take into account of the newly discovered assets hidden by Mr. Ng Yuk Keung. I observe that she had in person commenced a legal action in PRC courts by a home-made Statement of Claim dated 15 th November 2017. Although she did not specify that the Mediation Agreement shall be rescinded, the PRC Courts will no doubt take the Mediation Agreement into account. In practical sense, Ms Yan Ziaojie is in substance seeking to ask for further distribution of family assets not disclosed by Mr. Ng Yuk Keung before. ” (my own emphasis) 54. Nor had the other PRC expert of the defendant, Mr 戚连峰, stated the matter clearly. In his words:- “如果《民事调解书》对已经分割的婚姻财产分割并不公平，双方离婚后另行通过诉讼对其他婚姻财产进行分割时，主张先前分割不公平的一方可以 请求法院在 分割剩余婚姻财产 时 对先前的财产分割予以考虑。如果先前的财产分割确有不公平之处，法官按照公平的原则，在分割剩余婚姻财产时可能会予以酌情考虑。” (my own emphasis) 55. A matter that points to the possibility of the Shunyi case affecting the Property is that the Shunyi case is based on Article 47 of the Marriage Law. Such was not disputed by the plaintiff. Article 47 of the Marriage Law is in the board terms, not excluding possibility of reopening the prior division when new assets are discovered:- “离婚时，一方隐藏、转移、变卖、毁损夫妻共同财产，或伪造债务企图侵占另一方财产的，分割夫妻共同财产时，对隐藏、转移、变卖、毁损夫妻共同财产或伪造债务的一方，可以少分或不分。离婚后，另一方发现有上述行为的，可以向人民法院提起诉讼， 请求再次分割夫妻共同财产 。人民法院对前款规定的妨害民事诉讼的行为，依照民事诉讼法的规定予以制裁。” (my own emphasis) According to article 31 of “最高人民法院关于适用《中华人民共和国婚姻法》若干问题的解释（法释(2001) 30号）”:- “当事人依据婚姻法第四十七条的规定向人民法院提起诉讼，请求再次分割夫妻共同财产的诉讼时效为两年，从当事人发现之次日起计算。” 56. Whilst not disagreeing that Shunyi case is based on Article 47, Ms Li Qian, the PRC legal expert for the plaintiff, disputed that the Shunyi case would impact upon the distribution under the Mediation Agreement. She stated in para 12 of her opinion that:- “ 12. 该顺义法院案与该朝阳法院案是两个相对独立的案件，即无论该顺义法院案的结果如何，均不会影响该朝阳法院案中《民事调解书》除了该等股份之外其他内容的认定。” 57. However, Ms Li has not given any analysis as to how this opinion reconciles with the wide terms under Article 47. 58. In light of the above, on the question of whether the Shunyi case could disturb the scheme of things in the Mediation Agreement and hence the provisions of it on the Property, I cannot arrive at a conclusion. I do not feel that the parties’ PRC law expert evidence is conclusive one way or the other. 59. Nor are the contemporaneous documents clear-cut. Actually, this is the root of the problem. 60. The Shunyi case complaint does pray for “请求依法 分割夫妻共同财产 ” (own emphasis). The reference to the shares followed inside a bracket. The basis of the claim referred to the fact that after the mediation in the divorce proceedings and after the making of the Mediation Agreement, the existence of shares was discovered. To me, it was quite clear that there was no exclusive language to the effect that the other assets like the Property could not be subject to or affected by this action. Rather, the reference was made for division of joint asset(s) in so many words. 61. Both parties relied on another document whereby the Shunyi Court confirmed accepting the Shunyi case for proceeding (立案). The plaintiff relied on the reference of “涉诉标的：300.00000万元” (it bears an obvious mistake that it ought to state 300万 as shares, as dollars). The defendant relied on it for “案由：离婚后财产纠纷” for division of “财产”, not just the shares. The relevant parts of the confirmation document is set out below:- “人民法院民事一审案件立案审查、审判流程管理信息表 民事一审案件立案审查情况 案号（2018）京0113民初4732号 案由：离婚后财产纠纷 收到诉状日期： 2017年12月06日 立案日期 2018年02月01日 涉诉标的： 300.00000 万元 当事人基本情况 诉讼地位 姓名或单位名称 自然人居住地、经常居住地或单位住所地 原告 阎小洁 北京市顺义区后沙峪香蜜湾 被告 吴育强 审查人意见 建议立案 审查人：叶丽芳 审查日期：2018年02月01日 审批人意见 同意立案 审批人：叶丽芳 审批日期：2018年02月01日 应收受理费：7075.00元 实收受理费：7075元 （元） ” (emphasis added) 62. It seems to me that the confirmation document is rather neutral. It remains that I cannot conclude that the Shunyi case can affect the Property, nor can I conclude that it cannot. 63. This led to my enquiry at the very beginning of the hearing as to how “ same cause of action” under Order 12 Rule 2(8A)(c) should be interpreted. Despite my direction for further submissions just specifically on this issue with authorities, no one seems to have addressed me on it still, or adequately. 64. I believe that at the heart of Order 12 Rule 2(8A)(c), the condition is whether there are same or similar issues , and identical parties. In Linfield Ltd v Taoho Design Architects Ltd [2002] 2 HKC 204 at paragraphs 14 and 16, Ma J (as he then was)) stated as follows:- “One starts with the basic principles : what should serve the ends of justice between the parties to the litigation and as far as the administration of justice is concern?” “Even if there are multiple sets of proceedings involving similar or even the same issues, if there is no identity of parties, I fail to see how it is desirable or even possible for one or more of such proceedings involving different parties to be stayed pending the resolution of any other set or sets of proceedings. The determination of any issues in proceedings between different parties would not be binding on any other parties in another set of proceedings.” 65. The threshold is issue focused, on condition that there is identity of parties. It is not quite like what Mr Siu argued as necessarily subject matter based (ie his second limb of the argument referred to in paragraph 10 above). So putting aside whether the Shunyi case affects the Property, the issue is no doubt concerning matrimonial assets division. I really cannot see why one has to interpret “ same cause of action ” in the narrow sense restricting it to same subject matter ie the Property only. The ultimate concern is to avoid inconsistent rulings by different courts. Inconsistent rulings on issues ought to be undesirable and ought to be avoided. 66. I consider that the issues common to this action and the Shunyi case is the matrimonial asset division between the same parties. If this action is not stayed, it is conceivable that the defendant would raise issue, going forward, like the distribution under the Mediation Agreement should be varied by reason of the newly discovered shares. Such issues are common with what had surfaced in the Shunyi case already. 67. Furthermore, I now assume, for the sake of analysis, that the Shunyi Court is only capable of dividing up the newly discovered shares without varying other arrangement in the Mediation Agreement. It is still not impossible that the Shunyi Court’s decision will touch upon matters under the Mediation Agreement which can found other actions. All these are just different facets of the one single issue of matrimonial asset division. There must be a level of interplay still live and ongoing between the PRC marriage law jurisdiction and the Hong Kong jurisdiction over the Property. I really cannot proceed now as if the entitlement of the Property under the PRC marriage law jurisdiction has already been set in stone. 68. Accordingly, I consider that common issues exist, and they are still live. The PRC court has the jurisdiction over matrimonial assets division of the parties, and Hong Kong should wait for the settling of the question of entitlement first. The plaintiff’s second limb of the plaintiff’s argument that the subject matters are different (shares v Property as referred to in paragraph 10 above) is unsuccessful. J. Hong Kong action - doubtful foundation 69. The plaintiff’s claim in this action is fraught with problems. As I concluded that the Mediation Agreement is a PRC court order/judgment, the proper course for enforcing the foreign judgment in Hong Kong is to proceed for recognition and enforcement of foreign judgment, whether under common law rules or otherwise. This entails showing of, inter alia, finality and conclusiveness of the Judgment or Order. However, the plaintiff chose to characterise the Mediation Agreement as a simple contract or agreement. This view of the instrument is problematic, and it taints the validity of the claim in this action. I cannot see why I should prefer an action with such a wrong or dubious start to continue at a risk of inconsistent rulings on similar, if not common, issues. However much I cannot ascertain the likelihood of such risk realising, I still cannot exclude or rule that out, as mentioned above. 70. Section 48(5) of the District Court Ordinance also empowers the Court to order a stay. The subsection reads:- “The Court may stay any proceedings before it, where it thinks fit to do so, either of its own motion or on the application of any person, whether or not a party to the proceedings.” 71. The terms of the stay is until conclusion of the Shunyi case. If the Shunyi case later does not turn out to impact upon the Property, the plaintiff can continue with this action. K. Other arguments of the plaintiff 72. Mr Siu actually also argued on many other points. I will deal with them one by one. 73. Mr Siu argued that I could not stay the action until the determination of the Shunyi case, because that was not being asked for. Such is called a case management stay but the defendant was asking for a forum stay. I really do not find this argument convincing. I think that among other things, Section 48(5) of the District Court Ordinance, which was also not drawn to my attention at all by the parties, answers this argument. This Court’s power to stay is not limited to a particular kind of stay nor to only a set of terms as asked. 74. Mr Siu also argued on prejudice. The plaintiff has filed a jurisdictional challenge in the Shunyi case. He argues that the progress of the Shunyi case is unknown, and that so far it has little progress. He argues that it is unjust to have to keep the plaintiff wait for the Shunyi case, where this action could to be straightforward and could be dealt with speedily. I feel that this argument is unattractive. The plaintiff challenged the jurisdiction of Shunyi case and he should not be heard to complain that it has little progress. 75. There was no indication or allegation that the defendant was jeopardizing the Property by encumbrancing her joint interest. On the other hand, as I understand from the plaintiff’s solicitor at the direction hearing, it was the plaintiff’s own choice not to register the Writ of this action against the title of the Property. 76. Mr Siu relied on two cases where stay was refused: Hyundai Engineering & Construction Co. Ltd v UBAF (Hong Kong) Ltd. [2012] 5 HKLRD 620, dated 24 October 2012 and Gorthy Anil Kumar v Pacific Alliance Investment Management (HK) Limited & Anor , HCA 3040 of 2016, dated 21 July 2017. However, these cases were disputes arising squarely out of contracts which contained an exclusive jurisdiction clause favouring Hong Kong courts. The application of exclusive jurisdiction clauses is singularly important, and Mr Siu has not argued how in this case where the Mediation Agreement (even assuming it is an agreement) should attract the same treatment when there is no exclusive jurisdiction clause favouring Hong Kong. 77. Mr Siu complained that the defendant has failed to state a bona fide defence, and this was fatal to her case. He has not referred me to the source of the requirement. Anyway, it seems that this argument cannot be sound particularly where the filing of a defence will amount to submission to jurisdiction. 78. Although I am not relying on any further submissions after the hearing on the matters other than as I had directed, I deal with two further arguments of Mr Siu as stated in his further submissions dated 9 May 2018 herein below as well. 79. Mr Siu argued that as the legal opinion on characterisation of the Mediation Agreement was only introduced in the defendant’s affirmation in reply, the plaintiff had no chance to adduce evidence to address it. However, I feel that the issue of characterisation has been at the forefront of the parties’ minds. It is quite an obvious matter. As mentioned above, Ms Li Qian, for the plaintiff, had addressed this issue in the two paragraphs of her opinion adduced in the opposition affirmation already. That she chose not to be crystal clear is another matter (see paragraph 48 above). 80. The plaintiff has at no time before or at the hearing asked for adjournment for filing more evidence. 81. As mentioned above, the plaintiff instead argues the contrary – that there is no need of such evidence. Hence, I believe that the argument of “no chance” does not seem to have a chance of success. 82. Mr Wong argued that the plaintiff’s action ought to be stayed for its failure to comply with the common law requirement for recognition and enforcement of foreign judgment. He asked the Court to stay the action on the basis like in Chiyu Bank Corpoartion Limited v Chan Tin Kwun [1996] 2 HKLR 395, and Wuhan Zhong Shuo Hong Real Estate Cio Ltd v Kwong Sang Hong International Ltd [2000] HKLRD (Yrbk) 151. I understand Mr Siu as arguing, in response, that if the action here is to be treated as judgment enforcement action like Mr Wong has urged, then, this court is not empowered to stay because stay is not within the court’s enforcement jurisdiction. Mr Siu seemed to suggest that stay is only within the court’s determinative jurisdiction and if I accept Mr Wong’s argument, I cannot order stay. 83. In this connection, I make clear here that I am not actually relying on Mr Wong’s argument in the first place, because it is for the plaintiff to say how he is proceeding in this action. The plaintiff’s counsel said definitely that the plaintiff was proceeding with contract enforcement in this action. The Statement of Claim is also clearly treating the Mediation Agreement as an agreement. It is not logical for the court or the other side to force it upon the plaintiff that he was pursuing judgment enforcement action and then ‘dismissed’ it by a stay for its not being up to the requirement for judgment enforcement. It seems that one cannot square (the other’s) circle. Thus, I think that I do not need to deal with Mr Siu’s further arguments, which are in reply to Mr Wong’s argument, regarding determinative as opposed to enforcement jurisdiction. L. Orders 84. I make the following orders:- (a) Leave be granted for the defendant to file her stay application dated 21 March 2018 out of time; (b) This action be stayed until the conclusion of the Shunyi case namely北京市顺义区人民法院案号（2018）京0113民初4732号; and (c) Liberty to apply. M. Costs 85. On costs, I make the following orders:- (a) Costs of the defendant’s Summons for stay dated 21 March 2018 should be apportioned with 20% attributable to the time extension application and 80% to the substantive stay application; (b) There be no order as to costs of the defendant’s time application; and (c) The defendant has the costs of the substantive stay application, to be taxed if not agreed, with certificate for counsel. 86. I thank Mr Siu and Mr Wong for their assistance to the Court. (Kate Li) Deputy District Judge Mr Patrick Siu, instructed by Hui & Lam, for the plaintiff Mr Paul Wong, instructed by Hon & Co, for the defendant [1] The defendant’s Summons cited only Order 12 Rule 8(2) without mentioning also specifically Rule 8(2A)(c) but the plaintiff has not taken any issue over that. [2] The plaintiff has earlier argued that an appeal against the Mediation Agreement has a 6 month limitation period only and so the defendant’s claim was barred. However it seems that the plaintiff has not pursued this argument further. At the hearing, there was no more dispute that the Shunyi case was based on Article 47 of the Marriage Law which has a 2 year limitation period, not an appeal, and the Shunyi case was commenced within time. [3] The legal notice for enactment of which seemed to be LN 152 of 2008 ie issued in 2008 [4] Section 48(1)(a) of the District Court Ordinance [5] At §§61-68. Look up this case on Lawcite Noteup",
  "length": 43340,
  "headers_seen": [
    "A. Introduction",
    "B. Background",
    "C. Summary of key arguments",
    "D. Stay ordered pending conclusion of Shunyi case; dubious foundation of Hong Kong action",
    "E. Application for extension of time for making of stay application under Order 12 Rule 8",
    "F. Co-existence of inherent jurisdiction for forum stay",
    "G. Broad and unrestricted approach to Order 3 Rule5 discretion, endorsed recently in Astro Nusantara v PT Ayunda",
    "H. Whether there is a parallel PRC proceeding for the “same cause”?"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkdc/2018/534",
  "query": "enforcement of award",
  "ts": "2025-10-17T10:42:02",
  "ok": true
}