{
  "title": "MAGNUS LEONARD ROTH V. VITALY PETROVICH ORLOV | [2021] HKCA 639 | HKLII",
  "court": null,
  "year": 2021,
  "date": "2025-10-01",
  "content": "HKLII Databases Court of Appeal [2021] HKCA 639 MAGNUS LEONARD ROTH V. VITALY PETROVICH ORLOV Judgment Information Date 3 May, 2021 Action No. CAMP44/2020 Neutral Cit. [2021] HKCA 639 Download MS Word Judgment Reading Options Translation Toggle Highlight Appeal History CAMP44/2020 CAMP44/2020 MAGNUS LEONARD ROTH v. VITALY PETROVICH ORLOV CAMP 44/2020 [2021] HKCA 639 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF APPEAL MISCELLANEOUS PROCEEDINGS NO 44 OF 2020 (ON AN INTENDED APPEAL FROM HCA NO 1093 OF 2017) ________________________ MAGNUS LEONARD ROTH Plaintiff and VITALY PETROVICH ORLOV Defendant ________________________ Before: Hon Lam VP and Au JA in Court Date of Hearing: 24 November 2020 Dates of Supplemental Written Submissions: 8 and 22 December 2020 Date of Decision: 4 May 2021 ________________________ D E C I S I O N ________________________ Hon Au JA (giving the Decision of the Court): A. INTRODUCTION 1. This is the defendant’s renewed application for leave to appeal against the judgment of Anthony Chan J (“the Judge”) dated 26 March 2020 (“the Judgment”). 2. In the Judgment, the Judge dismissed the defendant’s summons to stay the present action in favour of arbitration pursuant to an arbitration clause contained in a framework agreement dated 28 April 2016 between the plaintiff and the defendant (“Framework Agreement”) and to set aside the leave granted to the plaintiff to serve the proceedings against the defendant out of jurisdiction. 3. The Judge later also refused the defendant’s application for leave to appeal the Judgment, and hence the present renewed application before this court. 4. At the hearing of this renewed leave application, we directed the parties’ attention to section 20 (9) of the Arbitration Ordinance ( Cap 609 ) (“the AO”). We raised the observation as to whether, on a proper construction, the effect of this provision was that the Judge’s refusal of leave was final, in the sense that the defendant was precluded from renewing his leave application before this Court. If that is the correct analysis, it would mean that the defendant’s application herein fails in limine . We asked the parties to lodge further written submissions on this issue and proceeded to hear submissions at the hearing concerning the merits of the application. 5. Since the hearing, we have received the parties’ written submissions on the effect of section 20(9) of the AO. The plaintiff, represented by Mr Christopher Chain and Mr Brian Fan, took a neutral stance, whereas the defendant, represented by Mr William Wong SC leading Mr Justin Lam and Ms Euchine Ng, mounted a constitutional challenge against the relevant statutory provisions. Given the stance taken by the plaintiff, and given the wider impact of a determination on this issue, we are not prepared to resolve it at this instance in the absence of full arguments. 6. Accordingly, for present purposes, we would assume in the defendant’s favour that he could renew the leave application before this court, and proceed to consider the substantive merits of his intended appeal. B. BRIEF BACKGROUND 7. The facts leading to the present claim by the plaintiff has been set out by the Judge at [4] - [17] of the Judgment. We will not repeat them herein. We would adopt them herein and only highlight the following for the present purpose. 8. In short, the plaintiff and the defendant were both sophisticated businessmen jointly engaged in a very successful fishery business run under what has been called the Norebo Group. 9. In November 2015, the defendant agreed to purchase all the plaintiff’s shares in the Norebo Group, with the sale and purchase to be completed by the end of February 2016 (“Initial Agreement”). However, it is said that the defendant delayed in completing the transaction. It is further said that in mid-April 2016, the parties orally agreed that the defendant should compensate the plaintiff for such delay at a sum of US$2 million (“Oral Agreement”). In this respect, it is common ground that, the sale and purchase of the Norebo Group shares was eventually completed by the signing of the Framework Agreement on 28 April 2016. Then, two days later, on 30 April 2016, the parties entered into a loan agreement with the defendant as borrower and the plaintiff as lender at a sum of US$2 million to be paid by 30 April 2017 (“Loan Agreement”). It is the plaintiff’s case that the Loan Agreement was to evidence and embody the Oral Agreement regarding the agreed compensation. On 9 May 2017, the plaintiff commenced the present action claiming against the defendant for US$2 million for his breach of the Oral Agreement as evidenced by the Loan Agreement, and for rectification of the Loan Agreement to that effect. 10. The defendant took out a summons to stay this action in favour of arbitration pursuant to section 20 of the AO. He further asked for setting aside the ex parte service out order granted to the plaintiff. C. THE JUDGMENT 11. In support of the applications, the defendant relied on clause 28.2 (“the arbitration clause”) [1] and clause 19.1 (“the entire agreement clause”) [2] of the Framework Agreement which were respectively quoted at [18] - [19] of the Judgment. 12. The principal issue before the Judge was whether the plaintiff’s claim under the Loan Agreement fell within the arbitration clause in the Framework Agreement and, if so, whether the order for service out of jurisdiction should be automatically set aside. The defendant alternatively also said the service out order should be set aside in any event. 13. In relation to the stay application, there is no dispute that the burden is on the defendant to show a prima facie or plainly arguable case that the arbitration clause covers the present claim. 14. The Judge found that the defendant failed to establish such a prima facie or plainly arguable case. He first ruled out the applicability of the entire agreement clause as the Loan Agreement was made after the Framework Agreement ([28] - [29] of the Judgment). As to the arbitration clause, the gist of the Judge’s reasons is that two strong factors of the factual matrix and context in the present action, namely, the different choice of law with no arbitration clause in the Loan Agreement and the date of the Loan Agreement, which was after the completion of the Framework Agreement, showed that the Loan Agreement was a free-standing and separate agreement, which was not intended to be covered by the arbitration clause ([30] - [35] of the Judgment). The Judge also found that the principle [3] derived from Fiona Trust v Holding Corp v Privalov [2007] UKHL 40 did not assist the defendant’s case ([36] - [41] of the Judgment). He therefore dismissed the defendant’s stay application and his setting aside application insofar as it relied on a successful stay application. See [43] of the Judgment. 15. Alternatively, he also dismissed the defendant’s setting aside application on the basis that Hong Kong was the proper and more appropriate forum for litigating the dispute under the plaintiff’s claim given the choice of law clause in the Loan Agreement and the parties’ use of Hong Kong corporate vehicles to operate the non-Russian fishing business. See [17] and [44] - [45] of the Judgment. D. THE INTENDED APPEAL D1. Grounds of appeal 16. In the draft Notice of Appeal, the defendant advanced two broad grounds to challenge the Judgment: (1) For the stay application, it is said that the Judge erred in law and in principle in failing to take into account relevant considerations, in taking into account irrelevant considerations and/or was plainly wrong in concluding that there is not even a prima facie case that the disputes in this action are within the ambit of the arbitration clause. More specifically, it is said that: (a) The Judge failed to take into account the fact that, on the plaintiff’s own case, the subject matter of the Loan Agreement was related to the transaction under the Framework Agreement (Ground 1(a)). (b) The Judge erred in relying on the existence of the Oral Agreement as “undisputed” (Ground 1(b)). (c) The Judge wrongly failed to take into account or had wrongly taken into account 11 factors listed by the defendant. It is not necessary for us to list them all here save to note that the defendant has sought to attack effectively all the matters that the Judge had taken into account in the Judgment (Ground 1(c) - (i), and (k)). (d) The Judge erred in concluding that the approach in Fiona trust was inapplicable (Ground 1(j)). (2) For the setting aside application, the defendant firstly argues that the stay application ought to have been granted and the setting aside application should automatically be granted as a result (Ground 2). Further and alternatively, the defendant says the Judge erred in law, took into account irrelevant considerations and/or was plainly wrong in concluding that the setting aside application should be dismissed independently (Ground 3). D2. Discussion 17. Under section 14AA of the High Court Ordinance ( Cap 4 ), leave to appeal shall only be granted if the court is satisfied that (a) the intended appeal has reasonable prospect of success or that (b) there is some other reason in the interests of justice why the appeal should be heard. Reasonable prospect involves the notion that the prospect of success must be “reasonable” and therefore more than “fanciful” without having to be probable: SMSE v KL [2009] 4 HKLRD 125 at [17]. 18. In our view, the appeal has no reasonable prospect of success for the following reasons. 19. It is trite that the court should take into account all relevant context and factual matrix in construing contractual provisions. In our view, as pointed out by the Judge, the following matters (which had been taken into account by the Judge) strongly point to the conclusion that disputes arising under the Loan Agreement are not covered by the arbitration clause: (1) First, it is important to note that the defendant for the purpose of this application has not even disputed in the evidence that the Loan Agreement is related to an agreement to compensate the plaintiff for the defendant’s delay in entering into a formal agreement for the sale and purchase of the plaintiff’s shares in the Norebo Group as claimed by the plaintiff. In the premises, such an agreement or at least the negotiation for compensation formed part of the context when the parties entered into the Framework Agreement containing the arbitration clause. Despite this, the parties did not deal with the question of compensation in the Framework Agreement and instead still decided to (and did) enter into and sign the Loan Agreement two days after the Framework Agreement, which contained a different choice of law clause and did not contain an arbitration clause. Such context and factual matrix strongly support an objective construction (a) that the parties did not intend the arbitration clause to cover the dispute in relation to the question of compensation for the earlier failure to enter into a formal agreement, or (b) that the parties when entering into the Loan Agreement did not intend it to be subject to arbitration. (2) Second, the parties entered into and signed the Loan Agreement only two days after the Framework Agreement and expressly incorporated therein a Hong Kong choice of law clause which is different from that in the Framework Agreement. It is pertinent to note that the parties, after choosing a different choice of law clause for the Loan Agreement, also did not further incorporate into it an arbitration clause as they did for the Framework Agreement. These clearly support the objective construction that when entering into the Loan Agreement, the parties did not intend to have any disputes relating to the Loan Agreement to be resolved by way of arbitration. (3) Third, as rightly observed by the Judge at [35] of the Judgment, objectively viewed, the subject matter of the Loan Agreement, that is the compensation for the defendant’s failure to complete the purchase of the plaintiff’s interest in the Norebo Group earlier, can be properly regarded as a past event and thus a free-standing matter to the Framework Agreement. This is consistent with the treatment of the subject matter under a separate agreement made after the Framework Agreement. This, coupled with the above context, again supports a construction that the parties did not intend to have any disputes in relation to the Loan Agreement to be resolved by arbitration. (4) Finally, and importantly, notwithstanding all the above objective context and factual matrix, there is nothing in the evidence to explain why, notwithstanding the Framework Agreement and the arbitration clause, the defendant would still have entered into the Loan Agreement (which the defendant in his own case says is related to the Framework Agreement) with a different choice of law clause just two days thereafter. 20. In our view, based only on the above-mentioned context and factual matrix, it points to a clear objective construction that the arbitration clause was not intended by the parties to cover disputes in relation to the Loan Agreement. 21. In the premises, the Judge is clearly correct in concluding that the defendant failed to show a prima facie case or a plainly arguable case that the arbitration clause covers the disputes in relation to the Loan Agreement. In this respect, it must be remembered that the burden rests on the defendant. 22. During the hearing, Mr Wong SC sought to invoke the presumption in Fiona Trust that, in general, parties to an arbitration agreement, as rational businessmen, are likely to have intended for the same tribunal to resolve any dispute arising out of the relationship into which they have entered (or purported to enter): [13] of Lord Hoffmann’s judgment. 23. He also submitted that the presumption applies not just when there are multiple disputes under a single agreement (as in Fiona Trust ), but also when there are multiple related agreements between the parties: see C v D1, D2, D3 [2015] EWHC 2126 (Comm), [99] (citing Deutsche Bank AG v Sebastian Holdings (No 2) [2011] 2 All ER 245 (Comm), [41] (Thomas LJ)) and [104(c)] (Carr DBE J). 24. Be that as it may, the Fiona Trust presumption is what it says on the tin: a presumption. It does not assist the defendant in circumstances where we consider the parties clearly intended that disputes arising under the Loan Agreement were not to be caught by the arbitration clause in the Framework Agreement. In short, the parties intended to regulate the compensation for delay by the Loan Agreement as a separate and distinct subject matter from the sale and purchase of the shares governed by the Framework Agreement. This is ultimately a matter of contractual construction, as Mr Wong SC fairly accepted during the hearing. 25. Mr Wong SC also laid much emphasis on the fact that the plaintiff’s pleaded case is based primarily on the Oral Agreement. On his analysis, the Judge approached the matter from the wrong angle: instead of focusing on the question whether the Loan Agreement fell within the scope of the arbitration clause, the Judge should have considered whether the Oral Agreement was arguably caught by the entire agreement clause and therefore arguably fell within the scope of the arbitration clause. 26. With respect, there is nothing in this argument. The defendant does not dispute the subject matter of the Oral Agreement and the Loan Agreement. They are both concerned with the compensation payable by the defendant to the plaintiff for the defendant’s delay in completing the sale and purchase of the plaintiff’s shares in the Norebo Group. If, on the proper construction of the arbitration clause, the parties do not intend for the Loan Agreement to be covered by it, it must follow that they do not intend for the Oral Agreement to be covered by it either. Accordingly, the Judge’s focus on the Loan Agreement could not be faulted. 27. Furthermore, reliance on the entire agreement clause does not assist the defendant. As pointed out by Mr Chain, the entire agreement clause by its express wording only covers all previous agreements “ relating to the subject matter of the Transaction Documents [including the Framework Agreement] ”. So far as the necessary connection to the Framework Agreement is concerned, we accept Mr Chain’s submission that the entire agreement clause sets the same criterion as the arbitration clause. Thus, if the arbitration clause does not apply to the subject matter of the Loan Agreement (and, by extension, the Oral Agreement), it also follows that the entire agreement clause has no application to the present context. 28. We should also mention some of the semantic criticisms launched by Mr Wong SC. He criticised the Judge’s description of the Loan Agreement as a “ free-standing ” document ([40] of the Judgment), and also his reference to the requirement of a “ close ” connection between the Loan Agreement and the Framework Agreement ([39] - [40] of the Judgment). 29. With respect, we do not see how these criticisms could cast doubt on the correctness of the Judge’s overall approach to the contractual interpretation exercise: (1) The reference to the Loan Agreement being a “ free-standing ” document is simply a way of expressing the view that the parties did not intend for the arbitration clause under the Framework Agreement to cover disputes arising under the Loan Agreement. (2) As to the “ close connection ” requirement, as pointed out by Mr Chain, it was merely a reference to Jacobs J’s judgment in Etihad Airways v Lucas Flother [2019] EWHC 3017 (Comm) (at [69]), a case cited by the defendant himself to support his case in the proceedings below. It cannot now become a ground of appeal for the defendant. 30. In light of our above view, the defendant’s intended grounds of appeal are therefore unarguable: (1) Under Ground 1(a), it was obvious that the Judge did take into account the fact that the subject matter of the Oral Agreement and the Loan Agreement could be generally regarded as matter relating to the Framework Agreement. See [26] of the Judgment. However, after taking into account other relevant matters as a whole, the Judge was entitled to conclude that on the proper construction, the arbitration clause did not cover the dispute arising under the Loan Agreement. The complaint under this ground that he failed to take this factor into account is therefore entirely without basis. (2) Ground 1(b) is similarly without merit. It is plain that the defendant did not in his evidence deny the existence of the Oral Agreement or otherwise. The mere reference to it as an “Alleged Oral Agreement” in the solicitor’s affidavit is neither here nor there, when he could have (but did not do so) through his solicitor’s affidavit unequivocally and expressly denied its existence. In light of the defendant’s said position adopted in his evidence, the complaint that the Judge has wrongly described the existence of Oral Agreement as “undisputed” is not only unfair but more of an afterthought. In any event, given our above analysis of the relevant context and factual matrix based on the signed Loan Agreement, which is a similar analysis to that adopted by the Judge, the complaint that the Judge had wrongly relied on the existence of Oral Agreement as “undisputed” does not assist the defendant’s intended appeal. (3) The complaints under Grounds 1(c) - (i) and (k) that the Judge had erred in his analysis in taking into account all those listed matters (which effectively refer to every single matter the Judge had referred to and taken into account for the purpose of construction) are unhelpful and equally unmeritorious. These purported grounds of appeal amount to no more than disagreeing with the conclusion of the analysis without identifying with sufficient particularities as to why those factors are not relevant to the construction exercise. Quite to the contrary, given our above analysis, we are of the clear view that the Judge was plainly and properly entitled to take those matters into account as the relevant context and factual matrix for the purpose of construction. (4) Ground 1(j) also does not assist the defendant’s intended appeal. In light of our above analysis on the proper construction of the arbitration clause and the Loan Agreement, which is specific to the evidential circumstances of this case, the Fiona Trust approach is irrelevant and would not take the matter any further. (5) Ground 2 is also bound to fail as there is no merit under the stay application. (6) Ground 3 is effectively against the Judge’s exercise of discretion in finding that Hong Kong is clearly and distinctly the more appropriate forum for the plaintiff’s claim after taking into account the choice of law clause in the Loan Agreement and the involvement of the Hong Kong corporate vehicles. These are clearly relevant factors that the Judge could take into account in deciding that question. The weight that the Judge had attributed to these factors in the balancing exercise is a matter for him, and we do not find it to be plainly wrong. Quite to the contrary, we agree with his conclusion. The defendant’s complaint under this ground is in gist simply a disagreement as to the conclusion reached after weighing those factors, which in our view has no merits. 31. For these reasons, the defendant’s intended appeal has no arguable merits and leave to appeal should be refused. There is no reason why costs should not follow the event. We order on a nisi basis that the defendant do pay the plaintiff’s costs of this application, to be taxed if not agreed. (Johnson Lam) (Thomas Au) Vice President Justice of Appeal Mr William Wong SC, Mr Justin Lam and Ms Euchine Ng, instructed by Boase, Cohen & Collins, for the defendant Mr Christopher Chain and Mr Brian Fan, instructed by Howse Williams, for the plaintiff [1] The arbitration clause provides relevantly: “[a]ny dispute arising out of or in connection with [the Framework Agreement], including any question regarding its existence, validity or termination, shall be referred to and finally resolved by arbitration under the LCIA Rules … The seat … of arbitration shall be London …”. [2] The entire agreement clause provides relevantly: “[the Framework Agreement] (together with the other Transaction Documents) constitutes the entire agreement and understanding between the Parties in respect of the subject matter of [the Framework Agreement] … [The Framework Agreement] supersedes any and all previous agreements or understandings (whether oral or written) relating to the subject matter of the Transaction Documents, which shall cease to have any further force or effect”. [3] “in construing an arbitration clause, the court should start from the assumption that the parties, as rational businessmen, are likely to have intended any dispute arising out of the relationship into which they have entered or purported to enter to be decided by the same tribunal.” Look up this case on Lawcite Noteup",
  "length": 23128,
  "headers_seen": [
    "A. INTRODUCTION",
    "B. BRIEF BACKGROUND",
    "C. THE JUDGMENT",
    "D. THE INTENDED APPEAL",
    "D1. Grounds of appeal",
    "D2. Discussion"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkca/2021/639",
  "query": "seat of arbitration",
  "ts": "2025-10-16T10:49:43",
  "ok": true
}