{
  "title": "T V. TS | [2014] HKCFI 1426 | HKLII",
  "court": null,
  "year": 2014,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2014] HKCFI 1426 T V. TS Judgment Information Date 27 Jul, 2014 Action No. HCA2315/2012 Neutral Cit. [2014] HKCFI 1426 Parallel Cit. [2014] 4 HKLRD 772 [2014] 6 HKC 247 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCA2315/2012 HCA2315/2012 T v. TS HCA 2315/2012 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE ACTION NO 2315 OF 2012 ____________ BETWEEN T Plaintiff and TS Defendant AND HCA 2316/2012 ACTION NO 2316 OF 2012 ____________ BETWEEN T Plaintiff and B Defendant ____________ AND HCA 2341/2012 ACTION NO 2341 OF 2012 ____________ BETWEEN T Plaintiff and J Defendant ____________ (Heard Together) Before: Hon Mimmie Chan J in Chambers Date of Hearing: 23 June 2014 Date of Reasons for Decision: 28 July 2014 ________________________ REASONS FOR DECISION ________________________ Introduction 1. On 13 and 18 December 2012, the plaintiff T (“ T ”) issued these proceedings against the defendants TS (“ TS ”), B (“ B ”) and J (“ J ”), seeking refund of deposits of US$3,854,100 and US$2 million respectively against TS and B (“ Deposits ”), and payment of a sum of US$400,000 from J pursuant to a Guarantee he signed on 10 November 2005 (“ Guarantee ”). The Deposits were paid by T under agreements made between T and TS on the first part, and between T and B on the other part, on 10 November 2005 (“ Contracts ”). J’s Guarantee was to secure B’s performance of its obligations under its agreement with T. On 13 November 2013, the defendants applied for these proceedings to be stayed for arbitration, pursuant to the arbitration clauses in the Contracts and the Guarantee. After hearing the parties on 23 June 2014, I granted the stay as sought. The following are the reasons for my decision. Background 2. The agreement between T and TS (“ Fabcon Agreement ”) was for T’s engagement of TS to build a clean room of a semiconductor manufacturing plant in Russia. The arbitration clause in the Fabcon Agreement provides as follows: “41.1 Any and all Disputes arising in connection with this Contract shall be settled in accordance with the provisions of this Clause 40 (sic). 41.2 Unless settled amicably, any Dispute shall be finally settled by arbitration in accordance with the rules of International Chamber of Commerce. There shall be 3 arbitrators appointed in accordance with such Act with the 3 rd arbitrator to be mutually agreed, however, if the Parties cannot agree, then the 3 rd arbitrator shall be appointed pursuant to the Rules. The arbitration shall be conducted in the English language and the place of arbitration shall be Hong Kong.” 3. “Dispute” is defined in the Fabcon Agreement to mean “any dispute, difference or claim arising out of or connected with (the Fabcon Agreement) or the Work”. 4. The agreement between T and B (“ IP Agreement ”) was for B’s transfer to T of technology and training for operating the clean room to be established by TS. The Guarantee was to secure B’s performance under the IP Agreement. Both the IT Agreement and the Guarantee contained similarly worded arbitration clauses, for “any dispute between the parties with respect to the rights and obligations set out in the (IT Agreement/the Guarantee) to be referred to arbitration in Hong Kong in accordance with the arbitration rules of the International Chamber of Commerce (“ ICC ”))”. 5. T had paid the Deposits to TS and B under and pursuant to the Contracts. Disputes arose, with T alleging breach of the Fabcon Agreement and the IP Agreement. As a result, the Contracts were terminated by T. 6. In accordance with the arbitration clauses contained in the Contracts and the Guarantee, on 4 February 2008, T commenced an arbitration (“ ICC Case 15438 ”) against TS, B and J, seeking relief which includes the refund of the Deposits paid to TS and B under the Contracts and the claim for J’s payment of sums due under the Guarantee (“ Dispute ”). The tribunal in ICC Case 15438 (“ Tribunal ”) issued a Partial Award on 20 January 2010 on liability, by which it dismissed T’s claims and allowed the counterclaims made by TS and B in respect of T’s breach of the Contracts. The Tribunal found that the Contracts had been wrongfully terminated by T; that J was not liable under the Guarantee as there was no breach by B of the IP Agreement; and that TS, B and J were entitled to damages in respect of T’s breach of contract. On 10 October 2001, the Tribunal issued a Final Award (“ Award ”), whereby damages were awarded to TS and B, and T was ordered to pay the costs and expenses of the arbitration. The Tribunal also dismissed TS’s counterclaim for the price of the goods under the Fabcon Agreement. 7. On 2 December 2011, T applied to the court to set aside the Award. Such application was dismissed by the court on 17 October 2013. 8. On 18 December 2012, T commenced another arbitration (“ ICC Case 19156 ”) against TS, B and J. According to the Terms of Reference, T seeks from the tribunal in ICC Case 19156 (“ 2 nd Tribunal ”) determination of a preliminary issue that as the Tribunal had in the Award omitted to deal with T’s claim for the refund of the Deposits, the arbitration clauses in the relevant agreements have been performed and are “null and void, inoperative or incapable of being performed” under Article 8 (1) of the Model Law, incorporated under section 20 of the Arbitration Ordinance , Cap 609 (“ Ordinance ”). 9. T’s claims in ICC Case 19156 are disputed by TS, B and J. The issues for determination by the 2 nd Tribunal in ICC Case 19156 include whether T’s claims against TS and B for refund of the Deposits paid under the Contract had been referred to and dismissed by the Tribunal in ICC Case 15438, and if so, whether the 2 nd Tribunal had jurisdiction over these claims in ICC case 19156. 10. In resisting TS’s application for stay of these proceedings before the court, T did not seek to argue that there was no agreement to arbitrate. T’s argument instead is that the agreement contained in the relevant arbitration clauses of the Contracts and the Guarantee (“ Arbitration Clauses ”) are “inoperative”, in that the parties’ agreement to refer the Dispute to arbitration had been discharged by performance. T had already referred the Dispute over its claims against TS, B and J to the Tribunal in ICC Case 15438. The Tribunal failed or omitted to deal with the refund of the Deposits in the Award. T claims that the parties had not made a request to the Tribunal, either for an additional award under Article 33 (3) of the Model Law in respect of the omission, or for correction or interpretation of the Award under the ICC Rules 1998 which apply to ICC Case 15438, and that T is entitled to claim the Deposits from TS and B, and for enforcement of J’s liability therefor under the Guarantee, by institution of these proceedings. Whether the arbitration agreement is inoperative 11. Mr Cooney SC for T accepts that there are no authorities for his proposition that the arbitration agreement contained in the Arbitration Clauses has become inoperative by virtue of performance. He argued that the proposition rests on general contract principles. He referred to Mustill & Boyd, The Law and Practice of Commercial Arbitration in England , 2 nd Ed, p 464, which states: “The expression ‘inoperative’ has no accepted meaning in English law, but it would seem apt to describe an agreement which, although not void ab initio, has for some reason ceased to have effect for the future. Three situations can be envisaged in which an arbitration agreement might be said to be ‘inoperative’. First, where the English Court has ordered that the arbitration agreement shall cease to have effect, or a foreign court has made a similar order which the English Court will recognize. Second, as is discussed in Chapter 32 , there may be circumstances in which an arbitration agreement might become ‘inoperative’ by virtue of the common-law doctrines of frustration, discharge by breach, etc. Third, the agreement may have ceased to operate by reason of some further agreement between the parties …” Although none of the situations referred to in the passage apply to the present case, Mr Cooney argued that these instances are not exhaustive of when an agreement can be said to be “inoperative”. 12. Mr Cooney also referred to Halsbury’s Laws of Hong Kong Vol 7 (2), 2007 Reissue, which summarizes the established methods of discharge of a contract by performance: “115.282 Methods of discharge The way in which a contractual promise may be discharged may be classified under two basic headings: discharge in accordance with the contract and discharge ‘against’ the contract. The former covers (1) discharge by performance and (2) discharge as result of an event stipulated in the contract. The latter covers (a) discharge by rescission for such matters as breach or misrepresentation or by subsequent agreement; (b) discharge by frustration; and (c) discharge as a result of certain miscellaneous events such as merger and (in some cases) death or bankruptcy.” 13. These principles of contract cannot be, and are not, disputed. 14. “Arbitration agreement” is defined in section 19 of the Ordinance as: “An agreement by the parties to submit to arbitration all or certain disputes which have arisen or which may arise between them in respect of a defined legal relationship, whether contractual or not. An arbitration agreement may be in the form of an arbitration clause in a contract or in the form of a separate agreement.” 15. The relevant Arbitration Clause in the Fabcon Agreement is in wide terms, covering “any and all” disputes, differences or claims “arising out of or connected with the Contract”. The relevant Arbitration Clauses in the IP Agreement and the Guarantee are likewise wide, to include “any dispute” “with respect to the rights and obligations set out” in the IP Agreement and the Guarantee. 16. On the authorities of Pacific Crown Engineering Ltd v Hyundai Engineering and Construction Co Ltd [2003] 3 HKC 659 , approved and followed in the Court of Appeal in PCCW Limited v Interactive Communications Service Ltd , CACV 18 of 2006, unreported, 16 November 2006, if I am satisfied that there is a prima facie case of the existence of a valid arbitration agreement between the parties, there should be a stay of the proceedings for the arbitrators to make the detailed final determination as to the existence or otherwise of the arbitration agreement. 17. However, Mr Cooney urged me to decide that the arbitration agreement in this case is “inoperative”, as Article 8 provides that the court shall refer the parties to arbitration “unless it finds that the agreement is null and void, inoperative or incapable of being performed”. 18. In the consideration of whether the arbitration agreement contained in the Arbitration Clauses can be said to have been discharged in this case, the nature of an arbitration agreement should be borne in mind. 19. In the words of Lord Hoffman in Fili Shipping Co Ltd and Others v Premium Nafta Products Ltd and others [2007] UKHL 40 : “5. …Arbitration is consensual. It depends upon the intention of the parties as expressed in their agreement. Only the agreement can tell you what kind of disputes they intended to submit to arbitration. But the meaning which parties intended to express by the words which they used will be affected by the commercial background and the reader’s understanding of the purpose for which the agreement was made. Businessmen in particular are assumed to have entered into agreements to achieve some rational commercial purpose and an understanding of this purpose will influence the way in which one interprets their language. 6. In approaching the question of construction, it is therefore necessary to inquire into the purpose of the arbitration clause. … The parties have entered into a relationship, an agreement or what is alleged to be an agreement or what appears on its face to be an agreement, which may give rise to disputes. They want those disputes decided by a tribunal which they have chosen, commonly on the grounds of such matters as its neutrality, expertise and privacy, the availability of legal services at the seat of the arbitration and the unobtrusive efficiency of its supervisory law. Particularly in the case of international contracts, they want a quick and efficient adjudication and do not want to take the risks of delay and, in too many cases, partiality, in proceedings before a national jurisdiction. … 13. In my opinion the construction of an arbitration clause should start from the assumption that the parties, as rational businessmen, are likely to have intended any dispute arising out of the relationship into which they have entered or purported to enter to be decided by the same tribunal. The clause should be construed in accordance with this presumption unless the language makes it clear that certain questions were intended to be excluded from the arbitrator’s jurisdiction. ” (Emphasis added) 20. In Born’s International Commercial Arbitration, Vol 1 International Arbitration Agreements , 2 nd edition, paragraph 9.02 [A] at p 1319, the learned author refers to the presumption favoring centralized “one-stop” dispute resolution as a liberal rule of interpretation of the scope of an arbitration agreement, on the basis that “rational businesspersons, acting in good faith, do not desire their disputes to be resolved in multiplicitous proceedings that impose costs, delays and the risks of inconsistent results, but instead desire a single, centralized forum for resolving their disputes”. 21. It is also relevant and important to bear in mind the doctrine of separability, given effect by Article 16 (1) of the Model Law (s 34 of the Ordinance). The arbitration clause which forms part of a contract “shall be treated as an agreement independent of the other terms of the contract”, such that a decision that the contract is null and void “shall not entail ipso jure the invalidity of the arbitration clause”. 22. The Arbitration Clauses are for the reference of “any and all disputes” arising out of or connected with the Fabcon Agreement, and the reference of “any dispute with respect to the rights and obligations set out” in the IP Agreement and the Guarantee. It can be envisaged that there may be one, or more, such disputes, which may arise, and all of them would be referable to arbitration. The fact that one dispute which has arisen has been referred to arbitration, cannot mean that the relevant Arbitration Clause has been performed, or discharged, if and when a further dispute arises between the parties out of the underlying contract, or is connected with the contract, or with respect to the rights and obligations set out in the underlying contract. 23. Although the Dispute as to T’s entitlement to the refund of the Deposits and to the sum due under the Guarantee was referred to arbitration in ICC Case 15438, the parties are now clearly still in dispute as to whether the claim to, and liability in respect of, the Deposits has been decided by the Tribunal in the Award. The Dispute has not been resolved, or put in another way, a new dispute has arisen as to whether T is entitled to payment from TS and B of the Deposits, and whether J is liable therefor under the Guarantee. It may be argued by T that such new dispute arose under the Award in ICC Case 15438, but such dispute is in my view connected with the Fabcon Agreement, and is with respect to the rights and obligations of the parties set out in the Guarantee and the IP Agreement. Adopting the sensible and rational business persons approach, it cannot sensibly be said that the parties could have intended, that notwithstanding their agreement to refer the Dispute to arbitration, the further or remaining dispute over the parties’ rights and liability in respect of the same Deposits by virtue of the Award should be subjected to litigation in the courts. 24. There is support for the above in the case of Radio Publicity (Universal) Ltd v Cie Luxembourgeoise de Radiodifusion [1936] 2 ALL ER 721 at 728, where Clauson J held that until all matters in dispute under the underlying agreement had been duly settled, the arbitration agreement was still operative, notwithstanding that the relations which the underlying agreement had originally brought into being between the parties had been discontinued. 25. Even if T is right in its assertion that the Dispute was omitted from the Award and not determined in ICC Case 15438, since the Dispute is not resolved, the parties’ agreement contained in the Arbitration Clause remains operative, and the Dispute should either be referred back to the Tribunal, or be referred to a new tribunal for arbitration. Whether the current dispute should be construed as the unresolved Dispute which had been referred to the Tribunal, or as a new dispute which has arisen under, or is connected with, or with respect to the rights and obligations in the Contracts and the Guarantee, the agreement embodied in the Arbitration Clauses remains to be performed, and cannot be said to have been completely discharged, to be (on T’s argument) inoperative. 26. I reject any contention that the agreement contained in the Arbitration Clauses is “incapable of being performed”. T does not rely on any contention that the Arbitration Clause is null and void. 27. The only point in contention being whether the arbitration agreement is “inoperative”, I am satisfied as to the remaining matters which are relevant to the question of whether a stay should be granted ( Tommy Sze & Co Ltd v Li & Fung Training & Others HCCT 29/2002 unreported 28 October 2002): that the Arbitration Clauses constitute arbitration agreements, that there is now a dispute or difference between the parties as to the Deposits, and that the dispute is within the ambit of the Arbitration Clauses. 28. Accordingly, a stay of these proceedings was granted on TS’s application, with an order for costs to be paid by T on an indemnity basis. As Reyes J observed in A v R (Arbitration: Enforcement) [2009] 3 HKLRD 389 , a party who obtains an arbitration award in his favor pursuant to an arbitration agreement should be entitled to expect that the court will enforce the award as a matter of course. Abortive and unmeritorious attempts to challenge, or to frustrate enforcement of or compliance with a valid award should not be encouraged. Where a party unsuccessfully resists enforcement, or seeks to set aside an award, or as in this case, seeks unsuccessfully to reopen through court proceedings an issue dealt with in the arbitration, instead of reverting to the Tribunal or making a new submission to arbitration in accordance with an acknowledged and agreed Arbitration Clause, it should pay the incidental costs on an indemnity basis, unless special circumstances exist. The fact that it may have an arguable case would not constitute special circumstances. (Mimmie Chan) Judge of the Court of First Instance High Court Mr Nicholas Cooney SC and Mr Tony Ko, instructed by Chiu, Szeto & Cheng, for the plaintiff (under all cases) Mr Jose-Antonio Maurellet, instructed by Stephenson Harwood, for the defendant (under all cases) Look up this case on Lawcite Noteup",
  "length": 19338,
  "headers_seen": [
    "Introduction",
    "Background",
    "Whether the arbitration agreement is inoperative"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2014/1426",
  "query": "arbitration",
  "ts": "2025-10-14T11:21:08",
  "ok": true
}