{
  "title": "DX V. LN | [2015] HKFC 144 | HKLII",
  "court": null,
  "year": 2015,
  "date": null,
  "content": "HKLII Databases Family Court [2015] HKFC 144 DX V. LN Judgment Information Date 29 Nov, 2015 Action No. FCMC7870/2014 Neutral Cit. [2015] HKFC 144 Download MS Word Judgment Reading Options Translation Toggle Highlight Appeal History FCMC7870/2014 FCMC7870B/2014 DX v. LN FCMC No.7870 of 2014 IN THE DISTRICT COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION MATRIMONIAL CAUSE NO. 7870 OF 2014 ---------------------------- BETWEEN DX Petitioner and LN Respondent and LSC formerly known as KK 1 st Intervener KYMF 2 nd Intervener ---------------------------- Before : HH Judge Bruno Chan in Chambers. Date of Hearing : 29 October & 2 November 2015. Date of Submission : 4 November 2015. Date of Further Submission : 9 November 2015. Date of Judgment : 30 November 2015. --------------------------- JUDGMENT (Anti-Suit Injunction) --------------------------- 1. This is the Petitioner Wife’s application by a summons issued on 29 th October 2015 for an anti-suit injunction against the Respondent Husband’s father, i.e. the 1 st Intervener herein (“Father”) restraining him from continuing or pursuing a legal action (“PRC Action”) in Wuhan, PRC under the Wuhan Intermediate People’s Court over certain landed properties in Wuhan held in the sole name of the Husband, and for both the Father and the Husband to forthwith provide full particulars of the said PRC Action. 2. Prior to issuing that summons the Wife on that same day applied on ex-parte (on notice) to this court for the anti-suit injunction on urgent basis against the Father in relation to the said PRC Action when this court granted the injunction accordingly as an interim basis and directed that the matter be heard inter-parte 4 days later on 2 nd November 2015. 3. Both Husband and Father were essentially not opposed to the 2 nd part of the application to provide the requested information, as the Father in fact did at the hearing on 2 nd November 2015 produce some of the relevant documents, of which I should also note that the Wife obviously did not have any opportunity of going through them before the hearing, while for the Husband’s part it was just a matter of how much time he should be given to provide his documents, for which he was eventually ordered to do so within 3 days. 4. It is therefore the anti-suit injunction sought by the Wife against the Father in relation to the PRC Action that requires the court’s consideration and determination, which was admittedly commenced by the Father against the Husband earlier on 18 th September 2015 in Wuhan but after he had joined in the parties’ divorce proceedings in respect of preliminary issue over the beneficial ownership of certain landed properties including those in Wuhan, and for which he had filed his affirmation on 12 th October 2015 but never mentioned anything about the PRC Action. 5. Before proceeding to consider this issue in details, it is important to first set out some background factual information relevant to the application. Relevant Background 6. Both Husband and Wife were born and raised in Wuhan, PRC before settling in Hong Kong where they subsequently married in 2006. They have 2 sons now aged 5 and 3 whose care and control have earlier been granted to the Wife after a trial, and with whom now reside in a rented apartment in the same neighbourhood of the parties’ former matrimonial home in the Husband’s sole name in Hung Hom, Kowloon. 7. It was the Wife who petitioned for divorce on 21 st February 2014 that commenced these proceedings, with the decree nisi being granted on 23 rd September 2014 and the Wife’s ancillary relief application adjourned for FDR upon exchanging of the parties’ Form E. 8. In his Form E the Husband disclosed to be the registered owner of those properties in Wuhan as well as the said former matrimonial home in Hong Kong the total value of which he put in excess of HK$82 million, but all of which he also claimed to be holding on trust for his father, which claim however was disputed by the Wife and hence on 18 th August 2015 the Husband issued a summons seeking to join his parents in the ancillary relief proceedings for the purpose of determining the ownership of those properties under his name by way of preliminary issue as per the guidelines provided by the English case of TL v ML [2006] 1 FLR 1236 and adopted by our courts. 9. In his said summons the Husband specifically prayed for the following: “2. There be determinations as to beneficial interest, ownership, source of funds or funding and/or indebtedness in respect of the following properties and assets, and the share(s), percentage(s) (if any) as between the Interveners, the petitioner and/or the respondent; 3. The issues be tried as preliminary issues in advance of the Financial Dispute Resolution process and/or Final Ancillary Relief Trial”. 10. As noted above this summons was not opposed by the Husband’s parents who were then at the hearing on 25 th August 2015 already represented by their present solicitors, and on 12 th October 2015 pursuant to the said order the Father filed his affirmation setting out various arrangements which he said to have made with the Husband in respect of those properties and claiming to be their beneficial owner with the Husband holding them on trust for him. The summons was then adjourned to 17 th December 2015 for PTR in respect of the preliminary issue. 11. I should also note that in addition to the hearing of that summons of the Husband, the Wife also on the same day sought maintenance pending suit for herself and the 2 children as well as legal costs contribution against the Husband, and after hearing argument from their counsel I handed down a judgment on 21 st September 2015 ordering the Husband to pay the Wife HK$100,000 per month as interim maintenance for her and the children, and HK$133,333 per month for 9 months for her legal costs up to FDR hearing. The Application 12. Against this backdrop, the Wife on 29 th October 2015 brought her application now before me, first on ex-parte with notice, of which she described as urgent and that the anti-suit injunction which she sought against the Father was stated in the summons as follows: “1. … the Intervener, whether by himself, his servants, agents or otherwise in his personal capacity or in the capacity of an officer, servant or agent of the Intervener be restrained from continuing pursuing proceeding or taking any further action in or with the action in Wuhan, PRC namely … under the Wuhan Intermediate People’s Court.” 13. Her reasons and evidence in support as set out in her 12 th affirmation are as follows: “8. On or about 23 rd October 2015, by a random search on the internet, it came to my attention that there was a hearing scheduled on 13 th October 2015 in the Wuhan Intermediate People’s Court whereby the Plaintiff is (Father) i.e. the Intervener in this case, and the Defendant is (Husband) (i.e. the Respondent) regarding matters on the disputes over the contract of sale and purchase of landed properties … The action number of the case is … (“the PRC Action”) … 9. I have no knowledge about the PRC Action and I immediately instructed my solicitors to write to the Respondent’s and the Intervener’s solicitors seeking full particulars of the PRC Action. I asked them to reply to my solicitors by 3 p.m. on 26 th October 2015 failing which I shall consider taking further action in Court without further notice … 10. On 26 th October 2015, I received a letter from the Respondent’s solicitors saying that they are taking their client’s instruction and should be able to give a substantive reply by 3 p.m. the next day, that is, by 27 th October 2015 … 11. I have not received any reply from the Intervener on 26 th October 2015. 12. On 27 th October 2015, in purported compliance with their promise to give a substantive reply, the respondent’s solicitors said in their letter that the hearing on 13 th October 2015 at the Wuhan Intermediate People’s Court was about a claim initiated by the Respondent’s father claiming that various PRC landed properties under the respondent’s name in fact belong to his father. It was also confirmed that the respondent attended the said hearing. … 18. Obviously, the Respondent and the Intervener deliberately hide the PRC Action from me. On one hand, the Intervener asked to join in to the Hong Kong divorce proceedings to determine the Issues (which include the PRC properties) on 18 th August 2015 but on the other hand, there was already a hearing in Wuhan on 13 th October 2015 regarding the PRC properties of the Respondent. Neither of them have informed me about the PRC Action and/or the hearing in Wuhan. … 20. The Respondent’s landed properties in PRC forms a substantial part of the family assets. Information and documents of the PRC Action are vital for me to seek further advice and/or to take further action to preserve the family assets and to protect my interests in the ancillary relief claim against the Respondent. 21. Since there was already a hearing on 13 th October 2015, I am deeply worried that a judgment could be entered anytime in absence of my knowledge. 22. It is crucial that the Intervener should refrain from taking any further action in the PRC proceedings and that I have all information and documents relating to the PRC Action as it concerns with the landed properties in PRC registered under the respondent’s name. I remind the Court it is my case that all the PRC landed properties registered in my husband’s name belong legally and beneficially to him. They are gifts from his father to him. 23. It is of utmost important that I can preserve the matrimonial assets in PRC (i.e. assets under the Respondent’s name in PRC) and prevent them from being disposed of before the preliminary issues trial and/or ancillary trial in Hong Kong.” 14. Ms Anita Yip SC for the Wife now submits that it is clear from the Husband’s earlier summons joining his parents as the Interveners, their common case is that the Husband holds those properties on trust for the Father, as evidenced by the Father’s clearest terms in his said affirmation, but when the Wife accidentally discovered the PRC Action and asked the solicitors representing the Husband and the Father for explanation and particulars, the Father never responded while the Husband’s reply was only deliberate vague and evasive, which Ms Yip submits clearly show that father and son are now trying to take the matter in their own hands by instituting proceedings in China thereby usurping the Hong Kong court’s jurisdiction over the same PRC properties currently litigated in Hong Kong, and hence unless restrained, the Father may sprint to the finishing line before the hearing could take place in Hong Kong, and that the Wife’s claims over those PRC properties would be frustrated. 15. The Father has not filed any evidence by affirmation in this application other then producing those documents relating to the PRC Action, but according to his counsel Mr Russell Coleman SC, the following are the Father’s instructions on his said action: (1) the PRC Action relates to immovable properties situate in the PRC; (2) it was commenced by the Father against the Husband on 18 th September 2015; (3) the claim came about as a result of the Husband’s breaches of a nominee agreement, and his assertion of ownership rights over those properties, notwithstanding the Father had the evidence to prove that he was the sole financier and to show the contractual stipulations in place for the nominee arrangement; (4) the litigation is compliant with the rule of in rem jurisdiction and the contractual stipulation between the parties; (5) the Wuhan court has assumed jurisdiction over the case; (6) the Wuhan court granted a freezing order over the properties including those belonging to both the Husband and Father by order of 29 th September 2015 following an earlier hearing; (7) the trial of the case has completed on 13 th October 2015 and the basic facts have been ascertained; (8) after the trial the Wife through lawyers raised objection to the Wuhan court and requested to be joined as a third party, though no formal application has been submitted; (9) if a third party applies to be joined, the court hearing the case must conduct a hearing in accordance with the third party’s request; (10) no notification has been given as to any new hearing, or when the awaited judgment after trial might be given. 16. It is against these facts in relation with the PRC action, Mr Coleman submits, that the anti-suit injunction does not properly arise in the circumstances, as the Wife needs to show that Hong Kong is the natural forum as a pre-requisite to the court even being able to consider granting an anti-suit injunction, failing which it would be the end of her application, but even if she is able to do so, he submits that Hong Kong courts have no jurisdiction to determine disputes concerning title to or interests in immovable properties outside Hong Kong, as they are in the present case in Wuhan, PRC. Anti-Suit Injunction 17. While it is well established that Hong Kong courts have jurisdiction to restrain a party from instituting or prosecuting proceedings in a foreign court, Mr Coleman submits that an injunction may be granted only if Hong Kong is the natural forum for the resolution of the dispute and the proceedings in the foreign court are vexatious or oppressive, and it would be useful to first refer to Dicey, Morris and Collins on The Conflict of Laws , 14 th edition as to the principles on the exercise of such jurisdiction at §12-069: “The underlying principle is that the jurisdiction is exercised “where it is appropriate to avoid injustice”, or, as it was once put, where the foreign proceedings are “contrary to equity and good conscience”. Although it is possible to identify certain categories of cases in which the jurisdiction has been exercised “the width and flexibility of equity are not to be undermined by categorisation” … in the most recent authoritative formulation of the principles there is no indication that the exercise of the discretion is limited by the need to demonstrate a legal or equitable right not to be sued. The English court may restrain proceedings brought abroad in breach of a contract not to sue, or in breach of a contract to be bound by the result of English proceedings, to sue only in England, or to submit disputes to arbitration. The court will also restrain proceedings which interfere with “the due process of the court”, or with the court’s jurisdiction to decide cases pending before it. Thus the court will enjoin proceedings taken abroad to recover foreign assets, whereby the party taking them will obtain an unfair advantage over other claimants in an English administration, or bankruptcy or winding up. It is also clear that the court may restrain foreign proceedings which are “oppressive or vexatious” in the traditional sense. For some years it was not clear what effect the modern development of forum non conveniens principles in the staying of English actions was to have on the exercise of the jurisdiction to enjoin foreign proceedings. In Castanho v Brown & Root (UK) Ltd Lord Scarman (with whom all other members of the House concurred) said that it was no longer necessary to consider case law earlier than the developments in England since The Atlantic Star and MacShannon v Rochware Glass Ltd. It was held that an injunction could be granted to restrain foreign proceedings in the circumstances in which a stay of English proceedings would be ordered: as the law then stood, that would mean that an injunction would be granted if the English court was an available forum in which justice could be done at substantially less inconvenience and expense, and the injunction would not deprive the plaintiff in the foreign proceedings of a legitimate personal or juridical advantage which would be available in the foreign jurisdiction. In the Aérospatiale case, however, the Privy Council (speaking through Lord Goff of Chieveley) held that it was not right to treat the principles applicable in injunction cases as equivalent to those in forum non conveniens cases, as developed in Spiliada Maritime Corp v Cansulex Ltd . If the principles were the same, it would mean a party could be restrained from proceeding in a foreign court on the sole ground that England was the natural forum. This could not be right, because it would lead to the conclusion that, in a case where there was simply a difference of view between the English court and the foreign court as to which was the natural forum, the English court could arrogate to itself, by the grant of an injunction, the power to resolve the dispute: such a conclusion would “be inconsistent with comity” and “disrespect the fundamental requirement that an injunction will only be granted where the ends of justice so require.” The Privy Council held that where a remedy was available both in England and in the foreign court, the English court would in general only restrain the plaintiff from pursuing proceedings in the foreign court if the pursuit would be vexatious or oppressive. The English court must be the natural forum for the action, and it must take account of the injustice to the defendant if the plaintiff is allowed to pursue the foreign proceedings, and also the injustice to the plaintiff if he is not allowed to do so. The High Court of Australia, by contrast, has adopted a rather narrower definition, namely that “foreign proceedings are to be regarded as vexatious or oppressive only if there is nothing which can be gained by them over and above what may be gained in local proceedings, but it also characterised as oppressive proceedings which were instituted in one court after an action had been begun in another court and which appeared to be brought for the dominant purpose of preventing the first action from continuing. In the result, an injunction may be granted if England is the natural forum for the resolution of the dispute and the proceedings in the foreign court are vexatious or oppressive. English courts have refrained from giving a comprehensive or limiting definition of these expressions; indeed, they have deliberately refrained from marking the outer extent of their power to act to restrain conduct which may give rise to injustice or, if the need for caution is given its due weight, serious injustice. It has been held that vexation or oppression may be indicated by the following: subjecting a party with no substantial connection with that jurisdiction; bad faith in the institution of the proceedings, or the institution of proceedings which are bound to fail; extreme inconvenience caused by the foreign proceedings; multiplicity of actions, especially where the foreign action might spawn further consequential litigation which might not be reconcilable with the foreign decision; bringing proceedings which interfere with or undermine the control of the English court of its own process; bringing proceedings which could and should have formed part of an English action brought earlier; bringing proceedings for no good reason in a court which will disregard an express choice of English law. … It was also indicated in Aérospatiale that before the English court was justified in granting an injunction to restrain vexatious or oppressive conduct, it was generally required that the court conclude that it provides the natural forum for the action. This was reiterated in Airbus Industrie GIE v Patel where it was said that this requirement – which was elevated to the status of a general rule requiring to be satisfied before the court may act – was necessary in order to respect the limits placed by comity upon the power of an English court to grant orders in relation to proceedings in foreign courts. In the absence of such a connection with England it will be a very rare case in which the English court would be justified in granting an injunction against a defendant whose conduct was oppressive or vexatious. In that case French aircraft manufacturers were refused an injunction restraining English defendants from pursuing proceedings in Texas arising out of an aircraft accident in India. Although the English court had in personam jurisdiction over the defendants, it was contrary to comity to restrain the Texas proceedings because the English forum did not have a sufficient interest in, or connection with, the matter. 18. In the present case, Mr Coleman submits, it is not unusual for there to be two sets of proceedings in two jurisdictions, which means the court could – and in the current circumstances should – uphold and continue the Hong Kong proceedings whilst simultaneously refusing the Wife’s anti-suit injunction, and if it is said that the Father’s consent to join the Hong Kong proceedings means the question of forum need not be addressed in the Hong Kong proceedings, that cannot help the Wife on her application but rather that the question of whether Hong Kong is the natural forum simply has not yet been addressed, but that it must be addressed as part of her application now made and should fail. 19. On this issue Mr Coleman submits that it would be instructive to refer to the judgment of Deputy High Court Judge Lam, as he then was, in the case of First Laser Ltd v Fujian Enterprises (Holding) Co Ltd (unreported), HCA 4414/2001, 12 th December 2002, in which the Learned Judge was faced with the defendant’s application to stay the Hong Kong proceedings on grounds of forum non conveniens whilst the plaintiff sought to restrain the defendant from continuing or prosecuting proceedings in Fujian, PRC when he referred to the principles of some of the cases cited above as follows: “ The anti-suit injunction 60. The applicable principles are set out in Societe Aérospatiale v Lee Kui Jak [1987] 1 AC 871 and Airbus Industrie v Patel [1999] 1 AC 119 … I would confine myself to the following citations. In Airbus Industrie v Patel [1999] 1 AC 119 at p.133, Lord Goff said, “The broad principle underlying the jurisdiction is that it is to be exercised when the ends of justice require it. Generally speaking, this may occur when the foreign proceedings are vexatious or oppressive … But, as was stressed in the Aérospatiale case …, in exercising the jurisdiction regard must be had to comity, and so the jurisdiction is one which must be exercised with caution …” 61. In Amchem Products Inc. v Workers’ Compensation Board [1993] 102 DLR (4 th ) 96 at p.120-1, a decision of the Supreme Court of Canada, Sopinka J said, “The result of the application of these principles is that when a foreign court assumes jurisdiction on a basis that generally conforms to our rule of private international law relating to the forum non conveniens , that decision will be respected and a Canadian court will not purport to make the decision for the foreign court. The policy of our courts with respect to comity demands no less. If, however, a foreign court assumes jurisdiction on a basis that is inconsistent with our rules of private international law and an injustice results to a litigant or “would-be” litigant in our courts, then the assumption of jurisdiction is inequitable and the party invoking the foreign jurisdiction can be restrained.” To similar effect is the judgment of Lord Goff in Aérospatiale at p.895E-G and Neill LJ in EI Dupont v Agnew [1988] 2 LI Rep 240 at p.249. In the latter case, Neill LJ concluded, “… where there is a difference of view between the English court and the foreign court as to which is the natural forum, the English court will not arrogate to itself by the grant of an injunction the power to resolve that dispute.” 62. In Turner v Grovit [2002] 1 WLR 107 , Lord Hobhouse distinguished between applicants who had a contractual right to litigate in a particular forum and those who did not have that right. For the latter, His Lordship said at p.120 Para.29, “Therefore, to summarise, the essential features which made it proper, under English law, for the [court to grant an anti-suit injunction in favour of those who did not have contracted right to litigate in England] are: (a) the applicant is a party to existing legal proceedings in this country; (b) the defendants have in bad faith commenced and propose to prosecute proceedings against the applicant in another jurisdiction for the purpose of frustrating or obstructing the proceedings in this country; (c) the court considers that it is necessary in order to protect the legitimate interest of the applicant in the English proceedings to grant the applicant a restraining order against the defendants.” 20. Applying those principles, Deputy High Court Judge Lam refused the plaintiff’s application for anti-suit injunction when he stated: “63. Ms Eu contended that the commencement and continuation of the PRC action by the 1 st Defendant are oppressive. She referred to the fact that the PRC action was only commenced after the Plaintiff started the action in Hong Kong and the Defendants took out a summons for the stay of the Hong Kong action. She also highlighted the difficulties the Plaintiff might encounter with regard to the concept of trust under PRC law. She referred to the difference between Hong Kong law and PRC law in respect of the questions of authority and lack of approval from Fujian government. All these, she said, pointed to the conclusion that the PRC action was brought for the dominant and calculated purpose of depriving the plaintiff of its claims under Hong Kong law. To support her contention, she relied on the decision of the High Court of Australia in CSR Ltd v Cigna Insurance Australia (1997) 189 CLR 345 at 401, “Proceedings which are brought for the dominant purpose of preventing another party from pursuing remedies available in the courts of another country and not available in this country are “seriously and unfairly … prejudicial [and] damaging”. They are, thus, oppressive …” 64. The burden is on the Plaintiff to satisfy this court that an anti-suit injunction should be granted. Ms Eu’s submission was, in my view, based on two underlying premises, (a) the claim of the Plaintiff based on trust should be governed by Hong Kong law; (b) the PRC action would frustrate the Plaintiff’s action in Hong Kong. 65. On (b), I have already held that the action in Hong Kong should not be stayed. On (a), as discussed above, I do not think I can come to a final conclusion on the applicable law in respect of each and every relevant issue. In other words, I am not satisfied, on the material available, that all issues in the primary claim of the plaintiff must be governed by Hong Kong law. On the contrary, as presently advised, I am more inclined (though I still maintain an open mind if this matter shall come back to me later) to the view that at least in respect of some of the issues, they should be governed by PRC law, see discussions in the above section on applicable law. 66. Balanced against this, as I have said in the section dealing with the stay application, there are factors suggesting that the Fujian court could be at least as much a natural forum as the Hong Kong court in dealing with the disputes between the parties. My view is that neither forum can be said to be distinctly more appropriate than the other. Of course, the PRC action is much narrower in scope and I have considered the stay application by reference to the trial of the issues raised in the Hong Kong action instead of the PRC action. Whether the Fujian court would be the appropriate forum for the trial of the PRC action has been litigated in the mainland with the participation of the Plaintiff to the highest court there and the Supreme People’s Court has adjudicated on the matter. As Mr Chan pointed out, the approach adopted by the Supreme People’s Court in deciding the matter was very much akin to our concept of forum non conveniens . The dicta of Sopinka J cited in Paragraph 61 above is relevant. 67. I have also taken into account of the fact that the trial of the PRC action has taken place and the Plaintiff also took part in it. By comparison, the action in Hong Kong is only at its early stage. I am not aware of a case where anti-suit injunction has been granted in these circumstances and Ms Eu, despite her diligence and that of her juniors, has not been able to refer me to any. The progress of the proceedings in the foreign court must be a relevant factor. I should record that there is no suggestion by the Plaintiff that the proceedings in the Fujian court have been conducted unfairly against it. 68. Moreover, as pointed out in paragraph 56 above, the PRC action could be complimentary to the Hong Kong action. 69. On the whole, I am not satisfied that the PRC action was brought for the dominant purpose of preventing the Plaintiff from pursuing its claims in the Hong Kong action or frustrating the same. Notwithstanding the timing of the commencement of the PRC action, I am of the view that it was quite legitimate for the 1 st Defendant to take the view the Fujian court was an appropriate forum and try to have the issues raised in the PRC action to be litigated there. Nor am I satisfied that it is necessary to grant an anti-suit injunction to protect the legitimate interest of the Plaintiff in the Hong Kong action. In short, I am not convinced that it is oppressive for the 1 st Defendant to commence or continue with the PRC action and I do not think the ends of justice require an anti-suit injunction to be granted. 70. As observed by Le Pichon JA in Asha Harkishin Premisingh v Harkishin Isarsingh Premsingh , CACV 845 of 2000, “ … the fact that the courts of country X have concluded that country X was the natural forum, does not entitle it on that ground alone to restrain a party from proceeding in the foreign court. It would be inconsistent with comity.” 71. For these reasons, the application for anti-suit injunction must be dismissed.” 21. Mr Coleman submits that as the current circumstances of the present case are similar, it is not unusual for there to be two sets of proceedings in two jurisdictions, which means that the court could and should uphold and continue the Hong Kong proceedings whilst simultaneously refusing the Wife an anti-suit injunction, as otherwise it would not be consistent with comity, the elements of which as summarised in MCC Proceeds Inc v Bishopsgate Investment Trust [1999] CLC 417 at 421-424 include: (1) to inform the court of the relevant contents of the foreign law, identifying statutes or other legislation and explaining where necessary the foreign court’s approach to their construction; (2) to identity judgments or other authorities, explaining what status they have as sources of the foreign law; and (3) where there is no authority directly in point, to assist the English judge in making a finding as to what the court’s ruling would be if the issue was to arise for decision there. 22. Mr Coleman therefore submits that as all parties in the present case assert that PRC law is applicable and have announced the intention to deploy expert opinion evidence as to such law, there is no better person to assist the Hong Kong in identifying the material PRC law and its meaning than the relevant court in the PRC which administers and rules on that law, and hence it is for the Wuhan court to rule on the dispute over those Wuhan properties in the PRC Action. 23. Mr Coleman further submits that in any event Hong Kong is not the natural forum for the resolution of the dispute between the Husband and the Father as to the true ownership of, and who should have title to those properties, as that question turns on the arrangements made in the PRC relating to immovable property in the PRC which will identify who should properly be regarded as having title to those immovable properties. The Moçambique Rule 24. Mr Coleman indeed questions whether the Hong Kong court even has jurisdiction to deal with that question, and submits that in affirming the Moçambique rule, Hong Kong courts generally have no jurisdiction to determine disputes concerning title to or interests in immovable property outside Hong Kong : Re Law Kin Man (unrep., HCMP 1711/1991, 13 June 1996 [1996] HKLY 1095). 25. The Moçambique rule is a common law rule in private international law which renders action relating to title in foreign land, the right to possession of foreign land and trespass to foreign land un-justifiable in common law jurisdiction established in 1893 by the House of Lords decision in the case of British South Africa Co v Campanhia de Moçambique [1893] AC 602 . 26. According to Johnston on The Conflict of Laws in Hong Kong , 2 nd edition, at §4.039, while there is no direct authority in Hong Kong law for the Moçambique rule, the orthodox understanding, following the leading English and other Commonwealth authorities, is that Hong Kong courts have no jurisdiction to determine: (1) disputes concerning title to or interests in immovable property outside Hong Kong; (2) claims of trespass to immovable property outside Hong Kong and, semble , other claims of wrongdoing where the essence of the complaint is one of damages to, entry upon or occupation of such property, even though no dispute arises concerning title to or interests in such property. 27. Given the lack of direct authority in Hong Kong for this historical rule notwithstanding Re Law Kin Man, it would be instructive to refer to Johnston as to the development of the law in relation to this rule in England and other Commonwealth jurisdictions over the intervening decades at §4.040: “ … In 1893, the House of Lords established that English courts have no jurisdiction over claims of trespass to foreign land. Other Commonwealth courts have extended the jurisdictional bar to torts concerning foreign land other than trespass, and to any other proceedings for the determination of title to or interests in foreign immovables. In 1078, the House of Lords, whilst questioning the rationality of the Moçambique rule, decided that it was too long-established to overrule and, moreover, that it ought to be construed relatively widely so as to deny jurisdiction in a case where the tort claim was not framed in trespass and, more significantly, where no dispute as to title had been raised. The House of Lords refused, however, to extend the rule to goods. Subsequently, however, limb(2) of the rule as summarised above has been reversed in part by statute in England, so as to permit English courts to exercise jurisdiction over claims for trespass to, or any other tort affecting, immovable property outside the jurisdiction unless the proceedings are principally concerned with a question of the title to, or the right to possession of, that property. There has been no such statutory provision in Hong Kong. 28. There are, however, exceptions from the Moçambique rule as set out in Johnston at §4.041: “There are some potentially significant exceptions, or possible exceptions, from the “much criticised” Moçambique rule: 1. Where the claim is based upon a personal obligation arising between the parties . Where the claim is based upon a contract, fraud, fiduciary relationship or other obligation which does not “depend for [its] existence on the law of the locus of the immovable property”, then the Moçambique rule does not bar the taking of jurisdiction. This principle, based on old English Chancery cases but applied in more recent times, permits the taking of jurisdiction and making of orders requiring steps to be taken in relation to foreign land where the claim is based on a personal obligation incurred by the defendant, arising from, for example, a breach of contract, fraud, trust or other equitable obligation. The jurisdiction to order ancillary relief following divorce also extends to foreign land. It has been said that the court will not take jurisdiction under this exception if the courts of the situs would prohibit enforcement or the forum court cannot effectively supervise execution. It is suggested, however, that these are matters of degree which are best regarded as going to the existence of the forum conveniens discretion and that if the Hong Kong court has effective personal jurisdiction over the defendant then the attitude of the foreign court ought not to be relevant. It should also be noted that Anton Piller orders (i.e. civil orders for the search of premises and seizure of evidence) may be made on this basis. 2. Administration cases . It appears that the rule has no application to questions arising in connection with the administration of estates or trusts … 3. Where the issue as title over foreign land only arises incidentally . In Moçambique itself, Lord Herschell said, in a much discussed dictum, that: “It is quite true that in the exercise of the undoubted jurisdiction of the courts it may become necessary incidentally to investigate and determine the title to foreign lands, but it does not seem to me to follow that because such a question may incidentally arise and fall to be adjudicated upon the courts possess, or that it is expedient that they should exercise, jurisdiction to try an action founded on a disputed claim of title to foreign lands.” It has been said in the English Court of Appeal that this means “that it is the action founded on a disputed claim of title to foreign lands over which an English court has no jurisdiction and that where no question of title arises, or only arises as a collateral incident of the trial of other issues there is nothing to exclude the jurisdiction”, and on that basis the court held that it had jurisdiction to allow a claim to recover rent under a lease of foreign land. The precise limits of the principle have not been explored in Hong Kong, and not fully explored elsewhere. 4. Waiver . Although it may be said that it is impossible to confer jurisdiction which the court does not have by way of agreement, waiver or estoppels, the applicability of that rule is somewhat questionable in the conflicts context and essentially depends on how one views the true nature of the rule. In the absence of any substantial reason to refuse to give effect to an agreement or waiver or estoppels, it is suggested that the court may take jurisdiction on such a basis where the facts justify it: indeed, the taking of jurisdiction in such circumstances may be regarded as falling within the exception based upon personal obligations discussed above.” 29. While the decision in British South Africa v Companhia de Moçambique was based exclusively on the historical development of the circumstances in which a court in England would take jurisdiction to hear any matter, as can be seen below it has been criticised that the exceptions to this rule are not very well defined, and that the rule itself has actually been abolished in some other jurisdictions of the common law such as New South Wales via its Jurisdiction of Courts (Foreign Land) Act 1989 (NSW). 30. In 1978 in the case of Hesperides Hotels Ltd v Muftizade [1979] AC 508 when the House of Lords was asked to depart from the Moçambique rule, it was conceded by Lord Fraser that the result might be that the plaintiff would be left without a remedy, that it was difficult to justify the rule except on historical grounds, and that it was neither logical nor satisfactory in the result (pp. 543-544), but the House declined to overrule the 1893 decision and it is revealing to consider the reasons given by Lord Wilberforce cited in Johnston at §4.042: “First, the rule is accepted, with differing degrees of force and emphasis in other jurisdictions of the common law … Secondly the nature of the rule itself, involving, as it clearly must, possible conflict with foreign jurisdictions, and the possible entry into and involvement with political questions of some delicacy, does not favour revision (assuming such to be logically desirable) by judicial decision, but rather by legislation… Thirdly, revision of the rule may necessitate consequential changes in the law. In order to prevent ‘forum shopping’ and overlapping, one such change would have to relate to ‘ forum non conveniens’ , a principle not yet fully developed in England… and, if English courts were to be given an extended jurisdiction, requiring legislative definition. Fourthly, it cannot be said that since 1893 there has been such a change of circumstances as to justify this House in changing the rule…” 31. How then would these objections apply to present-day Hong Kong law? Johnston made the following observations at §4.043: “Applying these four objections to present-day Hong Kong law, it may be noted, with reference to the first point, that the rule has been qualified in, inter alia , England since 1978; with reference to the second and third points, that the doctrine of forum conveniens is now well established and, it is suggested, well able to cope with potential comity problems; cases concerning immovable property are not, it is suggested, in some uniquely difficult category requiring a blanket exclusionary rule. As to the fourth objection, the House of Lords in 1893 nor 1978 was, of course, considering circumstances in England, not Hong Kong; notwithstanding the Court of Final Appeal’s usual adherence even after 1997 to English authority, it is suggested that this may be one of those rare cases in which there is good reason to depart from English case law. That is certainly not to say that jurisdiction should be taken lightly in cases where the essential dispute concerns title to foreign land: that will often be a very powerful factor weighing in favour of exercising the discretion so as to decline to exercise Hong Kong jurisdiction. Nevertheless, rather than continue to approach the matter by way of technical and unsatisfactory exceptions, it seems best, as in virtually every other legal context, to approach the matter in a less legalistic manner, by the application of the doctrine of forum conveniens . To allow the matter to continue to be governed in Hong Kong by, in effect, the historical procedural distinction between “local” and “transitory” actions and venues would be as unattractive as what was described, in a different context, as “the forms of action successfully clanking their special chains.” Lord Mansfield’s view that there was no exclusionary rule seems much more attractive in modern times than its rejection by later English judges in the intervening years.” 32. It seems to me that it has now been accepted that the conventional justification for the Moçambique rule is a practical one, for the reason that only the court of the situs can make an effective order or decree regarding foreign land, as it was not possible for an English court to enforce its decree as to title or possession of foreign land, therefore it ought not to embark upon a futile exercise. The justification for this principle has however been described as unconvincing, as can be seen below, that there has been greater readiness of courts to recognise judgments of foreign courts as reflected in the practice of private international law throughout the world since that 1893 decision, and that there is a growing belief that the rule no longer has any justification due to the recent development of the doctrine of forum non conveniens which provides a basis for a local court to decline jurisdiction where a foreign court is the more natural and appropriate forum, which has led to reform in jurisdictions such as UK where the rule was partially abrogated by s 30(1) of the Civil Jurisdictions and Judgments Act 1982, and abolished in New South Wales. 33. In the New South Wales Law Reform Commission Report 63 (1988) – Jurisdiction of Local Courts Over Foreign Land which proposed reform to the Moçambique rule and which led to its eventual abrogation, it noted that in relation to the denial of jurisdiction in actions for damages for trespass or other torts concerning foreign land, the rule has evoked universal criticism throughout the common law world (para 6.1), and identified 4 heads under which criticisms of this part of the rule could be grouped, namely that the rule was an anachronism, having as its foundation the assumption that jurors must have personal knowledge of the facts in issue, with the rule remaining in effect long after the requirement had been dispensed with, that the law relating to jurisdiction has changed so much since the Moçambique rule that it was said in UK that it may be dangerous to rely on the case, and that the obsolescence of the historical underpinnings to the action have not been accepted as a basis for avoiding the rule in Australia, while some courts in the United States had regarded the limitations imposed by the rule as the product of ancient legal fictions which should not bind contemporary courts (paras 6.3 – 6.4). 34. The second related head of criticism of the rule by the New South Wales Law Reform Commission was that it creates anomalies and arbitrary distinctions because it arose out of judicial development over centuries which did not always form a coherent whole, as pointed out by the Commission to proceedings between an original lessee and the assignee of the reversion constituting a transitory action, but proceedings between the original reversioner and the assignee of the lessee constituting a local action, and that anomalies were in fact admitted by Fry J in the Moçambique case that if a plaintiff brings an action for damages to foreign land, his chattels situate thereon, and his person. The court would have jurisdiction to adjudicate in relation to damage to chattels and person, but not to the land. Hence it noted that the distinction between local and transitory actions had been described as outmoded and analytically dubious and shrouded in mystery (paras 6.5-6.8). 35. The third head of criticism was that the Moçambique rule may cause injustice by denying a person any effective remedy for a wrong done to property which he or she owns overseas, and that if the wrongdoer has no assets located in the country in which he or she committed the trespass or negligence then, although the courts of that country may assert jurisdiction over the wrongdoer, that exercise of jurisdiction may well not be recognised by the courts of the country in which the assets are located, and any judgment given cannot be satisfied, while the courts of the country in which the defendant’s assets are situated will not, however, themselves take jurisdiction to hear the action by reason of the rule (para 6.9). 36. The fourth head of criticism was that the rule was illogical as, for example, the exception to the rule to enforce a contract or equity between litigants was justified on the basis that the court was only acting in personam ; yet if jurisdiction were also extended to hear an action in tort for damage done to foreign land, any consequent judgment in the plaintiff’s favour would only operate on a personal level, being made against the defendant personally and satisfied out of such of his assets as are located within the country’s territory. The jurisdiction for the common law’s refusal to accept jurisdiction was, it noted, therefore difficult to maintain (para 6.10). 37. In so far as the Moçambique decision is authority for the proposition that a court in one country will not entertain an action to determine title to, or the right to possession of foreign land due to recognition of the lex situs only being capable of making an effective decree, the Commission noted that it had not been subject to much criticism either academic or judicial, but did not think this justify the present state of the law, and objected to the rule extending beyond the seeking of a decree regarding ownership of land, to a decree which was connected with foreign land but could be effected by an order binding the defendant personally, and not requiring execution against the foreign land (paras 6.11-6.13). 38. It is in fact instructive to note the following criticisms of the rule as to title by the Commission as lacking clarity in the law as well as causing unnecessary expense and delay: “A. Lack of Clarity in the Law 6.14 It has been explained above …, based on the decisions in Penn v Lord Baltimore and Lord Cranstownb v Johnston the court in its equitable jurisdiction has the power to make an order, directed to the defendant personally, the effect of which may well impinge on the title to, or right to possession of, foreign land. But it has also been pointed out that this exception to the Moçambique rule depends upon there being an “equity” between the litigants. The lack of clarity in the law arises from the fact that the circumstances for the fulfilment of this condition are difficult to determine. As dicey and Morris point out, if “A agrees to sell foreign land to B, and instead conveys the land to C, who has notice of the contract, C is [for those purposes] a stranger to the equity” and the equitable exception does not apply. However, “if a company creates an equitable charge on land in favour of debenture-holders, and sells the land to a purchaser subject to the mortgage lien or charge now subsisting, and the purchaser expressly undertakes to pay the debentures and interest, the court has jurisdiction to entertain an action by the debenture-holders against the purchaser”. The authors go on to observe that the distinction between those two situations is tenuous and difficult to reconcile with equitable doctrines of constructive notice. 6.15 A further example of lack of clarity in the law relates to the exception to the Moçambique rule created in relation to the administration of deceased estates … 6.16 A final example in this general category is the decision of Woodward J, in Inglis v Commonwealth Trading Bank of Australia … In that case, the Judge himself accepted that his conclusion was anomalous, because of the fact that the denial of jurisdiction depended on the way in which, and the party by whom, proceedings were instituted, and not on the nature or substance of the plaintiffs claim. 6.17 If the Moçambique rule were to be abolished in its entirety, the courts would no longer be required to come to somewhat artificial conclusions as to whether the plaintiff’s action fell on one side or the other of a “jurisdictional line”, but would need only to determine whether their court was the appropriate forum for the resolution of the dispute, applying the notions of forum non conveniens discussed below … B. Unnecessary Expense and Delay 6.18 The principal situation in which the application of the Moçambique rule may lead to unnecessary expense and delay (and perhaps even to a denial of justice) relates to application for relief under the Family Provision Act 1982 (NSW) …” 39. At the conclusion of the report the Commission made the following recommendations: “8.1 It is recommended that the jurisdiction, not only of the Supreme Court of New South Wales but of all other courts in the State, be extended so that those courts have the power to hear and determine a matter, even though that matter relates to or may otherwise concern land outside the State. 8.2 The above recommendation is subject to the condition that courts in the State should exercise that jurisdiction only if the court is of the view, in the light of all the surrounding circumstances, that it is the most appropriate forum for the resolution of the matters in dispute. 8.3 It is further recommended that the Family Provision Act 1982 be amended so as to make it clear that, in an application under that Act, the court may have regard to land or other immovable property outside New South Wales owned by the deceased at the date of his or her death.” 40. As noted above, following this report the Moçambique limitation to jurisdiction was removed by the Jurisdiction of Courts (Foreign Land) Act 1989 (NSW) which came into operation in 1990 in New South Wales. 41. Despite being subject to much curial and academic criticisms the rule has remained in existence in various jurisdictions, mainly due to judicial adherence to stare decisis, and it must also be accepted, as pointed out in its report, the NSW Law Reform Commission never suggested that a court in New South Wales should determine matters which would entail it making orders as to the title to foreign land for reasons of convenience and comity. 42. That point of comity, submitted by Mr Coleman for the Father, is obvious in the present case as no order of the Hong Kong court could possibly bindthe PRC or Wuhan land registry to replace the Husband’s name with that of the Father on the certificates of ownership of those properties, which is the relief sought by the Father in the PRC Action, except by order of the PRC court. 43. That question of title to immovable property, Mr Coleman submits, is necessarily one of in rem jurisdiction, which is the basis on which the PRC Action proceeds as well as the freezing order by the PRC Court, there is therefore no question but that the Moçambique rule applies, and given the material obligation as to title is the personal obligation between Husband and Father in which the Wife has no role to play, it is submitted that she simply fails to fall within the 1 st exception of the rule. 44. Ms Yip however argues for the Wife that it is plainly wrong to say that Hong Kong court does not have jurisdiction to determine the disputes concerning title to or interest in those PRC properties which are all registered in the Husband’s name and against which the Wife has a legitimate claim in her ancillary relief application, as section 6 of Matrimonial Proceedings and Property Ordinance , Cap 192 (“MPPO”) expressly empowers the court to make a settlement of property order without any limitation as its jurisdiction to only deal with properties situated in Hong Kong. 45. It is also trite, Ms Yip submits, that Hong Kong court exercises an in personam jurisdiction over the parties namely Husband, Wife and Father because there is an issue in the Wife’s ancillary relief claim as to whether those properties over which the court can exercise dispositive power under section 6 belong to the Husband or the Father, and where TL v ML supra specifically provided for the procedures to deal with this kind of dispute involving a party not privy to the marriage which does not alter the substantive jurisdiction. 46. There is no question in my mind that, as pointed out by Mr Coleman, the TL v ML procedure is invoked because the subject-matter of the intervener proceedings is different from the subject-matter of the parties’ matrimonial proceedings, and that but for the convenience of adopting the TL v ML procedure in the parties’ matrimonial proceedings, the subject-matter of the intervener proceedings would certainly fall to be dealt with in wholly different proceedings, and that would indeed be in PRC for those properties in Wuhan, where the Father is clearly permanent resident and is in my view therefore entitled as of right to litigate his case over those properties in Wuhan. 47. Ms Yip however argues that the Wife’s case clearly falls within the 1 st exception of the Moçambique rule where her claim is based upon a personal obligation arising between the parties, and hence it is difficult to see why our Family Court’s in personam jurisdiction does not govern that personal obligation of the Husband. 48. Ms Yip in fact further submits that the 3 rd exception also applies where the issue as to title over foreign land only arises incidentally, as it was the Husband’s case first stated in his Form E that he acquired those properties subject to loans from the Father, and then he switched his case in his 6 th Affirmation by claiming to hold those properties on trust for the Father, while the latter’s Skeleton Argument suggests what he sought in the PRC Action is a restitution/recovery of those properties for the Husband’s breach of his nominee’s obligation, hence on either of their case the alleged dispute as to the title over the properties only arises incidentally from the underlying dispute. None of the above claims over properties, Ms Yip therefore submits, invokes the in rem jurisdiction of the court, but instead the in personam jurisdiction. 49. On that point Ms Yip relies on the European Convention case of Webb v Webb [1994] C-294/92, [1994] ECR 1-1717 where a son was the sole legal owner of land in France, the purchase price of which had been paid by his father who then sought a declaration from the English court that the son held the flat on trust for him and that he should convey the title to the flat to him. The son claimed that, by virtue of the Convention, the case could only be heard in France. The ECJ rejected his submission, holding that a Convention action for a declaration that a person holds immovable property as a trustee and for an order requiring that person to execute such documents as are required to vest legal ownership under the lex situs in the plaintiff does not involve rights in rem within the meaning of Article 16(1), and that it was irrelevant that the plaintiff wanted to obtain ownership of an immovable; what is important is whether rights in rem are the object of the proceedings. Since the plaintiff did not claim that he already enjoyed rights directly relating to the property which were enforceable as against the whole world, but sought only to assert rights against the defendant, it was held that the action was not a right in rem within the meaning of Article 16(1) of the 1968 Brussels Convention, but an action in personam . 50. Similarly in the present case, the Father’s claim in the PRC Action against the Husband as stated in his Skeleton Argument came about as a result of the Husband’s breaches of certain personal obligations under a nominee agreement and the Father’s assertion of ownership rights over the Wuhan Properties, with the questions of nominee or equitable obligations and trust between them for determination by the PRC Court, which seems true to me an action involving rights in personam rather than in rem , thereby putting the Wife’s case within the exceptions from the Moçambique rule. 51. In any event, Ms Yip argues, exception can in fact be found in this case, as a salient feature should be noted in First Laser that the plaintiff did take part in the Fujian action that was being complained of and there was no suggestion that the Fujian proceedings had been conducted unfairly against the plaintiff, which was one of the main reasons why the learned judge refused the application, but she submits is totally different from the present case where the Wife takes no part in the PRC Action, as she was deliberately kept in the dark from day one up until now. 52. Henceforth, Ms Yip submits, without the anti-suit injunction, the Wife’s interest would be seriously jeopardised if a PRC judgment is obtained by the Father, as there is a real possibility that it may be recognised by the Hong Kong court which would no doubt prejudice the Wife, of which this court is bound to take into account when balancing the convenience of the matter. 53. Ms Yip argues that as a result of their deliberate effort to conceal the PRC proceedings by the Father and Husband, together with the delay in providing full and frank disclosure by the Husband, and in the absence of any affidavit evidence from the Father, the Wife has little information of the nature and progress of the PRC proceedings in which she may not be allowed to join, nor the means to litigate in 2 fronts given the Husband’s failure to even comply with the earlier maintenance pending suit order. 54. Furthermore, Ms Yip argues, neither the Father nor Husband has taken out any application to stay the Hong Kong proceedings on grounds that Hong Kong has no jurisdiction, and instead the Husband, armed with his non-disclosure of the PRC proceedings, actively applied to join his parents as interveners in these proceedings, while the Father, also armed with the non-disclosure of the PRC proceedings, agreed to be so joined to determine the preliminary issue of ownership over those properties, hence the clear inference, Ms Yip submits, must be that they wanted to expose the Wife to 2 fronts, which bears the greatest emotional and financial pressure on her which cannot be right or fair in the circumstances, and the balance of convenience must lie in her favour. 55. Of all the cases cited above where the issues were raised over forum non conveniens or jurisdiction and as a result anti-suit injunction was being sought, both the plaintiff and defendant were the same parties in the two sets of proceedings in the competing jurisdictions, and hence if the local court refused to grant the anti-suit injunction on question of forum or policy with respect to comity, the plaintiff could still rely on the foreign court to properly adjudicate and resolve the dispute unless its assumption of jurisdiction is said to be inequitable, or that the foreign proceedings are vexatious or oppressive, or that jurisdiction should be exercised when the ends of justice requires it : see Societe Aerospatiale above 56. In the present case, the Wife was not a party to the PRC Action of which she had no prior knowledge or notice, and as asserted by the Father that it was a case which could be determined without her involvement at all, as made plain by the progress of the PRC Action, it begs the obvious question so central to the whole issue now before me: What exactly is the dispute between Father and Husband that was required to be determined by the PRC Court in the PRC Action? 57. It is plain that their case over the Wuhan Properties is the same – that they all belong to the Father, as clearly evidenced by the Husband’s Form E and his subsequent various affirmations, as well as the Father’s only affirmation filed on 12 th October 2015 after being joined as an intervener to the preliminary issue, in which he disclosed essentially the same arrangements he claimed to have made with the Husband over those properties but never any explanation or reason which led him to bring the PRC Action against his son, which justifies the Wife’s serious concern that the PRC Action would not be fought or defended by the Husband and that it would just be a formality for a judgment to be entered in favour of the Father by the PRC Court. 58. The clear inference must therefore be that they wanted to use the PRC Action, not only to expose the Wife to two fronts as submitted by Ms Yip, but more precariously in that the Father would be in a position to dispose of the Wuhan properties beyond the reach of the Wife’s claims or whatever award she may obtain from this court in her ancillary relief application against the Husband, as it has all along been her grave suspicions that he and his family would gang up against her in the divorce proceedings, and with valid basis as I have found in my earlier judgment on her application for maintenance pending suit. That must in my view be the main thrust of her application for anti-suit injunction upon the underlying principle that jurisdiction should be exercised to avoid injustice, in this case to the Wife and the mother of 2 small children in her divorce proceedings. 59. While Hong Kong courts may not appear to be the most natural or proper forum for the determination of title to those Wuhan properties as submitted by Mr Coleman, that issue had never been raised by either Father or Husband until this application, let alone to properly argue it, not to mention the fact that it was the Husband who applied to join the Father to this court for the determination of essentially the same subject-dispute in the PRC Action, and which as noted above was not opposed by the Father who appears to have submitted to this jurisdiction by filing his affirmation setting out his case. Which brings me back to essentially the same question as above: What is there for father and son to dispute about in the PRC Action, and after the interveners proceedings in this court, why brought similar action in PRC? There is simply no answer from either Father or Husband. 60. Given the evidently close relationship between Father and Husband and the unquestioned supports, financial and otherwise, from both his mother and sister shown throughout these proceedings to fight the Wife in almost every step of the way as I have found in my earlier decisions on the respective hearings of custody and maintenance pending suit, the order for the latter of which the Husband has never complied with and, as I understand, that he has since withdrawn all financial support for the Wife as well as chosen to remain outside the jurisdiction, all of which just go to support the Wife’s argument that the PRC Action is part of the Husband’s concerted efforts with his family to put his assets beyond her claims. Material Non-Disclosure 61. As for the Father’s allegation of significant non-disclosure by the Wife when applying for the anti-suit injunction, as set out in Mr Coleman’s Skeleton Argument and namely (1) the extreme rarity of worldwide anti-enforcement injunction, (2) the effect of PRC judgment in Hong Kong proceedings, and (3) the Wife’s attempts or steps towards intervening as party to, or to obtain a stay of, the PRC Action, of which Mr Coleman submits that the Wife had failed to properly identify to the court the true effect of the injunction sought, or failed to raise all material matters to that effect including points which could be made in opposition to the application and its intended effect, such as information which would identify that the PRC Action is likely to achieve the opposite of the “purpose of frustrating or obstructing” the Hong Kong court. 62. As for the last point on the Wife’s failure to tell the court that she had taken steps to join in or to obtain a stay of the PRC Action, Mr Coleman submits that this was highly material non-disclosure in circumstances where the law identifies that an application for an anti-suit injunction should usually first make an application for relief in the foreign action. 63. For the first two non-disclosures on law, Ms Yip argues that at the time of her ex-parte application, the issue of enforcement of PRC judgment simply did not arise, as the Wife did not even know the progress of the PRC proceedings, she cannot be guilty of materially non-disclosing something she was not aware of, hence that allegation is entirely groundless. 64. The Wife also denies the third allegation that she has failed to disclose her attempts to intervene as a party to, or to obtain a stay of, the PRC proceedings, as it is submitted that she has clearly in her 12 th Affirmation disclosed that she had attempted to approach a PRC lawyer for assistance but has been unable to join in the proceedings, and hence she argues that there is no material non-disclosure on her part, or that any matters not disclosed are not material to the court’s consideration of her application. 65. I agree that the first two points are directly relevant to comity of which submission could be made at the hearing of the application, and were indeed made, rather than in the Wife’s supportive affirmation which in the main dealt with evidence only. As for the third point, clearly the Wife’s failure or inability to join in or stay the PRC Action was the very reason for her application now before me, and I fail to see how that fact if not disclosed in her affirmation could be regarded as material non-disclosure, unlike a case when having joined in the PRC Action she chose not to disclose it in her present application which would certainly be said to be material non-disclosure. Conclusion 66. There is no question that the marital assets of the parties should be preserved pending the determination of their financial dispute, and that must include all those landed properties under the Husband’s sole name whether within or without the jurisdiction, for the purpose of not just to protect their right and interests over them but also their children’s needs to be met by those marital assets of their parents. 67. Given the background of these proceedings and the way the litigation has been conducted by the Husband and supported by his family, I agree that the Wife has every reason to be concerned by the outcome of the PRC Action which may leave her and the children in a seriously precarious position without any financial security under the circumstances and rendering any financial order granted by this court futile and meaningless, thereby defeating the underlying objective of achieving justice between the parties in their financial dispute or to safeguard their children’s welfare and interests. 68. In the premises there is no doubt in my judgment that jurisdiction should be exercised in favour of the Wife’s anti-suit application to avoid any injustice which may result from the PRC Action, and in view of the many criticisms which have been levelled at a rule clearly based on historical procedural development of a decision made more than a century ago which has since been wholly or partially abrogated in other common law jurisdictions, and given the lack of direct authority of its application in Hong Kong and its questionable relevancy to our present-day law, I am inclined to echo Johnston ’s observation that it would indeed be more attractive that there be no exclusionary rule at all, and thus leaving our courts the discretion as to whether jurisdiction should be exercised on the doctrine of forum conveniens. 69. If there is indeed an issue on forum, it was not raised before and should be properly argued if necessary between Father and Wife, but there can be no dispute to the fact that the Father has already agreed to intervene in this court in the preliminary issue over those properties in dispute and has filed his affirmation evidence for that purpose, and hence can be said to have submitted to this jurisdiction in respect of the dispute over those properties. 70. On the other hand and as noted above, I accept that it is the Father’s right as a Wuhan resident to litigate his dispute over those properties situate in Wuhan in the PRC Action, and given the current state of that action where the trial appears to have already taken place, and that with respect to the point of comity between the two jurisdictions, I do not propose to restrain the Father from continuing with the PRC Action for the determination as to title to those properties, but for all the reasons articulated above and in the underlying principle of doing what is just and practical to instead restrain him from dealing with or disposing of any of those properties in the event that the PRC Action concludes in his favour, pending the determination of the preliminary issue by this court. 71. My order is therefore as follows: (1) The 1 st Intervener (Father) whether by himself, his servants, agents or otherwise in his personal capacity or in the capacity of an officer, servant or agent of the Intervener be restrained from dealing with or disposing any of those properties in which the PRC Action may find or conclude in his favour pending the determination of the preliminary issue by this court unless with leave; (2) Costs reserved and to be dealt with at the preliminary issue trial; (3) Liberty to apply. 72. Last by not least, I wish to express my gratitude to counsel for both sides for their valuable assistance rendered to this court on such short notice and difficult circumstances. ( Bruno Chan ) District Judge Ms Anita Yip SC with Ms Lily Yu instructed by M/S Chaine, Chow & Barbara Hung for the Petitioner. Ms Bonnie Leung of M/S Wat & Co for the Respondent. Mr Russell Coleman SC instructed by M/S Withers for the Interveners. Look up this case on Lawcite Noteup",
  "length": 71886,
  "headers_seen": [
    "Relevant Background",
    "The Application",
    "Anti-Suit Injunction",
    "The Moçambique Rule",
    "Material Non-Disclosure",
    "Conclusion"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkfc/2015/144",
  "query": "anti-suit injunction",
  "ts": "2025-10-16T10:47:32",
  "ok": true
}