{
  "title": "GONG BENHAI V. HONG KONG INTERNATIONAL ARBITRATION CENTRE | [2014] HKCFI 737 | HKLII",
  "court": null,
  "year": 2014,
  "date": "0105-10-17",
  "content": "HKLII Databases Court of First Instance [2014] HKCFI 737 GONG BENHAI V. HONG KONG INTERNATIONAL ARBITRATION CENTRE Judgment Information Date 27 Apr, 2014 Action No. HCMP325/2014 Neutral Cit. [2014] HKCFI 737 Parallel Cit. [2015] 2 HKLRD 537 [2015] 2 HKLRD 530 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCMP325/2014 HCMP325X/2014 GONG BENHAI v. HONG KONG INTERNATIONAL ARBITRATION CENTRE [English Translation – 英譯本] HCMP 325/2014 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE MISCELLANEOUS PROCEEDINGS NO 325 OF 2014 ________________ BETWEEN GONG BENHAI （宮本海） Plaintiff and HONG KONG INTERNATIONAL ARBITRATION CENTRE （香港國際仲裁中心） Defendant ________________ Before: Hon Mimmie Chan J in Chambers (Open to the Public) Date of Hearing: 18 March 2014 Date of Reasons for Decision: 28 April 2014 REASONS FOR DECISION Background 1. This is an application made by the Hong Kong International Arbitration Centre (“HKIAC”), the defendant named in these proceedings, to strike out the claims made against it by the plaintiff, Mr Gong. 2. The plaintiff and Dandong Tyre Factory (“ Factory ”) entered into an arbitration agreement in writing on 30 August 2012 (“ Arbitration Agreement ”), whereby they agreed to arbitrate their dispute. The Arbitration Agreement provides for the place of arbitration to be Hong Kong, and HKIAC to be the arbitration institution. Under the Arbitration Agreement, the plaintiff and the Factory expressly agreed that the arbitral tribunal shall consist of three arbitrators, and that they would follow the arbitration rules of the HKIAC. 3. On 28 September 2012, the plaintiff commenced arbitration proceedings against the Factory under case reference number HKIAC/A 12190 (“ Arbitration ”). In accordance with the Arbitration Agreement, the Arbitration is governed by the 2008 HKIAC Administered Arbitration Rules (“ 2008 Rules ”). The arbitral tribunal was set up by HKIAC on 7 February 2013, consisting of Mr Cheung Kwok-kit (“ Cheung ”) as the presiding arbitrator, Mr Raymond Ho (“ Ho ”) as the arbitrator appointed for the plaintiff, and Mr An Hongqi as the arbitrator appointed for the Factory (“ Tribunal ”). 4. In July 2013, the plaintiff applied to the Tribunal, seeking disclosure to be made by the Factory of the “Repayment Statement of the Capital Raised from Employees” (“ Statement ”). The application was granted by the Tribunal, but in ordering such disclosure, the Tribunal permitted the Factory, at its request, not to disclose some parts of the information contained in the photocopy of the Statement to be provided to the plaintiff before the hearing of the Arbitration (“ Partial Disclosure Decision ”). The Factory claimed that those redacted or withheld information contained personal or confidential financial information of its employees or other personnel. 5. The plaintiff objected to the Partial Disclosure Decision. In August 2013, he challenged the arbitrators of the Tribunal and asked for Cheung and Ho to be replaced (“ Challenge ”) on the ground that they were not impartial and were unfair. By letter dated 5 August 2013, the Tribunal notified the plaintiff that there was no basis for him to challenge the constitution of the Tribunal, and that the arbitrators would not be replaced. The Tribunal referred the plaintiff to the provisions of article 11.7 of the 2008 Rules, which provides: “If the arbitrator being challenged does not withdraw, the HKIAC Council shall decide on the challenge. The challenge shall be dealt with in accordance with the Hong Kong International Arbitration Centre Challenge Rules.” 6. The HKIAC Challenge Rules (“ Challenge Rules ”) provide under Articles 2, 3 and 8 as follows: “ 2. The Council of the HKIAC (“the Council”) shall determine a challenge. In order to come to its determination, the Council may appoint a sub-committee of no more than three persons to oversee procedural matters, to consider the evidence and submissions made in respect of that evidence and to make recommendations to the Council in coming to its determination. 3. (a) A challenge and accompanying documents shall be addressed to the Secretariat of the [Hong Kong] International Arbitration Centre… (b) A challenge shall be accompanied by … a sum of HK$50,000 as a non-refundable registration fee on account of the [Hong Kong] International Arbitration Centre’s fees and expenses… 8. [The] Council’s determination in respect of any challenge shall be given to the parties in writing. The Council may in its sole discretion decide whether to support such determination with reasons.” 7. On 27 August 2013, the Council of HKIAC (“ Council ”) assigned a sub-committee to deal with the plaintiff’s Challenge, and after receiving a report from the sub-committee, the Council rejected the Challenge (“ Challenge Decision ”). On 24 December 2013, the Challenge Decision was served on the plaintiff, the Factory and the three arbitrators of the Tribunal. 8. On 14 February 2014, the plaintiff issued an originating summons in HCMP 325/2014, whereby HKIAC was named as the sole defendant. According to his affirmation made on an unspecified day in February 2014, the plaintiff sought the following relief from the court by way of “appeal”: (1) dismissal of the defendant’s decision on the replacement of Cheung and Ho as arbitrators and their withdrawal; (2) an order that HKIAC should reconsider the Challenge and to provide reasons for its decision on the ground that the procedure of the Challenge was illegal; (3) an order that HKIAC should forthwith stop the Tribunal from continuing to deal with the case and should replace the two substandard arbitrators; (4) dismissal of the decision for payment of so-called reasonable costs to the two arbitrators and an order that HKIAC or the arbitrators should bear the fees of the Challenge in the sum of HK$50,000; (5) an order that the HKIAC should bear the costs of the litigation, including the plaintiff’s costs of accommodation and travel. In his affirmation, the plaintiff stated that he sought HKIAC to “assume legal liability”, and sought leave to appeal on points of law. 9. On 11 March 2014, HKIAC applied by summons for dismissal of the plaintiff’s originating summons under Order 18 rule 19 and the inherent jurisdiction of the court on the ground that it had disclosed no reasonable cause of action, was frivolous, and/or was an abuse of the process of the court. The applicable law 10. Under section 12 of the Arbitration Ordinance of the Laws of Hong Kong (“ Ordinance ”), which adopts Article 5 of the UNCITRAL Model Law (“ Model Law ”), the court shall not intervene in matters governed by the Model Law and the Ordinance, except where so provided by the Model Law and the Ordinance. Section 3 of the Ordinance also expressly provides that one of principles underlying the Ordinance is that the court should interfere in the arbitration of the dispute only as expressly provided for in the Ordinance. 11. The Ordinance applies to an arbitration under an arbitration agreement, whether or not the agreement is entered into in Hong Kong, if the place of arbitration is in Hong Kong (section 5 of the Ordinance). The Ordinance clearly applies to the Arbitration in this case as the Arbitration Agreement provides for the place of the Arbitration to be in Hong Kong. 12. The plaintiff’s claims that he only agrees to be bound by the 2008 Rules and that the Ordinance and the Model Law have no application to the Arbitration or the Challenge are wholly misconceived. Ignorance of the law is no excuse. HKIAC is not under any duty to give legal advice to the plaintiff or to refer the plaintiff to all the relevant and applicable provisions of the law. 13. Section 26(1) of the Ordinance applies Article 13 of the Model Law to the procedure for the challenge of an arbitrator. Article 13 provides: “ (1) The parties are free to agree on a procedure for challenging an arbitrator, subject to the provisions of paragraph (3) of this article. (2) Failing such agreement, a party who intends to challenge an arbitrator shall, within 15 days after becoming aware of the constitution of the arbitral tribunal or after becoming aware of any circumstance referred to in article 12(2), send a written statement of the reasons for the challenge to the arbitral tribunal. Unless the challenged arbitrator withdraws from his office or the other party agrees to the challenge, the arbitral tribunal shall decide on the challenge. (3) If a challenge under any procedure agreed upon by the parties or under the procedure of paragraph (2) of this article is not successful, the challenging party may request, within thirty days after having received notice of the decision rejecting the challenge, the court or other authority specified in article 6 to decide on the challenge, which decision shall be subject to no appeal; while such a request is pending, the arbitral tribunal, including the challenged arbitrator, may continue the arbitral proceedings and make an award.” 14. Article 12 of the Model Law has effect by virtue of section 25 of the Ordinance, and it sets out the grounds for challenge of an arbitrator. Article 12(2) provides that an arbitrator may be challenged “only if circumstances exist that give rise to justifiable doubts as to his impartiality or independence, or if he does not possess qualifications agreed to by the parties”. Whether proper application made for court’s decision on the Challenge 15. As counsel for HKIAC has pointed out, the plaintiff and the Factory agreed on the procedure set out in the 2008 Rules, ie the Challenge Rules, for challenging the arbitrators. The Challenge was not successful as the Tribunal and the Council rejected it. Under Article 13(3) of the Model Law, the proper way for any further challenge is for a request to be made by application to the court within 30 days upon the plaintiff’s receipt of notice of the Council’s decision of rejecting his Challenge. The Challenge Decision concerned was made on 23 December 2013. Hence, even accepting the plaintiff’s claim that he only received the Challenge Decision on 26 December 2013, the 30 days specified under Article 13(3) had expired on 25 January 2014. 16. Since the court should interfere in the arbitration of a dispute only as expressly provided for in the Ordinance and the Model Law, and parties to a dispute should be free to agree on how their dispute should be resolved, the court should not interfere and decide on a challenge if the conditions set out in Article 13(3) are not complied with, including the condition for request to the court to be made within the specified period of 30 days. 17. Even if the originating summons issued on 12 February 2014 is to be treated as the plaintiff’s request to the court for a decision on the Challenge within the meaning of Article 13(3), his application is out of time and he should be barred from seeking the relief he claims from the court. 18. Moreover, even if I were to accede to the plaintiff’s application to deal with his claim out of time, I agree with counsel for HKIAC that the plaintiff’s application by originating summons in these proceedings has not been properly constituted. The application and request for the court’s decision on the Challenge under Article 13(3) should be made in the context of and by reference to the Arbitration between the plaintiff and the Factory. The Factory should be the proper defendant and indeed a necessary party to the proceedings. Order 73 rule 5 of the Rules of the High Court provides for the procedure relating to a request for the court to decide on a challenge to an arbitrator under section 26(1) of the Ordinance, and states that the originating summons must be served on the arbitrator in question, the arbitral tribunal and all the other parties to the arbitral proceedings. Nevertheless, neither the arbitrators of the Tribunal nor the Factory have been named in these proceedings, and none of them have been served with the originating summons. In respect of the Challenge and of the Arbitration, HKIAC is not a proper party, and the plaintiff has no cause of action against the HKIAC to require it to “assume legal liability”. Basis of the plaintiff’s complaints 19. There is in fact no substance in any of the plaintiff’s claims for relief. 20. The plaintiff accepts that he is bound by the 2008 Rules. Article 11.7 of the 2008 Rules provides that the Challenge shall be dealt with in accordance with the Challenge Rules. The HKIAC has referred to paragraph 8 of the Challenge Rules, which provides that the Council may in its sole discretion decide whether to support its determination with reasons. Hence, the plaintiff has no basis to seek the order, which he seeks under paragraph 8(2) above, that HKIAC as defendant should supply reasons for the Challenge Decision. 21. Under Article 13(3) of the Model Law, even when a proper request has been made to the court to seek a decision on a party’s challenge to an arbitrator, the arbitral tribunal including the challenged arbitrator may continue the arbitral proceedings and make an award. Even if the plaintiff should be accepted as having made a valid and proper request under Article 13(3), there is no basis or justification for the court to order HKIAC as defendant to stop the Tribunal from dealing with and continuing the Arbitration, as sought by the plaintiff under paragraph 8(3) above. 22. For the sake of completeness, even if the court should entertain the plaintiff’s request to decide on the Challenge, I consider that the plaintiff has not made out any case for the Challenge and replacing Kwok and Cheung. 23. In support of his claim that Cheung and Ho should be replaced, the plaintiff sought to argue the merits of his application for disclosure of the Statement, and whether the Partial Disclosure Decision was properly or correctly made. It was based on Cheung and Ho being not impartial or independent, or being unfair or incompetent or unqualified that the plaintiff claimed that there was no basis for the Partial Disclosure Decision. The plaintiff’s Challenge appeared to be premised on the fact that the Partial Disclosure Decision was erroneous, based on unclear facts and for want of a clear legal basis. No other facts has been put forward by the plaintiff to support his claim that Cheung and Ho were biased, or had made the Partial Disclosure Decision in a manner or by a procedure that could be said to be unfair or lacking in independence. In other words, the plaintiff challenged the arbitrators simply because he was not satisfied with the Partial Disclosure Decision, and appeared to suggest that since the arbitrators had made the Partial Disclosure Decision, they were biased, or unfair, or lacked the qualifications to be arbitrators. 24. A challenge to the appointment of an arbitrator can only be on the specific grounds exhaustively set out in Article 12 of the Model Law: that there are justifiable doubts as to the arbitrator’s impartiality or independence, and that he does not have any of the qualifications required by the parties. The fact that the arbitrator may have made an error of fact or law in any decision is not a ground of challenge. On the evidence filed by the plaintiff, I can find no justifiable doubts as to the impartiality or independence of Cheung and Ho, nor any fact to support the plaintiff’s assertion that Cheung and Ho were unqualified. In respect of the allegation that Cheung and Ho had made the Partial Disclosure Decision erroneously or without basis, there is absolutely no fact in support other than the plaintiff’s claim. 25. Being bound by the Challenge Rules which set out the conditions and terms for any challenge to an arbitrator, including the payment of a non-refundable registration fee of HK$50,000, I see no basis whatsoever for the plaintiff’s claim that HKIAC or the arbitrators should bear such fee, or that the decision that the fee should be paid by the plaintiff should be set aside. Application of section 105 of the Ordinance 26. Finally, I accept the submission made by HKIAC that it is entitled to rely on section 105 of the Ordinance, which provides that a person who appoints an arbitral tribunal, or exercises or performs any of the function of an administrative nature in connection with arbitral proceedings, is liable in law for the consequences of its act or omission in the exercise or performance of that function only if it is proved that the act was done or omitted to be done dishonestly. There is no basis whatsoever to suggest that HKIAC was acting dishonestly in its determination of the Challenge. Whether leave to appeal is applicable 27. The plaintiff seeks leave to appeal against the decisions of HKIAC, and invokes section 6 of Schedule 2 of the Ordinance. Again, this is totally misconceived. The Arbitration Agreement does not adopt or apply Schedule 2 of the Ordinance. Nor is there any substantive award made by the Tribunal or HKIAC. None of the Challenge Decision or the HKIAC’s decisions concerning the payment of fees for the Challenge amounts to a final determination of the dispute under the Arbitration Agreement, from which an appeal may be made by leave of the court where Schedule 2 is adopted by the parties to an arbitration agreement. Orders 28. For all the above reasons, I granted HKIAC’s application for striking out and ordered the plaintiff to pay to HKIAC the costs which HKIAC sought, in the nominal sum of $2,873. (Mimmie Chan) Judge of the Court of First Instance High Court The Plaintiff, Gong Benhai, appeared in person Mr Adrian Lai, instructed by Mayer Brown JSM, for the Defendant Translated by the Judgment Translation Unit of the Judiciary and vetted by Mr P.Y. Lo, Barrister-at-law Look up this case on Lawcite Noteup",
  "length": 17842,
  "headers_seen": [
    "Background",
    "The applicable law",
    "Whether proper application made for court’s decision on the Challenge",
    "Basis of the plaintiff’s complaints",
    "Application of section 105 of the Ordinance",
    "Whether leave to appeal is applicable",
    "Orders"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2014/737",
  "query": "HKIAC",
  "ts": "2025-10-17T10:44:55",
  "ok": true
}