{
  "title": "LAU LAN YING V. TOP HILL CO AND ANOTHER | [2021] HKCFI 290 | HKLII",
  "court": null,
  "year": 2021,
  "date": "2025-10-02",
  "content": "HKLII Databases Court of First Instance [2021] HKCFI 290 LAU LAN YING V. TOP HILL CO AND ANOTHER Judgment Information Date 3 Feb, 2021 Action No. HCPI6/2020 Neutral Cit. [2021] HKCFI 290 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCPI6/2020 HCPI6/2020 LAU LAN YING v. TOP HILL CO AND ANOTHER HCPI 6/2020 [2021] HKCFI 290 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE PERSONAL INJURIES ACTION NO 6 OF 2020 ________________________ BETWEEN LAU LAN YING Plaintiff and TOP HILL COMPANY 1 st Defendant YICK HING CONSTRUCTION COMPANY LIMITED 2 nd Defendant and ASIA INSURANCE CO LTD Third Party ________________________ Before: Hon Marlene Ng J in Chambers Date of Hearing: 8 December 2020 Date of Handing Down Decision: 4 February 2021 ________________________ D E C I S I O N ________________________ I. INTRODUCTION 1. The 2 nd defendant (“ D2 ”) was the principal contractor of a construction site in respect of slope stabilisation works under a government slope maintenance project (ie Landslip Prevention and Mitigation Programme (Hong Kong Government’s Works Contract No GE2015/02), “ Works ”) at slope feature no 3NW-D/C106 in Ta Kwu Ling, Ping Che Road, New Territories (“ Slope ”). D2 subcontracted the Works to the 1 st defendant (“ D1 ”). 2. The plaintiff (“ P ”) claimed D1 employed her as a casual worker, and assigned her to carry out the Works on the Slope. P alleged that: (a) when the Works were nearly finished most areas of the Slope were fenced off leaving a concrete pathway on the Slope (“ Pathway ”); (b) her co-workers were instructed to dismantle the Pathway and to pave stairs thereat; (c) sand/rocks were left all over the Slope as her co-workers dismantled the Pathway; (d) she was instructed to clear some trash and working tools left on the Slope by her co-workers; (e) after finishing clearing some such trash and working tools on 22 November 2017 she slipped and fell on some sand/rocks causing her to suffer bodily injuries (“ Accident ”). 3. On 13 September 2019, P commenced DCEC2203/2019 against D1 and D2 (collectively, “ Ds ”) by filing an Application to claim employees’ compensation (“ EC ”). On 22 May 2020, D2 filed an Answer to P’s Application. 4. On 2 January 2020, P commenced the present action against Ds for loss/damages she suffered as a result of the Accident, which P claimed were caused by negligence, breach of contract of employment, and breach of statutory duties on the part of Ds and their servants, agents and/or employees. On the same day, P filed her Statement of Claim and Statement of Damages. On 18 May 2020, D2 filed its Defence disputing liability. 5. On 3 June 2020, D2 filed a summons under Order 16 rule 2 of the Rules of the High Court (“ RHC ”) (“ TPN Summons ”) for leave to issue/serve a third party notice against Asia Insurance Co, Ltd (“ TP ”). On 3 June 2020, D2 filed the affirmation of its sole director Yuen Chung Yuen Edward (“ Yuen ”) in support. On 26 June 2020, TP filed the affidavit of its Assistant Vice President – Claims Kwong May Yin Erin (“ Kwong ”) and the affirmation of a consultant of TP’s loss adjuster Integrity Adjusters Limited (“ Integrity ”) Lau Chun Fai (“ Lau ”) in opposition. On 2 July 2020, Master Grace Chan granted leave for D2 to issue/serve a third party notice against TP. 6. On 7 July 2020, D2 commenced third party proceedings by filing its Third Party Notice (“ TPN ”) against TP for “an indemnity in respect of all [P’s] claim arising out of and in connection with the Accident and the costs of this action or contribution to the extent as may be found by the Court to be just and equitable in respect of [P’s] claim as well as [D2’s] own costs in defending this action, having regard to [TP’s] responsibility for such damages and/or costs on the ground that [TP is] the insurer of [D2’s] employee compensation insurance”. The grounds of D2’s claims against TP were as follows: (a) D2 and D1 were respectively the principal contractor and sub-contractor of the Works at the Slope; (b) P was allegedly D1’s employee assigned to work on the Works on the date of the Accident and allegedly suffered the Accident; (c) D2 as principal contractor was responsible to pay compensation for work injuries suffered by its sub-contractor’s employees; (d) at the time of the Accident, D1 did not have any EC insurance policy coverage, but D2 was covered by EC policy no AMK/ECC/ 15-0804491 with TP (“ Policy ”) effective from 15 June 2015 to 31 October 2018; (e) on 27 November 2017 “[D2] notified [TP] the Accident and commenced the insurance claim of [P]”, and on 8 December 2017 TP acknowledged the notification; (f) since then D2 complied with TP’s request to submit information as regards the Accident, including inter alia reports to the Labour Department, medical reports, sick leave certificates and receipts, but TP through Integrity notified D2 by letter dated 30 April 2019 that policy liability under the Policy was repudiated and TP would no longer process P’s insurance claim. 7. On 8 July 2020, TP by its solicitors filed acknowledgment of service to give notice of intention to defend the TPN. On the same day, TP filed a summons (“ Stay Summons ”) to stay the third party proceedings in the present action for arbitration pursuant to section 20 (1) of the Arbitration Ordinance Cap 609 (“ AO ”) and Order 12 rule 8 of the RHC. 8. On 28 July 2020, this court granted directions for filing and serving/lodging affidavits and submissions for possible paper disposal of the Stay Summons. On 14 July 2020, TP filed Kwong’s 2 nd affidavit in support. On 27 August 2020, D2 filed Yuen’s 2 nd affirmation (“ Yuen 2 nd Aff ”) in opposition. On 24 September 2020, TP lodged written submissions of its counsel Mr D Leung with 38 authorities. On 28 September 2020, D2 lodged written submissions of its counsel Mr M Leung with 11 authorities. On 8 October 2010, TP lodged D3’s reply submissions with another 14 authorities. Given the abundance of authorities cited by counsel, paper disposal was inappropriate. On 15 October 2020, this court directed the parties to attend oral hearing on 8 December 2020 with 1.5 hours reserved to hear oral submissions on the Stay Summons (“ Hearing ”). 9. Shortly before the Hearing, Mr D Leung submitted 2 further authorities, thus growing the total number of authorities cited by counsel to 65. But it transpired from oral submissions at the Hearing that the points of dispute on the Stay Summons were quite narrow. II. POLICY AND REPUDIATION 10. Yuen believed D1 did not have insurance policy coverage to cover claims by its employees who were injured on duty, but Yuen accepted D2 as principal contractor was liable to cover P’s claims in the present action if she succeeded in proving inter alia she was employed by D1 to work on the Works at the Slope, D1/D2 were liable for her work injury, and the quantum of her loss/damages. Yuen said D2 purchased the Policy in discharge of its obligation under section 40 of the Employees’ Compensation Ordinance Cap 282 (“ ECO ”). 11. There was no dispute that: (a) TP issued the Policy on 5 August 2015; (b) the Insured under the Policy was D2 as principal contractor and all its sub-contractors and sub-sub-contractors (with exceptions not relevant here) engaged in the Works and collectively insured pursuant to section 40(1B) of the ECO; (c) by the Policy TP agreed to indemnify D2 in respect of liability arising from bodily injury or death of all employees of D2, its sub-contractors and its sub-sub-contractors of the Works from 15 June 2015 to 14 December 2017 (extended to 31 October 2018) subject to the terms and conditions of the Policy; (d) the Policy was valid and effective on the date of the Accident; (e) clause W204 of the Policy [1] applied to employees of D2’s sub- contractors; (f) D2 wrote to TP on 29 November 2017 enclosing Form 2 dated 27 November 2017 concerning the Accident as completed by D2; (g) on 8 December 2017, TP by letter acknowledged receipt of Form 2, and asked D2 to keep it informed of developments and to provide the documents listed in the attachment thereto; (h) correspondence ensued between D2 and TP in 2018-2019; (i) by Integrity’s letter on 30 April 2019, TP repudiated policy liability under the Policy, and declined to further process the insurance claim in relation to P’s alleged work injury as a result of the Accident on the basis that D2 had breached Claims Settlement Condition (b)(i) [2] of the Policy for failing to provide information requested in Integrity’s letter dated 26 February 2018 despite 6 reminders and Integrity’s further letter dated 7 January 2019; (j) the Policy contained an arbitration clause under General Condition (g) as follows (“ Clause ”): “ Arbitration. All differences arising out of this Policy shall be determined by arbitration in accordance with the prevailing Arbitration Ordinance . If the parties fail to agree upon the choice of the arbitrator, then the choice shall be referred to the chairman for the time being of the Hong Kong International Arbitration Centre. It is expressly stipulated that it shall be a condition precedent to any right of action or suit upon this Policy that an arbitration award shall be first obtained. If the Company shall disclaim liability to the Insured for any claim hereunder and such claim shall not within twelve (12) calendar months from the date of such disclaimer have been referred to arbitration under the provisions herein contained then the claim shall for all purposes be deemed to have been abandoned and shall not thereafter be recoverable hereunder.” 12. For the purpose of the Stay Summons, both D2 and TP were prepared to assume P was D1’s employee at the time of the Accident. 13. Kwong claimed D2 failed to provide necessary information to TP regarding the Accident despite reminders, which constituted breach of Claims Settlement Condition (b)(i) that justified TP’s repudiation or disclaimer of policy liability. Lau claimed (a) the requested documents were relevant to P’s Accident and also to insurance coverage to facilitate TP’s investigation of the insurance claim, and (b) he had been in contact with D2’s staff over the request for information and consequent reminders, so D2 was plainly aware of the risk of TP repudiating policy liability if it still failed to provide the requested documents/information. Lau and Kwong said that on 26 March and 3 April 2019 Integrity on TP’s instructions sent draft repudiation letter to D2 by email and by letter as last reminder/warning, but D2 still failed to comply, so on 30 April 2019 TP repudiated policy liability. 14. Yuen disagreed, and contended TP wrongly repudiated policy liability. D2 denied any breach of Claims Settlement Conditions (b)(i), and claimed that out of the 9 requests for information in Integrity’s letter dated 26 February 2018, (a) information had been furnished to TP for some requests, (b) some requests were not essential for evaluating legitimacy or merits of the insurance claim, and (c) some required no answer as they were unknown or inapplicable to D2. Yuen also claimed Integrity’s letter dated 26 February 2018 and the subsequent remainders “were not delivered properly to the attention of [D2]”, and even though D2 received Integrity’s letter dated 7 January 2019 it was confusing and did not enclose the earlier letter of 26 February 2018 and the reminders. 15. In September/October 2019, D2 sent Form 4 and Form 1 in DCEC2203/2019 for TP’s information/action, but TP maintained that since policy liability had been disclaimed or repudiated D2 should engage its own solicitors to deal with P’s EC claim. 16. Kwong claimed since TP repudiated policy liability on 30 April 2019, any difference/dispute between D2 and TP should have been referred to arbitration within 12 months thereafter pursuant to the Clause, but D2 failed to do so. Kwong claimed D2’s third party proceedings against TP should be stayed for arbitration, but as explained in the Yuen 2 nd Aff, D2 opposed the Stay Summons on 2 grounds: (a) the Clause only governed accrued “differences” under the Policy, but liability under the Policy would not accrue until liability owed to and quantum of damages payable to P (third party to the Policy) had been established, which to date had not been so established, so there were no “differences arising out of the Policy” as yet and the Clause was not engaged; (b) it would be unreasonable for the courts to uphold boilerplate arbitration clauses such as the Clause in the wide manner proposed by TP, and/or it would be contrary to public policy for the courts to allow insurers to abuse such clauses, which (i) were common to many types of insurance contracts of which the insured were members of the general public, and (ii) often incorporated a time limitation element, that would have the effect of skewing insurance contracts heavily in favour of insurers. III. SUMMARY OF TP’s AND D2’s CONTENTIONS 17. The essence of the Stay Summons was that (a) TP should not have been joined as third party in the present action because D2 was bound by the Clause to submit the subject matter of the third party proceedings to arbitration, and (b) TP’s view that D2 was contractually time-barred from doing so after 30 April 2020 would not have prevented a stay of the third party proceedings. 18. As seen in paragraph 11(j) above, D2 did not dispute the existence of the Clause in the Policy, but D2 argued as follows: (a) “Differences” arising out of the Policy would only accrue after (i) final liability to P is established and (ii) TP fulfils its statutory obligation to indemnify D2 by compensating P and then seeks recovery from D2, so “[there] are no differences or disputes between the parties at this juncture and it is not D2’s intention to argue TP’s disclaimer of liability in this action” (see paragraph 16(a) above, “ Difference Issue ”). (b) “[Since] the underlying action is rooted in the [ECO] …… D2 has a statutory right to join TP as a third-party: see section 25(1)(b) of the ECO” and “TP’s obligations to indemnify D2 and/or compensate P is statutory, not contractual: see sections 42-44 of the ECO”, so it would be unreasonable and against public policy to allow TP to rely on the Clause which was a boilerplate arbitration clause that included a time limitation element to stay legal proceedings in the wide manner proposed by TP (see paragraph 16(b) above, “ Policy Issue ”). 19. Although D2 disagreed it was time-barred in relation to arbitration under the Clause since it claimed that under an indemnity policy time would not start to run unless/until the existence and amount of liability to relevant third party(ies) had been established, it was the common stance of both counsel (but for different reasons) that the time-bar issue was not pertinent for the Stay Summons, especially as both D2 and TP accepted the existence of the Clause that was contractually binding on them. I next turn to the nature of the Clause. IV. NATURE OF THE CLAUSE 20. The Clause was an arbitration agreement within the meaning of sections 2 and 19 of the AO that give effect to Article 7 of the UNCITRAL Model Law (“ Model Law ”). The Clause provided “[all] differences arising out of this Policy shall be determined by arbitration in accordance with the prevailing [AO] ……”, so it required/compelled the parties to have their “differences” “arising out of this Policy” resolved by arbitration. [3] 21. Since the subject matter of the Clause being “[all] differences arising out of this Policy ……” related to the Difference Issue, I shall deal with this aspect in Part VI below, but suffice to state here I find there were arbitrable “differences” between TP and D2 “arising out of this Policy” within the meaning of the Clause. 22. The Clause went on to state “…… it shall be a condition precedent to any right of action or suit upon this Policy that an arbitration award shall be first obtained ……” I agree with Mr D Leung this showed the Clause was a Scott v Avery clause. As explained by Jones J in Guangdong Water Conservancy and Hydro Power Engineering Development Co Ltd v The Ming An Insurance Co (HK) Ltd , the construction of the Scott v Avery clause in the insurance policy that case (which provided that “…… the making of an Award shall be a condition precedent to any right of action against [the defendant insurer] ……”) “is perfectly plain with the result that I am quite satisfied that no right of action will accrue to the plaintiff unless and until the matter is referred to arbitration and an award is made”. [4] Mr M Leung’s answer to this was that (a) statutory rights can exist independently of arbitration agreements, and (b) Scott v Avery clauses do not override section 3 of the AO or the court’s power to uphold public interests vis-à-vis private agreement. I will return to these arguments when I discuss the Policy Issue in Part VII below, but suffice to state here I am not persuaded these arguments overcome the plain wording of the Clause and its Scott v Avery nature as explained above. 23. As Mr D Leung explained (and Mr M Leung did not dispute), under the doctrine of separability, the Clause, which was collateral/ ancillary to the Policy, would survive TP’s repudiation or disclaimer of policy liability and rejection of D2’s insurance claim concerning P’s claim for common law damages and P’s present action against Ds. [5] 24. I will deal with the time limitation element in the Clause in Part VIII below. The Clause provided that if TP shall disclaim liability to D2 for any claim under the Policy and such claim was not referred to arbitration within 12 calendar months from the date of such disclaimer, then “the claim shall for all purposes be deemed to have been abandoned and shall not thereafter be recoverable” under the Policy. Suffice to note here that it is generally permissible for parties to a contract (including a contract of insurance) to agree/adopt such “Centrocon” form [6] to shorten the limitation period. [7] V. STAY FOR ARBITRATION 25. Section 20(1) of the AO gives effect to Article 8 of the Model Law, which provides as follows: “(1) A court before which an action is brought in a matter which is the subject of an arbitration agreement shall , if a party so requests not later than when submitting his first statement on the substance of the dispute, refer the parties to arbitration unless it finds that the agreement is null and void, inoperative or incapable of being performed. (2) Where an election referred to in paragraph (1) of this article has been brought, arbitral proceedings may nevertheless be commenced or continued, and an award may be made, while the issue is pending before the court.” (my emphasis) Section 20(5) of the AO goes on to provide that “[if] the court refers the parties in an action to arbitration, it must make an order staying the legal proceedings in that action”. 26. In my view, section 20 of the AO provides for mandatory stay of legal proceedings in favour of arbitration where the action is the subject of (a) an arbitration agreement (b) which is not null and void, inoperative or incapable of being performed, and there is (c) a dispute/difference between the parties (d) that is within the ambit of the arbitration agreement. [8] 27. I need not deal with (a)-(b) above since there was no dispute there was an arbitration agreement between D2 and TP (ie the Clause), and the Clause was effective, operative and capable of being performed. In any event, (i) once the party seeking stay for arbitration has brought himself within section 20(1) of the AO, it is for the resisting party who contends the arbitration agreement is null and void, inoperative or incapable of being performed to establish so, [9] and standard of proof is a high one, [10] and (ii) the court should construe such bar to mandatory stay in Article 8 of the Model Law (and section 20(1) of the AO) narrowly. [11] D2 / Mr M Leung suggested only (c) above was in issue for the Stay Summons. I will deal with (c)-(d) above when I discuss the Difference Issue in Part VI below. 28. On the policy rationale for mandatory stay of proceedings for arbitration, as I have explained in Wing Bo Building Construction Company Limited v Discreet Limited , [12] “[where] the parties have expressly agreed to refer disputes or differences to be determined by arbitration, it is generally safe to assume that it is their intention to have such disputes or differences to be resolved only by arbitration”. Lord Hoffmann noted in Fiona Trust & Holding Corporation & ors v Privalov & ors that the English equivalent of section 20(1) of the AO “shows a recognition by Parliament that …… businessmen frequently do want the question of whether their contract was valid, or came into existence, or has become ineffective, submitted to arbitration and that the law should not place conceptual obstacles in their way”. [13] Likewise, Hong Kong courts have been rigorous in their application of the provision for mandatory stay in all but exceptional circumstances [14] as borne out in Chimbusco International Petroleum (Singapore) Pte Ltd v Fully Best Trading Ltd [15] (see also Fung Hing Chiu Cyril v Henry Wai & Co (a firm) [16] discussed in paragraph 120 below): “11. The modern trend of the courts is to uphold arbitration agreements, to facilitate arbitrations, and (save in circumstances necessary to safeguard due process and as allowed under the international Conventions) not to intervene in an arbitration, which is the parties’ free choice as to the method of dispute resolution, and the substantive law and forum to govern and oversee the arbitration. 12. As a matter of public policy , Hong Kong as a party to the New York Convention has the duty to comply with its duties under art.II of the Convention: to recognize and enforce an arbitration agreement and to stay actions before the Court in breach of a valid and subsisting arbitration agreement. Under s.20 of the [AO], a Court before which an action is brought in a matter which is the subject of an arbitration agreement ‘shall’ refer the parties to arbitration, unless the Court finds that the agreement is null and void, inoperative or incapable of being performed. The Court has the duty to stay an action in accordance with the arbitration agreement found to exist. …… 19. …… It should therefore be an exceptional case when a party seeks recourse from the court, instead of the arbitral tribunal, when there is an arbitration clause in an agreement between the parties.” (my emphasis) 29. Thus, once the party seeking a stay for arbitration has brought himself within section 20(1) of the AO, there are contractual (ie the parties’ intention to resolve their dispute/difference by arbitration) and public policy (ie Hong Kong’s convention obligations) considerations for giving effect to mandatory stay of proceedings unless there are exceptional reasons to show otherwise. Since the courts will give effect to the commercial purpose of arbitration agreements so far as the language used by the parties permits, the relevant question becomes “whether there is any conceptual reason why parties who have agreed to submit the question …… to arbitration should not be allowed to do so”. [17] VI. DIFFERENCE ISSUE 30. The Clause provided that “[all] differences arising out of this Policy shall be determined by arbitration ……” Was there any arbitrable “difference” between D2 and TP “arising out of” the Policy that would justify stay of the third party proceedings? (a) Construction of arbitration clause 31. An arbitrator derives jurisdiction from the parties’ arbitration agreement. As Mimmie Chan J explained in VK Holdings (HK) Limited v Panasonic Eco Solutions (Hong Kong) Company Limited (formerly known as Panasonic Ecology Systems Hong Kong Company Limited) , [18] “23. …… When the question arises as to whether a certain dispute falls within an arbitrator’s jurisdiction, the court’s task is to consider the dispute in question, to elicit from the arbitration agreement the parties’ intentions concerning the jurisdiction to be conferred on the arbitrator, and to decide whether the parties did, or did not, intend a dispute of the kind in question to be resolved by the arbitrator. Put succinctly by Viscount Simon LC in Heyman v Darwins (1942) 72 Ll L Rep 65, at p 67: ‘The answer to the question whether a dispute falls within an arbitration clause in the contract must depend on (a) what is the dispute and (b) what disputes the arbitration clause covers.’” 32. As Mimmie Chan J further explained in paragraphs 24-25 in VK Holdings (HK) Limited , the guiding principle on construction of document is to discover what a reasonable person will have understood the parties to mean, having regard not merely to the individual words used, but to the agreement as a whole, the factual and legal background against it was concluded, and the practical objects which it is intended to achieve, [19] thus “[each] arbitration clause must be construed in the context of the contract as a whole, and the meaning of a particular formula may be broader or narrower depending on the nature of the transaction, the circumstances in which the arbitration clause came into existence, and the other provisions of the contract ……” 33. In doing so, the court takes into account 3 matters. First, there is a prima facie assumption that contracting parties intend all disputes relating to a particular transaction to be resolved by the same tribunal, and by agreeing to arbitrate they have prima facie chosen arbitration as the appropriate tribunal. [20] 34. Secondly, as Mr D Leung submitted, arbitration clauses should be construed as broadly/liberally as possible because any doubts concerning the scope of arbitral issues should be resolved in favour of arbitration. In Fiona Trust & Holding Corporation & ors , Lord Hope held that English law takes the approach to construction of arbitration clauses that is firmly embedded as part of the law of international commerce, ie “that any doubt concerning the scope of arbitral issues should be resolved in favour of arbitration and that arbitration clauses should be construed as broadly as possible”. [21] 35. Thirdly, even though Jackson J in X Limited v Y Limited reminded himself that “[authorities] on the meaning of words or phrases in the context of other arbitration clauses or other contracts must be viewed with caution for the reasons explained by May LJ in Ashville Investments Ltd v Elmer Contractors Ltd [1989] QB 488 , 494-495”, the learned judge accepted that “[nevertheless], an earlier decision on the meaning of a particular form of words is persuasive. The strength of the persuasive force depends upon the extent of the similarity between the contract and the surrounding circumstances in (a) the earlier decision and (b) the instant case”. [22] (b) Stay for arbitration 36. There was no dispute that the onus is on the applicant for a stay (ie TP here) to show there is a prima facie or plainly arguable case that there is a dispute (or “difference” under the Policy here) between the parties, and an arbitrator ought to be appointed to arbitrate their dispute (or “difference”). [23] The proper threshold test is whether there is a prima facie or plainly arguable case because “if the judge were to go into the matter more deeply, he would in effect be usurping the function of the arbitrator”. [24] 37. As I have explained in Wing Bo Building Construction Co Ltd v Discreet Ltd , such test is satisfied “if the evidence is cogent and arguable and not dubious or fanciful …… Thus, unless the point is clear, the court should not attempt to resolve the issue and the matter should be stayed for arbitration as it is for the arbitral tribunal to rule on its own jurisdiction, including any objections with respect to the existence or validity of the arbitration agreement”. [25] After all, if the arbitral tribunal seizes jurisdiction in respect of the dispute (or difference), the aggrieved party can apply to the court to challenge the arbitral tribunal’s jurisdiction under section 34(1) of the AO (which gives effect to Article 16 of the Model Law) and Order 73 of the RHC. [26] Indeed, section 34(2)(b) of the AO provides that the power of the arbitral tribunal to rule on its own jurisdiction under section 34(1) of the AO includes the power to decide what matters have been submitted to arbitration in accordance with the arbitration agreement. In my view, “[the] above embodies the Komptenz-Komptenz (Competence-Competence) principle …… which dictates that an arbitral tribunal is deemed to be competent to rule on the matter of its own jurisdiction”. [27] (c) “In the same matter” 38. Further, as Mimmie Chan J explained in Polytec Overseas Ltd v Grand Dragon International Holdings Co Ltd , “[for] the stay to apply, the action before the court must be “in the same matter” that is the subject of the arbitration agreement, and not merely “related” to or “involved” in it …… In ascertaining the “matter”, [28] the court should consider the substance of the controversy as it appears from the circumstances and evidence, and not just the particular terms in which the claimant has sought to formulate its claim in court. The focus is on the dispute, and not the pleadings”. [29] In doing so, the court should undertake a practical and common-sense inquiry in relation to any reasonably substantial issue that is not merely peripheral or tangentially connected to the dispute in the court proceedings. The court should not characterise the “matter” in either an overly broad or an unduly narrow and pedantic manner. [30] (d) “Differences arising out of this Policy” 39. With the aforesaid principles in mind, I turn to the question of what “all differences” “arising out of this Policy” in the Clause would cover. These phrases have been considered to confer the widest possible jurisdiction and a wide meaning, and a dispute “arising out of” the contract has been held to cover every dispute except a dispute as to whether there was ever a contract at all. [31] 40. In light of Jackson J’s observations in X Limited discussed in paragraph 35 above, even though each arbitration clause should be considered in its own context, earlier decisions on the meaning of the particular form of words used may be persuasive depending on similarity in contract/circumstances between such earlier decisions and the instant case. On such basis, Mimmie Chan J in paragraphs 31-34 in VK Holdings (HK) Limited explained that it seems words of broad import, eg “all differences” and “arising out of”, are to be given the natural meaning in the context in which they are found. 41. Bearing in mind that broad terms were used in the Clause, and that the overriding objective in construction is to give effect to what a reasonable man rather than a pedantic lawyer would have understood the parties to mean, the words “all differences arising out of this Policy” in the Clause were capable of bearing a meaning that embraced any difference between D2 and TP other than one which did not in any way arise out of the insurance transaction covered by the Policy. In my view, such construction sat well with the authorities. 42. In Bernard Doyle v Irish National Insurance Company plc , [32] the plaintiff sought indemnity from the defendant motor insurer after he was involved in an accident which resulted in a claim against him for personal injuries. The defendant notified the plaintiff it was voiding the policy for non-disclosure of a material fact (ie traffic conviction) upon renewals of the policy, so the plaintiff sued for specific performance of the contract of insurance, and the defendant applied to stay the proceedings on foot of an arbitration clause pursuant to the Irish equivalent of section 20 of the AO. Kelly J at page 94 held as follows: “…… It is to be noted that it is words so as to cover ‘all differences arising out of this policy’. In Harbour Assurance Ltd v Kanza Ltd [1993] QB 701 , Hoffmann LJ (as he then was) was of the opinion that the words ‘all disputes or differences arising out of this agreement’ should be given their natural meaning so as to produce a sensible and businesslike result and as such the words were wide enough to cover the dispute. In Heyman the words ‘any dispute’ were said to be wide enough to cover the claim of repudiation. The use of the word ‘differences’ has been said by Mustill and Boyd (supra) to confer the widest possible jurisdiction . Similarly the phrase ‘arising out of’ has been given a wide meaning. It has been said these words cover every dispute except a dispute as to whether there was ever a contract at all ( per Pilcher J) in HE Daniels Ltd v Carmel Exporters and Importers Ltd [1952] 2 QB 242 . This phrase embraces the issue of non-disclosure, vide Stebbing v Liverpool & London & Globe Insurance Co Ltd [1917] 2 KB 433 . In the circumstances I was satisfied that the defendant was entitled to have this dispute referred to arbitration in accordance with condition 5 of the policy of insurance.” (my emphasis) 43. Kelly J in Bernard Doyle appeared to consider that in the context of an arbitration agreement in an insurance contract, repudiation of policy liability by the insurer and legal action for specific performance by the insured to enforce policy liability against the insurer (which, despite Mr M Leung’s submissions that it was not D2’s intention to argue TP’s disclaimer of policy liability in the third party proceedings, was in my view akin to the context herein as to the Clause, policy repudiation by TP, D2’s disagreement thereto, and D2’s third party proceedings against TP for indemnity/contribution on the ground that TP was D2’s EC insurer under the Policy, ie specific performance of the Policy for enforcement of policy liability against TP thereunder notwithstanding TP’s repudiation or disclaimer), the words “all differences” “arising out of this Policy” should be given a wide meaning, especially when May LJ in Amec Civil Engineering Ltd v Secretary of State for Transport considered the phrase “dispute or difference” (the latter being a failure to agree) to be less hard-edged than “dispute” alone. [33] 44. Mr D Leung next referred me to the arbitration clause in clause 10 of the EC policy in Paul Y – Construction Limited & ors v Golik Metal Industrial Company Limited & ors , which provided inter alia that “[all] differences arising out of this Policy shall be referred to the decision of an Arbitrator to be appointed in writing by the parties ……” [34] The insurer sued inter alia the main contractor for contribution in respect of damages paid by the insurer on behalf the main contractor and the sub-contractor (both of whom were covered by the policy) for an employee work injury. The main contractor said (but the insurer disagreed) it could not be sued by the insurer using its right of subrogation. Reyes J in paragraph 4 held “[nevertheless], the matter is a difference arising out of the arbitration agreement and therefore I have no discretion in this matter. Under the [AO] I must stay the matter to be determined by arbitration”. 45. In my view, whilst the “difference” in Paul Y – Construction Limited & ors was not the same as the “matter” in the third party proceedings here, it illustrates (a) how a “difference” would “arise” from an insurance contract, (b) the wide meaning given to an arbitration clause similar in wording to the Clause in a EC insurance context, and (c) the mandatory effect of the stay under section 20 of the AO. 46. Significantly, I bear in mind Kelly J in Bernard Doyle cited Heyman & anor v Darwins, Limited [35] held that the words “any dispute” were wide enough to cover a claim of repudiation (see paragraph 42 above). In Heyman & anor , Lord Wright at pages 379 and 384 drew a distinction between repudiating the contract and repudiating liability under it, citing Macaura v Northern Assurance Co Ltd [36] (that concerned repudiation of policy liability under an insurance policy) which explained that the insurer in repudiating policy liability “do not repudiate the policy or dispute its validity as a contract; on the contrary they rely on it and say that according to its terms, express and implied, they are relieved from liability”. Viscount Simon LC in Heyman & anor went on to explain as follows: “…… [The respondents] admit the contract, and deny that they have repudiated it. Whether they have, or have not, is one of the disputes arising out of the agreement. ……” (page 362) “…… But, in a situation where the parties are at one in asserting that they entered into a binding contract, but a difference has arisen between them whether there has been a breach by one side or the other, or whether circumstances have arisen which have discharged one or both parties from further performance, such differences should be regarded as differences which have arisen ‘in respect of,’ or ‘with regard to,’ or ‘under’ the contract, and an arbitration clause which uses these, or similar, expressions should be construed accordingly. ……” (page 366) 47. I agree with Mr D Leung that there was a present and existing “difference” between TP and D2. TP repudiated or disclaimed policy liability under the Policy, and D2 sought indemnity/contribution from TP for D2’s liability to P and for D2’s legal costs incurred as a result of the Accident on the ground that TP was D2’s EC insurer under the Policy. In short, TP repudiated policy liability by Integrity’s letter dated 30 April 2019, but D2 disputed TP’s stance and continued to pursue policy coverage over P’s claim against Ds in relation to the Accident: (a) On 6 May 2019, D2 sent letter to Integrity concerning P’s EC claim in relation to the Accident to give the results of D2’s investigation into Integrity’s allegation that D2 failed to provide information to TP regarding the Accident, ie D2 concluded such allegation was “just due to the inadequate communication”. In my view, it appeared from such letter that D2 did not accept TP’s repudiation or disclaimer of policy liability because D2 went on to state in such letter “[D2] shall provide [Integrity/TP] with the requested information as soon as possible” and “formal letter for [D2’s project director’s] attention or the attention of [D2’s] [Yuen] could be used for future communication to prevent recurrence”. (b) On 8 May 2019, Integrity emailed D2 responding to D2’s investigation findings, and confirming all along it had adequate communication with D2 “by e-mail, phone or in formal writing”. (c) On 2 July 2019, Integrity for TP wrote to D2 confirming TP’s “decision of repudiating policy liability is final”, and asking D2 to handle DCEC2203/2019 at D2’s own expense. (d) On 21 September 2019, D2 emailed TP enclosing Forms 1 and 4 of DCEC2203/2019 “for [TP’s] information”. (e) On 24 September 2019, TP emailed D2 reiterating its “policy liability has been repudiated and [D2 is] advised to handle the matter at [D2’s] own discretion”, advising D2 to appoint solicitors to handle the matter, and asking to be notified of such appointment given TP’s liability under the ECO. (f) On 30 September and 2 October 2019, P’s solicitors in DCEC2203/ 2019 wrote to TP notifying them of the first hearing in the District Court and enclosing P’s medical report. (g) On 10 October 2019, TP wrote to D2 reiterating Ds were in breach of policy conditions and TP had repudiated policy liability to indemnify Ds for any claim as a result of the Accident, and enclosing the letters in (f) above for D2’s handling. TP also advised D2 to appoint solicitors to handle the matter, and to notify TP of such appointment in view of TP’s liability under the ECO. (h) On 7 July 2020, D2 filed the TPN to claim against TP for indemnity/ contribution in respect of P’s claim arising out of or in connection with the Accident, costs of the present action and D2’s own costs in defending the present action having regard to TP’s liability therefor on the ground that TP was the insurer of D2’s EC insurance. (i) On 8 July 2020, TP filed acknowledgment of service indicating TP’s intention to contest the jurisdiction of the Court of First Instance and TP’s unwillingness to make any admission. 48. In view of the legal principles on construction of arbitration clauses discussed above, I find the “matter” in the above paragraph clearly demonstrated there was in substance a “difference” between TP and D2 that arose out of the Policy and that fell squarely within the ambit of the Clause in that D2’s claim for indemnity/contribution from TP after 30 April 2019 and/or after commencement of the third party proceedings (on the basis that TP was D2’s EC insurer liable under the Policy for such indemnity/contribution) was disputed by TP (on the basis that TP had repudiated or disclaimed policy liability for such insurance claim by D2 in relation to P’s Accident). 49. Next, I find the fact that the “action” before the court was D2’s third party proceedings against TP for indemnity/contribution would not have affected the analysis. In Chevalier (Construction) Company Limited v Universal Aluminum Industries Limited , [37] the principal contractor terminated the sub-contractor’s sub-contract, but agreed to make direct payment of wages to the sub-contractor’s employees to be set off against any payments found due to the sub-contractor. The principal contractor sued the sub-contractor for recovery of payment of wages made, but the latter said it had a substantial claim against the former under the sub-contract. 50. DHCJ Seagroatt held that although the principal contractor’s payment of wages to its sub-contractor’s employees was to satisfy its obligations under the Employment Ordinance Cap 57 (“ EO ”), this liability involved a dispute arising out of the sub-contract since the sub-contractor alleged it was unable to pay wages to its employees as a result of the principal contractor not paying what was due to it under the sub-contract. As the arbitration clause was “distinct, all embracing and excludes no form or subject matter of dispute”, and the claim based on statutory payment was but one aspect of the dispute between the parties under the sub-contract, a stay was appropriate (paragraph 24). Significantly, DHCJ Seagroatt in paragraph 21 observed “[a] defendant in [a personal injury] action may allege contributory negligence on the part of a plaintiff, or bring in a third party on a contribution notice, relying on the Civil Liability Contribution Ordinance …… Their actions are not thereby statutory claims”. 51. Likewise, Ocean Park Corporation v Proud Sky Company Limited, Martinair Holland BV & anor (third parties) concerned an application by the 2 nd third party to stay the third party action by the defendant who claimed that should it be held liable to the plaintiff in the main action, the 2 nd third party would be liable to it pursuant to the provisions in the Civil Liability (Contribution) Ordinance Cap 377 (“ CLCO ”). Stone J said obiter that: “66. …… I cannot see that because the defendant may be found to possess a statutory right of contribution from [the 2 nd third party] in itself suffices to place the situation outwith the rubric of the term ‘All disputes’, which are the opening words of [the arbitration clause]; thus if the alleged joint and/or several liability of [the 2 nd third party] indeed is disputed, as would necessarily be the case – in fact, under the terms of [the arbitration clause] ‘a dispute shall exist whenever any of the parties declares this to be so’ – the fact that the relevant cause of action which underpins a claim for contribution by [the defendant] is of statutory and not contractual origin does not seem to be to make a material difference in terms of the stay argument. 67. Accordingly, if and in so far as this latter point taken by Mr Wright were to be ‘live’, which in my view it is not, I should have held against him on this argument.” 52. Thus, it appeared (as Mr D Leung submitted) that the fact a “dispute”/“difference” arises in separate action or third party proceedings for indemnity/contribution rather than in the main action between, say, the victim and the tortfeasor would not have affected the analysis. In Wealands (widow and administratrix of the estate of Wealands (decd)) v CLC Contractors Ltd (Key Scaffolding Ltd & anor, third parties) , [38] Mance LJ held that “[if] (as the defendant, in the present forensic context, submits) an arbitrator appointed under [the arbitration clause] would lack the power to award contribution, that is the consequence of the parties having agreed to submit their disputes to arbitration. It is not a reason for refusing a stay. Nor does it provide any basis for treating one aspect of their dispute, that involving any claim for contribution which the defendant wishes to pursue, as falling outside the scope of the arbitration clause or reserved to the court”. 53. But D2 / Mr M Leung argued there was no “difference” “arising out of the Policy” unless and until D2’s liability to P and the quantum of damages payable by D2 to P were established, but neither had been established yet. 54. It was said that D2 by purchasing the Policy complied with its obligation under section 40 of the ECO to take out insurance cover in respect of liability for EC and common law damages for work injury by employees (including those of its sub-contractor D1): “(1) Subject to subsections (1B) and (1C), no employer shall employ any employee in any employment unless there is in force in relation to such employee a policy of insurance issued by an insurer for an amount not less than the applicable amount specified in the Fourth Schedule in respect of the liability of the employer. …… (1B) A principal contractor who has undertaken to perform any construction work may, in compliance with subsection (1), take out a policy of insurance issued by an insurer of an amount not less than the amount specified in the Fourth Schedule in relation to a principal contractor in respect of the liability of the principal contractor and the liability of his sub-contractor. …… (1E) For the avoidance of doubt, it is declared that – …… (d) where a principal contractor has taken out a policy of insurance under subsection (1B), the principal contractor and a sub-contractor insured under the policy shall be regarded as having complied with subsection (1); …… (1F) The reference in this section to the liability of a person is a reference to the liability of the person under this Ordinance and independently of this Ordinance for any injury to his employee by accident arising out of and in the course of the employee’s employment. ……” 55. It was further said that since TP disclaimed policy liability in respect of P’s work injury, the effect of sections 43(1) and 44(3)(c) of the ECO was to make TP directly liable to compensate P (ie D1’s employee) in full notwithstanding anything in the Policy. Sections 42-44 of the ECO provide as follows: “42.(1) Notwithstanding anything in a policy of insurance issued for the purposes of this Part, an insurer is liable, in a proceeding under section 36LA or 44, for the amount of the liability of the employer not exceeding the available amount covered by the policy of insurance. (1A) For the avoidance of doubt, it is declared that an insurer is liable, in a proceeding under section 36LA or 44, for the amount of the liability of the employer not exceeding the available amount covered by the policy of insurance issued for the purposes of this Part notwithstanding the obligation imposed upon the employer by section 40 to insure for an amount in excess of the amount insured. …… (3) Where under this Part an amount is paid by the insurer which would, but for this section, not be payable under the policy of insurance, the employer is liable to pay that amount to the insurer. 43.(1) Subject to this section, where in relation to an employee there is in force a policy of insurance issued for the purposes of this Part and the employer of the employee becomes liable to pay any sum under this Ordinance or independently of this Ordinance in respect of an injury to the employee arising out of and in the course of his employment, such sum shall forthwith become due and payable by the insurer, including any sum payable in respect of interest and costs, notwithstanding anything to the contrary in the policy of insurance. (2) No sum shall be payable by an insurer under this section – …… (b) unless, in the case of compensation or damages determined or adjudged by a court or tribunal to be payable to the employee or any other person, the insurer had sufficient notice of the institution in the court or tribunal of proceedings for compensation or damages, as the case may be, to enable such insurer to be added as a party to the proceedings; …… (3) If sufficient notice of the institution of proceedings for the recovery of compensation or damages is given to an insurer to enable such insurer to apply to be added as a party to the proceedings, the court or tribunal, as the case may be, shall, on such application being made, add the insurer as a party and the insurer shall have the same right to defend the proceedings as if such insurer were the employer. (4) Where under this Part an amount is paid by the insurer which would, but for this section, not be payable under the policy of insurance, the employer is liable to pay that amount to the insurer. 44.(1) Every policy of insurance issued for the purposes of this Part shall be deemed to provide that any employee or other person having a claim against the person insured in respect of the liability in regard to which such policy was issued shall, subject to section 42, be entitled to recover in his own name, as though he were a party to the policy, directly from the insurer any amount which he would have been entitled to recover from the person insured. (2) An employee or other person having a claim against the person insured under a policy of insurance issued for the purposes of this Part shall not commence proceedings against the insurer unless he also commences or has commenced proceedings against the person insured. (3) Notwithstanding subsection (2), where an employee or other person having a claim against the person insured has reasonable grounds to be satisfied that – (a) the person insured cannot be readily located in Hong Kong; (b) the person insured is insolvent; or (c) the insurer has disclaimed liability under the policy of insurance, he may take proceedings against the insurer without taking or having taken proceedings against the person insured.” 56. Mr M Leung suggested that since an EC insurer is statutorily liable to compensate its sub-contractor’s injured employee, there was no “difference” between TP (EC insurer) and D2 (sub-contractor) because “TP need not unequivocally admit liability or quantum to dissipate the dispute. It is only when the insurer seeks recovery from D2 – and if D2 does not admit liability – that a genuine dispute arises”. It was further suggested that pragmatically speaking there was no genuine dispute before P’s claim reaches finality and before TP attempts to recover “compensation” it has paid to P, so D2 had no present “difference” to submit to arbitration. 57. I am unable to accept such arguments. First, such arguments rested on an unsound premise. Quite simply, there is no requirement for a sub-contractor’s injured employee to seek or first seek compensation from the principal contractor’s EC insurer (even though the EC policy covered the sub-contractor as the insured). Under section 44(3)(c) of the ECO, the injured employee “may” and not must take proceedings against the insurer without suing the insured sub-contractor / employer. Here, P (ie the injured employee) commenced the present action against Ds (ie the insured and not the EC insurer under the Policy). Further, if P were to succeed in her claim in the main action against D1 and/or D2, she could has executed any award of damages and costs in her favour against D1 and/or D2 without first demanding/suing TP to pay under section 43 of the ECO. 58. Secondly, the right of action conferred on P under sections 42-44 of the ECO (as explained in the above paragraph) (a) if disputed by TP would be a “difference”/“dispute” between P and TP (but P did not join TP as a defendant in the main action and TP did not apply to join the main action as an additional defendant), and (b) was in any event irrelevant to the “difference” between D2 and TP being their disagreement over D2’s insistence on policy coverage and TP’s disclaimer of policy liability explained in paragraphs 43 and 47-48 above. I agree with Mr D Leung that stay of the “difference” in (b) above would not bar any proceedings in (a) above. Petroleo Brasiliero SA v Mellitus Shipping Inc & ors demonstrates there could be ongoing proceedings in the main action and in the third/fourth party actions for contribution/indemnity even though one of the third party claims was stayed for arbitration, ie the stay would not debar the other proceedings. [39] 59. Thirdly, I am unable to accept Mr M Leung’s argument that since “it is trite law that liability under an indemnity policy does not accrue unless and until the existence and amount of the liability to relevant third parties (P in this case) has first been established …… [it] follows that no dispute can arise between the insured and insurer unless and until the liability to the claimant has been established ……” 60. In making such submissions, Mr M Leung strongly relied on William McIlroy (Swindon) Ltd & ors v Quinn Insurance Ltd , [40] which case therefore required more detailed scrutiny. In that case, a fire broke out in R’s shop (which together with 2 residential flats were leased to WM) and spread to other properties. The shop was occupied by WM’s associated company MS, and works were done at the shop for MS by L being CWO’s sub-contractor. L was insured under a public liability policy issued by Q. L contended the fire was not their fault, and their brokers duly notified Q when the fire took place. After some delay, Q disclaimed policy liability. In the meantime, R and the neighbouring occupiers sued WM, MS, CWO and L. WM, MS and CWO defended the action and brought third party action against L. L and Q were kept informed of progress of the litigation, but did not participate in the same. Default judgment was entered against L by R and by WM, MS and CWO. Claims in the main action were settled, which the judge held to be reasonable, and damages were assessed against L in respect of the claims by R and by WM, MS and CWO. L was unable to satisfy those judgments, and was wound up. L’s rights against Q were then vested in those claimants, so WM, MS and CWO as well as R sued Q, who raised a new ground for non-payment, ie L should have instituted arbitration proceedings within 9 months of the date on which Q communicated disclaimer of policy liability to L pursuant to the arbitration clause in the policy, but as more than 9 months had elapsed between that date and the issuance of proceedings, the actions were time-barred. This issue was tried as a preliminary issue, and it was held on appeal that the actions were promptly commenced within such 9-month period, so it was wrong to say L’s rights under the policy had been extinguished by such arbitration clause when the actions were issued. 61. Sir Henry Brooke said as follows at page 245: “[12] It is trite law that liability under an indemnity policy does not accrue unless and until the existence and amount of the liability to relevant third parties has first been established, whether by a judgment or by an arbitration award or by agreement: see Post Office v Norwich Union Fire Insurance Society Ltd [1967] 1 All ER 577 at 579-580, [1967] 2 QB 363 at 373-374 per Lord Denning and Bradley v Eagle Star Insurance Co Ltd [1989] 1 All ER 961 at 965, [1989] AC 957 at 966 per Lord Brandon of Oakbrook. [13] It follows that no dispute could have arisen between [L] and [Q] on [Q’s] liability under the public liability section of the policy, whether in respect of a claim or the amount to be paid, unless and until [L’s] liability to the present claimants had been established by the judgments on the assessment of damages which Ramsey J directed to be entered in December 2009 and January 2010 respectively …… The present actions were commenced well within the nine-month period after December 2009 or January 2010 which is stipulated by [the arbitration clause], and [Q] takes no point on the fact that court proceedings, as opposed to arbitration proceedings, were initiated in order to enforce these claims .” (my emphasis) 62. I am unable to see how the above observations would aid Mr M Leung’s contention when Sir Henry Booke made clear that no point was taken in William McIlroy (Swindon) Ltd & ors that court proceedings, as opposed to arbitration proceedings, were initiated to enforce the claims by WM, MS and CWO and by R, but here by the Stay Summons TP took the point that D2 should have taken arbitration proceedings instead of court proceedings (ie the third party proceedings). 63. Mr M Leung then directed my attention to Rix LJ’s obiter observations at page 249 as follows: “[31] If …… an insured was obliged by [the arbitration clause] to arbitrate, at pain of losing all remedy after nine months of such a dispute arising, then an insured would be forced to arbitrate even at a time when there might be no third party claim in the offing at all, indeed not even an incident which might in due course give rise to a third party claim. This might all be years before any third party claim might be intimated, let alone brought to court, let alone adjudicated and quantified. Although an arbitration brought in such circumstances might I suppose be stayed by agreement, this is a highly inefficient dispute resolution mechanism. It would be an unfortunately one-sided clause, for there is no provision to time-bar the insurer’s assertion of its right to repudiate his policy.” 64. Again, I reiterate paragraph 62 above and find these obiter observations are not persuasive here. As Rix LJ went on to observe at page 249, “[it] is necessary to consider the wording of the arbitration agreement more carefully”. The critical wording of the arbitration clause in that case provided that: [41] “ Any dispute between the Insured and the Company on our liability in respect of a claim or the amount to be paid shall, in default of agreement, be referred within nine months of the dispute arising, to an Arbitrator …… and the decision of the arbitrator shall be final and binding on both parties …… If the dispute has not been referred to arbitration within the aforesaid nine-month period, then the claim shall be deemed to have been abandoned and not recoverable thereafter.” (my emphasis) 65. Rix LJ explained the effect of such provision at pages 249-250 and 252-253 as follows: “[34] The first and most important matter to observe is that it only operates in respect of a ‘dispute … on our liability in respect of a claim or the mount to be paid’ (my emphasis). What is that claim? Is it the third party’s claim, or is it the insured claim’s under the policy? Plainly, it is the latter. For the condition goes on to refer to such a claim being “deemed to have been abandoned and not recoverable thereafter’, and the insured could not refer a third party claim against the insured to arbitration under the policy. Thus the arbitration clause can only be referring to a claim under the policy. Indeed, that was common ground before the judge, as he remarked (at [60]), and as was common ground before us. [35] It is therefore follows that if a dispute under the clause could arise before the Post Office time for a claim for an indemnity under the policy, the word ‘claim’ would have to embrace ‘potential claim’. But that is not what the clause says : and its talk of ‘the claim shall be deemed to have been abandoned and not recoverable thereafter’ emphasizes to my mind that what the clause is talking about is a claim for an indemnity which an insured is entitled to make against his insurer. It is only such a claim which can properly be said to have been abandoned and to become ‘not recoverable’. A merely potential claim is in any event irrecoverable, as the Post Office case teaches. In other words, I would regard ‘claim’ in this context as being synonymous with the assertion of a purported cause of action . That, after all, is the usual context of a time-bar provision, and it might be said a fortiori of a time-bar provision which not only bars remedy but also bars the claim itself. [36] Therefore, to my mind both the logic of the situations discussed by the judge and the wording of the arbitration clause itself combine to suggest that the clause simply does not have in mind a dispute as to liability under the policy divorced from a particular claim or cause of action for an indemnity which has, as the insured may assert but the insurer may deny, matured into a liability under the policy. Similarly, the quantification of the insured’s liability may be in dispute in respect of such a claim (‘or the amount to be paid’). That alternative is suggestive of a situation where liability is acknowledged by the insurer, but he disputes the amount in which liability has been assessed or agreed as between third party and insured. [37] It seems to me that the judge was therefore wrong to say that the repudiation by [Q] of all liability under the policy was therefore a ‘dispute in respect of [Q’s] liability in respect of the claim by [L] under the policy ’ (at [75]). [L] could have made no claim under the policy at that time . It could only have notified an incident which might give rise to a third party claim, or notified such a third party claim itself. …… …… [45] It is possible that in a motor policy (Walker’s case) the word ‘claim’ is to be regarded in a hybrid way. If an insured’s car is damaged in a collision, the insured is commonly spoken of as making a ‘claim’ on his policy, assuming it to be comprehensive. If in the collision a third party’s car is also damaged, usually in circumstances where fault is disputed, the insured’s ‘claim’ may possibly be regarded as encompassing a request for cover for any third party claim that may be made. It may be that in such circumstances the word ‘claim’ may be given a wide meaning as encompassing any assertion of a potential future liability on the part of the insurer. [46] Whatever may be the meaning given to ‘claim’ in such different circumstances, however, I am satisfied that in the context of a public liability policy such as is found in the present case , the essence of a claim under the policy is a request for an indemnity on the basis of an established cause of action in respect of a third party claim where liability and quantum have been ascertained, where the insured’s ‘liability in respect of a claim’ can properly be so regarded, and where such a claim can sensibly be spoken of as abandoned ……” (my emphasis) 66. It was plain from Rix LJ’s observations that much would turn on the wording of the particular arbitration clause in that case, ie what meaning should be attributed to the words “any dispute …… on [the insurer’s] liability in respect of a claim or the amount to be paid ……” in the context of public liability insurance. 67. First, the nature of the insurance policy in William McIlroy (Swindon) Ltd & ors (ie public insurance policy) was quite different from the nature of the insurance policy here (ie EC policy). In my view, the latter was more akin to the motor policy that Rix LJ referred to in paragraph 45 of his judgment [42] such that “claim” under the policy might be given a wide meaning as encompassing a request for cover for any third party claim (eg claim by P for common law damages) that might be made, ie a potential future liability. 68. Secondly, the conclusion in William McIlroy (Swindon) Ltd & ors was only operative on a “dispute …… on [the insurer’s] liability in respect of a claim or the amount to be paid ……” It was common ground in that case that “claim” referred to a claim under the policy, and such “claim” when read in the context of the time-bar provision was held to mean a particular claim or cause of action that had matured into a liability under the policy. On such wording/interpretation of the arbitration clause in that case, it was said mere repudiation of policy liability did not amount to “dispute …… on …… liability in respect of a claim” under the policy because at the time L could only have notified an accident but could not have made any claim that had matured into a liability under the policy (ie the existence and amount of liability to the relevant third party had not been established whether by judgment, arbitration award or agreement). 69. As seen in paragraphs 61 and 65 above, Sir Henry Brooke and Rix LJ placed strong reliance on Post Office v Norwich Union Fire Insurance Society Ltd [43] in coming to their aforesaid views. In that case, the contractors damaged a Post Office cable but denied liability. The contractors went into liquidation, and the Post Office sued the contractors’ insurers under section 1 of the Third Parties (Rights Against Insurers) Act 1930. The English Court of Appeal held that since the rights of the insured against the insurers vested in the Post Office by virtue of the 1930 Act was transferred subject to the conditions in the policy , and since the contractors could not have claimed to be indemnified by their insurers until liability and quantum of damage had been determined by agreement or judgment against the insured, the Post Office was in no better position and had no cause of action against the insurers under the policy. 70. Again, such conclusion turned on the particular wording of the indemnity provision in the policy to which the contractors (and the Post Office by subrogation) were subject. As Lord Denning MR said at pages 373-374: “The policy says that ‘the company will indemnify the insured against all sums which the insured shall become legally liable to pay as compensation in respect of loss or damage to property .’ It seems to me that the insured only acquires a right to sue for the money when his liability to the injured person has been established so as to give rise to a right of indemnity. His liability to the injured person must be ascertained and determined to exist, either by judgment of the court or by an award in arbitration or by agreement. Until that is done, the right to an indemnity does not arise. I agree with the statement by Devlin J in West Wake Price & Co v Ching . [44] ‘The assured cannot recover anything under the main indemnity clause or make any claim against the underwriters until they have been found liable and so sustained a loss.’” (my emphasis) 71. But here, the “matter” for referral to arbitration in the Clause was not any “claim” or any “dispute …… on …… liability in respect of a claim”. Rather, the relevant “matter” was “[all] differences arising out of this Policy”. I am unable to draw assistance from the observations by Sir Henry Brooke and Rix LJ in William McIlroy (Swindon) Ltd & ors or by Lord Denning MR in Post Office that essentially rested on the particular wording of the arbitration clauses in those cases. 72. I refer to paragraphs 39-48 above in which I have explained the wide meaning to be given to “differences” as used in arbitration clauses with similar wording in the insurance context, and I have further explained why an insurer’s repudiation of policy liability (which repudiation the insured disputed) would amount to an arbitrable “difference” in such context. In Tommy CP Sze & Co , Ma J (as he then was) at page 434 explained that a “dispute” (let alone a less hard-edged “difference”) “will exist unless there is a clear and unequivocal admission not only of liability but also of quantum”. Ma J (as he then was) went on to say in Dah Chong Hong (Engineering) Limited v Boldwin Construction Company Limited that “[in] other words, even an unanswerable claim will not mean that a dispute or difference does not exist unless there is a clear and unequivocal admission of liability and quantum”, [45] and in Getwick Engineers Limited v Pilecon Engineering Limited that “[in] in the absence of admissions as to both [liability and quantum], a mere denial of liability or of quantum claimed, even in circumstances where no defence exists, will be sufficient to found a dispute for the purpose of section 6 of the [AO] (and Article 8 [of the Model Law]). Thus, finding out whether a dispute (as defined in this way) exists, is the only exercise that the court carries out in a stay application (apart of course from construing the arbitration agreement to discover its full ambit) : it does not involve itself in evaluating the merits of the claim”. [46] 73. In short, the court in a stay application under section 20(1) of the AO will not evaluate/determine the merits of the defence or the issues raised by the defendant to the plaintiff’s claim because the court is merely concerned to consider the existence and nature of the dispute/difference on the construction and effect of the arbitration clause. [47] Since “there is a dispute unless a defendant has admitted the claim against him and …… in the absence of an admission all matters will be referred to arbitration, [so that] …… costly and time-consuming Order 14 and other applications will be avoided ……”, “[it] will then be for the arbitrator to examine the merits on either side ……” [48] Such low threshold for establishing a “dispute” or “difference” exists between the parties [49] is exemplified by the fact that a stay is mandatory “even when there is no real dispute, so long as there is an assertion of a dispute”. [50] 74. On such construction principles, there is plainly no need for liability and amount of the “claim” to be established by adjudication, arbitration or agreement for there to be an arbitrable “difference”. Here, TP repudiated policy liability (but D2 argued TP was not entitled to do so), and D2 issued/filed the TPN to claim indemnity/contribution against TP on the ground TP was the insurer of D2 (but TP filed acknowledgement of service declining to admit either liability or quantum). In my view, there was clearly a “difference” between TP and D2 arising out of the Policy within the ambit of the Clause. To adopt the approach suggested by Mr M Leung in the present context would fall foul of the guidance in the authorities discussed in paragraphs 72-73 above against evaluating merits of the “difference” and against requiring admission, judgment, award or agreement as to liability and quantum in finding the existence of a dispute/difference. 75. Thirdly, and more importantly, if D2 / Mr M Leung were correct in their contentions that no dispute could arise between the insured (ie D2) and the insurer (ie TP) because no claim or cause of action would accrue unless and until the existence/amount of liability to the claimant (ie P) had been established by overall settlement/ adjudication of the main action between P and Ds, then, quite simply, D2 would not have any accrued cause of action to support/maintain the TPN and the third party proceedings against TP, and D2 would only be able to sue TP if and when, according to D2, its cause of action would accrue upon establishing the existence/amount of liability to P. In a nutshell, D2 claimed there was no claim, dispute or cause of action simpliciter rather than there was no arbitrable difference coming within the ambit of the Clause. This, in my view, showed that on D2’s own case the third party proceedings were liable to be struck out and dismissed for no reasonable cause of action, and not merely to be stayed for arbitration. 76. As for the suggestion that there could not be any “difference” arising out of the Policy until TP fulfils its statutory obligation to indemnify D2 by compensating P and then seeks recovery from D2 (see paragraph 18(a) above), it is even more perplexing. If TP indemnified D2 by compensating P, there would have been no basis for D2 to take out any third party proceedings against TP for it would have suffered no loss. The Stay Summons was not concerned with any recovery action by TP against D2, but with D2’s third party claim against TP. Mr M Leung’s contention in this respect was irrelevant to the present context. 77. In my view, the TPN and the third party proceedings raised a “difference” between D2 and TP “arising out of the Policy” that would trigger the mandatory stay under section 20(1) of the AO, and I reject D2’s contentions on the Difference Issue. VII. POLICY ISSUE 78. I have in Part V above explained the policy rationale for a mandatory stay of “differences”/“disputes” within the ambit of the parties’ arbitration agreement that reflected recognition of party autonomy in dispute resolution and public interest need for compliance with international treaty obligations. 79. But Mr M Leung submitted there were countervailing policy considerations and drew attention to section 3(2)(a) of the AO which provides as follows: “3. Object and principles of this Ordinance (1) The object of this Ordinance is to facilitate the fair and speedy resolution of disputes by arbitration without unnecessary expense. (2) This Ordinance is based on the principles – (a) that, subject to the observance of the safeguards that are necessary in the public interest, the parties to a dispute should be free to agree on how the dispute should be resolved; and (b) that the court should interfere in the arbitration of a dispute only as provided for in this Ordinance.” 80. Whilst it is plain, in my view, that section 3 of the AO reflected the policy considerations referred to in paragraph 78 above, Mr M Leung submitted there were other statutory rights/obligations that would bring into play the proviso in section 3(2)(a) of the AO being “the observance of the safeguards that are necessary in the public interest”. It was said such proviso showed “[there] was no legislative intent for section 20 of the AO to override every statutory mechanism and provide for automatic, mandatory, or non-discretionary stay in favour of arbitration ……”, especially “in the context of ECO cases” that necessitated public interest considerations. 81. Before I turn to Mr M Leung’s submissions “in the context of ECO cases” that he argued was applicable to the third party proceedings here, it is useful to first turn to the authorities he cited as illustrations of his broad contentions in the above paragraph. 82. In Dickson Holdings Enterprise Co Ltd v Moravia CV , [51] the parties formed company C and entered into a shareholders’ agreement with an arbitration agreement (which provided that “[any] dispute, controversy or claim arising out of this agreement, or the breach, termination or invalidity thereof , shall be settled by arbitration” (my emphasis)). P had been transferred shares in C, which were subsequently forfeited due to non-payment upon a call pursuant to resolution passed in purported reliance on the articles. P issued an unfair prejudice petition claiming the forfeiture was invalid, but the other parties applied to have the petition struck out or stayed for arbitration. 83. Godfrey Lam J dismissed inter alia the stay application because the dispute simply did not fall within the ambit of the arbitration agreement in that case. Nevertheless, the learned judge made clear that: “32. There is nothing to prevent the substantive dispute in the petition proceedings for relief from unfairly prejudicial conduct, in the sense of the commercial disagreement to be resolved between the parties, from being determined by arbitration. Even where certain relief sought by a party can under the Companies Ordinance only be granted by the court upon a petition, the petition proceedings may still be stayed in favour of arbitration, with the stay being lifted, after the conclusion of the arbitration, for the court to make the appropriate orders in light of the arbitral findings ……” It was said an arbitration clause should be construed broadly, and there was a presumption of one-stop adjudication when it came to businessmen. Godfrey Lam J said it was trite under company law that once parties became shareholders there would be rights/obligations associated with membership that existed independently of any shareholder’s agreement. In that case, the dispute concerning breach of the articles and directors’ fiduciary duties which did not have direct connection with the shareholders’ agreement. “If the parties had intended otherwise [ie for the arbitration clause to cover such disputes], they could have easily devised an arbitration clause that expressly applied to any dispute between them relating to any affair of [C]. An example of a provision inserted into the articles of a company, requiring any difference relating to “any of the affairs” of the company be referred to arbitration, may be found in Newmark Capital Corp Ltd v Coffee Partners Ltd [2007] 1 HKLRD 718 , [13]” (pages 223-224). Since even on a wide interpretation the wording of the arbitration clause in the shareholders’ agreement did not encompass all disputes concerning shareholders’ rights, the stay application was dismissed (pages 221-225). 84. In my view, the findings in Dickson Holdings Enterprise Co Ltd did not support Mr M Leung’s broad proposition paragraph 80 above as they turned essentially on the construction of the particular arbitration agreement on well-established construction principles. More importantly, the learned judge saw nothing to prevent parties from agreeing to resolve by arbitration any dispute concerning unfairly prejudicial conduct or indeed any difference between shareholders in relation to any affair of the company. I disagree with Mr M Leung’s argument that this case demonstrated that the court would on principle uphold “shareholders’ remedies under the Companies Ordinance despite an arbitration clause within a shareholders’ agreement”. 85. In Lo Pui Fan and Mak Wai Ling, the Administratrices of the estate of Hung Tak Ming Raymond, deceased v Hongkong United Dockyards Limited (and Keppel Fels Limited, third parties) , [52] the third party applied to stay the third party proceedings (being a claim for full indemnity against the plaintiffs’ claim or “contribution to the plaintiff’s claim under the [CLCO] and/or the common law and also to the [EC] that the defendant had paid the plaintiffs under the [CLCO] and/or the [ECO]”) for arbitration. In that case, the plaintiffs were the administratrices of the defendant’s employee who suffered fatal injury on duty at a floating dock built by the third party pursuant to a contract with the defendant. The arbitration clause in such contract provided that “[any] dispute arising under or by virtue of this Contract or any differences of opinion between the parties hereto concerning their rights and obligations under this Contract shall be resolved by arbitration ……” (my emphasis). It was held that statutory claims brought by the defendant for indemnity/ contribution under section 3 of the CLCO and/or section 25(1)(b) of the ECO did not fall within the ambit of such arbitration clause. But L Chan J made clear his decision did not rest on any policy considerations but “turns upon the construction of the arbitration clause in this case” (paragraph 21). 86. However, I have reservations about placing reliance on Lo Pui Fan and Mak Wai Ling, the Administratrices of the estate of Hung Tak Ming Raymond, deceased when L Chan J accepted the submissions of the defendant’s counsel who cited Fillite (Runcorn) Ltd v Aqua-Lift (a Firm) , [53] Aggressive Construction Company Limited v Data-form Engineering Limited [54] and X Limited to support his argument that “a dispute arising under or in relation to the contract” did not embrace statutory claims/disputes not concerning obligations in the contract (paragraphs 18-20) when the learned judge (as well as DHCJ To in Aggressive Construction Company Limited ) did not have the benefit of having pertinent authorities such as Legend Interiors Ltd v Wing Mou Engineering Ltd & anor [55] and/or Fiona Trust & Holding Corporation & ors cited to him. 87. More detailed scrutiny of these authorities is therefore required, and I turn first to X Limited , which in fact did not concern any statutory claim at all, but I note Jackson J in paragraph 34 cited with approval Wealands (widow and administratrix of the estate of Wealands (decd)) from which he derived the following proposition (see footnote 38 above): “36. From this review of the authorities, I derive four propositions: …… (4) If an arbitration clause is drafted in appropriate terms, it may encompass a claim for contribution under the Civil Liability (Contribution) Act 1978 (see Wealands ).” In that case, it was held that where A claimed damages against X for breach of Project Contract S (ie X’s contract with A), and X claimed a contribution against Y under the Civil Liability (Contribution) Act 1978 (the English equivalent of CLCO, “ 1978 Act ”) on the basis of Y’s breach of the PDS Contract (ie Y’s contract with A), contribution would not fall within the scope of the arbitration clause in the Implementation Contract (ie Y’s other contract with A) that provided “[all] disputes, differences or questions between the parties to the Contract with respect to any matter or thing arising out of or relating to the Contract ……. shall be referred to the arbitration ……” It was said an “officious bystander” would plainly say X’s claim for contribution based on the PDS Contract was not a dispute, difference or question arising out of or relating to the Implementation Contract (paragraph 41). 88. In Aggressive Construction Company Limited , the plaintiff applied to stay the defendant’s counterclaim pursuant to arbitration agreements in 2 sub-contracts between the parties. Disputes arose over the performance of these 2 subcontracts. The plaintiff as main contractor served notices to terminate these sub-contracts, and took possession of the construction site. Upon payment of wages to the employees of the defendant as sub-contractor pursuant to section 43C of the EO, the plaintiff sued the defendant for repayment, but the latter counterclaimed for damages over termination of the sub-contracts. The arbitration clauses covered “any dispute in relation to the Sub-Contract arises between the Main Contractor and the Sub-Contractor”. It was said that since the plaintiff pursued its claim pursuant to its statutory obligation to pay the wages of its sub-contractor’s employees and also its statutory entitlement for recovery from its sub-contractor pursuant to sections 43C and 43F of the EO and not pursuant to the terms of the sub-contracts, the “dispute” turned on the existence of employment relationship between the defendant and the employees in question and did not relate to the sub-contracts, so the plaintiff was entitled to bring its claim. But the defendant’s counterclaim raised disputes over contractual issues that were subject of the arbitration agreements, so DHCJ To granted mandatory stay of the defendant’s counterclaim. 89. As explained in paragraph 86 above, neither DHCJ To nor L Chan J had the benefit of considering Legend Interiors Ltd (decided in 2004) which is significant for its relevant context and/or Fiona Trust & Holding Corporation & ors (decided in 2007) which is significant for its guiding principles. 90. In Legend Interiors Ltd , the main contractor sued (a) its sub-contractor for damages for breach of the sub-contract and for reimbursement of wages paid to the sub-contractor’s employees, and (b) the sub-contractor’s managing director to enforce an indemnity. The main contract contained an arbitration clause that was incorporated into the sub-contract. At issue was whether the action against the sub-contractor should be stayed pursuant to the arbitration agreement so incorporated into the sub-contract, and whether the action against the managing director should be stayed pending arbitration between the main contractor and the sub-contractor. 91. Reyes J agreed the sub-contract incorporated the arbitration clause, and found the main contractor’s claim for reimbursement of wages paid to the sub-contractor’s employees under sections 43C-H of the EO “fell within the terms of the arbitration agreement” that “provided for arbitration of any dispute or difference which might arise between the parties : … as to the construction of this Contract or as to any matter or thing of whatsoever nature arising thereunder or in connection therewith ” (pages 436 and 440). The learned judge explained at pp 440-441 as follows: “12. I raised the question in Court whether Legend’s claim for reimbursement of wages paid under the EO fell within the terms of the arbitration agreement. It seems to me on consideration that the claim does, because it arises in connection with the relation of main contractor and sub-contractor subsisting between [the main contractor] and [the sub-contractor]. Insofar as essentially there is a dispute among the two as to the extent to which on a final account between them certain amounts (including all or part of the reimbursement paid by [the main contractor] under the EO) remain due and owing to [the main contractor] from [the sub-contractor], it seems to me that the claim for reimbursement should also go to arbitration. 13. Finally, Mr Hui (appearing for [the sub-contractor] and [the managing director]) asks that I stay [the main contractor’s] proceedings against [the managing director] pending the outcome of arbitration proceedings between [the main contractor] and [the sub-contractor]. I decline to do so. [The managing director] is not party to the arbitration agreement. He will not be bound by the arbitrator’s findings. Assume, for example, that the arbitrator finds wholly in favour of [the main contractor]. Assume further that [the sub-contractor] fails to pay any arbitration award in [the main contractor’s] favour. If [the main contractor] were to sue [the managing director] for the amount awarded, [the managing director] might well argue that he was entitled to have all issues raised in the arbitration re-opened in litigation against him since he was not party to the arbitration and there is no res judicata as against [the managing director] . 14. I appreciate that this is an unfortunate situation. In an ideal world all matters relating to the same issues between different parties should be dealt with in a solitary forum at the same time. But this is not an uncommon situation where 2 persons are within the terms of an arbitration agreement and a third party guarantor is not. In the absence of any unequivocal agreement on [the managing director’s] part to be wholly bound by the findings of the arbitrator, I do not see that I should exercise any discretion under the Court’s inherent jurisdiction to grant a stay.” 92. In Fiona Trust & Holding Corporation & ors , the House of Lords held the time had come for a fresh start to be made to the construction of arbitration clauses, and the correct approach was for the court to “start from the assumption that the parties, as rational businessmen, are likely to have intended any dispute arising out of the relationship into which they have entered or purported to enter to be decided by the same tribunal. The clause should be construed in accordance with this presumption unless the language makes this clear that certain questions were intended to be excluded from the arbitrator’s jurisdiction. As Longmore LJ remarked, at [17]: ‘[i]f any businessman did want to exclude disputes about the validity of a contract, it would be comparatively easy to say so’” (page 958). As seen in Part VI above, such approach to construction of arbitration clauses has been diligently followed in both England and in Hong Kong. Thus, unless the arbitration agreement makes it clear that questions of statutory claim/relief are excluded, the arbitration clause applies. 93. Although Wealands (widow and administratrix of the estate of Wealands (decd)) (decided in 1999) predated Fiona Trust & Holding Corporation & ors , its decision was consistent with the approach adopted in Fiona Trust & Holding Corporation & ors. In Wealands (widow and administratrix of the estate of Wealands (decd)) , a worker suffered fatal injury, and his widow sued the main contractor who claimed contribution from the scaffolding contractor. The English Court of Appeal held the contribution claim fell within the arbitration clause of the sub-contract (see footnote 38 above). At page 38 Mance LJ rejected the proposition that the power to award contribution under the 1978 Act was vested only in the court, which proposition ran contrary to the principle of party autonomy enshrined in the Arbitration Act 1996 (“ 1996 Act ”). It was said that if the appointed arbitrator lacked power to award contribution, that would be the consequence of the parties having agreed to submit their disputes to arbitration but the arbitrator lacked jurisdiction to grant such relief, but it was not a reason for refusing a stay or for treating one aspect of their dispute, ie that involving any claim for contribution, as falling outside the scope of the arbitration clause or as being reserved to the court (pages 38-40). 94. As explained in paragraph 87 above, such guidance in Wealands (widow and administratrix of the estate of Wealands (decd)) was followed in X Limited . But the defendant’s counsel in Lo Pui Fan and Mak Wai Ling, the Administratrices of the estate of Hung Tak Ming Raymond, deceased expressed reservations over Wealands (widow and administratrix of the estate of Wealands (decd)) . [56] But in my view, such reservations have now been laid to rest by the court’s approach to construction of arbitration clauses as reaffirmed in Fiona Trust & Holding Corporation & ors and also reiterated in the recent English Court of Appeal decision handed down on 16 June 2020 in Bridgehouse (Bradford No 2) Limited v BAE Systems Plc . [57] 95. In Bridgehouse (Bradford No 2) Limited , BAE entered into a contract with BB2, and such contract contained (a) an arbitration clause applicable to disputes “arising out of the provisions” of the contract and (b) a clause giving BAE the right to terminate the contract by written notice in the event inter alia that BB2 was struck off the register. BB2 was struck off the register, and BAE served notice to terminate the contract. Later, when BB2 was restored to the register, it disputed the termination of the contract in arbitration proceedings. BB2’s contention was rejected by the arbitrator and on appeal to the court. BB2 then applied to the court for relief under section 1028(3) of the Companies Act 2006 (“ 2006 Act ”), ie an order that BAE’s termination of the contract was of no effect or that BAE be ordered to enter into a new contract with BB2 on the same terms as the contract. BAE applied to stay the proceedings for arbitration under the 1996 Act. 96. It was suggested that the arbitration clause did not extend to the claim under section 1028(3) of the 2006 Act, and that in any event such matter was not susceptible to arbitration. Males LJ explained the issue as follows: “68. The first issue is whether the legal proceedings in which BB2’s claim is brought are “in respect of a matter which under the agreement is to be referred to arbitration”. That depends on whether the parties’ dispute is within the scope of the arbitration clause in the agreement which provides for disputes “arising out of the provisions of the agreement” to be referred to arbitration.” The English Court of Appeal reiterated with approval the correct approach to construction of arbitration clauses in Fiona Trust & Holding Corporation & ors , and held the arbitration clause in Bridgehouse (Bradford No 2) Limited was applicable as such clause did not make clear that relief under section 1028(3) of the 2006 Act was excluded. As Males LJ explained in paragraph 70, “[to] accede to BB2’s submission that the arbitration clause is in relatively narrow terms which do not extend to the current dispute would take us back to the days before the House of Lords in the Fiona Trust case swept away the verbal distinctions between clauses which provided for disputes “arising in connection with”, “arising out of” and “arising under” an agreement to be arbitrated. ……” Males LJ went further to say that even on a narrow view of the arbitration clause, the parties dispute arose out of the provisions of the contract in that it arose of the express contract right for which BAE bargained to terminate the contract by notice in the event of BB2 being struck off the register, and BB2’s claim (if successful) would deprive BAE of the benefit of that contractual right. 97. Turning to the question of arbitrability of such statutory claim/relief, Newey LJ in giving the lead judgment reviewed relevant case law (including Wealands (widow and administratrix of the estate of Wealands (decd) ) and came to the view that a statutory claim/relief would be arbitrable unless (a) “the 2006 Act prohibits the reference to arbitration of such matters and [(b)] …… arbitration is precluded by public policy considerations” (paragraph 55). 98. On (a) above, Newey LJ held “the 2006 Act does not itself, either expressly or by implication, prohibit reference to arbitration matters arising on an application for relief under section 1028(3) of the 2006 Act. The fact that section 1028(3) speaks of “the court” granting relief does not carry that implication” because, following Wealands (widow and administratrix of the estate of Wealands (decd)) , the fact that a statutory power was given to the court did not mean that an arbitrator, to whom a dispute is properly agreed to be referred, does not have a similar power (paragraph 56). 99. Following Fulham Football Club (1987) Ltd v Richards , [58] Newey LJ noted that (a) section 1(b) of the 1996 Act gave primacy to party autonomy, (b) “Mance LJ had likewise noted “the principles of party autonomy enshrined in the 1996 Act” in Wealands ”, and (c) “[party] autonomy is “subject only to such safeguards as are necessary in the public interest”, [59] but that is a “demanding test”, in Longmore LJ’s words in Fulham ” (paragraph 57). Males LJ also said as follows: “73. In considering whether a dispute is arbitrable, the fact that the parties have agreed that it should be arbitrated is an important starting point. What that means is that they have agreed, not only that it should be arbitrated, but also that it should not be decided by a court. The law permits commercial parties to choose arbitration and should respect their choice unless there are compelling reasons not to do so . As I said in Nori Holding Ltd v PJSC ‘Bank Otkritie Financial Corpn’ [2018] EWHC 1343 (Comm), [2019] Bus LR 146 at [66], “Where parties agree to arbitrate, it is the policy of the law that they should be held to their bargain ”.” (my emphasis) 100. It was said that whilst compelling reasons to the contrary may be found in statutory provisions making clear that certain kinds of dispute are not capable of being determined by arbitration or in principles of public policy, there is nothing in the 2006 Act to suggest a claim for an order under section 1028(3) is inherently incapable of being arbitrated (paragraph 74). 101. On (b) above, Newey LJ explained that while, as Patten LJ noted in Fulham Football Club (1987) Ltd , “many aspects” of the statutory regime governing companies are immune from arbitration and lie within the court’s jurisdiction, eg winding up order or application for restoration to the register (under section 1029 of the 2006 Act), those matters “do not merely involve private disputes but status and potentially have implications far beyond the company and any particular counterparty” (paragraph 58). But no similar issues arise in relation to relief under section 1028(3) or section 1032(3) of the 2006 Act. Even though these provisions can be said to have been motivated by public policy considerations, but that is not to say that the grant of relief under them engages the public interest in such a way as to demand determination by the court rather than by an arbitrator as such relief does not affect the company’s status and will normally be an essentially private matter affecting nobody but the company and one or more specific individuals or entities. To put it in another way, even though these provisions have been thought to further public policy, they were comparable to the “essentially internal disputes” which are the subject of unfair prejudice petitions under section 994 of the 2006 Act that were held to be arbitrable in Fulham Football Club (1987) Ltd (paragraph 59). 102. Newey LJ went on to say it cannot be said that applications under section 1028(3) or section 1032(3) of the 2006 Act are obviously unsuited to be decided by an arbitrator. Such applications require consideration of what (if any) directions and provision are “just for placing the company and all other persons in the same position (as nearly as may be) as if the company had not been dissolved or struck off the register”, and arbitrators may be called upon to decide comparable questions in the context of, say, unfair prejudice or partnership disputes or contribution claims , [60] so an arbitrator will be well capable of deciding these issues in applications under section 1028(3) of the 2006 Act (paragraph 60). 103. Finally, Newey LJ was of the view that “the possibility of relief under section 1028(3) or section 1032(3) having an impact on third parties [61] [but in practice such cases must be the exception rather than the rule] does not …… mean that applications for such relief are not susceptible to arbitration”. Following Fulham Football Club (1987) Ltd , Newey LJ found the possibility of third parties being impacted “is not necessarily determinative of whether the subject matter of the dispute is itself arbitrable” (paragraph 61). Newey LJ also agreed with Longmore LJ in Fulham Football Club (1987) Ltd and Sundaresh Menon CJ in Tomolugen Holdings Ltd v Silicia Investors Ltd (a decision of the Singapore Court of Appeal) [62] that any procedural complexity that may result from the limitation of an arbitrator’s power to give all the remedies that a court can will not of itself give rise to non-arbitrability (pages 61-62). [63] In any event, there was no reason to think any third party would be affected by the grant of relief sought by BB2. 104. The above principles as applied to Bridgehouse (Bradford No 2) Limited were helpfully summarised by Mance LJ. He found there was no principle of public policy capable of outweighing what was already an important principle of public policy that the parties’ agreement to arbitrate should be respected, and an arbitrator would be well capable of deciding whether BB2 was able to make good the propositions for its claim and whether justice required BAE’s contractual right to terminate the contract in the event of BB2 being struck off should be overridden. “No issue of any wider public interest arises. Nor is it suggested that any third party rights would be affected” (paragraphs 74-77). 105. From the above, it is clear the Fiona Trust approach to the construction of arbitration clause continues to apply in England, and any argument that an arbitration clause is insufficiently broad will have to viewed against such approach. Further, consideration as to whether a statutory claim will not be arbitrable turns on (a) whether the statute prohibits arbitration and (b) whether it is precluded by public policy considerations, but this is a demanding test against the public policy of giving primacy to party autonomy. Still further, the fact (i) relevant legislation is motivated by public policy considerations which an arbitrator has to consider, (ii) there may be procedural complexity in referring the matter to arbitration, (iii) third parties may possibly be impacted, and/or (iv) there may be limitation on the power of the arbitrator to give full remedies may not be sufficient to preclude arbitration. In my view, given such guidance (which is consistent with the post-Fiona Trust case law both in England and Hong Kong), outside situations where the court relief sought inherently affects status and/or where the application is inherently a public and not a private matter, it will not be easy to hold commercial disputes to be non-arbitrable. 106. Based on the above principles, Newey LJ clearly explained why winding up order / insolvency proceedings are non-arbitrable, but unfair prejudice petitions and applications for restoration to the register are arbitrable. This is also reflected in Hong Kong case law. 107. In But Ka Chon v Interactive Brokers LLC , [64] the broker-dealer served statutory demand on a trader due to unresolved margin deficit, but the trader alleged the broker-dealer improperly liquidated his positions. The trader applied to set aside the statutory demand arguing inter alia that the dispute should be resolved by arbitration pursuant to an arbitration clause in the customer’s agreement. The Court of Appeal at page 104 held that in an insolvency petition the court is concerned to see whether the alleged debtor is insolvent, so it is not a subject that comes within section 20(1) of the AO. Rather, “[it] is the underlying contract or transaction which is the subject of an arbitration agreement”. It therefore followed there was no automatic, mandatory or non-discretionary stay under section 20(1) of the AO. As Newey LJ in Bridgehouse (Bradford No 2) Limited explained, winding up order affects the status of the company and has potential implications far beyond the company and any particular counterparty (see paragraph 101 above). 108. But in Dickson Holdings Enterprise Co Ltd , Godfrey Lam J held there is nothing to prevent the substantive dispute in an unfair prejudice petition in the sense of a commercial disagreement between the parties from being determined by arbitration even when certain reliefs can only be granted by the court upon a petition (but the stay can be lifted after the conclusion of the arbitration for the court to make appropriate orders in light of the arbitral findings) (see paragraphs 82-84 above, Fulham Football Club (1987) Ltd - see paragraph 101 above, and observations by Newey J in Bridgehouse (Bradford No2) Limited in paragraphs 101-102 above). 109. Turning to non-company cases on the local front, in Chevalier (Construction) Company Limited (see paragraphs 49-50 above), DHCJ Seagroatt, in line with the approach discussed above, held the principal contractor’s payment of wages to its sub-contractor’s employees in order to satisfy its obligations under the EO arose out of the sub-contract because the sub-contractor alleged it was unable to pay such wages due to the principal contractor’s default in not paying what was due to him under the sub-contract, and the learned judge further observed that “[a] defendant in [a personal injury] action may allege contributory negligence on the part of a plaintiff, or bring in a third party on a contribution notice, relying on the [CLCO] …… Their actions are not thereby statutory claims” (see also discussion on Ocean Park Corporation in paragraph 51 above). 110. In Pollard Construction Company Limited v Lee Kwong Kong and To Chun Yin trading as Hung Chong (Foundation) Construction Company , [65] the main contractor paid the wages of its sub-contractor’s employees pursuant to section 43C of the EO, and sued its sub-contractor for reimbursement pursuant to section 43F of the EO. The sub-contractor applied to stay the claim based on an arbitration clause in the sub-contract to the effect that any dispute arising in connection with the sub-contract shall be referred to arbitration. The main contractor disagreed inter alia on the basis that it was basically exercising its statutory rights under the EO to seek reimbursement of wages paid to its sub-contractor’s employees, which was said to be an independent statutory claim outside the ambit of the arbitration agreement. 111. In that case, HHJ K W Wong stayed the proceedings for arbitration. The learned judge referred to Chevalier (Construction) Company Limited and Legend Interiors Ltd with approval, but distinguished Aggressive Construction Company Limited on the basis that (a) the arbitration agreement in that case was “very different”, (b) the matters subject to arbitration in that case were qualified by the term “in terms of contract and in law” that was absent in Pollard Construction Company Limited , and (c) the limitation caused by a lay party adjudicating on the effect of general law was also absent in Pollard Construction Company Limited (paragraph 44), and also distinguished Lo Pui Fan and Mak Wai Ling, the Administratrices of the estate of Hung Tak Ming Raymond, deceased on the basis that (i) a narrower construction was adopted in that case due to the apparently limiting words “…… concerning their rights and obligations under the Contract”, and (ii) Legend Interiors Ltd was not cited to L Chan J in that case (paragraph 48). 112. In light of the wide ambit of the wording of the Clause in the present case, ie all “differences” “arising out of the policy”, and also the principles in Fiona Trust & Holding Corporation & ors as explained in Bridgehouse (Bradford No 2) Limited and in the authorities as discussed above that have been firmly followed in England and in Hong Kong, I prefer the reasoning in Chevalier (Construction) Company Limited , Legend Interiors Ltd and Pollard Construction Company Limited. In any event, I find Lo Pui Fan and Mak Wai Ling, the Administratrices of the estate of Hung Tak Ming Raymond, deceased unhelpful in the present context given (a) the limiting words in the arbitration clause in that case as explained by HHJ K W Wong (see above paragraph), (b) Mr M Leung’s confirmation that D2 did not rely on the CLCO for its claim in the third party proceedings, (c) the irrelevance of section 25(1)(b) of the ECO in the present context as discussed in paragraphs 121-129 below, and (d) the approach adopted by Fung J to stay proceedings under section 25(1)(b) of the ECO for arbitration in Sunrise Engineering Limited v Wing Hong Construction Limited [66] (see paragraph 128 below). 113. Mr M Leung submitted that D2 did not rely on the EO and/or the CLCO in the third party proceedings. But the above authorities concerning EO and/or the CLCO had been considered for their general principles so as to view Mr M Leung’s suggestion that statutory claim/relief can preclude arbitration by public policy considerations through the prism of those general principles. As said, if a “dispute”/ “difference” falls within the ambit of the arbitration clause, the party resisting arbitration has to satisfy a demanding test. Moreover, as seen in the discussion in Part VI above, the “difference” between D2 and TP being the “matter” in the third party proceedings was not any statutory claim (especially when Mr M Leung made clear that D2 did not rely on the CLCO for the TPN and the third party proceedings), but one that arose from the Policy, ie D2 seeking policy liability against TP in respect of its insurance claim for the Accident, and TP having disclaimed policy liability in respect of such insurance claim. 114. But Mr M Leung argued that TP’s obligations vis-à-vis D2 to indemnify/contribute arose from the ECO, so I turn to his arguments on such statute. 115. Mr M Leung submitted that “ECO cases” necessitated public interest considerations. He referred to Paquito Lima Buton v Rainbow Joy Shipping Ltd Inc , [67] and claimed the Court of Final Appeal held as follows: (a) There is no overriding right to insist on arbitration and the Model Law itself recognises the need for domestic laws to exclude certain disputes from arbitration for public policy reasons. (b) It is not in the public interest to allow insurers to use arbitration clauses to shield/delay compensation to injured employees, disassociate from the statutory compensation mechanism, or to transfer the financial burden of the defendants in EC cases and/or in compensation payments to the insured employers. 116. It is therefore necessary to find out what exactly was decided by the Court of Final Appeal in Paquito Lima Buton . In that case, X was employed by R to work on its vessel under 3 contracts, ie a Philippine contract, a Hong Kong contract, and a collective bargaining agreement. X suffered work injury and issued a EC claim under the ECO, but R applied to stay the proceedings for arbitration. It was held there was no arbitration agreement between the parties, and therefore no basis for granting a stay. On the matter of mandatory stay under the now section 20(1) of the AO and Article 8(1) of the Model Law, Ribiero PJ said as follows: “44. However, it is clear that there is no overriding right to insist on arbitration. The AO makes it clear that the parties’ freedom to agree on how their dispute is to be resolved is ‘subject to the observance of such safeguards as are necessary in the public interest’. [68] Furthermore, the [Model Law] expressly recognizes that domestic laws may be enacted which exclude certain disputes from arbitration. It follows that the mandatory stay provisions of Article 8 are inoperative if some other law precludes their application to the dispute in question.” 117. I am not persuaded that by the above statement Ribeiro PJ was saying, as Mr M Leung would have me find, that the Model Law recognised “ the need for domestic laws to exclude certain disputes from arbitration for public policy reasons” (my emphasis). Rather, all Ribeiro PJ said was the mandatory stay in Article 8 of the Model Law is inoperative if some other law precludes their application to the dispute in question, and (as seen in the paragraph below) section 18A(1) of the ECO by expressly reserving EC claims by injured employees against their employers to the exclusive jurisdiction of District Court precludes arbitration for such EC claims. 118. Ribeiro PJ noted section 18A(1) of the ECO confers on the District Court exclusive jurisdiction to deal with all EC clams by injured employees against their employers save in expressly excepted cases (of which arbitration is not any), so there is no power to stay such EC claims for arbitration. In coming to such statutory interpretation, Ribeiro PJ at pages 483-484 took into account the policy considerations that militate strongly against a construction which permits EC claims to be stayed for arbitration: “(a) The ECO’s policy is self-evidently to provide a framework of legal protection for injured and incapacitated employees, operated by the Commissioner for Labour and the District Court. To this end, it restricts freedom of contract, for example, by requiring certain settlement agreements to be approved by the Commissioner and (by s.31) nullifying any contractual attempts to extinguish or reduce the employer’s ECO liabilities. That policy favours a construction of s.18A(1) which restricts the parties’ freedom to contract in favour of arbitration with a view to preventing the employee being thereby removed from the protective framework. Such a restriction, imposed in the public interest, is expressly accommodated by the AO. [69] (b) Secondly, as was pointed out in LKK Trans Ltd v Wong Hoi Chung , [70] the ECO establishes a no-fault, insurance-based scheme aimed at giving quick financial relief to employees incapacitated by work-related injury. Legal aid and supplementary legal aid is available for such claims. [71] Permitting ECO claims to be interrupted by stay applications in favour of non-legally aided arbitrations is not conducive to the objectives of the statutory scheme. It is difficult in any event to see any practical benefits in an arbitration stay. There is no reason to think that arbitrators would be in any way better equipped to deal with claims. On the contrary, the District Court has relevant experience and expertise in depth. Certainly, without legal aid, the employee is likely to be disadvantaged in conducting an arbitration. And in a case like the present, where the arbitration agreement refers the dispute to a foreign arbitral tribunal, even if (which is not the case here) that tribunal should be amenable to applying the ECO, it would be ill-equipped to give effect to its provisions in the light of the relevant case-law. A foreign arbitral tribunal is in practice far more likely to apply the law of its own jurisdiction, which may or may not be as favourable to the employee.” 119. But the “difference” between D2 and TP here is not any EC claim by an injured employee against his employer under section 18A of the ECO. First, P’s claim against Ds in the main action sought common law damages and not EC, and there was no applicable exclusive jurisdiction statutory provision. Secondly, D2’s claim against TP in the third party proceedings was not any claim for EC or common law damages but rather for indemnity/contribution based on the Policy (ie TP was the insurer of D2’s EC insurance policy). It is not easy to see how the public policy considerations referred to by Ribeiro PJ in the above paragraph that underlined the policy objective of ECO as a piece of social legislation to afford no-fault insurance-based protection of quick financial relief for injured/incapacitated employees to have bearing on the “difference” between D2 and TP in the third party proceedings. 120. As seen in the discussions in paragraphs 97-102 and 105 above, in the absence of (a) statutory provision reserving exclusive jurisdiction to the court (ie prohibiting arbitration) and/or (b) public policy objections that discourage an arbitrator to adjudicate, there is no basis to say a statutory claim based on a statutory right/obligation that falls within the ambit of an arbitration agreement between the parties can only be litigated before the court and cannot be referred to arbitration. Indeed, as explained in Bridgehouse (Bradford No 2) Limited , the fact legislation is motivated by public policy considerations or further public policy objectives does not mean that statutory claims or claims based on statutory rights/obligations are therefore non-arbitrable (see paragraph 101 above). The public interest in giving primacy to party autonomy cannot be assailed unless the statute prohibits arbitration and/or arbitration is precluded by public policy considerations, and the courts will be slow to find that such demanding test is met unless there are exceptional or compelling reasons (see paragraph 99 above). Mimmie Chan J in Fung Hing Chiu Cyril reiterated the public policy interests in favour of arbitration as follows: [72] “21. Without disputing that there is a public policy interest for the Court to exercise control and supervision over solicitors who are officers of the Court, it is relevant to bear in mind that there are also public policy interests in holding parties to a contract, entered into by their free will, to settle their disputes by arbitration. It is also undeniable that Hong Kong is promoted as an important international arbitration centre, and that the Courts here encourage parties’ resolution of their disputes by arbitration – as can be evidenced by the object and principles of the Ordinance (set out in s.3 thereof), and the authorities on how the powers of the Court under the Ordinance are exercised. A further important policy consideration is that Hong Kong and the Courts here should observe the obligations assumed under international conventions, such as the New York Convention of which Hong Kong is a party, and the duties thereunder: under art.II, to recognise and enforce an arbitration agreement; and under art.III, to recognise arbitral awards as binding and to enforce them. To the extent that there may be any possible conflict between these policy considerations, then a proper balance has to be drawn by the Courts, in the exercise of its jurisdiction and powers on the facts of each case.” 121. But Mr M Leung suggested certain provisions in the ECO raised public policy considerations that would preclude TP’s request to stay the third party proceedings for arbitration. He first referred to section 25(1)(b) of the ECO which provides as follows: “(1) Where the injury in respect of which compensation is payable was caused in circumstances creating a legal liability in some person other than the employer (in this section referred to as the third party) to pay damages to the employee in respect thereof – …… (b) the employer by whom compensation is payable , and any person who may be called upon to pay an indemnity under section 24 in the case of an employee employed by a subcontractor , shall have a right of action against the third party for the recovery of any sum which he obliged to pay as a result of the accident , whether by way of compensation or indemnity or by virtue of any agreement made with the employee prior to the accident, and may exercise such right either by joining in an action begun by the employee against the third party or by instituting separate proceedings : Provided that the amount recoverable under this paragraph shall not exceed the amount of damages, if any, which in the opinion of the court would have been awarded to the employee but for the provisions of this Ordinance.” (my emphasis) 122. In a nutshell, section 25 of the ECO gives the right of action thereunder to 2 categories of persons: (a) the employer by whom compensation is payable, and (b) the person who may be called upon to pay an indemnity under section 24 of the ECO in the case of an employee employed by a sub-contractor. 123. On (a) above, “compensation” is defined in section 3(1) of the ECO to mean compensation, medical expenses, cost of prosthesis or surgical appliance under various provisions of the ECO, interim payment, or surcharge/interest payable on the compensation, which plainly does not include (i) common law damages that were the subject matter of P’s claim against Ds in the main action or (ii) indemnity/contribution by TP that was the subject matter of D2’s claim in the third party proceedings. 124. In respect of (b) above, the indemnity under section 24 of the ECO provides as follows: “24.(1) Where any person (in this section referred to as the principal contractor), in the course of or for the purposes of his trade or business, contracts with a sub-contractor for the execution by or under the sub-contractor of the whole or any part of any work undertaken by the principal contractor, the principal contractor shall be liable to pay to any employee employed by that sub-contractor or by any other sub-contractor in the execution of the work any compensation under this Ordinance which the principal contractor would have been liable to pay if that employee had been immediately employed by him; and where compensation is claimed from or proceedings are taken against the principal contractor, then, in the application of this Ordinance, references to the principal contractor shall be substituted for references to the employer, except that the amount of any compensation calculated by reference to earnings shall be calculated by reference to the earnings of the employee under the employer by whom he is immediately employed. …… (2) Where the principal contractor is liable to pay compensation under this section , he shall be entitled to be indemnified by any person who would have been liable to pay compensation to the employee independently of this section.” (my emphasis) Thus, if the principal contractor paid “compensation” (ie EC and not common law damages) under the ECO to its sub-contractor’s employee, it will then be able to seek indemnity for such EC payment from, say, the sub-contractor being the direct employer who is liable to pay EC to the employee. 125. In the circumstances, such statutory right of action against the third party concerns recovery from a third party (eg a tortfeasor) of EC paid by way of compensation or indemnity as aforesaid provided the recoverable amount shall not exceed the amount of damages that would have been awarded to the employee but for the provisions of the ECO (eg not to exceed the quantum of common law damages that would have been awarded to the employee against the tortfeasor). Plainly, section 24 (and hence section 25) of the ECO is not applicable to a claim for common law damages and/or a claim for indemnity/contribution in relation to common law damages. 126. This was made clear by the Court of Appeal in Woo Kin-wah v Somec (HK) Limited & anor (and Tugu Insurance Company Limited) . [73] In that case, the employee sued his employer and the main contractor for damages for personal injuries, but there was no claim for EC under the ECO. The employer’s own insurer actively defended the proceedings. The main contractor’s insurer applied to be joined pursuant to section 43(3) of the ECO on the basis that by reason of section 24(1) of the ECO the main contractor was deemed to be the employee’s employer for the purpose of section 43 of the ECO. 127. Kempster JA rejected such argument, and was “satisfied that “compensation is claimed” when ss. 16A, 16D and 17 are invoked and “proceedings” are taken when the employee makes an application to the District Court pursuant to s. 18A(2); all relating to “compensation” and having no reference to such claims as are made in the action which are for “damages”. “Compensation” and “damages” are defined in s. 3. There is no substance in Tugu’s [main contractor’s insurer] application in his regard” (page 304). Fuad VP said “s. 24 does not give an employee a right to claim anything other than compensation as defined in s. 3 against the principal contractor. An employee cannot rely on s. 24 to make the principal contractor liable to him in any ordinary action for damages as if he had directly employed the employee. The section read in the context of the Ordinance as a whole makes this abundantly clear. ……” 128. Indeed, in Sunrise Engineering Limited , Fung J stayed the claim by the sub-contractor (who paid EC to its injured employee without ECO proceedings) under section 25(1)(b) of the ECO against the main contractor (who had taken out EC insurance covering the sub-contractor’s workers) for inter alia indemnity in respect of EC paid on behalf of the main contractor in favour of arbitration. The contract between the main contractor and the sub-contractor “contained an arbitration clause to the effect any party may refer to arbitration under the [AO] all disputes of whatever nature arising from or connected with the contract”. Fung J disagreed the indemnity claim under section 25(1)(b) of the ECO was excluded from arbitration by the exclusive jurisdiction provision in section 18A(1) of the ECO. Although Paquito Lima Buton held that arbitration was not an exception under section 18A(1) of the ECO and there was no power to stay EC claims in favour of arbitration, Fung J concluded as follows: “20. I view the position as follows: (1) S.18A as held in [ Paquito Lima Buton ] only confers exclusive jurisdiction on the District Court in relation to a EC claim; (2) S. 2 of ECO defines “compensation” to mean compensation payable under ss.6, 7, 8, 9, 10, 10A, 16I(3), 36MA, 36B, 36I of ECO which have no application to the present case; (3) There is not and will never be any EC claim by the worker in any case as the claim was settled; (4) S.25(1)(b) is an enabling provision for the employer to take separate proceedings in the High Court or District Court to recover damages against a third party (the principal contractor as the case may be) related to the EC claims and the holding in the Hip Hing case [74] that those proceedings may only be taken in the High Court in the circumstances of that case was in the context of whether the employer could make a claim against the principal contractor in the EC proceedings; (5) Neither the [ Paquito Lima Buton ] nor Hip Hing case excluded arbitration in such separate proceedings .” (my emphasis) 129. In my view, claims under section 25(1)(b) of the ECO are arbitrable, and do not raise public policy considerations that have bearing in the present context. 130. Next, Mr M Leung referred me to section 40 of the ECO (see paragraph 54 above). As explained in paragraph 55-56 above, Mr M Leung arguments ran as follows: (a) D2 by purchasing the Policy complied with its obligation under section 40 of the ECO to take out insurance cover in respect of liability for EC and common law damages for work injury by employees (including those of its sub-contractor D1); (b) since TP disclaimed policy liability in respect of P’s work injury, the effect of sections 43(1) and 44(3)(c) of the ECO was to make TP directly liable to compensate P notwithstanding anything in the Policy; (c) since (i) EC insurers are directly and statutorily liable to compensate injured employees (see (b) above), and (ii) insurers are often better equipped to engage claimants in negotiations and mediation (which often has the effect of reaching finality of claim in a cost-effective manner), there exists a “statutory mechanism by employees and employers to join third parties such as insurers”; (d) by applying the public policy considerations in relation to ECO in Paquito Lima Buton and other cases that suggest “statutory rights and obligations exist independently of arbitration clauses”, TP should remain as a third party in the present action, and it would be up to TP to decide whether “to remain passive, take up the defence, or engage P in negotiation or mediation – these are matters of their choice”; (e) whether TP who was statutorily obliged to compensate P might separately seek to recover payment from the insured (eg D2), that would be a matter for another day. 131. As explained in paragraphs 116-118 above, Paquito Lima Buton made clear that the ECO is a piece of social legislation that affords protection to injured and incapacitated employees premised on a no-fault and insurance-based scheme. The requirement for compulsory EC insurance under section 40 of the ECO coupled with the option for direct recovery against the EC insurer under sections 42 and 44 of the ECO are important elements of such protection. But even when the EC insurer disclaims liability to its insured (eg main contractor and the sub-contractor / employer), the injured employee is not required to first seek direct recovery against EC insurer, and can seek EC/damages directly from the sub-contractor / employer and/or the main contractor, leaving them to resolve their own difference/dispute on policy liability according to the terms of the EC insurance policy. This is augmented by section 43 of the ECO that requires on the EC insurer to pay any liability by the employer to pay EC/damages to the injured employee notwithstanding anything to the contrary in the EC insurance policy. The rights given to injured employees under sections 42-44 of the ECO is for their protection in case the main contractors and/or the sub-contractors / employers are unable to pay EC and/or damages. It is because of such obligation to pay EC and/or damages that the employer is liable to pay to the injured employee despite disclaimer of policy liability that the EC insurer is given a right to join in the injured employee’s legal claim for EC and/or damages under section 43(3) of the ECO. 132. The above showed (and as Mr M Leung conceded in his oral submissions) that the public policy considerations for the ECO scheme as evident from the interplay among sections 40, 42, 43 and 44 of the ECO is to afford protection to (a) the injured employee rather than to (b) the sub-contractor / employer, the main contractor and/or the EC insurer, hence protection to the insured against the EC insurer in disputes over policy liability among the parties in (b) above is not a policy objective of the ECO. Mr M Leung then suggested the injured employee may still have a role to play in relation to any dispute/difference over policy liability under a EC policy between the insured and insurer because of the operation of sections 42 and 44 of the ECO. This is not understood since (i) as yet there was no claim by P against TP for payment of common law damages to trigger TP’s liability to pay P under sections 42 and 44 of the ECO, and (ii) there is no settlement and/or adjudication in favour of P against D1 that would give rise to the employer’s (ie D1’s) [75] liability for P’s work injury as a result of the Accident to trigger TP’s liability to pay P under section 43 of the ECO. [76] 133. In light of the above, and since Mr M Leung argued that the third party proceedings were not premised on the CLCO, I am unable to see how D2’s claim against TP in the third party proceedings could be said to be a statutory claim. It is at best a claim (and hence a “difference”) arising under the Policy in that D2 disputed TP’s disclaimer or repudiation of policy liability and claimed TP was liable to indemnify/contribute to D2’s liability to P (if any). The ECO does not prohibit arbitration such claim (which is outside section 18A of the ECO), and in my view, arbitration of such “difference” was not precluded by public policy considerations. Even though compulsory EC insurance cover under the ECO is motivated by public policy considerations to protect the injured employee, it is not sufficient to preclude arbitration in the present context. After all, whatever might be the outcome of the “matter” in the third party proceedings as between D2 and TP, TP as an EC insurer would still be liable to P under sections 42-44 of the ECO. In my view, the “difference” between D2 and TP over opposing stance on policy liability (ie TP’s liability to D2 as its insurer under the Policy) was essentially a private and not a public matter that would not trigger wider public policy interests. 134. On the above analysis, I am unable to see how there exists a “statutory mechanism by employees and employers to join third parties such as insurers” as suggested by Mr M Leung, and/or how in the present context D2 as main contractor and the insured under the Policy (in contra -distinction to P as the injured employee) was able to pray in aid statutory rights and obligations that existed independently of the Clause for the purpose of the third party proceedings. In my view, the fact EC insurers are better versed than their insured in handling personal injury litigation commenced by injured employees is neither here nor there when the EC insurers and the insured commercially agreed to include broadly worded arbitration agreements in the EC policies. In giving primacy to the public policy of party autonomy, I see no abuse or unreasonableness on the part of TP in relying in the Clause as agreed with D2, and I do not accept this has the effect of skewing the Policy heavily in favour of TP (even though the Clause contained a shortened time-bar provision). 135. In my view, there must be mandatory stay of the TPN and the third party proceedings in this action. It is unfortunate that the main action between P and Ds will be pursued in court whilst the “difference” between D2 and TP will be stayed for arbitration, but in light of the unequivocal Clause, this is insufficient ground to decline a stay (see paragraphs 91, 103 and 105 above). VIII. TIME LIMITATION 136. Mr D Leung submitted that the Clause required D2 to submit its claim to arbitration within 12 calendar months of TP’s disclaimer of liability under the Policy, but D2 failed to do so within the agreed limitation period. Mr M Leung disagreed on 2 bases: (a) as a matter of practicality, if and when TP complied with its statutory obligation to compensate P, it was for TP to commence arbitration/litigation to recover from D2 such compensation paid to P, and (b) on the basis of D2’s submissions on the strength of William McIlroy (Swindon) Ltd in paragraph 56 above, Mr M Leung’s written submissions went on as follows: “35. As a matter of law, where an insurer had declined to provide indemnity cover to its insured, and the insurance policy stated that a dispute about ‘ liability to the Insured for any claim ’ had to be referred to an arbitrator within a specified period of the dispute arising, the word “claim” had a narrow meaning and referred to the date on which there was an established cause of action in respect of a third party claim and where liability and quantum had been ascertained. TP’s strict assertion of a Centrocon clause will absurdly force the insured to arbitrate at a time when there might be no third party claim in the offing at all: see Quinn Insurance .” 137. I have in paragraphs 57, 59, 62 and 67-75 above rejected D2’s arguments based on William McIlroy (Swindon) Ltd , and repeat my analysis and conclusion here. It is also difficult to see the relevance of the contention in (a) above as the third party proceedings did not concern any claim by TP against D2 for recovery of compensation paid to P pursuant to sections 42-44 of the ECO, but concerned D2’s claim against TP for indemnity/contribution (based on TP’s alleged policy liability under the Policy). 138. Anyway, such disagreement was irrelevant for present purposes. After all, Mr M Leung suggested there was no time-bar, and Mr D Leung submitted the fact arbitration proceedings were time-barred under the Clause would not prevent this court from referring the “difference” between D2 and TP to arbitration for the arbitral tribunal to decide whether the arbitration agreement (ie Clause) was still operative, [77] and, where appropriate, to determine such “difference” either by reference to the time-bar provision in the Clause or to extension of time for commencing arbitration proceedings. After all, the matter of time-bar would merely provide a defence to the claim, but would not go to the jurisdiction of the court or the arbitral tribunal. [78] 139. I find it unnecessary to come to any definitive view over such disagreement, and indeed it would be wrong to do so as it would be a matter that ought to be left for decision by the arbitrator. If the time-bar matter would prove to be an insuperable obstacle for D2, then it would mean D2’s claim (being the subject matter of the third party proceedings) would fail, but it would not mean it was not an arbitrable “difference”. IX. CONCLUSION 140. I therefore grant an order that the TPN and the third party proceedings between D2 and TP in this action be stayed, and that D2 and TP be referred to arbitration. There is no reason why costs should not follow event, and I grant a costs order nisi that D2 shall pay TP costs of the third party proceedings in this action, including costs of and occasioned by the Stay Summons, to be taxed if not agreed. 141. I note that in the Stay Summons, TP prayed for such costs to be in the cause of the arbitration to be commenced. This might have been a commendable course to adopt if D2 did not resist the Stay Summons and agreed to forthwith commence arbitration proceedings. But as D2 chose to resist the Stay Summons until adjudication herein, I see no reason why costs should not follow event. 142. Mr M Leung submitted that following the rationale explained by Mimmie Chan J at pages 588-590 in Chimbusco International Petroleum (Singapore) Pte Ltd , D2 should pay costs on indemnity basis. However, this has not been alluded to in the Stay Summons even though it was obvious from D2’s stance on the TPN Summons that it would refuse to refer the “difference” to arbitration in accordance with the Clause. In my view, a fair order would be an order for costs against D2 on usual party and party basis. (Marlene Ng) Judge of the Court of First Instance High Court Mr Michael Leung, instructed by Tam Pun & Yipp, for the 2 nd defendant Mr Dexter Leung, instructed by Paul CK Tang & Chiu, for the third party [1] clause W204 of the Policy provided that “[it] is hereby understood and agreed that the indemnity herein granted is extended to indemnify the Insured against legal liability (including liability under the [ECO] set out in the Policy) to Employees in the employ of sub-contractors performing work for the Insured while engaged in the Business in respect of which this Policy is granted ……”, and “Business” was defined to mean the usual work and activities carried on by the Insured pertaining to his business as specified in the Schedule (which included the Works) and no other [2] Claims Settlement Condition (b)(i) provided that “Claims Control by the Company. The Company shall be entitled upon notice to the Insured to take over and conduct in the Insured’s name the defence or settlement of any claim demand or proceedings against the Insured. In any event: (i) the Insured shall provide all such information and assistance including the latest earnings of all Employees duly certified as being correct by an independent auditor and forward all such documents and other records to the Company for the conduct of such claim demand or proceedings as the Company in its discretion may from time to time require; ……” [3] see Tommy CP Sze & Co v Li & Fung (Trading) Ltd & ors [2003] 1 HKC 418 , 425 [4] [1985] 1 HKC 177 , 370 [5] see (a) section 34(1) of the AO that gives effect to Article 16 of the Model Law, (b) Fung Sang Trading Ltd v Kai Sun Sea Products & Food Co Ltd [1992] 1 HKLR 40 , 50 where Kaplan J (citing Heyman & anor v Darwins, Ltd [1942] AC 356 , 373-374 and Harbour Assurance Co (UK) Ltd v Kansa General International Insurance Co Ltd & ors [1993] QB 701 , 723) noted Article 16 of the Model Law enshrined the doctrine of separability, ie “the arbitration clause is separable from the contract containing it so that if the contract is repudiated and the repudiation is accepted the arbitration clause survives the repudiation thus enabling the arbitrator to render an award on the claim resulting from the alleged arbitration”, (c) Bernard Doyle v Irish National Insurance Company plc [1998] 1 IR 89, 92-94 where Kelly J (again citing Heyman & anor and Harbour Assurance Co (UK) Ltd )affirmed that the arbitration clause survived the voidance of the insurance contract, and (d) Parshad v Chit Hing Construction Engineering [2011] 1 HKLRD 217 , 246-247 [6] see Guangdong Water Conservancy and Hydro Power Engineering Development Co Ltd v Ming An Insurance Co (HK) Ltd [1990] 2 HKLR 557 , 559 [7] see Parshad at pp 233-234 citing Kanson Crane Service Co Ltd v Bank of China Group Insurance Co Ltd HCA4246/2002, DHCJ Lam (as he then was) (unreported, 1 August 2003) paras 14-15, and Colinvaux’s Law of Insurance (8 th ed, 2006) para 9-35 at pp 322-323 [8] see Tommy CP Sze & Co at pp 425-426 and 429-430, and Wing Bo Building Construction Company Limited v Discreet Limited HCA146/2015, DHCJ Marlene Ng (unreported, 14 January 2016) para 38 [9] see Associated British Ports v Tata Steel UK Ltd [2018] 1 All ER (Comm) 170, 176 and Klöckner Pentaplast GmbH & Co KG v Advance Technology (HK) Co Ltd [2011] 4 HKLRD 262 , 269 [10] see Klöckner Pentaplast GmbH & Co KG at p 269 [11] see Louis Dreyfus Trading Ltd v Bonarich International (Group) Ltd [1997] 3 HKC 597 , 606 in which Waung J said “…… obviously it is not the intention of the Model Law to take away the strong new right of mandatory stay easily by any casual act of the defendant ……” [12] HCA146/2015, DHCJ Marlene Ng (unreported, 14 January 2016) para 37 (see also Harbour Assurance Co (UK) Ltd) at p 726 and Fiona Trust & Holding Corporation & ors v Privalov & ors [2007] 4 All ER 951 , 957-958 and 961-962) [13] [2007] 4 All ER 951 , 957 [14] see Tommy CP Sze & Co at pp 429-430 where Ma J (as he then was) opined that “[it] is difficult to see why parties would wish to have disputes or differences between them resolved both privately and publicly. It is surely one or the other. It does not readily make sense (in the absence of clear words dictating this result) that a party is able or is required to go to arbitration provided he fulfils procedural requirements (such as commencing proceedings within a certain time) but if he does not or chooses not to, then he can freely litigate in the courts” [15] [2016] 1 HKLRD 582 , 586-587 [16] [2018] 1 HKLRD 808 , 815 [17] see Fiona Trust & Holding Corporation & ors at pp 957-958 [18] HCCT19/2014, Mimmie Chan J (unreported, 19 December 2014) [19] see Jumbo King Limited v Faithful Properties Limited [1994] HKC 707, 726 [20] see VK Holdings (HK) Limited at para 24 and Tommy CP Sze & Co at pp 429-430 (see footnote 14 above) [21] at pp 962-963 [22] [2005] EWHC 769 (TCC) para 27 [23] see Pacific Crown Engineering Ltd v Hyundai Engineering & Construction Co Ltd [2003] 3 HKLRD 440 , 442-444 and PCCW Global Ltd v Interactive Communications Service Ltd [2007] 1 HKLRD 309 , 320 [24] see Star (Universal) Co Ltd & anor v Private Company “Triple V” Inc [1995] 2 HKLR 62 cited in PCCW Global Ltd at p 320 [25] [2016] 2 HKLRD 779 , 800 (see also Star (Universal) Co Ltd & anor cited in Pacific Crown Engineering Ltd at p 443, Fung Hing Chiu Cyril at p 814 and Neo Intelligence Holdings Limited v Giant Crown Industries Limited & ors HCA1127/2017, DHCJ Sherrington (unreported, 27 November 2017) para 10) [26] see Pacific Crown Engineering Ltd at p 443 [27] see Wing Bo Building Construction Co Ltd v Discreet Ltd [2016] 2 HKLRD 779 , 800-801 [28] “matter” is a word of wide import and does not necessarily mean the whole matter in controversy in the court proceedings (see Tanning Research Laboratories Inc v O’Brien (1990) 91 ALR 180 , 193 cited by Blair J in Autoridad del Canal de Panamá v Sacyr SA & ors [2018] 1 All ER (Comm) 916, 953) [29] [2017] 3 HKLRD 258 , 265 [30] see Tomolugen Holdings Ltd v Silicia Investments Ltd [2015] SGCA 57 , para 114 cited by Blair J in Autoridad del Canal de Panamá at p 954 [31] see VK Holdings (HK) Limited at para 24 (and also Mustill & Boyd: Commercial Arbitration 2 nd ed pp 118-120 and the cases cited therein as well as HE Daniels, Ltd v Carmel Exporters and Importers, Ltd [1953] 2 Lloyd’s Rep 103 cited by Mimmie Chan J) [32] [1998] 1 IR 89 [33] [2005] 1 WLR 2339 , 2350 (but anyway, there should not be any “semantic distinction between a ‘difference’ and a ‘dispute’ reminiscent of the ‘fussy distinctions’ deprecated” in Fiona Trust & Holding Corporation & ors at pp 958 and 961-962 as observed by May LJ in Lombard North Central plc & anor v GATX Corporation [2012] 2 All ER (Comm) 1119, 1128) [34] HCA4758/2002, Reyes J (unreported, 19 February 2004) [35] [1942] AC 356 [36] [1925] AC 619 , 631 [37] HCA2338/2013, DHCJ Seagroatt (unreported, 18 June 2014) [38] [2000] 1 All ER (Comm) 30, 38-40 in which Mance LJ considered the question whether the arbitration clause in that case covered the defendant’s claims against the 1 st third party under the English equivalent of the CLCO, ie the Civil Liability (Contribution) Act 1978 (“ 1978 Act ”), and rejected the argument that it would not open to the parties, even by agreement, to confer on the arbitral tribunal power to award contribution in circumstances in which a court would have such power under the 1978 Act on the basis that such argument ran contrary to the principles of party autonomy under the Arbitration Act 1996 even though the 1978 Act refers only to the “court” [39] [2001] 1 All ER (Comm) 993, 995-996 in which the holders of the bills of lading sued the vessel owners who counterclaimed against such holders and issued third party proceedings against (a) the time charterer of the vessel for contractual indemnity and/or damages for any liability it might pay to such holders, and (b) the shipper and original party to the bills of lading for damages on similar basis to its counterclaim against such holders, and even though the third party proceedings in (b) above were stayed for arbitration, leave was granted for the time charterer of the vessel to serve fourth party proceedings out of jurisdiction against the shipper and the original party to the bills of lading on the basis that if the time charterer were liable to the vessel owners, the shipper and such original party would also be liable, thus entitling the time charterer to claim contribution from the shipper and such original party under the 1978 Act [40] [1967] 2 QB 263 [41] at p 247 [42] see also Sir Henry Brooke’s judgment at paras 14-17 and pp 245-246 [43] [1967] 2 QB 363 [44] [1957] 1 WLR 45 , 49; [1956] 3 All ER 821 [45] HCA1291/2002, Ma J (as he then was) (unreported, 11 October 2002) para 20(7) [46] HCA558/2002, Ma J (as he then was) (unreported, 28 August 2002) para 23(3) [47] see Yingde Gases Investment Limited v Shihlien China Holding Co Limited HCA2059/2012, Mimmie Chan J (unreported, 20 January 2014) para 35 (see also para 72 above for the observations by Ma J (as he then was) in Getwick Engineers Limited at para 23(3)) [48] see Guangdong Agriculture Company Limited v Conagra International (Far East) Limited [1993] HKLR 113 , 123-124 (see also Tai Hing Cotton Mill Ltd v Glencore Grain Rotterdam BV & anor [1996] 1 HKC 363 , 373 and 377, and Halki Shipping Corporation v Sopex Oils Ltd [1998] 1 WLR 726 , 749, 753 and 761-762) [49] see Falcon Insurance Company (Hong Kong) Limited v Ng Kwok Fai & anor HCA2585/2005, Burrell J (unreported, 23 May 2006) para 10 [50] see Mervyne Elizabeth Mitchell & anor v William Raymond Morris [2016] EWHC 3800 (Ch) para 24 citing Halki Shipping Corporation – see footnote 48 above) [51] [2019] 3 HKLRD 210 [52] HCPI171/2011, L Chan J (unreported, 29 July 2013) [53] 1989 Times 28 February [54] HCA2143/2008, DHCJ To (unreported, 4 August 2009) paras 22-28 [55] [2004] 2 HKLRD 435 [56] by citing Russell on Arbitration 3 rd ed para 6-112 (see para 17 of Lo Pui Fan and Mak Wai Ling, the Administratrices of the estate of Hung Tak Ming Raymond, deceased ) [57] [2020] EWCA Civ 759 – not cited by Mr D Leung and Mr M Leung [58] [2011] EWCA Civ 855 and [2012] Ch 333 [59] equivalent to section 3(2)(a) of the AO [60] Newey LJ in para 60 noted that under the 1978 Act contribution is to be “such as may be found … to be just and equitable having regard to the extent of that person’s responsibility for the damage in question” [61] ie persons who will not be bound by the outcome of the arbitration [62] [2015] SGCA 57 , [2016] 1 SLR 373 [63] see also Legend Interiors Ltd at pp 440-441 (see paras 90-91 above) [64] [2019] 4 HKLRD 85 [65] DCCJ5635/2016, HHJ K W Wong (unreported, 27 October 2017) [66] HCA1847/2008, Fung J (unreported, 3 March 2009) [67] (2008) 11 HKCFAR 464 [68] now section 3(2)(a) of the AO [69] now section 3(2)(a) of the AO [70] (2006) 9 HKCFAR 103 at para 36 [71] see section s 5 and 5A of the Legal Aid Ordinance Cap 91 [72] at P 815 [73] [1993] 1 HKLR 300 [74] ie Wong Leung-tak & anor v Hip Hing Construction Co Ltd [1991] 2 HKLR 345 [75] in Woo Kin-wah , Fuad VP at page 307 explained that “[as] I construe s. 43(1), the sum which forthwith becomes due and payable to the employee by virtue of its provisions, is any sum his employer becomes liable to pay under the Ordinance or independently of it - the words “and the employer of the employee becomes liable to pay” cannot be read as if they were “and any person becomes liable to pay”. And in the light of the meaning of the words “employer” and “employee” as defined respectively in s. 3 and s. 2(1), they cannot possibly be read as including a principal contractor and an employee of his sub-contractor. If this is so, then sub-ss. (2), (3) and (4) of s. 43, which are designed to safeguard the position of the insurer, must be read with this distinction in mind ” (my emphasis) [76] Kempster VP in Woo Kin-wah held that (a) the employee had direct rights against his employer’s insurer, but the principal contractor’s insurer in that case had not demonstrated they had insurer interest (ie being liable to the injured employee under its EC insurance policy), so it was not entitled under section 43(3) of the ECO to be added as party in the proceedings, which right “is surely a quid pro quo for contingent and direct liability to the employee” (page 305), and (b) the court was in any event not bound to accede to such an application despite the wording of section 43(3) of the ECO, especially as the sub-contractor / employer and its insurer were actively defending the employee’s claim and when the principal contractor’s insurer merely wished to be involved to avoid recourse to separate proceedings or to arbitration (page 305) [77] see Tommy CP Sze & Co at p 432 and Grandeur Electrical Co Ltd v Cheung Kee Fung Cheung Construction Co Ltd [2006] 3 HKLRD 535 , 542-543 [78] see Tommy CP Sze & Co at p 433, and The “Titan Unity” [2013] SGHCR 28 at para 47 in which Shaun Leong Li Shiong AR stated that “…… [if] the arbitral tribunal decides that it has jurisdiction to determine the dispute, the plaintiff can place the very same arguments before the arbitral tribunal for its consideration on why the time bar does not apply, both in fact and in law. It is not for the courts to pick and determine what issues should be placed before the arbitral tribunal by way of imposing conditions to a stay of court proceedings, where parties have already consented to refer their dispute to arbitration, and where the relevant issues fall within the scope of the arbitration agreement. This must be so if party autonomy is to be respected …… A party to an arbitration agreement will not be allowed a backdoor way of obviating the limited scope of the court’s review of an arbitral award allowed under our arbitral framework, by cherry picking the issues which may be placed before the arbitral tribunal via a conditional stay of court proceedings ……: Look up this case on Lawcite Noteup",
  "length": 150261,
  "headers_seen": [
    "I. INTRODUCTION",
    "II. POLICY AND REPUDIATION",
    "III. SUMMARY OF TP’s AND D2’s CONTENTIONS",
    "IV. NATURE OF THE CLAUSE",
    "V. STAY FOR ARBITRATION",
    "VI. DIFFERENCE ISSUE",
    "(a) Construction of arbitration clause",
    "(b) Stay for arbitration"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2021/290",
  "query": "kompetenz-kompetenz",
  "ts": "2025-10-16T10:51:40",
  "ok": true
}