{
  "title": "HHH V. SWM | [2016] HKFC 108 | HKLII",
  "court": null,
  "year": 2016,
  "date": null,
  "content": "HKLII Databases Family Court [2016] HKFC 108 HHH V. SWM Judgment Information Date 7 Apr, 2016 Action No. FCMC15225/2015 Neutral Cit. [2016] HKFC 108 Download MS Word Judgment Reading Options Translation Toggle Highlight Appeal History FCMC15225/2015 FCMC15225/2015 HHH v. SWM FCMC 15225/2015 IN THE DISTRICT COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION MATRIMONIAL CAUSES NO. 15225 OF 2015 ------------------------ BETWEEN HHH Petitioner And SWM Respondent ------------------------ Coram: Deputy District Judge D. Cheung in Chambers (Not open to public) Date of Hearing: 29 th March 2016 Date of Handing Down Judgment: 8 th April 2016 ----------------------- J U D G M E N T ( Maintenance Pending Suit ) ------------------------ 1. This is a hearing of the respondent wife’s (hereinafter called “the wife”) application for her maintenance pending suit against the petitioner husband (hereinafter called “the husband”). Brief History 2. The parties were married on 24 th August 1991. 3. Within wedlock, they have 2 sons, now 20 and 18 years old and both of them are students and are studying Form 6 and Form 3 currently. Both children started receiving elite training since primary school and have been representing their schools or Hong Kong to participate in many local and international competitions and achieved many awards. 4. Both children are required to devote intensive time in their sports skill training, and they also need to attend the study in the Hong Kong Sports Institute as well. 5. The wife and the husband have been separated since or about October 2006. Both children since then have been living with the wife. Since separation, the husband had been paying to the wife maintenance for the support of the wife and the children until November 2015. 6. Since 1 st November 2015, the husband ceased paying any maintenance to the wife and the children and the husband also ceased paying the children’s school fees and other educational expenses since September 2015. 7. On 27 th November 2015, the husband issued his petition for divorce based on 2 years separation.On 22 nd January 2016, the wife took out application asking for an order of maintenance pending suit of HK$107,000.00 per month commencing on 1 st November 2015 until the date of determination of the suit against the husband and the application was adjourned to today for argument. 8. Both parties had filed and exchanged their respective affirmations and Form E Financial Statements. No questionnaire had been filed and exchanged. The Law on Interim Maintenance 9. The power to order maintenance pending suit is set out in s 3 of Matrimonial Proceedings and Property Ordinance , Cap 192 (“MPPO”) whereby the court may order a party to make to the other such periodical payments for his or her maintenance and for such term beginning not earlier than the date of the presentation of the petition and ending on the date of the determination of the suit, as the court thinks reasonable. 10. It is clear that under this provision there is no power to make an order for an interim lump sum or an interim order for sale or transfer of property, but otherwise the court has an unfettered discretion in the matter subject to the result being reasonable: F v F (maintenance pending suit) (1983) 4 FLR 382 . 11. As for the matters which the court should consider in assessing an application for maintenance pending suit, Rayden and Jackson on Divorce and Family Matters , 18 th Edition, said these as follows: “There is no hard and fast rule, and no fixed proportion: each case depends on its own facts. It has been said that the approach to maintenance pending suit should be empirical, and that ‘in the ordinary sort of case the district judges who deal with these applications will have to take a broad view of means on the one hand and income on the other and come to a “rough and ready” conclusion’, or take a ‘broad brush’ approach. The overriding consideration is the actual needs of the parties pending suit. Although the provisions of s 25 of the MCA 1973 are expressed to arise only when the court is deciding whether to exercise its powers under s 23, 24 or 24A, the court may nonetheless have regard to the criteria listed in s 25 on an application for maintenance pending suit. 12. The following principles quoted in the case of HJFG v KCY (CACV 127/2011, 28 October 2011 , should be noted when considering maintenance pending suit/interim maintenance applications: a. The sole criteria to be applied in determining the application is “reasonable” which is synonymous with “fairness”. b. A very important factor in determining fairness is the marital standard of living. c. In every maintenance pending suit application there should be a specific maintenance pending suit budget which excludes capital or long term expenditure, more aptly to be considered on a final hearing. d. Where the affidavit or form E disclosure by the payer is obviously deficient, the Court should not hesitate to make robust assumptions about his ability to pay. The Court is not confined to the mere say-so of the payer as to the extent of his income or resources. In such situation, the Court should err in favour of the payee. 13. In practice, as oral evidence is rarely given, it will be unusual for the court on an application for maintenance pending suit to be in a position to make findings of fact on issues in dispute sufficient, for example, to deal with conduct or allegations of non disclosure. 14. However if it is demonstrated that the paying party has not performed his duty to make full and frank disclosure of his financial resources, then the court can take a broad and robust view of his means, and it does not have to accept and proceed on the basis of the assertions of the paying party as to his means and an inability to pay. 15. The court can look at the reality of the situation and take into account voluntary funding from third parties. Any under provision or over provision in the order for maintenance pending suit can always be corrected when the account comes to be taken at the substantive hearing when there is every opportunity to do fairness by set-off…” 16. I do not think the above general principles are in dispute. The wife’s Case 17. The wife and the husband are currently aged 49 and the wife was a teacher for 19 years and stopped working in September 2007 and become a full time housewife ever since. 18. The wife’s case is that the husband is a doctor with good monthly income. Theparties had a comfortable standard of living during the marriage. 19. After the parties’ separation, the husband continuously paid maintenance to her and the children until October 2015. For the initial 6 years after their separation, the husband paid HK$80,000.00 per month as the maintenance for her and the children. 20. From August 2012 to August 2015, the husband paid the wife HK$70,000.00 per month as maintenance and the husband would settle the children’s school fee, tuition charges, books and examination fees and other educational expenses with school or relevant institution/company directly. 21. In September 2015, the husband reduced the monthly maintenance to HK$60,000.00, and in October 2015, the husband further reduced the maintenance to HK$50,000.00 until he stopped paying any in November 2015. 22. After the husband ceased paying maintenance to the wife, the wife had to borrow loans from the banks and withdrew from her insurance in order to generate funds to support the living for herself and the children, and the wife had incurred debts amounting to HK$943,326.00. (see Form E, 2.13) 23. The wife asserted that the husband has the ability to pay the maintenance requested by her.The wife seeks maintenance pending suit order for the sum of HK$107,000.00. It is submitted that this sum is more or less identical to the status quo of maintenance paid to her prior to the husband’s divorce petition, and the order should be backdated to November 2015. 24. The wife further asserted that she was never required to pay any coach fee, and no part of the maintenance previously paid by the husband consisted of any coach fee expenses. The husband’s case 25. The husband’s case rests mainly on the issue of quantum of maintenance pending suit and the husband did not dispute the liability (see paragraph 2 of 1 st Affidavit of the husband), and Mr Lam, counsel for the husband submitted in this skeleton that the only issue in this case is quantum. 26. The husband’s case is that on the basis that it is possible for the wife and/or the 2 adult children to produce some income themselves, HK$47,052.00 should be reasonable even though they may have expenses of HK$67,163.00 per month in total (see paragraph 19 of the skeleton). 27. During the trial, Mr. Lam abandoned his argument that the 2 adult children could produce any income as private tutor as the elder son is now preparing for public examination and the younger son only has Form 3 standard. 28. As a result, the husband asserted that the reasonable expenditure for the wife and the children should be HK$67,163.00. However, the said expenditure should be subject to the earning capability of the wife. Mr. Lam asserted that the wife could earn HK$20,000.00 per month. 29. Mr. Lam though confirmed that there is no issue of ability to pay maintenance pending suit per month and submitted that the husband has no strong view on back-dating the maintenance pending suit payment, Mr Lam later submitted that the husband is not in a financial position to make a lump summaintenance pending suit payments back-dating to November 2015. 30. In that case, I will treat that it is also the husband’s case that the ability to pay by the husband is one of the issues to be determined. 31. It is also submitted that the wife’s alleged expenses were grossly exaggerated, and that part of the maintenance paid by the husband previously were in fact payment for the coach fee of HK$40,000.00. The husband asserted that the wife should not be getting the financial support at the previous level, because the wife no longer needed to pay the coach fee. Issues of the case 32. The following issues arise for my consideration : (a) How much maintenance should the husband pay to the wife as reasonable maintenance pending suit for herself and the children? (issue 1) (b) Can the husband afford to pay the sum? (issue2) (c) In the event that an amount is ordered what date should that part of the order take effect from? (issue3) Issue 1 How much maintenance should the husband pay to the wife as reasonable maintenance pending suit for herself? The wife’s Financial Position and needs 30. It is worth noting that the wife in this case has based her reasonable needs on the standard of living in which she claims to have been provided by the husband prior to the divorce petition.As to the monthly outgoings for the wife and the children, the figures quoted in her Form E were about $119,701.00 and they were made up of the following items: General Mortgageinstalments $26,452 Utilities $4,584 Management fees $1,597 Food $5,000 Household expenses $2,000 Carexpenses $5,000 Storage $1,768 $46,401 Personal Meals out of home $4,500 Transport $200 Clothing/Shoes $300 Personal grooming $500 Entertainment/presents $500 Holidays $1,500 Medical/Dental $200 Insurance premium $1,800 $9,500 Children School fees $15,000 Extra tuition fees $20,000 School books and stationery $3,500 Medical/Dental $6,000 Extra CurricularActivities $500 Entertainment/presents $2,000 Holidays $5,000 Clothing/Shoes $2,000 Insurance premium $3,000 Lunches and pocket money $6,000 Other Transport $500 Uniform $300 $63,800 Grand Total: $119,701 37. In the wife’s affidavit at paragraph 28, she also stated that the repayment of bank loan of $5,494 per month and mobile &internet charges of $2,179 per month. These 2 items shall also be taken into account when considering the maintenance pending suit of the wife. 38. In so far as this particular case is concerned the reference to the reasonableness of the expenses of the wife and the children is particularly pertinent. 39. The amount of the previous sum given to the wife was one of the indicators, though not a conclusive one, for me to consider what amount should be reasonable and fair in the circumstances. 40. It seems that one of the issues needed to be taken into account is whether the amount of the previous sum given to the wife consisted of any coach fee. 41. The wife asserted that she was not required to pay the coach fee in the sum of HK$40,000.00 whereas the husband asserted to the contrary. My view is that it is not necessary to look at the matter as to who is telling the truth. 42. The more practical approach is to assesswhether the present amount of expenditure of HK$107,000.00 is reasonable, irrespective of whether the wife did or did not pay coach fee previously. If the present amount of expenditure of HK$107,000.00 is unreasonable, then this amount will need to be adjusted. 43. Then what is maintenance pending suit? By definition, maintenance pending suit is restricted to payments which constitute “maintenance”, which are reasonable in the circumstances and which will endure for no longer than it takes to determine the divorce litigation. 44. “Maintenance” is a broad concept, and it must be restricted to those payments necessary to meet the recurring costs of living at whatever standard of living as appropriate. 45. An important factor in determining fairness is a consideration of the marital standard of living. In this regard, each case must be considered according to its own circumstances. I remind myself that it is not simply to assume that wealth equates extravagance. Some wealthy married couples live comparatively modesty lives and spend with a discipline born of discretion, while others enjoy consumption on a grand scale. 46. In the present case, my focus should be ondetermining the “immediate and reasonable needs” of the wife and the children. 47. During the trial, Mr. Lam had submitted that there are 3 items in the list of the Personal expenses of the wife that the husband considered unreasonable and would challenge, namely meals out of home, entertainment and holiday. 48. Other than the 3 items above mentioned, the rest of the items in the wife’s list of the Personal expenses will be accepted by the husband as reasonable. The husband asserted that meals out of home should be $3,500 instead of $4,500, and that entertainment expenses should be $400 instead of $500, and holiday expenses should be $800 instead of $1,500. Therefore, the husband suggested that the amount for the Personal expenses of the wife should be $7,700 instead of $9,900. 49. Mr. Lam further submitted that there are 6 items in the Children’s list of the expenses which the husband considered unreasonable and would challenge, namely school fees, extra tuition fee, medical, entertainment, holidays, and lunches and pocket money. 50. Other than the 6 items as mentioned above, the rest of the items in the Children’s list of the expenses will be accepted by the husband as reasonable. The husband asserted that school fees should be $12,000 instead of $15,000, and that extra tuition fee should be $10,000 instead of $20,000, and there should be no medical fee. 51. As to the entertainment and holiday expenses, the husband asserted that it should be $1,000 and $2,000 respectively, instead of $2,000 and $5,000 respectively, and that lunch and pocket money should be $4,000 instead of $6,000. Therefore, the husband suggested that the amount of the expenses for the Children should be $38,800 instead of $63,800. 52. According to the calculation suggested by the husband, the total amount of the Personal expenses of the wife and the expenses for the Children should be $46,500. 53. First of all, for the items in the Personal expenses of the wife and the Children which are conceded by the husband, my view is that the expense is necessary and the amount stated for are reasonable. 54. Next, I look at the reasonableness of the items not conceded by the husband. 55. In determining what amount should be reasonable for the expenses of meals out of home, I must also consider the amount spent in food under the General expenses. 56. The wife had stated $5,000 for food in the list of General expenses. The younger son is studying in a boarding school, so most of the time, only the wife and the elder son will be at home consuming breakfast and dinner. In that case, $30 per day for breakfast and $100 per day for dinner would be sufficient and reasonable for two people. 57. As a result, I would consider $4,000 would be reasonable for the expenses for food at home instead of $5,000 under the General expenses. 58. For meals out of home, if I assume once every week (i.e. 4 times a month), I shall consider $3,500 as a reasonable sum. The way this amount is determined is, assuming each meal out of home will cost $875 for 3 people, then adding the $100 which has been allowed for food cost for each dinner, each meal out of home will be $975, if that night they stay out for dinner. 59. As to lunches and pocket money for the children, I consider that the sum of $4,000as reasonable because each child will have $2,000, and each of them can spend about $67 per day. 60. I consider thatthe entertainment and holiday expenses should be treatedtogether because it reflects the leisure activities one enjoys inside and outside Hong Kong. For these 2 items, the wife’s expense is $2,000, whereas the children’s expense is $7,000. 61. My view is that the wife’s expenseon these 2 items is reasonable. I am of the view that the children’s expense on these 2 items should be similar to the wife’s. Therefore, I will consider that the children’s expense on these 2 items should be $4,000. 62. As to the school fee for the children, the husband asserted that it should be $12,000 instead of $15,000. 63. According to attachment to Part 4.3 of the Form E of the wife, the annual school fee of the elder son is $17,600, and the examination fee for HKDSEE for 2016 is $3,086. 64. The annual school fee of the younger son is $60,400 whereas his annual boarding fee is $63,700 and there is miscellaneous fee of $3,523 for the year of 2015/2016. The total expenses of the children for this item is $148,309, and on average each month shall be $12,359. I shall round up the figure to $12,500 per month. 65. As to the extra tuition fee for the Children, the wife in her 2 nd affidavit stated that the Children attended many private tuition classes outside of school, including for mathematics, physics, chemistry, and general education (see paragraph 30(3)). 66. The elder son is now preparing for public examination, and that both Children had attended private tuition outside of school in order to keep up with their studies alongside the demands of their sport training and competition. I see no reason why this pattern of learning should change in the meantime. 67. The husband asserted that the extra tuition fee should be $10,000 instead of $20,000. For the elder son, the wife stated that around $540 to $590 is spent per month for each subject at the tuition center inMongkok. 68. Therefore, each month will be approximately $2,500 for 4 subjects. The wife asserted that the elder son also attends another tuition center. I estimate that another $2,500 would be sufficient, so the total provision for the elder son for extra tuition fee should be $5,000. 69. For the younger son, the wife asserted that $6,155 was spent in January 2016 and $3,900 was spent in February 2016. I shall take $5,000 as reasonable because on average per session is $325, and each session is about 2 hours. 70. In that case, the younger son had been provided for 15 sessions and the younger son needed to attend 30 hours of private tuition per month which I consider sufficient and reasonable. 71. I estimate that it will be reasonable for the two children to spend $10,000 in total for the extra tuition fee as suggested by the husband. 72. The wife had produced the medical certificates for the elder son and the younger son. According to the exhibits produced by the wife (see SWM-10), Dr. Chan had in a letter dated 12 th October 2015 stated that the elder son was suffering from anxiety disorder, and he is receiving regular psychiatric medications. 73. The elder son also attended counseling services in dealing with the emotional distresses on 29/8, 4/9, 10/9, 12/9, 14/9,18/9 and 24/9. 74. Dr. Chan had also in a letter dated 7 th January 2015 stated that the younger son has been under his care since November 2015, and the younger son is suffering from depressive episode with anxiety symptoms, and mentally unfit to resume his sport training on medical ground, and that the younger son needed to receive regular psychiatric and psychological treatment. 75. In a letter dated 23 rd June 2015 issued by Victor & Partners Physiotherapy, it was stated that the younger son required post surgical management of lumbar spine, and needed to undergo 42 sessions of physiotherapy for 6 months, and each session costs $900. The total fee is $37,800 and my calculation is that the expenses for each month should be $6,300. 76. The younger son also consulted another doctor for shoulder and upper back injury, and the consultation fee is ranging from $830 to $980. 77. The husband asserted that the Children can consult public hospital, that is why he considered that no provision should be made for this item. I can see that there is necessity for the elder son and the younger son to consult different types of doctors from time to time. I see no reason why they need to go to public hospital unless the husband is financially incapable to support them which I shall consider later when I deal with the husband’s ability to pay. 78. I am of the view that the medical expenses as suggested by the wife for the Children in the amount of $6,000 per month is reasonable. 79. As to General expenses of the wife, the husband had conceded that he will not dispute the mortgage instalments (see skeleton paragraph 8). 80. The wife stated in her affidavit that she owns a car-park and a car. The husband and the wife bought a Honda in 2006 for around $220,000 and to this day, that was the car she used to chauffeur the Children. 81. I see no reason why the mode of travelling she adopted for 10 years should change. Therefore, the car expense of $5,000 and the carpark management fee of $350 per month should incur and I consider that the said amount is reasonable. 82. Apart from the car expenses, the wifealso claimed for herself and the Children $200 and $500, respectively, for transportation. I am of the view that since the wife already claimed car expenses, there should not be any additional transportation expenses to be claimed. 83. The husband also challenged the amount of the mobile phone and internet charges. The husband suggested $1,500 for this item. I consider $1,500 as reasonable for this item. A decent plan for a mobile phone should not be more than $500. 84. By reason of the aforesaid adjustments, the monthly outgoings for the wife and the Children should be the following items and amount: General Mortgageinstalments $26,452 Utilities $4,584 Management fees $1,597 Food $4,000 Household expenses $2,000 Carexpenses $5,000 Storage $1,768 $45,401 Personal Meals out of home $3,500 Clothing/Shoes $300 Personal grooming $500 Entertainment/presents $500 Holidays $1,500 Medical/Dental $200 Repayment of Bank loan $5,494 Mobile & Internet $1,500 Insurance premium $1,800 $15,294 Children School fees $12,500 Extra tuition fees $10,000 School books and stationery $3,500 Medical/Dental $6,000 Extra CurricularActivities $500 Entertainment/presents/Holidays $4,000 Clothing/Shoes $2,000 Insurance premium $3,000 Lunches and pocket money $4,000 Uniform $300 $45,800 Grand Total: $106,495 85. To round up the aforesaid figure, I am of the view that $107,000should be a reasonable sum for the maintenance pending suit for the wife to cover the immediate need of the wife and the Children instead of figure suggested by the husband. 86. Mr. Lam had submitted that it is possible for the wife to produce some income. 87. Ms. Chan referred me to the case of H v H (unrep., FCMC 1969/2007, 3 October 2007), and submitted that the sole criteria in making an award are reasonableness and the needs of the parties, and the Court should not take a long term view or consider the potential earning capacity or future capital prospect of the parties. 88. I totally agree with Ms. Chan’s submission. The wife stopped working in September 2007 and become a full time housewife ever since. It is both unrealistic and wrong in principle to consider the potential earning capacity of the wife (if any) for the present purpose. Issue 2 Can the husband afford to pay these sums? The husband’ s Financial Position 89. The husband is now 49 years old, and Mr. Lam did not submit that the husband is unable to pay the ongoing maintenance pending suit. He only submitted that the husband may have difficult in paying the lump sum maintenance backdated since November 2015. 90. The husband is now enjoying an income of about HK$192,000.00 per month. His bank accounts revealed a credit balance of $127,947.69. His investment in share and stock is about $50,000. His pension is slightly over $5.6 million. He has no outstanding payment of his credit cards. 91. According to the husband’s Form E, he stated that his current General monthly expenses is$15,800. His Personal monthly expenses is$143,000, and the Children monthly expenses is $2,200. Therefore, he stated that the total monthly expenses is$161,000. 92. The amount that the husband spent for his General monthly expenses is reasonable. However, I find that there are a number of items in the Personal expenses which appear overstated. I shall deal with them one by one. 93. Firstly, the money spent on meals out of home appears overstated and unreasonable.According to the exhibit produced by the husband (see HHH-7), the husband usually spends $30 for breakfast, $50 for lunch and $60 for dinner, so a total of $140 per day, which means about $4,200 per month. 94. The husband may sometimes goes out for expensive meals. My view is that it would be more than sufficient and reasonable for a person to spend $500 each time and 8 times per month, which means about $4,000. Therefore, the amount for meals out of home should be $8,200 instead of $10,000. 95. The husband also stated that his travelling expenses is $5,000 (see HHH-8). My view is that this amount is again overstated. The husband travelling expenses is ranging from $20 to $100. There is only one time which he spent $5,000. I do not consider this sum as reasonable and regular. Deducting this sum of $5,000, I consider that his average travelling expenses should be $2,000. 96. As to the expenses of clothing/shoes, he stated that he will spend $5,000 per month. My view is that this amount is again overstated and unreasonable. I am of the view that $3,000 per month will be reasonable. 97. As to the expenses for entertainment/present and holidays, earliest on, I have mentioned that the entertainment and holiday expenses should be treated together because it reflects the leisure activities one enjoys inside and outside Hong Kong. For these 2 items, the wife’s expenses is $2,000, whereas the husband’s expenses is $10,000. 98. According to HHH-10, the husband stated that on 13 th January 2016, he spent$7,130 on gifts, and 25 th January 2016, he spent $135 on other gifts. The husband also stated that he spent $5,000 on holidays. 99. I cannot see why on the one hand, the husband suggested that the wife’s expenses on these items should be $1,200 and the Children’s expenses on these items should be $3,000 for the 2 of them, when on the other hand the husband can spend $10,000. 100. My view is that $1,000 for the expenses of entertainment/present and $1,500 for the expenses of holiday is reasonable for the husband which is higher than the wife’s expenses as a matter of fairness. 101. In addition, as to the expenses of others, the husband stated that he needed to spend $80,000 which covered future expenses for setting up his own clinics (see HHH-11), purchasing property and repayment of debts owed by the wife to the coach. 102. I am of the view that potential future expenses for setting up clinics and purchasing property are future needs and plan of the husband which should not be taken into account for the present purpose. Theseplans are long term plan and can always be postponed for the more urgent and immediate needs of the wife and Children. 103. As to the husband’s assertion that he needed to repay the debt that the wife owed to the coach, my view is that if it is later proven that the wife is liable to pay the coach, she will be made responsible to bear the debts. 104. For the present purpose, I am not persuaded that the husband had any obligation to pay to the coach on behalf of the wife. Therefore, the amount of $80,000 mentioned in the Form E of the husband should be deducted.By reason of the aforesaid adjustments, the monthly outgoings for the husband should be the following items and amount: General Utilities $2,000 Management fees $300 Food $1,000 Household expenses $1,000 Insurance $2,500 Domestic helper $9,000 $15,800 Personal Meals out of home $8,200 Transport $2,000 Clothing/Shoes $3,000 Personal grooming $200 Entertainment/presents $1,000 Holidays $1,500 Medical/Dental $300 Tax $30,000 Insurance premium $2,500 Contribution to parent $10,000 $58,700 Children School fees $2,200 $2,200 Grand Total: $76,700 105. After deducting the aforesaid expenses of $76,700 from his monthly income of $192,078, the husband still have $115,378. I am of the view that the husband is able to pay $107,000 to the wife for her maintenance pending suit. 106. After paying the wife maintenance pending suit, the husband still have $8,378. The husband also stated that his father is in his 90’s, if unfortunately his father passed away, he needs to move out from the present premise where he lives with his father. 107. If that is the case, by that time, the husband can stop paying $10,000 to his father and also reduce to having one domestic helper instead of two. The reduction in expenses in these items will allow him to have sufficient money to cover his own rental expenses, if he will incur one by that time. 108. In addition, I agree with the observation made by Ms. Chan in her skeleton at paragraph 51. For Maintenance pending suit, the husband’s resources may include the husband’s ability to provide money by overdrafts or through loans. 109. Therefore, even if my assessment of the expenses of the husband is incorrect, after taking into account of the husband’s ability to provide money by overdrafts or through loans. I am prepared to make robust assumptions about his ability to pay, and I am not confined to the mere say-so of the payer as to the extent of his income or resources. 110. Of all these available or potential sources aforesaid mentioned, I am of the view that the husband is able to pay the wife HK$107,000 per month as maintenance pending suit. 111. After considering all the circumstances of the case and the evidence received so far, I am prepared to make an interim maintenance order for the wife. 112. The General expenses of the wife for the sum of $45,401 should be divided by 3, which is $15,134 for each person. The wife maintenance should be 1/3 of the General expenses (i.e. $15,134) plus her Personal expenses (i.e. $15,294) which equals to a total sum of $30,428. I shall round up the figure to $31,000per month being maintenance pending suit for the wife. 113. As to the maintenance pending suit for each child, I am aware that each child has different level of expenses on some of the items e.g. school fee and medical expense. The school fee and medical expense for the elder son per month should be $1,800 and $1,000 respectively. Whereas the school fee and medical expense for the younger son per month should be $10,700 and $5,000 respectively. 114. By reasons of the aforesaid, the amount for the elder son should be 1/3 of the General expenses (i.e. $15,134) plus $16,450 being his share of the expenses for the Children which equals to $31,583. I shall round up the figure to $31,500 per month for the elder son. 115. The amount for the younger son should be 1/3 of the General expenses (i.e. $15,134) plus $29,350 being his share of the expenses for the Children which equals to $44,484. I shall round up the figure to $44,500 per month for the younger son. Issue 3 In the event that an amount is ordered what date should that part of the order take effect from? 116. During the hearing Ms. Chan asked that the maintenance pending suit be backdated to November 2015. 117. I am not prepared to backdate the aforesaid sum to the date of November 2015. My view is that having provided maintenance pending suit to cover the repayment of the loan which the wife had previously incurred, I do not see there is any need to backdate her maintenance pending suit to the date of November 2015. Order 118. It is ordered that : (a) the husband shall pay the wife the sum of $31,000 per month as maintenance pending suit for the wife, the 1 st payment to be paid on 15 th April 2016 and thereafter on or before the 15 th day of each succeeding month until further order of the court; (b) the husband shall pay the wife the sum of $31,500 per month as maintenance pending suit for the elder son, the 1 st payment to be paid on 15 th April 2016 and thereafter on or before the 15 th day of each succeeding month until further order of the court; (c) the husband shall pay the wife the sum of $44,500 per month as maintenance pending suit for the younger son, the 1 st payment to be paid on 15 th April 2016 and thereafter on or before the 15 th day of each succeeding month until further order of the court; (d) credit would be given for the monthly direct payments of $2,200 the husband paid to the school; and (e) all the aforesaid monthly payments will be paid on account of any sum eventually received by the wife and/or the husband when the AR is determined. Costs 119. I will make a costs order. Costs shall follow the event. I will make a decree nisi that costs of this summons shall be to the wife to be taxed if not agreed, such order to be made absolute upon the expiration of 14 days. There shall be certificate for counsel.Lastly, I thank both counsels for their assistance. David C. W. Cheung Deputy District Judge Representation : Mr. Kenneth Lam instructed by Messrs. K.T. Chan & Co. for the Petitioner Ms. Lareina Chan instructed by Messrs . Chan, Wong & Lam solicitors for the Respondent Look up this case on Lawcite Noteup",
  "length": 34824,
  "headers_seen": [
    "Brief History",
    "The Law on Interim Maintenance",
    "The wife’s Case",
    "The husband’s case",
    "Issues of the case",
    "Issue 1",
    "How much maintenance should the husband pay to the wife as reasonable maintenance pending suit for herself?",
    "The wife’s Financial Position and needs"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkfc/2016/108",
  "query": "maintenance pending suit",
  "ts": "2025-10-16T12:10:52",
  "ok": true
}