{
  "title": "廈門新景地集團有限公司 FORMERLY KNOWN AS 廈門市鑫新景地房地產有限公司 V. ETON PROPERTIES LTD AND ANOTHER | [2023] HKCFI 1327 | HKLII",
  "court": null,
  "year": 2023,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2023] HKCFI 1327 廈門新景地集團有限公司 FORMERLY KNOWN AS 廈門市鑫新景地房地產有限公司 V. ETON PROPERTIES LTD AND ANOTHER Judgment Information Date 17 May, 2023 Action No. HCCT98/2022 Neutral Cit. [2023] HKCFI 1327 Parallel Cit. [2023] 4 HKC 373 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCCT98/2022 HCCT98/2022 廈門新景地集團有限公司 formerly known as 廈門市鑫新景地房地產有限公司 v. ETON PROPERTIES LTD AND ANOTHER HCCT 98/2022 [2023] HKCFI 1327 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO 98 OF 2022 ____________________ IN THE MATTER of Section 21L of the High Court Ordinance ( Cap. 4 ) ____________________ BETWEEN 廈門新景地集團有限公司 formerly known as 廈門市鑫新景地房地產有限公司 Plaintiff and ETON PROPERTIES LIMITED (裕景興業有限公司) 1st Defendant ETON PROPERTIES (HOLDINGS) LIMITED (裕景興業(集團)有限公司) 2nd Defendant ____________________ Before: Hon Mimmie Chan J in Court Date of Hearing: 20 March 2023 Date of Judgment: 18 May 2023 _______________ J U D G M E N T _______________ Background 1. This case has a remarkable history in terms of the long and winding course the parties have taken through the courts at all levels. 2. From its source of an ex parte application made in HCCT 54/2007 for leave to enforce a Mainland arbitral award made in October 2006 (“ 1 st Award ”) for the continued performance of an Agreement made between the Plaintiff and the 1 st and 2 nd Defendants (“ Agreement ”) and for statutory judgment to be entered on the 1 st Award, the Plaintiff’s action to enforce the 1 st Award by HCCL 13/2011 (“ HCCL 13 ”) (formerly HCA 961/2008) has gone through a trial on liability at first instance, with appeals all the way to the Court of Final Appeal (“ CFA ”). The matter has now returned to the Court of 1 st Instance for trial on quantum, but the parties have continued their skirmishes at each and every turn. Only the essential developments more relevant to the latest dispute are outlined below. 3. The Court of Appeal, by its judgment of 15 April 2016 (“ CA Judgment ”), overturned the initial trial judge’s dismissal in June 2012 of the Plaintiff’s claims made in HCCL 13. In the CA Judgment, the Court of Appeal allowed the Plaintiff’s claim against the 1 st and 2 nd Defendants for breach of their implied promise to honour and perform the 1 st Award (“ Promise ”), but held that the Plaintiff should elect between (i) maintaining the judgment entered on the 1 st Award for continued performance of the Agreement, or (ii) obtaining judgment for damages for the Defendants’ breach of the implied Promise. After some procrastination, the Plaintiff on 9 October 2017 elected to enter judgment for damages. Upon such election, the statutory judgment in HCCT 54/2007 was set aside. 4. On 30 April 2018, the trial for assessment of damages in HCCL 13 was stayed pending the determination of the appeal against the CA Judgment by the Court of Final Appeal (“ CFA ”). 5. The CFA judgment was handed down on 9 October 2020 (“ CFA Judgment ”), whereby the Defendants’ appeal against the CA Judgment was dismissed. Consequently, directions were made on 6 November 2020 for the trial on quantum and assessment of damages in HCCL 13 to proceed, with hearing dates scheduled in September 2023, and for further pleadings to be filed on quantum. As was customary to these parties, various interlocutory skirmishes and appeals followed, but leave was granted in August 2022 for the pleadings to be amended, and directions issued for expert evidence to be adduced on issues of valuation. The current dispute 6. In the midst of the preparations for the trial on quantum in HCCL 13, on 17 June 2022, the Defendants commenced a new arbitration against the Plaintiff on the Mainland (“ New Arbitration ”). In the New Arbitration, the Defendants seek from the tribunal the following orders (“ Relief ”): (1) that the Agreement is terminated; (2) that upon termination of the Agreement, which cannot and has not continued to be performed, the rights and obligations of the parties including compensation for loss shall be determined according to the governing law of the Agreement, being the laws of the PRC; (3) that the compensation for loss arising from the claim made in the arbitration is a dispute arising from the performance of the Agreement, and both parties are obligated to submit the dispute for arbitration pursuant to the arbitration clause contained in the Agreement; and (4) that in relation to the compensation for loss, the Defendants’ liabilities should be limited to the principle of penal deposit, namely making an additional payment of the deposit in the amount of RMB 5 million, or any amount as determined by the tribunal to be appropriate under PRC laws. 7. The Defendants claim that the New Arbitration was commenced by them as a result of the PRC Civil Code coming into effect on the Mainland on 1 January 2021 (“ Civil Code ”). Article 580 of the Civil Code (“ Article 580 ”) allows any party to an agreement, regardless of whether it is the party in breach or the innocent party, to terminate the agreement in circumstances specified in the provision. This was in contrast to the former provisions of Article 110 of the PRC Contract Law, which limits the right to seek a discharge of an agreement to an innocent party which was not in breach thereof. 8. The Defendants highlighted the fact that the New Arbitration concerns the rights and obligations of the parties under the Agreement, which is separate and distinct from the enforcement proceedings in Hong Kong which concern enforcement of the Promise to perform the 1 st Award. They maintain that the issues raised in the New Arbitration for determination by the tribunal have not been litigated before in Hong Kong, as they concern the Defendants’ right to terminate the Agreement under the new provisions of the Civil Code, and concern the amount of compensation payable by the Defendants upon such termination of the Agreement in accordance with Article 580. The Defendants pointed out that the New Arbitration has been accepted by CIETAC, according to its notice issued on 9 October 2022. 9. On 3 November 2022, the Plaintiff issued the Originating Summons in this action, seeking an injunction to restrain the Defendants from taking any steps to pursue the New Arbitration or the claims therein, and to compel them to take steps to discontinue the New Arbitration. The Plaintiff claims that the New Arbitration was commenced by the Defendants in bad faith, with a view to relitigating issues already determined in the enforcement proceedings in Hong Kong and to deprive the Plaintiff of the fruits of the 1 st Award. The Plaintiff argued that the New Arbitration is an attempt to frustrate the enforcement of the 1 st Award, which is vexatious, oppressive and abusive, such that the injunction sought should be granted in order to protect the Hong Kong judicial process, and prevent attacks against the judgments made by the Hong Kong Courts. 10. Despite the emphases placed by the Defendants on the fact that the New Arbitration was commenced as a result of the change in law effected by the New Code, Counsel for the Plaintiff has pointed out that the Request for Arbitration (“ Request ”) served by the Defendants in fact made no mention of Article 580 or of the Civil Code itself as the alleged basis of their claims in the New Arbitration. What the Defendants did refer to was the Plaintiff’s claim for damages in HCCL 13, as being a claim for compensation of its loss for the Defendants’ breach of the Agreement, the Defendants claiming in the Request that such a claim of the Plaintiff was in breach of and inconsistent with the Agreement which provides for the parties’ reference to arbitration for assessment of damages under the Agreement. The Plaintiff argued that the Defendants’ stance, as reflected in the Request, demonstrates that they are seeking to relitigate in the New Arbitration matters which have already been finally decided by the CFA and the Court of Appeal, namely, that the Plaintiff’s claim for damages in HCCL 13 is one for the Defendants’ breach of the Promise, and not for breach of the Agreement, and further, that the arbitration clause in the Agreement only covers disputes arising from the performance of the Agreement, and not disputes relating to the Promise to perform the 1 st Award. 11. The Plaintiff submitted that the New Arbitration was commenced 20 years after the Defendants’ breach of the Agreement (and nearly 18 months after the Civil Code came into effect), in an attempt to argue yet again that the Plaintiff should not be entitled to damages at common law, because such claim for damages should be governed by PRC law and should be submitted to the CIETAC tribunal for determination. On behalf of the Plaintiff, Counsel argued that the Court should infer from all the circumstances of this case that the Defendants were mala fide in commencing the New Arbitration, and that it is clear that the New Arbitration is vexatious, initiated for the purpose of undermining or hampering the enforcement of the 1 st Award - which should not be allowed. The currently decided and indisputable matters 12. It is helpful to set out and summarize what, in my judgment, are indisputable matters. 13. In the 1 st Award, the tribunal recorded that the Defendants had repudiated the Agreement, and that the Plaintiff had refused to accept termination. The tribunal rejected the Defendants’ argument that performance of the Agreement was impossible due to the change of circumstances, namely the construction activities which had already taken place on the land in question, the sale of the residential units, and the restructuring of the Eton Group which had been carried out, as a result of which the Defendants’ shareholding/control in Legend Properties (Xiamen) Company Limited (“ HK Legend ”) which owned the Mainland company Legend Properties (Xiamen) Company Limited (“ PRC Legend ”) which in turn had the right to develop the land in Xiamen (“ Land ”) had been transferred to another entity (“ EPGL ”) in the Eton Group (“ Restructuring ”). By the 1 st Award, the tribunal declared that the Defendants shall continue to perform the Agreement. 14. The Hong Kong Court entered judgment in terms of the 1 st Award (“ Statutory Judgment ”), and dismissed the Defendants’ application to set aside the Statutory Judgment, which application was made on the ground that it was impossible to perform the Agreement. In his judgment, Reyes J did not accept that the Agreement was substantially incapable of performance, as alleged. 15. On appeal, the Court of Appeal affirmed the judgment of Reyes J, Le Pichon JA holding that there was no insuperable impediment to the transfer of the shares registered in the name of EPGL to the Plaintiff, and that in any event the alleged impossibility was self-inflicted by the Defendants’ Group. 16. The Defendants had returned to the CIETAC tribunal to seek a determination that the Agreement could not be performed, and that the parties should be discharged therefrom (“ 2 nd Arbitration ”). Such application was refused by the arbitral tribunal, by another award made on 22 April 2009 (“ 2 nd Award ”). The Defendants argued in the 2 nd Arbitration that the Agreement had been lawfully terminated because of the substantial change involving completion of the development, the sale of more than 90% of the units in the development, and the Restructuring. The tribunal rejected this argument, holding that the Restructuring which caused the Defendants’ shareholding/control in Hong Kong Legend to be transferred to EPGL was itself a breach of the Agreement, and not a ground for lawful termination. 17. The tribunal further stated in the 2 nd Award that it was not satisfied that the objectives of the Agreement were incapable of being met, pointing out that the order made in the 1 st Award was for the continued performance of the Agreement and that the judgment of Reyes J had made observations on how the Agreement should be performed. 18. When the Defendants applied to the tribunal again, to seek a ruling on the alternative approaches to meet the purpose of the Agreement, such application was refused by the tribunal. In its decision of 27 July 2009, the tribunal stated in no uncertain terms that the 1 st Award was final, and had not left out any matter which would need to be further determined according to the PRC Arbitration Law. 19. As explained in the CA Judgment, which allowed the Plaintiff’s claim for breach of the Promise to perform the Award, the failure to honour the implied mutual promise to honour an award after a valid submission of the dispute to arbitration constitutes a fresh and separate cause of action which is independent of the action based on any breach of the underlying contract. 20. The CA Judgment found that HCCL 13 operated at the enforcement phase, and was distinct from any dispute falling within the arbitration clause of the Agreement, thereby rejecting the Defendants’ argument that HCCL 13 was an invalid attempt at circumventing the arbitral process. The Court of Appeal agreed that the tribunal was in effect functus . 21. In the CFA Judgment, the CFA rejected the Defendants’ argument that HCCL 13 was a claim to enforce the Agreement, pointing out that the action on the 1 st Award was an independent cause of action separate from the original contract or the breach occurring from it, such that the two claims are governed by different systems of law. Suing for breach of the Promise is an aspect of enforcement regulated by the enforcing court according to the lex fori , and to be distinguished from the arbitration concerning performance of the Agreement which was governed by PRC law. 22. The CFA also dismissed the Defendants’ proposition that the damages claimed in HCCL 13 should be viewed as damages for loss of the profits of the development flowing from breach of the Agreement. It was explained that at the enforcement stage, the enforcing court may grant such relief as may be appropriate to the award, such as damages for failure to perform a non-monetary award, specific performance, a declaration or an injunction. 23. The CFA found the Defendants’ suggestion that the 1 st Award and the 2 nd Award were solely concerned with the validity of the Agreement to be “wholly unsustainable”. The CFA pointed out that the tribunal had: held that the Defendants were in breach of the Agreement; rejected the Defendants’ submission that continued performance of the Agreement was impossible; stated that the Restructuring was a breach of the Agreement which could not be a ground to terminate the Agreement; made it clear that the tribunal had fully adjudicated the case, and that the arbitration was final and comprehensive; and refused to entertain further proceedings for damages or other appropriate relief. 24. In the Statement in Response filed for the trial on quantum, the Defendants had sought to claim: firstly, that questions relating to the Plaintiff’s loss, including heads of loss, causation and remoteness, are governed by PRC law, and under PRC law, the failure to perform the 1 st Award does not give the Plaintiff any right to damages (“ PRC Law Argument ”); and secondly, the Plaintiff’s failure to submit the underlying dispute to CIETAC to obtain an award which can be performed and enforced, or to seek a ruling as to how the parties can continue to perform the Agreement, or to agree to submission of the dispute to arbitration, constituted the Plaintiff’s failure to mitigate its loss (“ Arbitration Argument ”). These claims have been struck out by this Court’s decision of 3 August 2021, on the basis of the findings already made in the CA Judgment and the CFA Judgment. Applicable legal principles 25. I do not think that the parties are far apart in terms of the legal principles applicable to an application for the grant of an anti-arbitration injunction. 26. The Court has the jurisdiction and power under section 21L of the High Court Ordinance (the equivalent of section 37 of the English Senior Courts Act) to grant either an anti-suit injunction or an anti-arbitration injunction, and the power to grant such injunction is in all cases in which it appears to the Court to be just or convenient to do so. The power to restrain a party from proceeding with an arbitration under section 21L was recognized in SA v KB [2016] 2 HKLRD 1249 . In that case (decided in November 2011 but only reported in 2016), Deputy Judge G Lam SC (as Lam JA then was) considered the English authorities on anti-suit and anti-arbitration injunctions, and concluded that whilst the jurisdiction to grant an injunction to restrain an arbitration exists, the power of the Court to grant such an injunction must be exercised not only with great caution and in circumstances which can be shown to be wholly exceptional, but also with due and proper regard to the objectives and principles of the autonomy, independence and finality of arbitration as enshrined in the Arbitration Ordinance (“ Ordinance ”). 27. In SA v KB , His Lordship applied the principles set out in J Jarvis & Sons Ltd v Blue Circle Dartford Estates Ltd [2007] BLR 439, that two conditions have to be satisfied before the power to grant an anti-arbitration injunction may be exercised, namely: (1) the injunction does not cause injustice to the claimant in the arbitration, and (2) the continuance of the injunction would be oppressive, vexatious, unconscionable or an abuse of process. 28. In Sabbagh v Khoury [2020] Bus LR 724, the English Court explained that an anti-arbitration injunction involves an interference with the fundamental principle of international arbitration that courts should uphold, and therefore not interfere with, arbitration agreements. David Richards LJ pointed out that where it is clear that the dispute in question is within the terms of a valid arbitration agreement, then the courts should not interfere. In view of the extensive Hong Kong authorities on the approach and policy of the Courts here towards upholding arbitration agreements and the finality of arbitral awards, this principle cannot be disputed. 29. The English Court in Claxton Engineering Services Ltd v TXM [2012] 1 CLC 326 also highlighted the need for caution in the grant of anti-arbitration injunctions in relation to arbitrations outside the jurisdiction, “because such matters are generally best left to the relevant supervisory courts being the courts of the country of the seat of the arbitration”. In his judgment, Hamblen J observed: “In many of the cases which concern whether an anti-arbitration injunction should be granted there is an issue as to whether there is any or any valid arbitration agreement. One can well understand why it would generally be appropriate for that issue to be left in the first instance to be determined by the arbitration tribunal.” 30. In Claxton itself, the court had held that there was no arbitration agreement, and was satisfied that there were “sufficiently exceptional circumstances” to justify the grant of an anti-arbitration injunction, on the basis that the foreign arbitration would infringe the claimant’s contractual right to have the dispute determined by the English court in accordance with the exclusive jurisdiction clause in the agreement, and also that continuation of the arbitration would be vexatious and oppressive. 31. Counsel for the Defendants have referred to the courts’ observation that the approach for the grant of the normal anti-suit injunctions should not be automatically applied to anti-arbitration injunctions, because of the more restricted nature of the powers of the courts to intervene in arbitrations by virtue of the express statutory provisions of the English Arbitration Act 1996 and Article 5 of the Model Law (corresponding with section 3 of our Arbitration Ordinance ). In Excalibur Ventures LLC v Texas Keystone Inc [2011] 2 CLC 338, Gloster J observed: “An English court will be particularly slow to restrain arbitration proceedings where there is an agreement for the arbitration to have its seat in a foreign jurisdiction and the parties have ‘unquestionably agreed’ to the foreign arbitration clause: see Weissfisch v Julius at paragraph 33. That is because, given the priority to be accorded to the parties’ choice of arbitration, and the limited nature of the court’s powers to intervene under the provisions of the Arbitration Act 1996 (‘the Act’), the court should not simply apply the same approach as for the grant of the normal anti-suit injunction: see Elektrim SA v Vivendi Universal SA (No 2) ( supra ) per Aikens J (as he then was) at paragraph 77.” 32. In SA v KB , the Hong Kong Court also observed (at paragraph 87 of the judgment) that the approach to an anti-arbitration injunction cannot be entirely assimilated to that for an anti-suit injunction, explaining as follows: “In the case of an anti-suit injunction affecting foreign proceedings, the jurisdiction is exercised by the Hong Kong Court with caution because of the need for respect for comity. An injunction to restrain a local arbitration, as in the present case, is not affected by considerations of international comity in the same way. But, as explained above, it is subject to a different principle which also requires the power should be exercised with great caution, and that is the principle of autonomy and independence of arbitration which has been given statutory recognition in s 2AA (2) (b) of the Arbitration Ordinance .” The principles and objective of section 2AA of the repealed Arbitration Ordinance Cap 341 remain unchanged as reflected in section 3 of the Ordinance. The Defendants have accordingly pointed out that the need for great caution is highlighted and more important when the subject of the injunction is a foreign-seated arbitration, as in the present case. 33. There can be no doubt that the objectives of autonomy as set out in section 3 of the Ordinance, and the policy of minimal curial intervention in arbitration, as repeatedly emphasized by the courts, must be borne in mind when an application for anti-arbitration injunction is considered. 34. In Born, International Commercial Arbitration , 3 rd ed at page 1416, the author expressed concerns that anti-arbitration injunctions against international arbitrations which are subject to the New York Convention are difficult to be reconciled with obligations imposed by the Convention on Contracting States. As Counsel for the Defendants highlighted, Born drew the distinction between cases where an injunction is granted to restrain a party from proceeding with purported arbitral proceedings in the absence of a valid arbitration agreement, and cases where injunctions are made in respect of an arbitration under a valid international arbitration agreement, the latter of which may be a breach of articles II (3) and III of the Convention. 35. In Sabbagh v Khoury [2020] 1 All ER 485 , the English Court of Appeal considered the above question and David Richards LJ accepted that where a dispute fell within an arbitration agreement, the grant of an anti-arbitration injunction would be contrary to the fundamental principle underpinning the New York Convention and the 1996 Act, of respecting and giving effect to arbitration agreements. This is demonstrated by the fact that the court would have to stay the proceedings under section 9 of the 1996 Arbitration Act (corresponding to section 20 of the Ordinance) if there had been an application made under the section in respect of a matter which should be referred to arbitration. The Court of Appeal in Sabbagh v Khoury considered that where it is clear that the dispute is within the terms of a valid arbitration agreement, the courts should not interfere by granting an injunction to restrain the continuance of the arbitration. 36. On the strength of Sabbagh v Khoury and the authorities considered in that case, Counsel for the Defendants submitted that in the cases where anti-arbitration injunctions were granted, there were at least genuine and serious disputes over the jurisdiction of the arbitral tribunal or the arbitrability of the dispute submitted to arbitration, and that even in such cases, the Court still has the discretion whether to leave the issue to be decided by the tribunal, in accordance with the Kompetenz-kompetenz principle. Counsel argued that the applicant for the injunction must demonstrate to the Court that there is at least a good arguable case that it is not bound to submit the dispute to arbitration in accordance with a valid and existing arbitration agreement. 37. From the authorities on anti-arbitration injunctions, it can be seen that what the applicant has to establish is that firstly, the continuance of the arbitration affected by the injunction sought would be oppressive, vexatious or an abuse of process, such as to affect the legal or equitable rights of the applicant (which would include the right not to be harassed by abusive proceedings), and further, that the grant of the injunction will not cause injustice to the claimant in the arbitration. This is due to the fact that under section 21L of the High Court Ordinance , the touchstone for the grant of the injunction is that it would be just or convenient to do so, which means that a balance of the justice or injustice to the parties concerned must be carried out. 38. Even in the cases cited and relied upon by Counsel for the Plaintiff, the relevant considerations of the courts were whether it would be vexatious and oppressive to proceed with the arbitration or foreign proceedings ( Convoy Collateral Ltd v Broad Idea International Ltd [2022] 2 WLR 703 ; Suen Kwai Kam v Central China Dragon Select Growth Fund [2020] HKCFI 69 ), and whether the grant of the injunction would cause injustice to the respondent, for example by depriving him of any advantage in the foreign forum ( Suen Kwai Kam v Central China Dragon Select Growth Fund [2020] HKCFI 69 ). 39. The other authorities relied upon by the Plaintiff are to support its contention that the New Arbitration is an attempt on the Defendants’ part to re-litigate issues already and finally determined in HCCL 13 and which are binding on the Defendants, such that the injunction should be granted to restrain the continuation of an arbitration which is vexatious and oppressive, in breach of the Plaintiff’s rights not to be vexed and sued again, and otherwise an abuse of the process of the court in an attempt to undermine or hamper the Hong Kong court’s enforcement of the 1 st Award. Should the injunction be granted in this case? 40. The starting point is the Request, which should be considered to ascertain the claims made and relief sought by the Defendants in the New Arbitration. 41. In the Request which was dated 17 June 2022, the Defendants referred to the Agreement and the arbitration clause contained therein. The Defendants then set out their request for the determination sought from the tribunal, which are: (1) Confirmation that the Agreement is determined; (2) Confirmation that when the Agreement is determined, cannot be performed or has not continued to be performed, compensatory damages and the rights and obligations of the parties should be decided in accordance with the governing law of the Agreement, namely PRC law; (3) Confirmation that the above question of compensatory damages is a dispute arising from the performance of the Agreement, and that both parties have the obligation to submit such dispute to arbitration in accordance with the Agreement; (4) Confirmation that in respect of the request for compensatory damages, the liability of the 2 nd Claimant should be confined by the deposit principle, namely payment of additional deposit of RMB 5 million, or such other compensation as the tribunal finds to be appropriate under PRC law; (5) Confirmation that the reasonable legal costs, arbitration costs and fees (if any) occasioned by the confirmation of determination of the Agreement be apportioned in accordance with principles of equality. 42. The Request then sets out the facts and grounds relied upon by the Defendants in their application for relief. These recite the background of the Agreement, the dispute leading to the 1 st Award and the 2 nd Award, the Plaintiff’s abandonment of the Statutory Judgment in Hong Kong and the judgment on the 1 st Award obtained in Hong Kong. The Defendants claimed in the Request that as the development of the Land had been completed, and the Restructuring of shares had taken place, it was practically impossible for performance of the Agreement to continue. The Defendants further stated in the Request that after the 2 nd Award, neither party had been able to perform the Agreement in substance, which situation had continued until 2022. 43. It was claimed in the Request that in seeking damages at common law on the basis of the value of the shares, the Plaintiff had in substance accepted the reality that it was impossible to perform the Agreement. The Defendants stated that the Plaintiff’s claim for damages in common law is in substance a claim for damages for the Defendants’ breach of the Agreement, but in seeking to assess such damages under Hong Kong law, the Plaintiffs were in clear breach of the Agreement which is governed by PRC law, under which the parties had agreed that damages should be submitted to arbitration, in accordance with the arbitration agreement contained in the underlying Agreement. The Defendants claimed in the Request that in the current circumstances, it was impossible to perform the Agreement, and each party should terminate the Agreement and seek determination of their rights and obligations in accordance with PRC law, and that it was on the basis of the parties’ arbitration agreement that the Defendants submitted the dispute to the tribunal. 44. Counsel for the Plaintiff therefore argued that as apparent from the Request and the claims made therein, the Defendants are obviously seeking to reopen and reargue that: (1) the Agreement should be terminated due to impossibility of performance; (2) the Plaintiff’s claim for damages in HCCL 13 is inconsistent with and a breach of the arbitration clause in the Agreement; (3) assessment of the Plaintiff’s claim for damages should be in accordance with PRC law as the governing law of the Agreement. These are matters which have been argued before the Hong Kong courts, and dismissed by the courts, such that the Defendants are seeking by the New Arbitration to attack the findings made not only by the Hong Kong courts but also the findings made by the tribunal in the 1 st Award and the 2 nd Award, which course is vexatious, oppressive and an abuse of process. 45. As summarized at paragraphs 13 to 15 and 23 above, the Hong Kong courts at different levels have unequivocally rejected the Defendants’ argument that it was impossible for the Agreement to be performed by virtue of the Restructuring and the development and sale of the units, and held that these were not grounds which could be relied upon by the Defendants to terminate the Agreement, or to set aside the 1 st Award. 46. In the 2 nd Award, the tribunal had also rejected such argument when the Defendants sought a ruling from it that the Agreement could not be performed, and that the parties should be discharged, the tribunal stating that it was not satisfied that the objectives of the Agreement were incapable of being met, and that there was nothing further to be determined by the arbitral tribunal. 47. The Hong Kong courts have also decided clearly and unequivocally that the Plaintiff’s claim in HCCL 13 is for breach of the Promise, which is a separate cause of action independent of the cause of action based on breach of the Agreement, that the action is an aspect of enforcement, which is governed by Hong Kong law as the lex fori , and not PRC law which governed the Agreement. Damages to be awarded for breach of the Promise are accordingly to be assessed by Hong Kong law. The amendments sought to be made by the Defendants, to plead that PRC law governed the question of the assessment of the Plaintiff’s loss, have all been struck out for the trial on quantum. 48. It will indeed be abusive and vexatious for the Defendants to be permitted to argue in the New Arbitration that the Plaintiff’s claim for damages as made in HCCL 13 should be determined and assessed by PRC law, as compensation for breach of the Agreement. Permitting them to do so would be allowing the Defendants to make a collateral attack on the CFA Judgment and all the other judgments made by the Hong Kong courts on the issue of the Plaintiff’s entitlement to damages for breach of the Promise, and that the impossibility of performance of the Agreement cannot be a ground to discharge the Defendant from the Agreement. There are good grounds to find that the New Arbitration is an abuse, vexatious and oppressive, which ought to be restrained in order to protect the Plaintiff’s rights to enforce the 1 st Award and not to be vexed by duplicitous claims. 49. However, before the Court can conclude that it should exercise its power to grant the injunction sought, there are other considerations such as whether the Defendants’ rights would be unjustly deprived or prejudiced, and whether it would be just to restrain the continuation of the New Arbitration. 50. In this case, it has to be borne in mind that, as the Hong Kong courts have recognized, the 1 st Award is for the Agreement to be continued to be performed. There is as yet no order by any tribunal or court to the effect that the Agreement has been terminated, or that the parties have been discharged therefrom, the courts and the tribunal rejecting the argument that performance of the Agreement is impossible. The Defendants therefore have a right to invoke the arbitration clause in the subsisting Agreement, and to submit to arbitration any dispute “arising from the performance of the Agreement”, in accordance with and as provided for in the relevant Article 13 of the Agreement. They claim that the performance, or the purported/attempted performance, of the Agreement has demonstrated that it should be terminated, and that with the passing of the Civil Code and the amendment of the Contract Law, the Defendants have now become entitled to seek termination of and their discharge from the Agreement, notwithstanding that they were held to have been in breach of the Agreement. 51. The Plaintiff pointed out that any new claim or argument sought to be based on the Civil Code cannot be an excuse to reopen questions finally decided by the Hong Kong courts. Under Article 580, the Defendants would have to establish that performance of the Agreement is impossible either as a matter of fact or as a matter of law, and that this caused the purpose of the Agreement not to be achieved. Necessarily, this entails attacking the findings made in the CFA Judgment, the CA Judgment and the 2 nd Award, in which the courts and the tribunal had rejected the claim that performance of the Agreement was impossible, and that the objectives of the Agreement were incapable of being met, and asking the tribunal in the 2 nd Arbitration to reopen all these issues. On the Plaintiff’s case, these are decided issues which create res judicata , or issue estoppel, and there is demonstrably a case of abuse, vexation and oppression. 52. On the Defendants’ part, they argued that the findings made by the Hong Kong Courts were made in respect of the cause of action on the Promise, whereas their claim in the New Arbitration for an order confirming the termination of the Agreement is one made on the basis of and under the Agreement. As the CFA and the Court of Appeal have held, a cause of action based on the underlying Agreement is separate and distinct, and independent of the action based on the Promise - the latter being the subject matter of HCCL 13. 53. What is material, as is clear from the authorities, is that an anti-arbitration injunction should only be granted by the Court in exceptional circumstances, and unless strong reasons are established, parties to an arbitration agreement ought to be kept to their bargain. If the respondent can establish that the claim sought to be submitted falls within the scope of the arbitration agreement, then the parties should abide by their agreement, and it would be against the principles and policy of the courts to grant an injunction to restrain the commencement or continuation of the arbitration. In this context, the Court must recognize and accept that it is within the jurisdiction of the tribunal to decide questions of res judicata or issue estoppel, which go to the merits of the defence and can be raised by the Plaintiff as an answer to the claims made by the Defendants in the New Arbitration, and the tribunal can determine whether the issues decided and findings made by either the tribunal in the 1 st Award or 2 nd Award, or by the Hong Kong courts in HCCL 13 on the claim for breach of the Promise affect the relief sought by the Defendants in the New Arbitration. 54. As the Court found in Intermet FZCO v Ansol Limited [2007] EWHC 226, the fact that there may be significant degree of duplication and overlap between concurrent court proceedings and the arbitration would not be sufficient to warrant the deprivation of the claimants of their right to arbitrate issues which are subject to the arbitration agreement. The prospect of concurrent court proceedings and arbitration relating to the same subject matter do not make the arbitration vexatious, unconscionable or an abuse of process to justify the court taking the disputed issues out of the hands of the arbitrator ( J Jarvis & Sons Limited v Blue Circle Dartford Estates Limited [2007] EWHC 1262 (TCC). 55. I cannot ignore the ringing reminders given by the Courts in the authorities, as to the need for caution and restraint when the Court is asked to exercise its power to restrain an arbitration which is the right of the respondent to commence and pursue, and in particular, an arbitration which is seated outside Hong Kong. The Plaintiff highlighted the fact that the Hong Kong court has an interest in restraining any attempt to undermine enforcement of an award recognized in Hong Kong, and in preventing collateral attacks on the final judgments of the Hong Kong courts. 56. There are obviously competing interests in play. What is unusual in this case is that the 1 st Award is for continued performance of an agreement held to be in place, what the Hong Kong Court is enforcing is a judgment entered on the breach of the Promise to honour the 1 st Award, and what the Defendants seek to do in the New Arbitration is to ask for discharge of the Agreement under the new Article 580. The judgment in HCCL 13 for compensation in respect of the breach of the Promise is separate to and independent of the Agreement, and the rights and duties of the Plaintiff and the Defendants respectively flow from the 1 st Award. There has been no judgment or award of compensation for breach of the Agreement. Whether or not the rights and obligations of the parties under the Agreement can be said under PRC law to have continued to subsist after any judgment or award has been entered, are for determination under PRC law and the tribunal and supervisory court on the Mainland are the better forum for argument on these questions. If the contractual rights of the Defendants have continued to subsist under the Agreement, it cannot be said that they are vexatious or abusive in submitting such of these rights to the tribunal in the New Arbitration, for determination. 57. On balance, I cannot conclude that it would be just to grant the injunction in the wide terms sought by the Plaintiff, and the parties should be left to argue before the tribunal whether the Defendants are entitled under Article 580 to seek termination of the Agreement. Whether their rights under Article 580 are affected by the findings made by the tribunal in the 1 st Award and the 2 nd Award, or by the findings made by the Courts in Hong Kong as to the alleged impossibility of either the performance of the Agreement or the attainment of the purpose of the Agreement, would have to be argued before and decided by the tribunal. 58. However, in my judgment, it would be right and just to grant an injunction to restrain the Defendants from continuing the New Arbitration on the basis of or for pursuing any claim or assertion that the Plaintiff’s action for damages as claimed in HCCL 13 is in substance a claim for damages for the Defendants’ breach of the Agreement and/or is in breach of the Agreement, or that it should be determined by or under PRC law on the question of assessment of the Plaintiff’s loss for breach of the Promise. The Plaintiff has clearly shown that these issues are not covered by, and not within the scope of the arbitration clause of the Agreement, the Defendants’ rights under that clause have not been infringed, and any arbitration of such claims or assertions is in my judgment vexatious, oppressive and an abuse of process, in seeking to attack the judgments of the Hong Kong Courts, and undermine enforcement of the 1 st Award in Hong Kong. In so finding, I reject the Defendants’ submission that the claims asserted were not the claims made in the New Arbitration but were only stated by way of background in the Request. A recitation of the fact of the Plaintiff’s institution of HCCL 13, or of the claims made by the Plaintiff in HCCL 13, are statements of the background. A statement, averment or assertion that the Plaintiff’s claims in HCCL 13 are claims for damages in respect of the Defendants’ breach of the Agreement, and/or are inconsistent with or constitute a breach of the arbitration agreement are not statements of the background, but assertions and claims made against the Plaintiff for relief or remedy. Disposition 59. On the facts of this case, the application for injunction is only granted in the terms stated in paragraph 58 above, and not on the wider terms claimed in paragraph 1 of the Originating Summons. 60. The fair order to make on costs is that the Defendants should pay 50% of the Plaintiff’s costs of and occasioned by the Originating Summons and the Plaintiff’s Summons of 3 November 2022 (for interlocutory injunction), with Certificate for 2 Counsel. Such order nisi is to become absolute unless application for variation is made within 14 days. (Mimmie Chan) Judge of the Court of First Instance High Court Mr Edward Chan SC, Mr James Man and Mr Jonathan Ng, instructed by Anthony Siu & Co, for the plaintiff Mr Benjamin Yu SC, Mr Paul Shieh SC and Ms Astina Au, instructed by Mayer Brown, for the 1 st and 2 nd defendants Look up this case on Lawcite Noteup",
  "length": 42939,
  "headers_seen": [
    "Background",
    "The current dispute",
    "The currently decided and indisputable matters",
    "Applicable legal principles",
    "Should the injunction be granted in this case?",
    "Disposition"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2023/1327",
  "query": "kompetenz-kompetenz",
  "ts": "2025-10-16T10:51:28",
  "ok": true
}