{
  "title": "LAW PO LIN V. HAU KWAI FAT AND OTHERS | [2018] HKCFI 1345 | HKLII",
  "court": null,
  "year": 2018,
  "date": "0347-10-17",
  "content": "HKLII Databases Court of First Instance [2018] HKCFI 1345 LAW PO LIN V. HAU KWAI FAT AND OTHERS Judgment Information Date 13 Jun, 2018 Action No. HCA1443/2014 Neutral Cit. [2018] HKCFI 1345 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCA1443/2014 HCA1443/2014 LAW PO LIN v. HAU KWAI FAT AND OTHERS HCA 1443/2014 [2018] HKCFI 1345 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE ACTION NO 1443 OF 2014 ________________________ BETWEEN LAW PO LIN(羅保蓮) Plaintiff and HAU KWAI FAT (侯貴發) 1 st Defendant HAU YING HUNG (侯英雄) 2 nd Defendant HAU YING FAT (侯英發) 3 rd Defendant ________________________ AND BETWEEN LEE YIN PING SANDY ( 李燕萍) (executor of the estate of LAW PO LIN(羅保蓮), deceased) Plaintiff and HAU KWAI FAT (侯貴發) 1 st Defendant HAU YING HUNG (侯英雄) 2 nd Defendant HAU YING FAT (侯英發) 3 rd Defendant ________________________ (By Original Writ and by Order of Master R. Yu of the High Court to carry on proceedings dated the 1 September 2016) Before: Deputy High Court Judge To in Court Dates of Hearing: 22, 23 and 27 February 2018 Date of Judgment: 14 June 2018 ________________________ JUDGMENT ________________________ Introduction 1. This is the plaintiff’s action for a declaration that the defendants’ title to a relevant portion of the land known as Lot No 2104 in Demarcation District 76 (the “Land”) has been extinguished and that the plaintiff has obtained a good possessory title to the relevant portion the Land. The defendants counterclaim for delivery of vacant possession of that relevant portion of the Land. 2. Law Po Lin (the “Mother”) was the plaintiff at the commencement of the present proceedings. She passed away on 15 May 2015. By an order dated 1 September 2016, her daughter, Lee Yin Ping Sandy (the “Daughter”), was made a party and the present proceedings are carried on as if she has substituted the Mother. 3. The defendants have been the registered owners of the Land since 28 September 1998. They became the owners by way of gift from Hau Chung Hing Tong (the “Tong”) of which their father, Hau Tim Shau (“Hau”) was once its manager. The Tong was also the registered owner of another lot of land in the same Demarcation District known as Lot No 2296 (“Lot 2296”). The defendants had migrated to Holland or the United Kingdom long time ago and are absentee paper owners of the Land. 4. The Mother was married to Lee Tin (the “Father”) in China in 1949. The Father rented the Land from Hau in 1950s as their residence and for raising pigs. The tenancy arrangement was made by the village representatives. In 1959, Hau was appointed as manager of the Tong. 5. On 21 March 1961, through the arrangement of the then village representative, Yip Kwai, the Father bought a piece of land identified on the conveyancing document as Lot 2296 from the Tong at the consideration of $900. It is the plaintiff’s case that the Father’s intention, and presumably the Tong’s as well, was to purchase or sell the Land on which the Father and his family were living. But as the conveyancing document indicates, the subject matter of the purchase was recorded as Lot 2296. However, from that date on, the Father, together with the Mother and their Daughter, who was born in that year, continued to live on the Land as if he was its lawful owner. The Father ceased paying rent to Hau or the Tong. Neither did Hau nor the Tong require him to pay rent for his continued occupation of the Land. The Father was not required to seek permission for alteration or re-planning the use of the Land from Hau or the Tong or anybody else. He also started to pay government rent and rates to the government direct. 6. In 1975, the family demolished a wooden structure and converted it into a brick building with asbestos roof. In 1989, the family was burgled. The Father made a report to the police and the police responded to the Father. 7. On 24 December 1993, the defendants were appointed as managers of the Tong. The Father and his family continued to live on the Land undisturbed until 1995 (the “1995 incident”). By then, thirty-fouryears have lapsed since the Father and his family occupied the Land without paying rent on the mistaken belief that he was its lawful owner. 8. In early 1995, one or two of the defendants visited the Land and demanded the Father to vacate. The Father ignored them and told them to go away. The defendants left. They came again on one or two other occasions repeating their demand. Again the Father ignored them and told them to go away, which they did. On 19 April 1995, the Tong, through its then solicitors, Messrs Leung Kin & Co (“LK&Co”), issued a letter to the Father claiming to be the lawful owner of the Land occupied by the Father identified as Lot No 2104 and demanded his eviction from the Land. 9. Having instructed solicitors and surveyors to conduct an investigation, the Father and his family came to realise that the land the Father bought was Lot 2296 and not the Land they were occupying and that they had never used or occupied Lot 2296. The Father obtained legal advice and understood that as the Land was held by the Tong it was legally difficult to claim adverse possession against the Tong. Thus, he took no legal action but continued in occupation and use of the Land as before. Apart from those few occasions, the Father’s and his family’s occupation and use of the Land was undisturbed. 10. On 28 September 1998, the defendants’ father assigned the Land to the defendants. That was effected by way of a deed of gift by the Tong assigning the Land to the defendants. The bar against a claim of adverse possession against a Tong was thus removed. But the defendants did not seek to recover the Land and did nothing to protect their right to the Land. 11. On 19 December 2005, the Father died. The Mother continued to live on the Land. With the assistance of her Daughter, the Mother conducted a large scale renovation on the Land, including changing the wooden fences into barbed wire fences and replacing the asbestos rooftop. 12. In October 2013, a male surnamed Hau loitered at the front gate of the Land and caused nuisance to the Mother, including kicking the front gate with force, yelling and claiming that he was the owner of the Land and demanding the Mother to leave immediately. The male repeated the disturbing action twice. The Mother reported the matter to the police in November 2013. 13. On 30 July 2014, the Mother issued the writ of summons in this action. The relevant legal provisions under the Limitation Ordinance ( Cap 347 ) 14. The following provisions of the Limitation Ordinance ( Cap 347 ) are relevant to these proceedings: “ 7. (2) No action shall be brought by any other person to recover any land after the expiration of 12 years from the date on which the right of action accrued to him or, if it first accrued to some person through whom he claims, to that person: Provided that, if the right of action first accrued to the Crown through whom the person bringing the action claims, the action may be brought at any time before the expiration of the period during which the action could have been brought by the Crown, or of 12 years from the date on which the right of action accrued to some person other than the Crown, whichever period first expires. 13. (1) No right of action to recover land shall be deemed to accrue unless the land is in the possession of some person in whose favour the period of limitation can run (hereafter in this section referred to as adverse possession) and where under the foregoing provisions of this Ordinance any such right of action is deemed to accrue on a certain date and no person is in adverse possession on that date, the right of action shall not be deemed to accrue unless and until adverse possession is taken of the land. (2) Where a right of action to recover land has accrued and thereafter, before the right is barred, the Plaintiff’s Land ceases to be in adverse possession, the right of action shall no longer be deemed to have accrued and no fresh right of action shall be deemed to accrue unless and until the land is again taken in adverse possession. 17. Subject to the provisions of section 10, at the expiration of the period prescribed by this Ordinance for any person to bring an action to recover land (including a redemption action), the title of that person to the land shall be extinguished.” 15. Section 7(2) prescribes a limitation period of 12 years from the date on which the right of action accrued to the land owner. It is clear from the section that the right of action must have first accrued before the limitation period may begin to run. Sections 13(1) and (2) make it clear that accrual of cause of action to the paper owner is a requirement additional to the requirement of adverse possession by the squatter before the dispossessed land owner is barred from taking action to recover his land. The effect of section 7(2) and section 17 is that after the expiry of the limitation period, no action may be brought by the dispossessed land owner to recover his land and his title to the land shall be extinguished. Legal principles applicable to adverse possession 16. The legal principles applicable to adverse possession are wellsettled and can be found in any property law textbook. Paragraphs 8 to 13 of my earlier decision in Berkenhead Properties and Investment Limited v Lam Kai-man & Anor [1] contains a convenient summary as follows: “ 8. The legal principles applicable to adverse possession were usefully summarised by Slade J (as he then was) in Powell v McFarlan , (1979) 38 P and CR 452 which was approved by the English Court of Appeal in Buckinghamshire County Council v Moran , [1990] 1 Ch 623 . Those principles were applied by the Court of Final Appeal in Wong Tak Yue v Kung Kwok Wai David (No 2) , (1997-1998) 1 HKCFAR 55 . The following principles may be distilled from these authorities. 9. Exclusive possession is the bedrock of English land law. The starting point of land law is that in the absence of evidence to the contrary, the owner of land with the paper title is deemed to be in possession of the land. He is the person with the prima facie right to possession. A person seeking to establish title to land by adverse possession has to prove he has, in respect of that land and for a period of 12 years or more: (i) factual possession; (ii) intention to possess or animus possidendi ; and (iii) adverse possession. 10. Factual possession signifies an appropriate degree of physical control. It must be a single and conclusive possession. What acts constitute a sufficient degree of exclusive physical control depend on the circumstances, in particular the nature of the land in question and the manner in which land of that nature is commonly used or enjoyed. Everything depends on the particular circumstances. Broadly speaking, what must be shownas constituting factual possession is that the alleged possessor has been dealing with the land in question as an occupying owner might have been expected to deal with it and that no one else has done so: Powell v McFarlane ,(1979) 38 P and CR 452. 11. Intention to possess or animus possidendi is the intention to possess the land in one’s own name and on one’s own behalf, to the exclusion of the world at large, including the owner with the paper title so far as is reasonably practicable and so far as the process of the law will allow. In the case of a paper owner, the slightest act done in manifestation of his title is sufficient evidence of that intention which may negative intention to discontinue or abandon possession. By contrast, for a squatter, he has to make it perfectly plain to the world at large by his actions or words that he is enjoying the land openly as of right as if he is the rightful owner. If his acts are open to more than one interpretation and he has not made it perfectly plain to the world at large by his actions or words that he has intended to exclude the owner as best he can, the court will treat him as not having had the requisite intention and consequently as not having dispossessed the owner: Powell v McFarlane, (1979) 38 P and CR 452. An intention to pay rent for the use of the land isplainly and completely inconsistent with the intention to possess. As was pointed out by Nourse LJ in Buckinghamshire County Council v Moran , [1990] 1 Ch 623 , adverse possession can be described as ‘possession as of wrong’. For the purpose of the Limitation Ordinance , it is the intention of the squatter that is essential. Further, it is not necessary for the squatter to establish an intention to own or even an intention to acquire ownership of the land: Buckinghamshire County Council v Moran , [1990] 1 Ch 623 . 12. Adverse possession means that the possession by the squatter must be adverse against the title of the paper owner. Possession is never adverse if it is enjoyed under a lawful title or with the permission of the paper owner: Buckinghamshire County Council v Moran , [1990] 1 Ch 623 . 13. The burden of proof of these three requirements is on the squatter. The standard of proof is the civil standard. However, the burden is a heavy one. The squatter has to adduce objective and compelling evidence: Powell v McFarlane , (1979) 38 P and CR 452 at 476. Self-serving evidence is hardly likely to be of assistance. The court will scrutinize such evidence with great care. The squatter’s evidence of his subjective intention will invariably be given no weight as being self-serving evidence, but his statements against his interest will usually be accorded considerable weight. Objective evidence will be given such weight as they deserve.” In summary, to prove adverse possession, a squatter has to bear the burdenof proving physical possession, intention to possess and that his possession is adverse to the paper owner. The issues 17. The applicable limitation period for adverse possession is 12 years since the 1991 amendment to the Limitation Ordinance . To succeed, the plaintiff has to prove that the Mother’s exclusive possession of the relevant part of the Land began not later than 29 July 2002, ie twelve years and one day before the date of issue of the writ. She has to prove physical possession, intention to possess and that the possession is adverse to the defendants. 18. The defendants have not pleaded any positive case. They put the plaintiff to strict proof. They are entitled to test the quality of the plaintiff’s evidence by way of cross-examination without having to put forward any positive case. It is sufficient for them to cast doubt on the overall probability of the plaintiff’s claim. They dispute that neither the Father nor the Mother had acquired adverse possession over the Land. The theme of their defence is that even if the Father and Mother had physical occupation of the Land (which is not admitted), they did not have animus possidendi . Even if the Father had adverse possession over the Land (which is not admitted), the Wife’s occupation was only as licensee of the Father. At the highest the Mother could only commence adverse possession after the Father’s death on 19 December 2005. The period of limitation has not expired until the twelfth anniversary of the Father’s death. 19. Against the above factual background, the legal issue raised by this line of defence is whether as a matter of law there could be joint adverse possession. If there could be, the factual issue raised is when did the Mother’s adverse possession begin. Itwould be useful to analyse the position before and after April 1995 when the Father and Mother first came to know that they were in wrongful occupation of the Land. Joint adverse possession 20. It is not the defendants’ argument that adverse possession couldnot be jointly held. The plaintiff proceeded on the basis that the Mother was in joint adverse possession of the Land with the Father. I think the parties have no dispute that just as land could be possessed jointly by co-owners, it could also be adversely possessed jointly by squatters. For the present purpose, it is important to understand what joint adverse possession entails. 21. While ownership may be joint and several, possession cannot. Possession must be single. It can be held jointly but not severally because of the concept of unity of possession. In Megarry & Wade, The Law of Real Property [2] , ‘unity of possession’ was defined as follows: “ (a) Unity of possession. Unity of possession is common to all forms of co-ownership. Atcommon law, each co-owner is as much entitled to possession ofany part of the land as the others. He cannot point to any part of the land as his own to the exclusion of the others; if he could, there would be separate ownership and not co-ownership.” 22. In JA Pye (Oxford) Ltd v Graham & another [3] , Lord Hope referred to this unity as “exclusivity” and said: “ 70. The general rule, which English law has derived from the Roman law, is that only one person can be in possession at any one time. Exclusivity is of the essence of possession. The same rule applies in cases where two or more persons are entitled to the enjoyment of property simultaneously. As between themselves they have separate rights, but as against everyone else they are in the position of a single owner.” 23. Thus, two or more persons are in joint adverse possession of land belonging to another if they are in physical occupation of the land with the common intention that their possession shall be to the exclusion of everyone else including the paper owner, but not as between themselves. They have effective control over the land as against the whole world. As between themselves, they are entitled to the use and possession of any part of the land but cannot point to any part as his own to the exclusion of the other. 24. Their position can be contrasted with that of the squatters in Marsden v Miller and Others [4] . In that case a number of squatters made use of land at the same time, but the use each made was independent of the others, and none of them was in effective control of the land. They were not in adverse possession and not joint adverse possession. 25. Similarly, in Lambeth London Borough Council v Bigden [5] , a number of squatters occupied flats in a block. The door to the street was locked, and each of the squatters had keys. The trial judge held that the squatters were not in possession of the common parts of the block of flats. In the Court of Appeal, Mummery LJ indicated that he agreed with the trial judge on the issue as to possession of the common parts. He rejected the contention that the squatters were collectively in possession as ‘novel and far reaching’, saying: “ The argument rests almost entirely on the fact that throughout therelevant period only the occupiers had the key to the street door to their block. Even assuming that this amounted to dispossession of the Council in respect of each block with a locked street door preventing the Council from gaining access, it does not follow that the defendants and their predecessors, who went into occupation of the property at different times, were collectively or jointly in adverse possession of the entire block, including its common parts, throughout the limitation period of 12 years … The judge was entitled to find as facts that there was no consensual arrangement affecting the basis of occupation of the individual flats within the blocks (the allocation arrangements being scant or non-existent); that there was no exercise of effective joint or communal control over the individual flats themselves; and that there was no physical occupation or joint adverse possession of the common parts ie the hall ways and staircases about which he heard evidence. The judge heard no evidence of joint occupation of other common parts of the blocks, such as the outer walls, foundations and the roof, which would also be relevant to the acquisition of a freehold title to a block of flats by adverse possession.” The Father’s possession before 1995 26. The Father was in possession of the Land since 1949 as a tenant. In March 1961, he bought Lot 2296, believing it to be the Land of which he had been the tenant. He bought it under his own name, thinking he was the lawful owner with right to exclusive possession. He built, developed, farmed and lived on the Land which he had rented for twelve years before he took steps to purchase it. Having purchased what he thought to be the Land, he continued doing the same for thirty-four years before the defendants visited him and claimed ownership and followed by their solicitors’ letter demanding his vacation from the Land. As the facts turned out, he was not the lawful owner, but a squatter. 27. Against that background of thirty-four years’ occupation, the defendants still dispute adverse possession. Mr Sherry, counsel for the defendants, relies on the 1995 incident as evidence that the defendants had not abandoned possession of the Land. It is true that the law bends heavily in favour of the paper owner. What a paper owner needs to show to establish his possession of the disputed land is very minimal. Animus may even be taken for granted, butthere must be sufficient act of possession to establish the fact of possession, however minimal. What is sufficient depends on the factual circumstances. It is a question of fact. In this connection, it would be useful to refer to the following dicta of Lord Hope in JA Pye (Oxford) Ltd v Graham & another [6] : “ 70. … Once possession has begun, as in the case of the owner of land with a paper title who has entered into occupation of it, his possession is presumed to continue. But it can be lost when it isgiven up or discontinued. When that happens, possession can be acquired by someone else. The acquisition of possession requiresboth an intention to take or occupy the land (“ animus ”) and some act of the body (‘ corpus ”) which gives effect to that intention. Occupation of the land alone is not enough, nor is an intention tooccupy which is not put into effect by action. Both aspects must be examined, and each is bound up with the other. But acts of the mind can be, and sometimes can only be, demonstrated by acts of the body. In practice, the best evidence of intention is frequently found in the acts which have taken place.” Though Lord Hope was addressing the issue of how possession may be lost, what his Lordship said is relevant also to the issue as to how possession may be proved. It is not enough to show an intention to possess or intention not to abandon possession in the context of the defendants’ situation. In addition to intention, there must be some act of the body which gives effect to or manifests that intention. On the facts, the defendants had intention to recover possession of the Land and they manifested that intention by repeatedly visiting the Land and making a demand for possession. But they just walked away when the Father rejected their demand. They made a demand by way of LK&Co’s letter. But there was no follow through and no legal action was instituted to recover possession for nineteen years. Theplaintiff continued occupation of the Land with the Father and commencedlegal action. On the factual circumstances of this case, what the defendants did was far from being sufficient. On the contrary, the Father’s and the Mother’s conduct on the one hand and the defendants’ conduct on the othershow that the Father and Mother had continued in adverse possession while the defendants were dispossessed. 28. The plaintiff produced two deposit receipts for account number 49-2800-7 dated 20 October and 3 December 1964 from China Light & Power Co Ltd issued to the Father. The address stated on one receipt was “7 Kung Ling, Pak Bin Village, Fanling” and on the other was seemingly “7 Hung Ling, Pak Bin Village, Fanling”. Since the account number was the same, the two receipts must refer to deposit for supply of electricity to the same address. The plaintiff also produced another deposit receipt issued to the Father at “7 Hung Ling West Village for account number 75522-160-05 dated 23 July 1975. The addresses stated on the receipts bear striking similarities. The Daughter said that addresses were the address of the Land used at different times. 29. The plaintiff produced two electricity bills issued in 1975 to the Father at “7 Hung Ling West Village”, and two issued in 1983 and 1986 issued to the Father “c/o Lap Shing Hong, 35 Wo Fung Street, Fanling.” The 1983 and 1986 receipts contained a remark “Re. 7 Hung Leng West Village Sha Tau Kok NT”. I accept that remark as a reference to the Land. The Daughter explained that the Land was located off the main road and in those days postmen did not make delivery to addresses in isolated locations in the New Territories but only to letter boxes placed by the residents near specified lampposts on the main road. Later, mails were delivered to a shop in Luen Wo Market in Fanling for the residents to pick up. Hence, the bills in 1983 and 1986 were addressed to “Lee Tin c/o Lap Shing Hong”. 30. Since the 1995 incident, the Father had the record with China Light and Power rectified. The plaintiff produced three more recent bills issued in 2002, 2006 and 2013 addressed to the Father at an address in Tai Po Plaza, which is the address of the Father’s son. The bills referred to the location of electricity supply at “DD76 Lot 2104 Hung Leng West Village”. The bills had a new account number. I think these bills put it beyond doubt that all the deposit receipts and bills mentioned hereinabove referred to supply of electricity to the Land since 1964. 31. Mr Sherry argues that the deposit receipts and electricity bills did not refer to supply of electricity to the Land because they did not refer to Lot 2104, but the defendants had no evidence as to what the address stated on the bills was. He also argues that the bills issued after 2002 showthat the Mother was no longer living on the Land since 2002. I shall revert to that later. I mentioned this at this stage just to put everything in the context. Against the undisputed fact that the Father rented the Land and was led into possession which he occupied even as at the date when LK&Co’s letter was served on him, how can the defendants dispute the Daughter’s evidence, albeit partly hearsay, that the Father was in occupation of the Land throughout from 1949 to 1995? How can they challenge the Daughter’s evidence that the deposit receipts and bills refer to supply of electricity to the Land? 32. The plaintiff produced three water accounts issued to the Father “c/o Lap Shing Hong, 51 Wo Fung Street, Luen Wo Hui, Fan Ling” in 1975, 1979 and 1984. The Daughter said that the address of Lap Shing Hong was used for the same reason as for the electricity bills. The plaintiff also produced a number of water accounts issued after 1992 to the Father at the Daughter’s address in Kwai Fong Garden. In the water accounts issued before 2002, the address to which water was supplied was stated to be “Lot 2 DD 76, Kwan Tei, Fan Ling”. However, in the water accounts issued after 2002, the supply address was stated to be “DD 76 Lot 2104, Kwan Tei, Fanling”. The Daughter’s evidence is that “Kwan Tei” referred to the area where DD 76 was located and the post 2002 water accounts put it beyond doubt that the address to which water was supplied was the Land in issue. 33. The plaintiff also produced a receipt from the Agriculture and Fisheries Department for artificial insemination service issued in 1966 in relation to the Father’s pig raising business, a receipt for licence fee for domestic television licence issued on 12 March 1969 (which was required in those days), and correspondence with the police dated 22 March 1989 reporting a burglary on the Land. These documents show the Father’s presence on and use of the Land. 34. The Daughter was born in 1961 and was aged 34 when the defendants came to demand repossession of the Land in 1995. She was able to give evidence of the Father’s activities on the Land as far back as 20 years from 1995. Her evidence is supported by contemporaneous documents such as the utility bills I referred to above. Her evidence that the Father was in exclusive possession of the Land could not be doubted. It is also the defendants’ own evidence that they visited the Land on two or three occasions to demand repossession of the Land from the Father and were ignored on each occasion. While Mr Sherry submits that this is evidence that the defendants had not abandoned the Land, it is also evidence that they were dispossessed and that the Father was in exclusive possession which was adverse to the defendants. The defendants’ challenge of the Father’s adverse possession is just hopeless. The Father’s and Mother’s adverse possession after 1995 35. The thrust of the defendants’ argument is that even if the Father was in adverse possession of the Land, the Mother was not. She was just a licensee in occupation of the Land with the permission of the Father. Mr Sherry argues that there is a distinction between possession and occupation. That distinction is well accepted. The distinction lies in the presence or absence of effective control. That is a question of fact. 36. Mr Sherry argues that the Father acquired Lot 2296 in his own name and not jointly with the Mother. It must have been his intention that he would be the person in exclusive possession or control of the land that he bought. Though as it turned out what he purchased was Lot 2296 and not the Land, his intention in respect of the Land was the same. He was in possession and the Mother was in occupation as his licensee. Mr Sherry also draws support for that proposition from the case of Yeung Wai Fan v Honiton International Limited [7] in which Deputy High Court Judge Leung held that the son’s occupation of his father’s land arising out of family relationship was akin to permission or licence by the father. 37. That may well have been the situation had it not been for the 1995 incident. As a result of that incident, the Father must have had obtained proper legal advice. He even knew he could not succeed in an action for adverse possession against the Tong. He must have realized that his possession with respect to the Land was precarious. The Mother clearly knew that also. In the face of the threat of imminent eviction, the Father would not have maintained the stance as pictured by Mr Sherry. The Father was not the owner of the Land as was the father in Yeung Wai Fan v Honiton International Limited . He was not in any position to give any licence to anyone to occupy the Land. Everybody was equal and in the same boat. The common goal must be to keep the boat afloat, ie to resist the defendants’ claim as rigorously and as selflessly as they could and in a united front. Everybody shall defend the Land by continuing in possession to the exclusion of the whole world, especially the defendants. They shall do so for each other jointly and not just on behalf of the Father. 38. Mr Sherry argues that it was accepted by the Daughter that the family was a traditional Chinese family with the Father as the head of the family and in charge or in control, subject to the usual amount of discussion as would be expected between husband and wife. I am unable to read too much into that particular aspect of the Daughter’s evidence. Clearly, she was talking in the context of control of the family affairs by the head of the family and not about control over the Land. At the highest, she may consider her occupation of the Land as daughter was subject to the Father’s control or that she was her Father’s licensee. She could not speak for the Mother’s intention or the Father’s and Mother’s common intention in respect of the Land. 39. Ordinarily, the fortunes of husband and wife are bound up together. Even if the husband is the sole breadwinner, the wife is not a mere sleeping partner to the matrimonial union without any contribution to the family wealth. She contributes to the family fortune by running the home, attending to the children and the usual household chores. A fortiori ,if the wife also contributes to the family business or family income. The law recognises the wife’s equity in the matrimonial home. Thus, the wife stands on a different position from that of the son as regards her occupationof the matrimonial home, even if it is held in the name of the husband. She may not, as a rule, be a licensee of the husband. It is a question of fact. 40. On the fact, the Father ran the pig raising and farming businesswhile the Mother helped in the business as well as worked outside as a parttime amah to supplement the family income. Where the wife is occupying land purchased by the husband, the inference that she is occupying under licence of the husband may be drawn. However, in the present case, the Land was not purchased by the Father. The Father and Mother found themselves in wrongful occupation of someone else’s Land. Under the circumstances in 1995, it was inappropriate to consider either of them as occupying the Land under the licence of the other. They were in the same boat engaged in a joint enterprise to fight against eviction. There is no evidence that the Father exercised control over the Land to the exclusion of the Mother. The Father continued his pig raising and farming business while the Mother continued giving assistance to the Father and working outside to supplement the needs of the family. They clearly evince an intention to occupy, farm and live on the Land as one unit to the exclusionof everybody including the defendants. Any control exercised by the Father over the Land must have been exercised jointly. The inference that they were in joint adverse possession against the defendants could be more readily drawn than that they were continuing the adverse possession of the Father. 41. Mr Sherry relies heavily on Yeung Wai Fanv Honiton International Limited . I think such reliance is misconceived. Mr Poon, counsel for the plaintiff, advanced many features distinguishing that case from the present one. I only need to refer to one feature which is conclusive. In that case, it was the court’s finding that the father was already in exclusive possession of the disputed land before the son moved in. A licence could readily be inferredunder such circumstances. In the present case, the evidence that the Mother and Father acted as joint tortfeasor to adversely possess the Land to the exclusion of the defendants is overwhelming. That leaves no room for inferring a licence as suggested by Mr Sherry. In Ngan Yuk Yip v Herbal-T (HK) Limited [8] , the wife assisted the husband in farming on the disputed land. Then the husband bought an adjacent plot of land under his sole name. Deputy High Court Judge Seagroatt was ready to jump to the conclusion that once the wife and the husband had evinced an intention to occupy farm and exclude anyone from the disputed land they were in adverse possession. He did not find it necessary to differentiate the husband’s possession from the wife’s. The Mother’s case as I have analysed it is far stronger than the wife’s case in Ngan Yuk Yip . 42. Mr Sherry argues that in the Father’s solicitors’ reply to LK&Co’s demand for possession dated 31 May 1995, no mention was made of adverse possession by the Mother suggesting therefore that the Mother was a licensee of the Father. I am unable to agree. That reply was in response to a claim against the Father. No purpose would be served by the Father asserting adverse possession by another person. Besides, even accepting that the Mother was a licensee of the Father prior to 1995, the circumstances since then have changed to support a case of joint adverse possession. 43. Mr Sherry refers to the Certificate of Marriage of the Father and the Mother dated 29 November 1989 in which they gave the Daughter’s address in Kwai Fong Garden as their residential address. He argues that therefore the Father and Mother were living with the Daughter at least since 1989 and were no longer in adverse possession of the Land. Such argument is very flimsy and could be readily dismissed in the light of the Daughter’s evidence. According to the Daughter, her parents used her address as correspondence address only because there was no postal address for the Land. Mails addressed to the Land could not be delivered. The Daughter was 28 years of age in 1989 and was married. Her home would be too small to accommodate her own family and the Father and Mother. Though the Father and Mother were required to enter their residential address on the certificate and not their correspondence address,I accept the Daughter’s explanation. 44. Mr Sherry engages a similar argument in relation to the address as stated in the electricity bills and water accounts as evidence that the Father had vacated the Land in 2002. With respect, such argument is self-defeating. If the Father had vacated the Land in 2002, why would he still maintain the electricity and water supply to the Land and provide a correspondence address to enable those bills could be delivered, collected and paid? In my view, the arrangement is strong evidence of the Father maintaining possession and control over the Land. As the other evidence suggests, such possession and control was exercised on his and the Mother’s behalf or jointly with the Mother. 45. Mr Sherry refers to the renovation agreement in respect of the Land dated 10 March 2006. It was addressed to the Daughter. He argues that as evidence that the Land was possessed by the Daughter in 2006 and not the Mother. Again, other than argument, the defendants had no concrete evidence in support of the argument. Such argument is only to be rejected in the light of the Daughter’s evidence that she entered the agreement on behalf of her Mother or as her agent because she was more capable to attend to the renovation matter on the Mother’s behalf in view of her old age. That was just what a daughter would do for her aged and widowed mother. I accept the Daughter’s evidence. It makes sense and is inherently probable. 46. Enclosing land is strong evidence of manifestation of possession. Mr Sherry argues that there is no evidence who erected the fence enclosing the relevant part of the Land and there is a possibility that it was erected by the previous owners. It is not the defendants’ evidence that the fence was erected by them or the Tong or their predecessor in title. It does not matter who erected the fence. What matters is who put the lock on the gate. The undisputed evidence is that the lock was installed by the Father in his lifetime and then the Mother. That is strong evidence of manifestation of possession to the exclusion of the whole world including the defendants. 47. There are other trivial arguments raised by Mr Sherry. I do not find it necessary to deal with them other than to say that I do not agreewith those arguments. Accordingly, I find that with effect from the date of LK&Co’s letter of 19 April 1995, the Mother started to be in joint adverse possession of the Land with the Father. Upon the Father’s death on 19 December 2005, the Mother assumed sole adverse possession of the Land against the defendants. The defendants and their predecessor in title had been dispossessed of the Land for 57 years. The Mother started joint adverse possession of the Land with the Father since 1995 and was in such possession until her death on 15 May 2015. The defendants’ right to recover the Land has long been lost and their title extinguished by virtue of section s 7 and 17 of the Limitation Ordinance . The defendants are absentee landlords. They only have themselves to blame for not following through with their actions in 1995. Conclusion 48. I am satisfied that the plaintiff has made out a case of adverse possession over the relevant part of the Land against the defendants. Accordingly, I enter judgment in favour of the plaintiff against the defendants and grant her the order sought subject to the minor amendments to be made to Annexure I of the Statement of Claim as to the precise boundary of the relevant part. The defendants’ counterclaim is dismissed. I also make a costs order that the plaintiff shall have costs of the action against the defendants. (Anthony To) Deputy High Court Judge Mr Kevin Poon, instructed by Hoosenally & Neo, for the plaintiff Mr Anthony James Sherry and Ms K K Chan Jacqueline, instructed by Jim & Co, for the 1 st , 2 nd and 3 rd defendants [1] HCMP 1588/2012, unreported, 12 January 2016 [2] 8 th Edition, §13-005 [3] [2003] 1 AC 419 at 445, at §70 [4] (1992) 64 P & CR 239 [5] (2000) 33 HLR 478 [6] [2003] 1 AC 419 at 445, §70 [7] HCA 1051/2010 (unreported) 11 September 2015 [8] HCA 1981/2012 (unreported), 30 October 2015 Look up this case on Lawcite Noteup",
  "length": 40948,
  "headers_seen": [
    "Introduction",
    "The relevant legal provisions under the Limitation Ordinance ( Cap 347 )",
    "Legal principles applicable to adverse possession",
    "The issues",
    "Joint adverse possession",
    "The Father’s possession before 1995",
    "The Father’s and Mother’s adverse possession after 1995",
    "Conclusion"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2018/1345",
  "query": "adverse possession",
  "ts": "2025-10-17T10:44:10",
  "ok": true
}