{
  "title": "SUEN KWAI KAM V. CENTRAL CHINA DRAGON SELECT GROWTH FUND | [2020] HKCFI 69 | HKLII",
  "court": null,
  "year": 2020,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2020] HKCFI 69 SUEN KWAI KAM V. CENTRAL CHINA DRAGON SELECT GROWTH FUND Judgment Information Date 6 Jan, 2020 Action No. HCA1264/2019 Neutral Cit. [2020] HKCFI 69 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCA1264/2019 HCA1264/2019 SUEN KWAI KAM v. CENTRAL CHINA DRAGON SELECT GROWTH FUND HCA 1264/2019 [2020] HKCFI 69 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE ACTION NO 1264 OF 2019 ______________ BETWEEN SUEN KWAI KAM (孙桂琴) Plaintiff and CENTRAL CHINA DRAGON SELECT GROWTH FUND (中州龙腾优选增长基金) Defendant ______________ Before: Deputy High Court Judge William Wong SC in Chambers Date of Hearing: 16 October 2019 Date of Decision: 7 January 2020 ______________ DECISION ______________ THE APPLICATION 1. The Plaintiff, by summons dated 30 July 2019, applied for an interim anti-suit injunction to restrain the Defendant, whether by its directors or agents, from continuing with proceedings in the Mainland (the “Mainland Proceedings”) commenced against the Plaintiff in the No 4 Intermediate People’s Court in Beijing, the Mainland, China (the “Beijing Intermediate Court”), or bringing any other legal proceedings in any other jurisdiction raising the same or substantially the same subject matters or disputes or issues (the “Summons”). MATERIAL FACTS 2. The Plaintiff was and is the sole director and shareholder of Rapid Rise Link Limited (“Rapid Rise”), a company incorporated in the British Virgin Islands. 3. The Defendant was and is a company incorporated in the Cayman Islands. 4. It is the Plaintiff’s case that: (1) In or around July 2017, the Plaintiff became interested in investing in a company listed on the Shenzhen Stock Exchange, namely, Kangdexin Composite Material Group Company Limited (the “Stock”). (2) The Plaintiff was then introduced to one Mr Cui Bin (“Cui”). Cui in turn introduced her to Wang, who is the executive director of an asset management company incorporated in Hong Kong, namely, Central China International Asset Management Company Limited (“Central China”). (3) Cui and Wang together advised the Plaintiff to conduct her intended investment in the form of a fund, such that the Plaintiff could obtain financing for larger investments in the Stock through monetary contribution into the fund by other investors. (4) Eventually: (a) The proposed fund (the “Fund”) was set up with the Defendant as a corporate vehicle. (b) The Plaintiff also incorporated Rapid Rise to subscribe for shares in the Fund on the advice of Cui. (c) The Plaintiff and the Defendant then entered into an agreement regarding the operation of the Fund, the details of which are set out in a document entitled “Private Placement Memorandum” dated 26 September 2017 (the “Memorandum”). (5) The Memorandum provides, inter alia , that: (a) Wang is one of the directors of the Fund; and (b) Central China is the investment manager of the Fund. (6) Further, the following features of the Fund are reflected in the Memorandum: (a) The Fund has three classes of subscribers or investors, namely, Class A Shareholders, Class B Shareholders and Class C Shareholders. (b) These three classes of shareholders or subscribers would invest in the Stock through subscription to the Fund. The Fund was limited to investing in the Stock unless all shareholders agreed otherwise. The target total subscription amount of the Fund was HK$1.6 billion. (c) Contractually, Class C Shareholders are subject to compulsory subscription which means that they would be required to provide additional capital or collateral when the value of the investments in the Fund falls below a pre-determined level, similar to a margin call as contended by the Plaintiff. (d) Class A Shareholders and Class B Shareholders are entitled to receive a guaranteed and pre-determined yield, in the form of dividends, for their investment in the Fund, similar to a margin interest as contended by the Plaintiff. (e) Class C Shareholders are, however, only entitled to dividends when there is “ Excess Return ” from the investment, meaning return in excess of the aggregate amount of the dividend payable to Class A Shareholders and Class B Shareholders. 5. The Memorandum provides, inter alia , that: “ When the Fund has insufficient cash to pay the Class A Dividends and the Class B Dividends (together, the ‘Fixed Dividends’), the Investment Manager (on behalf of the Directors) may either issue a Compulsory Subscription Notice to the holders of Class C Shares, as set out under the section headed ‘Compulsory Subscription’ or liquidate the Fund’s investments as it deems fit. Shareholders should note that there is no assurance that the Fund will declare and pay the Fixed Dividends, or that there will be sufficient profits for such declaration and payment. The Directors may also determine that profits be retained for future expenses of the Fund or as reserves. This proposal does not constitute a guarantee from the Fund, its Directors, the Investment Manager or the Fund’s service providers that the Fixed Dividends will be declared and paid as proposed herein. In addition, Class C Shareholders will only be paid if there is any Excess Return and further, Class C Shareholders are obliged to make compulsory subscription if the Fund requires.” ( emphasis added ) 6. In or around November 2017, the Plaintiff caused Rapid Rise to subscribe for HK$1 billion worth of shares in the Fund as Class C Shareholder. 7. A company known as BOCOM International Securities Limited (“BOCOM”) invested in the Fund as Class A Shareholder. 8. Central China invested in the Fund as Class B Shareholder. 9. On 26 December 2018, the Plaintiff executed a personal guarantee in favour of the, inter alia , the Defendant (the “Guarantee”). Clause 17.1 of the Guarantee provides: “ 17.1 Jurisdiction of Hong Kong courts (a) The courts of Hong Kong have exclusive jurisdiction to settle any dispute arising out of or in connection with this Deed (including any dispute regarding the existence, validity or termination of this Deed) (a “Dispute”). (b) The Parties agree that the courts of Hong Kong are the most appropriate and convenient courts to settle Disputes, and submit themselves to the jurisdiction of the courts of Hong Kong, and accordingly no Party will argue to the contrary. (c) The Clause 17.1 is for the benefit of the Secured Parties only. As a result, the Secured Parties shall not be prevented from taking proceedings relating to a Dispute in any other courts with jurisdiction. To the extent allowed by law, the Secured Parties may take concurrent proceedings in any number of jurisdictions. ” ( emphasis added ) 10. It is the Plaintiff’s case that during the period from around 17 January 2018 to 5 November 2018, Central China, as the asset manager of the Fund, issued various compulsory subscription or margin calls to Rapid Rise, requiring Rapid Rise to subscribe for more shares in the Fund. 11. It is the Defendant’s case that, as at 30 January 2019, Rapid Rise owed the Defendant HK$111,797,420.82 (the “Debt”). 12. On 2 February 2019, the Defendant issued a statutory demand against the Plaintiff in respect of the Debt. 13. On 20 February 2019, the Plaintiff applied to set aside the statutory demand. 14. On 8 April 2019, by consent, the statutory demand was set aside with costs to the Plaintiff. 15. On 23 April 2019, the Defendant commenced the Mainland Proceedings and also applied to freeze the assets of the Plaintiff in the Mainland, China. 16. On 28 April 2019, the Beijing Intermediate Court granted an order to freeze two real properties registered under the name of the Plaintiff in the total value of RMB 95,940,687 up to 9 May 2022 (the “Mainland Freezing Order”). 17. On 23 May 2019, the Plaintiff applied to dismiss the Mainland Proceedings by challenging the jurisdiction of the Beijing Intermediate Court. The Plaintiff’s application was dismissed on 24 June 2019. 18. On 22 July 2019, the Plaintiff appealed to the Higher People’s Court in Beijing (the “Beijing Higher People’s Court”). The Plaintiff’s appeal has not yet been heard by the Beijing Higher People’s Court. 19. On 15 July 2019, the Plaintiff commenced the present proceedings. A few days earlier, the Plaintiff caused Access International Investment (HK) Company Limited, to which the Plaintiff is a 90% shareholder, to sell a property in Shiu Fai Terrace at HK$39 million. 20. On 30 July 2019, the Plaintiff took out the present Summons. 21. It has recently come to the Defendant’s attention that the Writ of Summons in HCA 1589/2019 has been registered on 17 September 2018 against the Plaintiff’s another property in Kai Tak. The Defendant has concern that this property is at risk. 22. The Plaintiff’s case is that the Guarantee she signed is tainted with illegality and is thus enforceable for being contrary to public policy. It is averred that: (1) The Securities and Futures Commission (“the SFC”) issued a document entitled “Circular to Licensed Corporation — Margin Financing Activities Disguised as Investments” on 3 August 2018, wherein the SFC observed that some licensed corporations have been carrying on asset management activities which in fact may have aided and abetted unlicensed affiliates or third parties to provide margin financing in the guise of investments. (2) The entire operation of the Fund, as embodied in the Memorandum, constitutes a de facto margin financing arrangement and a Type 8 regulated activity under the Securities and Futures Ordinance , Cap 571 . (3) However, neither BOCOM nor Central China is properly licensed to carry out Type 8 regulated activity. (4) Therefore, BOCOM and Central China were providing margin financing to Rapid Rise through the Fund without license and the operation of the Fund represents an illegal arrangement. (5) The Memorandum is therefore an illegal agreement and by necessary extension so is the Guarantee. 23. I should mention that, at this stage, no expert evidence is adduced to prove that the operation of the Fund is illegal. This Court is also not asked to determine the issue of illegality and unenforceability of the Guarantee on a summary basis. The Plaintiff might well have a case on illegality. Similarly, the Defendant might well have a perfect answer. But what is clear is that this is not an issue that can be summarily deposed of at this stage of the proceedings. GROUNDS OF THE APPLICATION 24. The Plaintiff submitted that an interim anti-suit injunction should be granted on two main grounds: (1) The parties ought to litigate their disputes only in the contractually nominated forum, namely, Hong Kong as there exists no exceptional reason in the present case for commencing and/or continuing a parallel proceedings in the Mainland, China (the “Contractual Ground”). (2) The Mainland Proceedings was commenced in bad faith and/or the pursuit of the Mainland Proceedings is unconscionable (the “Unconscionable Ground”). APPLICABLE LEGAL PRINCIPLES 25. The applicable principles are well established and can be summarised as follows: (1) A person has no right not be sued in a particular forum , domestic or foreign, unless there is specific factor which gives him that right. (See Turner v Grovit [2002] 1 WLR 107 at 118, §25 per Lord Hobhouse.) (2) Anti-suit injunction will be granted only when the ends of justice require it. In exercising the jurisdiction, regard must be had to comity and so that the jurisdiction is one which must be exercised with caution. In Airbus Industrie GIE v Patel & others [1999] 1 AC 119 , Lord Goff of Chieveley at 133D–F said: “The broad principle underlying the jurisdiction is that it is to be exercised when the ends of justice require it. Generally speaking, this may occur when the foreign proceedings are vexatious or oppressive. Historically these terms have different meanings (see the Aérospatiale case, at pp. 893B–E and 893H–894G); but in the Amchem Products case Sopinka J., at p. 932, expressed a preference for a formulation of the principle based simply on the ends of justice, without reference to vexation or oppression. But, as was stressed in the Aérospatiale case (see, in particular, p. 895D–H), in exercising the jurisdiction regard must be had to comity, and so the jurisdiction is one which must be exercised with caution: see p. 892E–F. This aspect of the jurisdiction has been stressed both by the Supreme Court of Canada (see the Amchem Products case, at p. 934, per Sopinka J.) and by the High Court of Australia (see the C.S.R. case, at p. 436), and it is, in my opinion, of particular relevance in the present case.” (3) An applicant who seeks an interlocutory anti-suit injunction must establish more than an arguable case before he can obtain such an injunction. Bharwaney J in Liaoyang Shunfeng Iron and Steel Co Ltd v Yeung Tsz Wang CACV 234/2011, unreported, 14 June 2012 at §145 said: “I am persuaded by Ms Wong, and I conclude, that in every case, whether based on an exclusive jurisdiction clause or on unconscionable conduct, the applicant seeking an interlocutory anti-suit injunction has to establish his case to a high degree of probability or, in the words of Hartmann JA, that he must demonstrate a strong or convincing prima facie case. After all, a breach of an exclusive jurisdiction clause is a species of wrongful misconduct. But above all, it seems to me that the court must have regard to the effect of the interlocutory anti-suit injunction. If its effect is likely to be final, the applicant seeking such an injunction must establish a convincing prime facie case before the court would be moved to grant such an injunction.” (4) The fact that Hong Kong courts have concluded that Hong Kong is the natural forum does not entitle it on that ground alone to restrain a party from proceeding in the foreign court. It will be inconsistent with comity. (See First Laser Ltd v Fujian Enterprises (Holdings) Co Ltd HCA 4414/2001, unreported, 12 December 2002 per Deputy High Court Judge Lam (as he then was) at §70 applying Asha Harkishin Premisingh v Harkishin Isarsingh Premsingh CACV 845/2000, unreported, 30 November 2001. (5) Account must be taken not only of injustice to the applicant if the respondent to the application is permitted to pursue foreign proceedings which are vexatious or oppressive, but also of injustice to the respondent if, by granting the injunction, he is deprived of any advantage in the foreign forum of which it would be unjust to deprive him. (See Liaoyang Shunfeng ( supra ) at §87 per Hartmann JA (as he then was)). (6) A distinction is to be drawn between cases where the application for an anti-suit injunction is founded upon a contractual right and other cases, in which it is asserted that the foreign proceedings have been commenced in bad faith for the purpose of frustrating proceedings in Hong Kong. (See Liaoyang Shunfeng ( supra ) at §87 per Hartmann JA). (7) Where the applicant is relying upon a contractual right not to be sued in the foreign country (say because of an exclusive jurisdiction clause or an arbitration clause), then, absent some special circumstances, he has by reason of his contract a legitimate interest in enforcing that right against the other party to the contract. (See Turner v Grovit [2002] 1 WLR 107 at 119C–D per Lord Hobhouse.) (8) Where the applicant is relying upon conduct of the other person which is unconscionable for some non-contractual reason, the law requires that the legitimate interest must be the existence of proceedings in Hong Kong which need to be protected by the grant of a restraining order. (See Turner v Grovit [2002] 1 WLR 107 at 119D per Lord Hobhouse.) (9) The starting point for considering the effect of a non-exclusive jurisdiction clause must be the wording of the clause. Where a non-exclusive jurisdiction clause does not clearly indicate whether prior or subsequent parallel proceedings in a non-selected forum are permitted or prohibited, the best interpretation will usually be that, by contracting for non-exclusive jurisdiction, the parties have anticipated and accepted the possibility of some parallel proceedings, and as a result, only foreign proceedings which are vexatious and oppressive for some reason independent of the mere presence of the non-exclusive clause will be restrained by injunction. (See Deutsche Bank AG v Highland Crusader Offshore Partners LP [2010] 1 WLR 1023 at §§105 – 115 per Toulson LJ.) (10) A non-exclusive jurisdiction agreement precludes either party from later arguing that the forum identified is not an appropriate forum on grounds foreseeable at the time of the agreement, for the parties must be taken to have been aware of such matters at the time of the agreement. For that reason an application to stay on forum non conveniens grounds an action brought in Hong Kong pursuant to a Hong Kong non-exclusive jurisdiction clause will ordinarily fail unless the factors relied upon were unforeseeable at the time of the agreement. (See Deutsche Bank AG v Highland Crusader Offshore Partners LP [2010] 1 WLR 1023 at §50 per Toulson LJ.) (11) The essential features which made it proper for a court to exercise its power to grant an anti-suit injunction are: (a) The applicant is a party to existing legal proceedings in Hong Kong; (b) The defendants have in bad faith commenced and propose to prosecute proceedings against the applicant in another jurisdiction for the purpose of frustrating or obstructing the proceedings in Hong Kong; (c) The court considers that it is necessary in order to protect the legitimate interest of the applicant in the Hong Kong proceedings to grant the applicant restraining order against the defendants. (See Turner v Grovit ( supra ) at §29 per Lord Hobhouse.) (12) In considering whether the foreign proceedings are vexatious or oppressive, the juridical advantage of powers of enforcement in the foreign jurisdiction is a significant factor. (See Choi Sai Yiu v Widepower [1994] 3 HKC 274 at 281B per Deputy Judge Cheung (as he then was)). ANALYSIS Contractual Ground 26. The starting point is the wording of the contract. In the present case, Clause 17.1(c) of the Guarantee. 27. Mr Pang SC for the Plaintiff submitted that a combined reading of Clause 17.1 suggests that the parties have agreed that the courts of Hong Kong shall have exclusive jurisdiction and is the natural forum to settle any disputes arising out of the Guarantee, but the Defendant retains a unilateral option to pursue proceedings elsewhere “to the extent allowed by law”. 28. Mr Pang SC for the Plaintiff further submitted that the phrase “to the extent allowed by law” is important because on a proper construction, the inclusion of such a phrase in the relevant jurisdiction clauses meant that the Defendant’s right to exercise the option to invoke the jurisdiction of other courts is not without limit in that it must be congruent with the legal principles applicable in Hong Kong. 29. Mr Wong for the Defendant, however, submitted that Clause 17.1(c) concerns two different contractual rights of the Defendant. The first right is that the Defendant “ shall not be prevented from taking proceedings relating to a Dispute in any other courts with jurisdiction ”. In other words, the Defendant may take proceedings in any court as long as the said court has jurisdiction to settle the dispute in relation to the Guarantee. 30. I am of the view that Mr Wong’s construction is the correct one. This distinct contractual right is not qualified by the phrase “to be extent allowed by law”. The Defendant has a contractual right to commence proceedings in the Beijing Intermediate Court. I do not see how this Court can legitimately restrain the Defendant from exercising its contractual rights under the Guarantee. 31. In the present case, the Defendant chose to commence proceedings in the Beijing Intermediate Court. The Plaintiff attempted to challenge the jurisdiction of the Beijing Intermediate Court and has failed. She has lodged an appeal but it has yet to be heard. Thus, I agree that the Beijing Intermediate Court is a court with jurisdiction. As such, I have no doubt that the Plaintiff is bound by Clause 17.1(c) and cannot prevent the Defendant from taking proceedings in the Beijing Intermediate Court. That should really be the end of the analysis. 32. In any event, to the extent that the Defendant’s second contractual right to “ take concurrent proceedings in any number of jurisdiction ” is qualified by the phrase “to the extent allowed by the law ” is concerned, it is important to note that the Defendant did not commence parallel proceedings at all. The present proceedings is commenced by the Plaintiff. When the Defendant commenced the Mainland Proceedings, there were no on-going legal proceedings in Hong Kong. The proceedings relating to the statutory demand had been settled and there was no proceedings in Hong Kong when the Defendant commenced the Mainland Proceedings. 33. I am of the view that the Plaintiff cannot take advantage of Clause 17.1(c) by commencing the present proceedings in Hong Kong to argue that there exists parallel proceedings and hence the Defendant has to be restrained from proceeding with the Mainland Proceedings. I agree with Mr Wong for the Defendant that the Plaintiff cannot rely on its self- created situation of parallel proceedings to deprive the Defendant of the contractual right to continue the Mainland Proceedings, particularly when it is expressly provided in Clause 17.1(c) that the whole of Clause 17.1 is for the benefit of the Secured Parties only. 34. Insofar as the Plaintiff’s reliance on Noble Power Investments v Nissei Stomach Tokyo Co Ltd [2008] 5 HKLRD 631 and Sabah Shipyard v Republic of Pakistan [2003] 2 Lloyd’s Rep 571 is concerned, I agree with Mr Wong for the Defendant that the former is not about anti-suit injunction and the latter was decided on its own particular facts. (See Deutsche Bank AG v Highland Crusader Offshore Partners LP [2010] 1 WLR 1023 at §112 per Toulson LJ.) Unconscionable Ground 35. As a matter of analysis, I do not see how the unconscionable ground is going to assist the Plaintiff given that the Defendant has a contractual right to commence and continue the Mainland Proceedings. Given that this argument has been fully ventilated, out of abundance of caution, I now also deal with it. 36. First, Mr Pang SC for the Plaintiff submitted that it is undesirable to have concurrent proceedings in two different jurisdictions. There is the inherent risk of inconsistent judgments and even worse an unseemly rush to judgment. It would also be oppressive if the Plaintiff is to be subject to two sets of proceedings. All these concerns are very real and genuine. However, it is not the Defendant who commenced parallel proceedings in the Mainland and Hong Kong. When the Plaintiff commenced the Hong Kong proceedings, she knew that there would inevitably be parallel proceedings and yet she chose to do. She did that only after she failed in her challenge to the jurisdiction of the Beijing Intermediate Court. On the other hand, when the Defendant commenced the Mainland Proceedings, there was no concurrent proceedings in Hong Kong. I am of the view that the Plaintiff cannot rely on the concurrent proceedings she deliberately created in order to deprive the Defendant of its contractual right to continue with its Mainland Proceedings. That will be wrong. 37. Indeed, as a matter of analysis, the present application is a collateral attack on the jurisdiction of the Beijing Intermediate Court after the Plaintiff has chosen to challenge the same in the Mainland and an appeal is due to be heard and determined by the Beijing Higher People’s Court. There is nothing unconscionable to allow the Mainland Proceedings to continue. The Plaintiff is the author of the potential risk and undesirable consequences as suggested by Mr Pang SC. 38. Secondly, it is submitted that the fact that the Defendant agreed to set aside the statutory demand demonstrates that the Defendant realized that it was unable to sustain any credible claims in Hong Kong. The Plaintiff then argues that the weakness of the Defendant’s claim is a relevant factor on considering whether to grant the present application. I disagree. The fact that the Defendant withdrew its statutory demand does not signify that it recognizes that its claims are weak. The legal test of a bankruptcy petition is very different from the test to be applied in a High Court action. The fact that the Defendant recognizes that its claims cannot be determined summarily does not means that its claims are weak. 39. In any event, as I mention above, this Court cannot summarily assess the strength or weakness of the Plaintiff’s case at this stage. 40. Mr Wong for the Defendant referred this Court to the case of Star Reefers Pool v JFC Group [2012] EWCA Civ 14 , [2012] CLC 294 at §31 where Rix LJ said: “ We were also shown a number of authorities where the weakness of the case sought to be pursued in the foreign court has been the subject of comment. In Midland Bank v Laker Airways [1986] QB 689 at 700 Lawton LJ said that ‘the weakness of the evidence is a factor which can be taken into account, together with the more weighty factors, in deciding whether conduct is unconscionable’, but that to treat such weakness ‘as a separate and distinct ground’ of unconscionability was problematic. English judges could not set themselves up as examining magistrates to decide whether a foreign court had a case fit for trial. It was only in case where it was ‘plain’ that a case was ‘bound to fail’ that the making of it was vexatious (see British Airways Board v Laker Airways Ltd [1985] AC 58 at 86); but such cases were ‘likely to be rare’. …” 41. I agree that in deciding whether the conduct is unconscionable for the purpose of anti-suit injunction, the court will assess the evidence available to decide whether the case is strong or weak, and it is only when the case is so weak that it is bound to fail that the court will conclude that the making of it is vexatious. 42. In the present case, the Plaintiff signed the Guarantee and is thus prima facie bound by it. The Plaintiff’s case of illegality is yet to be tested and tried. At this early stage when the evidence is rather limited, this Court cannot say that it is plain that the Defendant’s claims against the Plaintiff are so weak that they are bound to fail. 43. Thirdly, the Plaintiff alleges that Hong Kong is the most appropriate forum to deal with the issues relating to the Guarantee. 44. However, the fact that Hong Kong is the natural forum does not suffice to justify an anti-suit injunction. In Glencore International AG v Exter Shipping Ltd [2002] EWCA Civ 524 , [2002] CLC 1090, Rix LJ at §42 said: “ … the natural forum for the litigation must be in England, but this, while a necessary, is not a sufficient condition.” 45. On the other hand, I agree with Mr Wong for the Defendant that the fact that the Defendant was able to obtain the Mainland Freezing Order against two properties registered under the name of the Plaintiff in the Mainland, China at the value of RMB 95,940,687 demonstrates that the Defendant commenced the Mainland Proceedings for juridical advantage and therefore is not vexatious or oppressive. ( Choi Sai Yiu (supra).) 46. Mr Wong for the Defendant submitted that to grant an anti-suit injunction will unjustly deprive the Defendant of such advantage, particularly when the Plaintiff has sold one of her properties in Hong Kong and the other one is at risk. I agree. Although the Plaintiff relied on her PRC legal opinion to argue that the grant of an anti-suit injunction does not affect the validity of the Mainland Freezing Order, the Defendant can enforce any judgment obtained in Hong Kong in the Mainland, China and the Plaintiff even gives an undertaking to apply to uplift the Mainland Freezing Order, I agree with Mr Wong for the Defendant that the legal position is not entirely clear as the Plaintiff’s PRC legal opinion is very brief. Further, the Mainland Freezing Order is valid only up to 9 May 2022. If this Court grants an anti-suit injunction and the Mainland Freezing Order is lapsed before any Hong Kong judgment is handed down, the Defendant will not be in a position to apply for an extension of the Mainland Freezing Order. I agree that this is a legitimate and real concern. 47. Further, Mr Wong for the Defendant also pointed out that there is a risk that the Defendant might not be able to enforce its judgment on its counterclaim pursuant to the Mainland Judgments (Reciprocal Enforcement) Ordinance , Cap 597 as there might well be arguments that the Guarantee confers non-exclusive jurisdiction on the courts of Hong Kong and as such it is not a “choice of Hong Kong court agreement” to the exclusion of courts of other jurisdiction. Hence, any judgment to be obtained in relation to the Guarantee might not be enforceable in the Mainland, China. I do not find it necessary to resolve this issue save to say that I am satisfied that the Defendant has demonstrated that it has juridical advantage to continue the Mainland Proceedings. DISPOSITION 48. For all the reasons stated above, the Plaintiff’s Summons is dismissed. I also make a costs order nisi that the Plaintiff is to pay the costs of and incidental to the Summons to the Defendant to be taxed, on a party to party basis, if not agreed with certificate for one counsel. This costs order nisi will be made absolute within 14 days from the day hereof unless the parties take out application to vary the same within the 14-days period. 49. Finally, it remains for me to thank Mr Pang SC and Mr Lam for the Plaintiff and Mr Wong for the Defendant for their very able and helpful assistance. (William Wong SC) Deputy High Court Judge Mr Robert Pang SC and Mr Timothy Lam, instructed by Victor Chan & Co, for the plaintiff Mr Damian Wong, instructed by Hobson & Ma, for the defendant Look up this case on Lawcite Noteup",
  "length": 30096,
  "headers_seen": [
    "THE APPLICATION",
    "MATERIAL FACTS",
    "GROUNDS OF THE APPLICATION",
    "APPLICABLE LEGAL PRINCIPLES",
    "ANALYSIS",
    "Contractual Ground",
    "Unconscionable Ground",
    "DISPOSITION"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2020/69",
  "query": "anti-suit injunction",
  "ts": "2025-10-16T10:47:18",
  "ok": true
}