{
  "title": "THE OWNERS OF THE SHIP OR VESSEL\"LADY MURIEL\" V. TRANSORIENT SHIPPING LTD. | [1995] HKCA 615 | HKLII",
  "court": null,
  "year": 1995,
  "date": null,
  "content": "HKLII Databases Court of Appeal [1995] HKCA 615 THE OWNERS OF THE SHIP OR VESSEL\"LADY MURIEL\" V. TRANSORIENT SHIPPING LTD. Judgment Information Date 29 Mar, 1995 Action No. CACV87/1995 Neutral Cit. [1995] HKCA 615 Parallel Cit. [1995] 2 HKC 320 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History CACV87/1995 CACV000087/1995 THE OWNERS OF THE SHIP OR VESSEL\"LADY MURIEL\" v. TRANSORIENT SHIPPING LTD. CACV000087/1995 IN THE COURT OF APPEAL 1995, No. 87 (Civil) ___________ BETWEEN THE OWNERS OF THE SHIP OR VESSEL\"LADY MURIEL\" Appellants/ Defendants AND TRANSORIENT SHIPPING LIMITED Respondent/ Plaintiff ___________ Coram: Hon. Nazareth, V.-P., Bokhary and Godfrey, JJ.A. Dates of hearing: 29 and 30 March 1995 Date of judgment: 30 March 1995 Date of handing down reasons: 3 May 1995 __________________ J U D G M E N T __________________ Godfrey, J.A.: 1. This is an appeal from an order of Jerome Chan, J., made on Friday, 24 March 1995 at 6:30 p.m., whereby the defendants, the owners of the vessel \"Lady Muriel\", were ordered to permit the plaintiffs, the charterers, to inspect the vessel, then lying at anchor in Hong Kong, on the terms set out in the order. The judge refused the owners' request to stay the operation of his order pending an appeal from it; and such are the law's delays here that it took the best part of an hour before the owners were able to make arrangements for me to entertain an application for such a stay. On Sunday, 26 March 1995, at 11:30 a.m., I granted a stay of the judge's order over Tuesday, 28 March 1995, on which date the appeal was then expected to be set down for hearing. In the event, the appeal was listed not on that date but on Wednesday, 29 March 1995 (the parties having agreed to a further stay over that date) and on Thursday, 30 March 1995, this court allowed the appeal. We stated that we would put into writing our reasons for allowing the appeal, which we now do; but before doing so, we would express our appreciation of the very considerable effort the solicitors and counsel on both sides must have exerted in order to bring this meticulously prepared and researched appeal on for hearing with such expedition. 2. The background is as follows 3. On 24 March 1994, the \"Lady Muriel\" was chartered by the owners to the charterers, under a time charter, made in Copenhagen in the form approved by the New York Produce Exchange, for 3½ years. The charter party contained the following clause 93 relating to arbitration: \"93. ARBITRATION: All disputes arising out of this contract which cannot be amicably resolved shall be referred to Arbitration in London. Unless the parties agree upon a sole Arbitrator the reference shall be to 2 (two) Arbitrators, one to be appointed by each of the parties. The Arbitrators shall be commercial men, and the Umpire, if appointed, shall be a legal man, and shall be members of the London Maritime Arbitrators' Association or otherwise qualified by experience to deal with commercial shipping disputes. The contract is governed by English Law and there shall apply to Arbitration proceedings under this Clause the terms of the London Maritime Arbitrators' Association current at the time when the Arbitration proceedings are commenced. It is further agreed that the 7 (seven) days limit for appointment of the Arbitrator, either originally or by substitution, shall be changed to 30 (thirty) days. In the event the amount of claim and counter-claim does not exceed USD25,000.00, the parties agree to refer any dispute to a sole Arbitrator in accordance with the \"Small Claims Procedure\" of the London Maritime Arbitrators' Association.\" 4. Disputes as to the seaworthiness of the vessel have arisen between the owners and the charterers. These disputes have generated a plethora of accusations of bad faith made by each side against the other, but those, of course, are not matters into which this court can go at this stage. It is sufficient for present purposes to refer to the following passage from an affidavit made by the charterers' solicitor on 15 March 1995: \".....the Plaintiffs who have almost 2½ years to run under the above charter party, have a legitimate commercial interest in satisfying themselves that the Defendants' vessel is seaworthy. The vessel has a history of breakdowns and has remained in Hong Kong for almost a month with a series of breakdowns. There is a dispute between the parties as to the condition of the vessel and whether it is off hire coupled with the Plaintiffs' concern whether the cargo presently on board, which I am advised by Mr Bruce Taylor is worth approximately US$1.5 million can be safely carried to destination, and whether to load further cargo on this current voyage. In my respectful submission, the Plaintiffs should be entitled to determine by independent survey the condition of the vessel which will be necessary and relevant evidence in the arbitration recently commenced.\" The claims made by the charterers against the owners have not yet been formulated. The questions which we have to consider in this appeal are (1) whether the judge had jurisdiction to make the order which he did; and (2) if so, whether he was right to exercise it. Neither of these are easy questions. 5. I start with the first question, of jurisdiction. 6. The seat of arbitration under the charter party here is in England. But the vessel, at the material time, i.e. when the judge made his order, was in Hong Kong. At the date when the judge made his order (though not when the charterers commenced these proceedings) each party had appointed an arbitrator in accordance with the provisions of clause 93 of the charter party, and, accordingly, at the date of the judge's order, the English arbitrators were seized of the disputes between the parties. England has not adopted the UNCITRAL Model Law. Hong Kong has. However, under Article 1(2) of the Model Law, the provisions of the Model Law, except Articles 8, 9, 35 and 36, apply only if the seat of the arbitration is in Hong Kong. Since the seat of the arbitration in our case is not in Hong Kong, but in England, it follows that the provisions of the Model Law do not generally apply to it. However an exception is made for (inter alia) Article 9. Article 9, which does apply, provides that it is not incompatible with an arbitration agreement for a party to request, before or during arbitral proceedings, from a court, \"an interim measure of protection\", and for a court to grant such measure; and I would hold, therefore, that there is nothing in the adoption by Hong Kong of the Model Law which precludes the Hong Kong court, in our case, from granting, if appropriate, \"an interim measure of protection\" to the charterers, if it otherwise has jurisdiction to do so. In my judgment, it did have jurisdiction to do so; but not, as the charterers claimed, under section 14 (6)(g) of the local Arbitration Ordinance Cap. 341 . That sub-section does give the court power to make orders for the inspection of property as to which a question arises in a reference to arbitration; but it applies only (1) to domestic arbitrations; and (2) by virtue of s.34E, adopted in 1991, to international commercial arbitrations which are governed by the Model Law. The arbitration here is neither of these. The seat of the arbitration is not in Hong Kong but in England, and the arbitration is not governed by the Model Law. But the court did have power to make the order under the inherent jurisdiction of the court and is not precluded from doing so by Article 5 of the Model Law, which provides that in matters governed by the Model Law the court shall not intervene except where so provided in the Model Law. 7. Following the reasoning which commended itself to the House of Lords in Channel Tunnel Group Ltd. v. Balfour Beatty Ltd [1993] AC 334 , I would hold that it is not a necessary condition of the grant of an \"interim measure of protection\" that it should be ancillary to relief to be granted by a Hong Kong court, and I would hold that there is no reason in principle why an order made by the Hong Kong court for a mandatory stay of a Hong Kong action should preclude the grant of an order in that action for \"interim protection\" in aid of a foreign arbitration. The jurisdiction in question is, as I have said, the inherent jurisdiction of the court; section 21L of the Supreme Court Ordinance ( Cap. 4 ) on which some reliance was placed by the charterers, does not \"confer any new jurisdiction nor remove or limit any existing jurisdiction\": see The Supreme Court Practice, 1995, Vol. 2, at para. 5167. The inherent jurisdiction of the court is quite wide enough to justify the grant of an \"interim measure of protection\" even if (as Sheen J. considered in The \"Mare del Nord\" [1990] 1 Lloyds Law Reports 40) such an order would not normally be described as an injunction. Such an order, when it takes the form of an order to permit inspection, is closely analogous to an order in the Anton Pillar form, a form of order which is of course made under the inherent jurisdiction of the court. 8. The question, then, is whether what the charterers sought and obtained here was \"an interim measure of protection\". I would hold that it was. The order for inspection of the vessel was plainly an \"interim\" measure; it was not an order which settled the rights of the parties inter se. And it was a measure of \"protection\", because it was designed to preserve evidence to be used in the arbitration, protecting the charterers against the risk of the loss of evidence which, but for the order for inspection, they will be unable to produce in the arbitration. For these reasons, and although I accept that section 14(6)(g) of the local Ordinance does not assist them, I would decide the jurisdiction point in favour of the charterers, and hold that the judge did have jurisdiction to make the order which he made. 9. I turn to the next question; whether it was right for the judge to make the order, notwithstanding that by the time he came to make it, the arbitrators appointed by the parties were seized of the dispute. 10. I would hold, again following the decision of the House of Lords in Channel Tunnel Group v. Balfour Beatty Ltd [1993] AC 334 , that there is no reason in principle why the judge should not have made such an order as he made here notwithstanding that (under the Model Law) there had to be a stay of the Hong Kong action in favour of the arbitration. But the question, as that case demonstrates, is whether the grant of the relief claimed would be appropriate in circumstances where as here the arbitrators had not themselves been asked to make an order for inspection of the vessel (as they could have been; see \"The Vasso\" [1983] 1 WLR 838 ) nor to approve the charterers' application to the Hong Kong court for such an order. 11. In the circumstances of this case, it would not be appropriate for the Hong Kong court to grant the relief sought at the instance of the charterers, who have not even sought, let alone obtained, the approval of the arbitrators to their request for that relief. I do not rule out the possibility that, in another case, where there is great urgency, and where serious and irreparable damage would manifestly and undoubtedly be done to the charterers unless the relief sought were granted, so that the interests of justice dictated the grant of relief to the charterers as a matter of necessity, the court might be prepared to grant charterers an appropriate \"interim measure of protection\", notwithstanding that the approval of the arbitrators to their application had not been first obtained. But it is, in my judgment, not enough that it would be just and convenient to make the order for inspection. I am of the opinion that before the Hong Kong court would be justified in making such an order in aid of a foreign arbitration, it would have to be satisfied, beyond a peradventure, that the charterers would suffer serious and irreparable damage if the order were not made. As it seems to me on the facts of the present case, the charterers are unable to do more than prove that it would be of some assistance in the resolution of their disputes with the owners if the evidence produced by the inspection were in due course to be placed before the arbitrators. This, in my judgment, is not nearly good enough. 12. I agree with the sentiments expressed in the Channel Tunnel Group case to the effect that those who make agreements for the resolution of disputes must show good reasons for departing from them, and that, having promised to take their complaints to arbitrators, that is where complainants should go. The fact that they may find that remedy too slow, or too inconvenient, is quite beside the point. That is not to say that the Hong Kong court must never be invited to play a secondary role in the taking of measures to make the work of the chosen tribunal more effective. To say that the Hong Kong court can never grant an interim measure of protection in support of proceedings which the parties have agreed should be the subject of an arbitration abroad would be to go too far. It will be remembered that the captain of HMS Pinafore originally claimed that he was \"never, never sick at sea\"; but, under pressure, was constrained to substitute \"never\" with \"well, hardly ever\". The Hong Kong court has then the power to grant \"an interim measure of protection\" to a party to an arbitration, even in an action itself otherwise stayed in favour of the arbitration; but ought to be very cautious about granting him relief. Clearly, if the arbitrators approve of the application, the situation is totally changed. The purpose of \"an interim measure of protection\" is not to encroach on the procedural powers of the arbitrators but to re-inforce them, and to render more effective the decision at which the arbitrators will ultimately arrive on the substance of the dispute. Provided that this, and no more, is what such a measure legitimately aims to do, there is nothing in it contrary to the spirit of international arbitration. The problem is that there is always a tension when the court is asked to order, by way of interim relief in support of an arbitration, a remedy of the same kind as could be sought from the arbitrators: a tension between, on the one hand, the need for the court to make a tentative assessment of the merits in order to decide whether the plaintiff's claim is strong enough to merit protection, and on the other, the duty of the court to respect the choice of tribunal which both parties have made, and not to take out of the hands of the arbitrators a power of decision which the parties have entrusted to them alone. There are limits beyond which parties to arbitration agreements cannot be allowed, consistently with their arbitration agreements, \"to run to the courts for help\", as Lord Mustill pointed out in S.A. Coppée Lavalin L.V. v. Ken-Ren Chemicals and Fertilizers Ltd [1995] 1 AC 38 , at p.65. 13. The matter can perhaps best be put this way; where a party to an international commercial arbitration, the seat of which is in a place other than Hong Kong, seeks \"an interim measure of protection\" from the court of Hong Kong without having first obtained the approval of the arbitrators to his application, the Hong Kong court should refuse the application unless satisfied that the justice of the case necessitates the grant of the relief in order to prevent what may be serious and irreparable damage to the position of the applicant in the arbitration. If, as I think is here the case, the applicant is unable to discharge this (admittedly, very heavy) burden, the Hong Kong court should refuse him relief. 14. I would therefore allow this appeal; and I would order the charterers to pay the owners' costs of the application below; of the costs of the application to this court for a stay; and of this appeal. Bokhary, J.A.: 15. I, too, would allow this appeal and make that order as to costs. In my view, the judge went too far. 16. The courts must be careful not to usurp the function of arbitrators through excessive zeal in attempting to assist them. There can be situations in which there is a real danger that a party would, unless stopped by the courts here, do something which would render nugatory an application which the opposite party could, timeously and with reasonable prospects of success, make to overseas arbitrators or the courts of the country in which they are sitting. In such a situation - and when (as in the present case) service is possible - it may be that the courts here can properly make a prohibitory order to preserve the position pending such an application overseas. Making such an order might be truly to assist the arbitrators without in any way usurping their function. 17. In the present case, the judge went further than merely preserving the position for the arbitrators. He went so far as to do what it was for the overseas arbitrators or the courts where they are sitting to do. And that is why I think he went too far. Nazareth, V.P.: 18. For the reasons given by my Lords, I agreed that the appeal had to be allowed. (G.P. Nazareth) (K. Bokhary) (G.M. Godfrey) Vice President Justice of Appeal Justice of Appeal Representation: Mr. J.D. Kerr (M/s. Ince & Co.) for Appellants/Defendants Mr. C.L. Smith (M/s. Holman, Fenwick & Willan) for Respondent/Plaintiff Look up this case on Lawcite Noteup",
  "length": 17456,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkca/1995/615",
  "query": "seat of arbitration",
  "ts": "2025-10-16T10:49:39",
  "ok": true
}