{
  "title": "CHAN SHU CHUN AND OTHERS V. RIGHT MARGIN LTD AND OTHERS | [2015] HKCFI 947 | HKLII",
  "court": null,
  "year": 2015,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2015] HKCFI 947 CHAN SHU CHUN AND OTHERS V. RIGHT MARGIN LTD AND OTHERS Judgment Information Date 12 May, 2015 Action No. HCA792/2015 Neutral Cit. [2015] HKCFI 947 Parallel Cit. [2015] 3 HKLRD 409 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCA792/2015 HCA792/2015 CHAN SHU CHUN AND OTHERS v. RIGHT MARGIN LTD AND OTHERS HCA 792/2015 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE HIGH COURT ACTION NO 792 OF 2015 ________________ BETWEEN CHAN SHU CHUN (陳書春) 1 st Plaintiff TIAN YAO (XIAMEN) PROPERTY DEVELOPMENT COMPANY LIMITED (天耀 (廈門) 置業發展有限公司) 2 nd Plaintiff and RIGHT MARGIN LIMITED (當鋭有限公司) 1 st Defendant TIAN LIANG LIMITED (天量有限公司) 2 nd Defendant DAVID CHARLES PARKER 3 rd Defendant CHAN KAM POR (陳鑒波) 4 th Defendant YEUNG KWONG SUNNY (楊光) 5 th Defendant LEUNG WAI CHOI DEREK (梁煒才) 6 th Defendant ________________ Before: Madam Recorder Linda Chan SC in Chambers Date of Hearing: 24 April 2015 Date of Decision: 24 April 2015 Date of Reasons for Decision: 13 May 2015 ________________________ REASONS FOR DECISION ________________________ 1. By summons dated 15 April 2015, the 1 st and 2 nd plaintiffs, Chan Shu Chun (“CSC”) and Tian Yao (Xiamen) Property Development Company Limited (“Tian Yao”), apply for a final injunction against all the defendants to restrain them from taking part in the arbitration proceedings before South China International Economic and Trade Arbitration Commission (“SCIETAC”) (case no SHEN T20150116) (“the Arbitration”) pursuant to an agreement dated 29 January 2015 purportedly made between the 2 nd defendant, Tian Liang Limited (“Tian Liang”) and Tian Yao. 2. In the skeleton argument of Mr Andy Hung and Mr Yuan Shan Cao, counsel for the plaintiffs, the application is made on the bases that the Arbitration is a “sham”, that the 1 st defendant, Right Margin Limited (“Right Margin”), has acted in breach of its duties as mortgagee and that the 3 rd to 6 th defendants have conspired to cause “economic injury” to Tian Yao. 3. At the hearing, Mr CY Li SC, counsel for the plaintiffs, informs the court that the application is made on behalf of CSC against the 1 st defendant, Right Margin and Tian Liang only, and the injunction sought is interlocutory. For the purpose of the application, the only cause of action relies on by CSC is the alleged breach of duties of Right Margin as mortgagee. 4. So far as Tian Liang is concerned, it is a BVI company and does not have a place of business in Hong Kong. No attempt was made by CSC to apply for leave to serve the writ of summons or the documents filed in relation to the application out of the jurisdiction on Tian Liang. There is a belated application issued by CSC the day before the hearing seeking an order that Tian Liang “be deemed to have been served” with the documents. There is no merit in the application and I dismiss the application with costs. 5. As Tian Liang is not before the court, the application is only made against Right Margin although Mr Li seeks to re‑formulate the application in an attempt to bind Tian Liang, as discussed in §27 below. 6. After hearing submissions from the parties, I dismiss the application and order costs to be paid by CSC to the 1 st and 3 rd to 6 th defendants on an indemnity basis with reasons to be handed down which I now give. Background fact 7. The background fact relevant to the application is not in dispute. 8. CSC was until 9 May 2013 the sole shareholder of Tian Liang, which owns all the equity in Tian Yao. Tian Yao is a company established in the PRC and holds a property development project in Xiamen (“the Project”). Right Margin is a company within the Chinachem group and the 4 th defendant, Mr Chan Kam Por (“KP Chan”), is its director. 9. On 16 January 2009, Tian Liang, Tian Yao and Right Margin entered into an agency agreement (“Agency Agreement”) whereby: (1) Right Margin was appointed as the exclusive sales agent of 34 designated units in the Project during the period from 1 April 2009 to 31 March 2011 (“Agency Period”); (2) Right Margin advanced a sum of RMB120,330,603 to Tian Yao and Tian Liang, which was to be repaid to Right Margin at the end of the Agency Period; and (3) Right Margin was entitled to a share of the proceeds from sale of the units during the Agency Period. 10. As security for the Agency Agreement, the following documents were executed in favour of Right Margin on 16 January 2009 (collectively “Security Documents”): (1) a share mortgage whereby CSC mortgaged all his shares in Tian Liang (“the Shares”) to Right Margin (“the Mortgage”); (2) a share pledge under which Tian Liang pledged all its equity in Tian Yao to Right Margin; and (3) a personal guarantee under which CSC guaranteed the legal obligations of Tian Yao and Tian Liang under the Agency Agreement. 11. Tian Liang and Tian Yao failed to pay the amounts due to Right Margin under the Agency Agreement. On 7 February 2013, Right Margin commenced proceedings intituled “HCA 265/2013” against Tian Liang, Tian Yao and CSC claiming RMB140,221,986, being the amount allegedly due and payable to Right Margin pursuant to the Agency Agreement. Right Margin obtained default judgment for the amount claimed together with interest at 8% from 7 February 2013 against Tian Liang and Tian Yao on 9 April 2013 (“1 st Default Judgment”) and against CSC on 15 April 2013 (“2 nd Default Judgment”). 12. On the basis of the 1 st Default Judgment, on 12 March 2014, Right Margin obtained an order from the Xiamen Intermediary Court to freeze the assets of Tian Liang and Tian Yao up to RMB145,528,644.60. On 20 June 2014, the same court held that the 1 st Default Judgment should be recognised and enforced against Tian Liang and Tian Yao and ordered them to pay RMB140,221,986 together with interest at 8% from 7 February 2013 to the date of the order. 13. By summons issued on 24 July 2014 (and amended by another summons dated 16 January 2015), Tian Yao and CSC applied in HCA 265/2013 to set aside the 1 st and 2 nd Default Judgments on the basis that the amount payable to Right Margin should be HK$129,770,275.36 instead of RMB140,221,986 claimed by Right Margin. 14. On 9 May 2013, Right Margin exercised its rights under the Mortgage and transferred the Shares from CSC to itself. On the same day, Right Margin procured Tian Liang to remove CSC as its director and appointed the 3 rd defendant, David Charles Parker (“Mr Parker”) and Mr KP Chan as its directors. For the purpose of this application, CSC does not dispute the transfer of the Shares or the change in directorship in Tian Liang. 15. By written resolutions of the board of directors of Tian Liang passed on 21 October 2014 (signed by Mr Parker and Mr KP Chan as directors) (“October 2014 Resolutions”), Mr KP Chan was appointed as the authorised signatory of Tian Liang in place of Mr Hui Yip Wing (“Mr Hui”) and was authorised to sign documents for the purposes of: (1) removing Mr Hui, Mr Li Wing Lung (“Mr Li”) and Mr Lu Hongxiang (“Mr Lu”) as directors of Tian Yao (collectively “the Old Management”); (2) removing Mr Li as legal representative of Tian Yao; (3) appointing Mr Parker, Mr Yeung and Mr Leung as directors of Tian Yao; and (4) appointing Mr Parker as legal representative of Tian Yao. 16. Thereafter, Mr KP Chan, on behalf of Tian Liang, signed a letter of appointment and a letter of dismissal both dated 21 October 2014 to effect the above changes in directors and legal representative of Tian Yao. 17. On 29 January 2015, the new board of Tian Yao comprising of Mr Parker, Mr Yeung and Mr Leung, passed resolutions to (1) confirm that Mr Parker is the only authorised representative of Tian Yao and (2) approve the policy on custody of Yian Yao’s company seal, business licence and financial records (“January 2015 Resolutions”). 18. By an agreement dated 29 January 2015 (“the Agreement”) executed by Mr KP Chan on behalf of Tian Liang ( qua authorised representative) and by Mr Parker on behalf of Tian Yao ( qua legal representative), the parties agreed, inter alia , that Tian Yao shall (1) hand over its company chops and other official documents to Mr Parker within two days, and (2) register the changes in legal representative and directors of Tian Yao within five days with the relevant Administration for Industry and Commerce (“AIC”). Under clause 9, the parties agreed to submit any dispute relating to the Agreement to SCIETAC for arbitration. 19. On 4 February 2015, Tian Liang commenced the Arbitration against Tian Yao by filing an application with SCIETAC claiming that Tian Yao had failed to perform its obligations under the Agreement. The Arbitration is scheduled to be heard on 28 April 2015. Summary of parties’ cases 20. Against the above background, CSC sought an injunction against Right Margin so as to stop the Arbitration from proceeding further. 21. In short, it is CSC’s case that as mortgagee of the Shares, Right Margin is under a duty to exercise its powers in good faith and for the purpose of obtaining repayment and not for any collateral purpose. There is a serious question to be tried that Right Margin has acted in breaches of its duty and the balance of convenience lies in favour of granting the injunction. The breaches of duty allegedly committed by Right Margin include: (1) Commencing HCA 256/2013, obtaining the 1 st and 2 nd Default Judgments and taking steps to freeze the Project while the negotiations between CSC and Right Margin on the provision of certain shares held by CSC in another company in Shanghai “as collateral for deferring payment due under the Agency Agreement” have been on‑going. (2) Obtaining the freezing order against the Project, thereby rendering CSC unable to repay the amount owed to Right Margin, which it is said “clogs the equity of redemption”. (3) Trying to take control over Tian Yao which “plainly exceeds the realm of the exercise of a genuine mortgagee’s powers”, such conduct has nothing to do with securing repayment of the debt owed by Tian Liang and Tian Yao and “constitutes an attempt to improperly interfere with, and disrupt, the business and affairs of Tian Yao”. (4) Failing to disclose the removal of the directors and legal representative of Tian Yao to the Old Management and deliberately sending the letters concerning the changes in directorship to incorrect addresses. (5) Devising a scheme using the Agreement and the Arbitration, both of which are “sham”, in order to obtain an arbitration award to effect the change of directors and legal representative of Tian Yao at AIC. 22. Mr Eugene Fung SC, counsel for Right Margin, submits that the application should be dismissed for the following reasons: (1) The application is for an anti-suit injunction, and CSC has failed to satisfy the high threshold requires for the court to grant such injunction. (2) Tiang Liang and Tian Yao were in default of their obligations under the Agency Agreement, which constituted an event of default. Right Margin was entitled to exercise the rights under clauses 5.01 and 5.02 of the Mortgage including all rights attached to the Shares. (3) Right Margin is seeking to take control of Tian Yao for the purpose of securing repayment of the outstanding debt. (4) The Agreement is not a sham as the legal rights and obligations which the parties intended to create were exactly the same as the legal rights and obligations they intended to portray to third parties. (5) In any event, the validity of the Agreement will be an issue to be determined in the Arbitration and the Old Management has already taken steps to intervene in the Arbitration and to defend the claim purportedly on behalf of Tian Yao. Application is futile 23. As stated above, the application is directed against Right Margin. This raises the obvious question on the utility of the application, as Right Margin is not a party to the Arbitration. Mr Fung submits that there is no point in seeking to restrain Right Margin from proceeding with the Arbitration as it is not a party to such Arbitration. It is well established that equity does not act in vain and will not grant an injunction which is futile. 24. Mr Li seeks to rely on an opinion rendered by a PRC lawyer, which he submits confirm that an injunction, if granted by the court against Right Margin, will be effective in stopping the Arbitration from proceeding further. 25. In fact, the opinion (which is not an expert opinion) says no such thing. The PRC lawyer states that the arbitration tribunal has in its preliminary ruling rendered in March 2015 confirmed that Mr Parker, in his capacity as legal representative of Tian Yao, has authority to sign the Agreement. This, in his view, shows that the tribunal has already formed a preliminary view that the Agreement is valid. Thus, unless the Old Management is able to produce new evidence, such as an injunction granted by the Hong Kong court restraining Right Margin from taking any steps to replace the directors or invalidating the Agreement , it is likely that the tribunal will rule in favour of Tian Liang in the Arbitration. 26. As there is nothing to show that the injunction sought against Right Margin will have the effect of putting the Arbitration to a halt, which is the only stated purpose of the application, it is a futile application and should be dismissed in limine . 27. I should add that in his Points of Reply, which is only provided to the court and the defendants shortly before the hearing, Mr Li proposes to seek an injunction to restrain Right Margin “whether by itself, its directors, officers, employees or agents from procuring TIAN LIANG LIMITED” to proceed with the Arbitration. Leaving aside the delay in re‑formulating the application, which effectively deprives Right Margin of the opportunity to properly consider such application, it seems to me that the re‑formulation is based on a misapprehension that as the sole shareholder of Tian Liang, Right Margin has the right to usurp the powers of the directors of Tian Liang. It is well established that where there is an effective board, the shareholders cannot in general meeting usurp the powers of the board ( Breckland Group Holdings Ltd v London and Suffolk Properties and others [1989] BCLC 100; Miracle Chance Ltd v Ho Yuk Wah [1999] 3 HKC 811 (CA) at 815C‑F). There is no suggestion that the board of Tian Liang is not effective. 28. That being the position, it is not necessary to consider the other points raised by the parties. Nevertheless, I shall deal with them briefly as they are relevant to my decision to order costs against CSC on an indemnity basis. Anti-suit injunction 29. Mr Li submits that the application is governed by the American Cyanamid principles, which require the applicant to satisfy the court that there is a serious question to be tried, that damage is not an adequate remedy and that balance of convenience lies in favour of granting the injunction. 30. Mr Fung, on the other hand, submits that CSC is essentially seeking an anti‑suit injunction to prevent the defendants from participating in, and/or procuring Tian Liang from litigating in another jurisdiction. Mr Fung submits that the principles governing an application for anti-suit injunction are as follows: (1) A person has no right not to be sued in a particular forum, domestic or foreign, unless there is some specific factor which gives him that right ( Turner v Grovit [2002] 1 WLR 107 at 118C‑D, per Lord Hobhouse; Liaoyang Shunfeng Iron & Steel Co Ltd v Yeung Tsz Wang , CACV 234/2011, 14 June 2012, at §84, per Hartmann JA). (2) The court may restrain a defendant from instituting or continuing proceedings in a foreign jurisdiction where (1) the bringing of the proceedings abroad is in breach of an agreement, and (2) the conduct of the party to be restrained is unconscionable, vexatious or oppressive ( Turner v Grovit , at 117C‑F and 118C‑D). (3) An anti‑suit injunction will only be issued restraining a party who is amenable to the jurisdiction of the court, against whom an injunction will be an effective remedy. This is a consequence of the fact that a court when restraining foreign proceedings is not regulating its own jurisdiction ( Turner v Grovit , at 117B‑C). (4) An anti‑suit injunction always requires caution as it involves interference with the process or potential process of a foreign tribunal. It is not for the Hong Kong court to arrogate itself the decision how a foreign court should determine the matter. The stronger the connection of the foreign court with the parties and the subject matter of the dispute, the stronger the argument against intervention ( SNI Aerospatiale v Lee Kui Jak [1987] AC 871 at 895D‑H, per Lord Goff; Airbus Industrie GIE v Patel [1999] 1 AC 119 at 148G‑H, per Lord Goff; Liaoyang Shunfeng , at §85). (5) As the court is required to consider an application for anti-suit injunction with caution, the applicant must demonstrate something more than a prima facie case ( Liaoyang Shunfeng , at §110). 31. Mr Li does not dispute the above principles but submits that the application is not an anti-suit injunction as neither CSC nor Right Margin is a party to the Arbitration and, as such, it cannot be said that CSC is seeking an injunction to restrain Right Margin from proceeding against him in the Arbitration. This seems to me to be a tacit acceptance by CSC that the application is futile. In any event, I do not think it is open to CSC to seek an injunction for the stated purpose of restraining the Arbitration from proceeding and, at the same time, disavowing the fact that he is seeking to restrain the same Arbitration from being litigated. 32. Mr Li submits that even if the application may be characterised as an application for an anti-suit injunction, it should be granted as the end of justice requires it “because the whole arbitration is artificial if not a sham undertaken for the admitted purpose of procuring an agreed arbitral award for showing to the public authority”. For the reasons set out in §§41 and 42 below, I do not think there is any basis to suggest that the Arbitration is a sham. In any event, it is impossible to see how it can be said that the end of justice requires the court to grant the anti-suit injunction sought by CSC, as the Arbitration is neither conducted in breach of an agreement, nor can it be said that the conduct of Right Margin is unconscionable, vexatious or oppressive. 33. In my view, the end of justice does not require the court to grant an anti-suit injunction. As Mr Fung submits, the validity of the Agreement — which CSC alleges to be a sham — is an issue which will be determined by the tribunal in the Arbitration. As the Old Management has already taken steps to intervene in the Arbitration, they may advance their argument to the tribunal for its consideration. There is no reason why this cannot be done. The application for anti‑suit injunction must fail on this ground as well. Alleged breach of duties 34. Mr Li submits that as mortgagee of the Shares, Right Margin is under a duty to exercise its powers in good faith and for the purpose of obtaining repayment, relying on Downsview Nominees Ltd v First City Corporation Ltd [1993] AC 295 at 312F‑G; Medforth v Blake [2000] Ch 86 at 101H‑102B; Hong Da Development & Investment Holding Co Ltd v China Aoyuan property Group Ltd & Ors , HCA 1377/2011 at §§125, 132, per G Lam J. 35. The above cases all recognised that upon enforcement of a mortgage, a mortgagee is entitled to, and has the powers, to take control over the mortgaged property and decide how the assets should be preserved and realised for the purpose of repaying the debt owed. In Downsview Nominees Ltd v First City Corporation Ltd, at 312F‑H,Lord Templeman said this: “From these principles flowed two rules, first, that powers conferred on a mortgagee must be exercised in good faith for the purpose of obtaining repayment and secondly that, subject to the first rule, powers conferred on a mortgagee may be exercised although the consequences may be disadvantageous to the borrower . These principles and rules apply also to a receiver and manager appointed by the mortgagee. It does not follow that a receiver and manager must immediately upon appointment seize all the cash in the coffers of the company and sell all the company’s assets or so much of the assets as he chooses and considers sufficient to complete the redemption of the mortgage. He is entitled, but not bound, to allow the company’s business to be continued by himself or by the existing or other executives . The decisions of the receiver and manager whether to continue with the business or close down the business and sell assets chosen by him cannot be impeached if those decisions are taken in good faith while protecting the interests of the debenture holder in recovering the moneys due under the debenture, even though the decisions of the receiver and manager may be disadvantageous for the company.” ( emphasis added ) 36. In the present case, the alleged breaches of duties all relate to the steps taken by Right Margin to seize control over Tian Liang and its wholly owned subsidiary, Tian Yao. Mr Li is unable to point to any authority in support of his contention that in taking steps to seize control over the mortgaged property, a mortgagee would be regarded as acting in breach of its duty. 37. There is no dispute that Tian Liang and Tian Yao failed to pay the amounts due under the Agency Agreement. According to CSC, the amount owed was HK$129,770,275.36. Under clause 5.01(a) of the Mortgage, if CSC “fails to fulfil any part of the Secured Obligations”, Right Margin may declare the security over the Shares immediately enforceable. Thus, it is indisputable that Right Margin was entitled to enforce the security over the Shares and to exercise the powers under clause 5.02. 38. Clause 5.02 provides that upon the security becoming enforceable, Right Margin may: “(1) without any notice to or further consent or concurrence of the Mortgagor exercise all rights and enjoy all benefits attached to the [Shares] as if it were the sole beneficial owner thereof; (2) dispose of the [Shares] or any part thereof in such manner and for such consideration (whether payable or deliverable immediately or by instalments) as Right Margin considers appropriate; and (3) implement the resignations of the incumbent directors of the Mortgagor [1] (if applicable) and appoint Right Margin’s nominees in their stead and/or if it has not already done so procure the transfer of the [Shares] (or such of the same as it considers appropriate) so that the same are registered in its name or the names of its nominees and/or act in all respects as the beneficial owner of the [Shares] and assume the management and control of the Mortgagor and/or apply all dividends accruing on the [Shares] in or towards satisfaction of the Secured Obligations.” ( emphasis added ) 39. Amongst the alleged breaches of duty, as summarised in §21 above, the ones under (3), (4) and (5) all relate to the steps taken by Right Margin to seize control over Tian Liang and Tian Yao. I am unable to see how CSC can complain about the steps taken by Right Margin when such steps are within the powers given to Right Margin under clause 5.02 of the Mortgage. 40. As for CSC’s allegation that the Agreement and the Arbitration are “sham”, it does not take the point any further. 41. Mr Fung submits that “sham” is a legal concept. It was explained by Diplock LJ in Snook v London and West Riding Investments [1967] 2 QB 786 at 802C‑F as meaning acts or documents “which are intended by [the parties to the sham] to give to third parties or to the court the appearance of creating between the parties legal rights and obligations different from the actual legal rights and obligations (if any) which the parties intend to create”. 42. On Right Margin’s case, (1) by the October 2014 Resolutions, the Old Management was replaced by Mr Parker, Mr Yeung and Mr Leung who were appointed as Tian Yao’s directors; (2) on 29 January 2015, Mr Parker was appointed as the sole authorised representative of Tian Yao by its new board. It follows that Mr Parker was duly authorised to sign the Agreement on behalf of Tian Yao, and the Agreement could not be a “sham” as the legal rights and obligations which the parties intended to create were exactly the same as those which the Agreement intended to portray to third parties. I agree. 43. As for the complaint about Right Margin commencing proceedings against Tian Liang, Tian Yao and CSC, obtaining the 1 st and 2 nd Default Judgments and taking enforcing proceedings in Xiamen while CSC and Right Margin have been negotiating on a settlement (§21(1) above), it is wholly without merit. As Mr Fung points out, the negotiations took place in 2011 to 2013 and no agreement was reached. There is nothing wrong for Right Margin to take enforcement steps while negotiating with CSC for a possible settlement. There is no implied duty for a party in negotiation to inform the other side of what legal steps he has taken or is going to take to enforce its rights. CSC has not been able to point to any authority in support of his extraordinary proposition. In any event, there is no suggestion that the service of writ of summons in HCA 265/2013 was irregular. As for the letters to the Old Management, they were sent to their registered addresses recorded with Xiamen AIC. 44. Lastly, the complaint that Right Margin’s act in freezing the Project renders CSC to be unable to repay the amount owed and thus “clogs the equity of redemption” (§21(2) above) is misconceived. 45. It is well established that a creditor can choose to enforce whichever remedy that is open to him. As stated by Lord Templeman in China South Sea Bank v Tan Soon Gin [1990] 1 AC 536 at 545C‑D: “The creditor has three sources of repayment. The creditor could sue the debtor, sell the mortgage securities or sue the surety. All these remedies could be exercised at any time or times simultaneously or contemporaneously or successively or not at all.” (see also Fisher & Lightwood’s Law of Mortgage , 14 th ed, 2014, §26.13; Calnan, Taking Security: Law and Practice , 2 nd ed, 2011, §8.51). 46. As Right Margin has the right to take any steps open to it for the purpose of obtaining repayment, there is no basis for CSC to allege that Right Margin’s act in freezing the Project constitutes a breach of duty. 47. For the above reasons, I do not think any of the alleged breaches of duty raises a serious issue to be tried. It follows that even if, contrary to my view, the application is not an application for an anti-suit injunction and that I should approach the application on the basis of the American Cyanamid principles, I would still dismiss the application on the basis that there is no serious issue to be tried. Conclusion and costs 48. The application should be dismissed. I consider that it is appropriate to order the costs of and occasioned by the application be paid by CSC to Right Margin and the 3 rd to 6 th defendants on an indemnity basis, with certificate for two counsel, for the following reasons: (1) The application is futile and devoid of any merit. (2) CSC saw fit to make serious allegations of conspiracy to injure against the defendants in circumstances where the alleged breaches of duties are ill‑founded and wholly without merit. It is only until the hearing when Mr Li appears for the plaintiffs that the allegation of conspiracy to injure is abandoned. By that stage, costs have already been incurred by the defendants in defending those allegations. (3) The dispute arose out of the enforcement of the Mortgage by Right Margin. Under clause 9.01 of the Mortgage, CSC agrees to pay on a full indemnity basis all reasonable costs, expenses and charges including legal fees incurred by Right Margin in connection with, inter alia, the enforcement of the Mortgage, and the enforcement or exercise of the rights under or otherwise in connection with the Mortgage. There is no reason why the court should not give effect to this clause. (Linda Chan SC) Recorder of the Court of First Instance High Court Mr Li Chau-yuen SC and Mr Yuen Shan Cao, instructed by B C Chow & Co, for the 1 st & 2 nd plaintiffs Mr Eugene Fung SC and Mr Wilson Leung, instructed by Norton Rose Fulbright Hong Kong, for the 1 st , 3 rd to 6 th defendants The 2 nd defendant was not represented and did not appear [1] Mr Fung submits that the reference to “Mortgagor” (being CSC) is a typographical error and it is intended to be a reference to Tian Liang. Mr Li does not suggest otherwise Look up this case on Lawcite Noteup",
  "length": 28748,
  "headers_seen": [
    "Background fact",
    "Summary of parties’ cases",
    "Application is futile",
    "Anti-suit injunction",
    "Alleged breach of duties",
    "Conclusion and costs"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2015/947",
  "query": "anti-suit injunction",
  "ts": "2025-10-16T10:47:24",
  "ok": true
}