{
  "title": "ASTRO NUSANTARA AND OTHERS V. PT AYUNDA PRIMA MITRA | [2015] HKCFI 274 | HKLII",
  "court": null,
  "year": 2015,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2015] HKCFI 274 ASTRO NUSANTARA AND OTHERS V. PT AYUNDA PRIMA MITRA Judgment Information Date 17 Feb, 2015 Action No. HCCT45/2010 Neutral Cit. [2015] HKCFI 274 Download MS Word Judgment Reading Options Translation Toggle Highlight Appeal History HCCT45/2010 HCCT45H/2010 ASTRO NUSANTARA AND OTHERS v. PT AYUNDA PRIMA MITRA HCCT 45/2010 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO 45 OF 2010 ________________________ BETWEEN (1) ASTRO NUSANTARA INTERNATIONAL B.V. Applicants/ (2) ASTRO NUSANTARA HOLDINGS B.V. Claimants in the (3) ASTRO MULTIMEDIA CORPORATION N.V. Arbitration/ (4) ASTRO MULTIMEDIA N.V. Judgment (5) ASTRO OVERSEAS LIMITED (formerly Creditors known as AAAN (Bermuda) Limited) (6) ASTRO ALL ASIA NETWORKS PLC (7) MEASAT BROADCAST NETWORK SYSTEMS SDN BHD (8) ALL ASIA MULTIMEDIA NETWORK FZ-LLC and (1) PT AYUNDA PRIMA MITRA Defendants/ (2) PT FIRST MEDIA TBK (formerly known as PT BROADBAND MULTIMEDIA TBK) Respondents in the Arbitration/ (3) PT DIRECT VISION Judgment Debtors and ACROSSASIA LIMITED Garnishee ________________________ Before: Hon Chow J in Chambers Date of Hearing: 8, 9 10 & 11 December 2014 Date of Handing Down Judgment: 17 February 2015 ________________________ J U D G M E N T ________________________ Introduction 1. I have before me a summons issued by the 2 nd defendant, PT First Media TBK (formerly known as PT Broadband Multimedia TBK) (“First Media”), on 18 January 2012 seeking, inter alia : (1) An extension of time to apply to set aside (a) two orders made by Mr Justice Saunders on 3 August 2010 and 20 September 2010 respectively (collectively “the Hong Kong Orders”) granting leave to the 1 st to 8 th applicants (hereinafter collectively referred to as “Astro”) to enforce five arbitration awards, and (b) the judgment of Mr Justice Saunders entered on 9 December 2010 (“the Hong Kong Judgment”) pursuant to the Hong Kong Orders. (2) An order that the Hong Kong Orders and Hong Kong Judgment be set aside. (3) An order that the Garnishee Order to Show Cause (“the Garnishee Order Nisi ”) made by Master Levy on 22 July 2011 be discharged. 2. The five arbitration awards (“the Awards”) were made by an arbitral tribunal (“the Tribunal”) constituted by Sir Gordon Langley, Sir Simon Tuckey and Stewart C Boyd CBE QC under the auspices of the Singapore International Arbitration Centre (“SIAC”) on various dates between 7 May 2009 and 3 August 2010. 3. Although relief was granted to all eight applicants under the Awards, the principal monetary relief awarded by the Tribunal was in favour of the 6 th to 8 th applicants (“the Additional Parties”), and the focus of the parties’ arguments before this court relates to the enforcement of the Awards by the Additional Parties against First Media. 4. While the validity of the Awards can no longer be challenged by First Media before the Singapore court, being the supervisory court of the arbitration, enforcement of the Awards by the Additional Parties against First Media has been refused by the Singapore Court of Appeal by a judgment of that court rendered on 31 October 2013 (“the SCA Judgment”), on the ground that there was no valid arbitration agreement between the Additional Parties and First Media and the Tribunal had no jurisdiction to make the Awards in favour of the Additional Parties against First Media. 5. Notwithstanding the SCA Judgment, Astro has, through its counsel Mr David Joseph QC leading Mr Bernard Man and Mr Justin Ho, advanced formidable arguments in support of the contention that First Media’s present application to set aside the Hong Kong Orders and Hong Kong Judgment ought to be refused. In summary, Mr Joseph argues that: (1) The Awards, being valid and binding and not having been set aside, have been entered as judgments in Hong Kong. There is now no machinery to permit any challenge of such judgments, whether under s 44 of the Arbitration Ordinance , Cap 341 (“the Ordinance”) or otherwise, except by way of an appeal to the Court of Appeal (“Ground 1”). (2) There are no valid grounds to extend the time to apply to set aside the Hong Kong Orders and Hong Kong Judgment 14 months after the period prescribed by the Orders for making such application has expired (“Ground 2”). (3) Further, there is no valid basis under Hong Kong law at the enforcement stage for First Media to challenge the jurisdiction of the Tribunal to make the Awards when it lost its challenge in a ruling on a preliminary issue by the Tribunal and then deliberately decided not to challenge that ruling in court but chose to defend the claims on the merits. First Media’s conduct is said to be not consonant with the principle of good faith, or amount to an implied waiver or give rise to an estoppel (“Ground 3”). (4) In any event, the Tribunal’s decision on jurisdiction is correct, and this court is not bound by the decision of another enforcing court, namely, the Singapore Court of Appeal (“Ground 4”). (5) Further, and in any event, the Tribunal made a further finding in the Interim Final Award, namely, that First Media in the course of defending the merits had, by signing the Memorandum of Issues with its particular wording and without reservation, signed a further agreement for the arbitration of the issues identified in the memorandum. This, it is said, amounted to a binding submission to arbitration of those issues. The Interim Final Award has never been challenged or set aside and remains valid and binding. The reasoning of the Tribunal on this further submission is unimpeachable, and was not addressed by the Singapore Courts in the enforcement proceedings in that jurisdiction (“Ground 5”). 6. At first sight, it may be thought that, given the SCA Judgment that the Tribunal had no jurisdiction to make the Awards as between the Additional Parties and First Media, enforcement of the Awards should be refused in Hong Kong virtually as a matter of course. Indeed, the Court of Appeal here, when dismissing an application by Astro for leave to appeal against an order made by Madam Justice Mimmie Chan granting a stay of the garnishee order absolute pending the determination of the present summons (as to which see further below), said at paragraph 13 of its decision in HCMP 835/2014 that “it will indeed be remarkable if, despite the Singapore Court of Appeal judgment on the invalidity of arbitration awards, Astro will still be able to enforce a judgment here based on the same arbitration awards that were made without jurisdiction.” 7. I fully recognize the force of the above statement of the Court of Appeal. Nevertheless, for reasons which I shall explain in this judgment, I am ultimately persuaded by the arguments advanced on behalf of Astro that (i) I should not exercise my discretion to extend the time for First Media to apply to set aside the Hong Kong Orders and Hong Kong Judgment, with the consequence that they shall remain undisturbed, and (ii) in any event, even if an extension of time is granted, First Media would be precluded from relying on s 44(2) of the Ordinance to resist enforcement of the Awards. 8. Before I consider the validity of each of the five grounds advanced by Mr Joseph, and a number of additional issues raised by Mr Toby Landau QC (appearing together with Mr Mark Strachan SC and Mr Jeffrey Chau) for First Media in support of its application, I shall first set out the background facts relevant for the present purposes. Background facts 9. The facts set out in this section are taken largely from the SCA Judgment. 10. The dispute between the parties arose out of a joint venture agreement called the Subscription and Shareholders’ Agreement (“the SSA”) dated 11 March 2005 entered into between companies belonging to an Indonesian conglomerate (“the Lippo Group”) on the one hand and companies within a Malaysian media group (“the Astro Group”) on the other for the provision of multimedia and television services in Indonesia. The joint venture vehicle was the 3 rd defendant in these proceedings (“Direct Vision”). 11. The Lippo Group’s interest in the joint venture was held by the 1 st defendant in these proceedings (“Ayunda”), whose obligations to the Astro Group under the joint venture were guaranteed by First Media, an Indonesian company with its shares listed on the Indonesian Stock Exchange. On the other hand, the Astro Group’s interest in the joint venture was held by the 3 rd and 4 th applicants, with the 5 th applicant guaranteeing their obligations. 12. The original parties to the SSA were the 3 rd to 5 th applicants on the side of the Astro Group, and Ayunda, First Media and Direct Vision (hereinafter collectively referred to as “Lippo”) on the side of the Lippo Group. Subsequently, pursuant to a novation agreement, the 1 st and 2 nd applicants took the place of the 3 rd and 4 th applicants in the joint venture. 13. The Additional Parties were, however, never made parties to the SSA. 14. The SSA contained an arbitration agreement, under the heading of “Dispute Resolution”, as follows: “17.1 Parties’ Efforts . The Parties agree to use all reasonable efforts to resolve any dispute under, or in relation to this Agreement quickly and amicably to achieve timely and full performance of the terms of this Agreement. 17.2 Claims . Any Party which claims that a dispute, controversy or claim has arisen under, or relating to, this Agreement must give notice thereof to the other Party(ies) as soon as practicable after the occurrence of the event, matter or thing which is the subject of such dispute ... and shall designate a person as its representative for negotiations relating to the dispute, which person shall have authority to settle the dispute. The other Party(ies) shall, within seven (7) days of such notice, each specify in writing its position in relation to the dispute and designate as its representative in negotiations relating to the dispute a person with similar authority. If, within thirty (30) days of the other Party(ies)’s reply, the matter is not resolved, the matter shall be referred, [within] seven (7) days to the respective chief executive officers or senior executives performing an equivalent function (‘Chief Executive’) of each Party in dispute. 17.3 Role of Representatives, Executives . The Chief Executives of each Party in dispute shall use all reasonable endeavours to settle the dispute within thirty (30) days after receipt of the particulars of the dispute. If the Chief Executives of the Parties in dispute cannot resolve the dispute within that time, then the provisions of Clause 17.4 apply. 17.4 Dispute Resolution Procedure . If the Parties in dispute are unable to resolve the subject matter of dispute amicably within (30) days, then any Party in dispute may commence binding arbitration through the Singapore International Arbitration Centre (‘SIAC’) and in accordance, except as herein stated, with the rules of SIAC ... … 17.6 No Litigation . The Parties agree that none of the Parties will be allowed to commence or maintain any action in any court of law with respect to any Dispute, except for the enforcement of arbitral award granted pursuant to proceedings commenced pursuant to Clause 17.4 or interim orders under Clause 17.11.” 15. Clause 18.5 of the SSA provides that the agreement shall be governed by and construed in accordance with the laws of the Republic of Singapore. 16. The SSA contained a number of conditions precedents upon which the parties’ respective obligations thereunder were predicated. It was agreed that the parties would have until July 2006 to fulfil those conditions precedent. In the meantime, funds and services were provided by the Additional Parties to Direct Vision to build up the latter’s business from about December 2005. 17. As a matter of fact, the conditions precedent were not fulfilled. By about mid‑August 2007, it became clear to the parties that the joint venture would not close. Nevertheless, the Additional Parties continued to provide funds and services to Direct Vision while the parties were exploring exit options. A dispute then arose between Lippo and Astro. Lippo contended that the Additional Parties had, orally or by conduct, agreed to continue to provide funds and services to Direct Vision, but Astro was not willing to do so. 18. In October 2008, the Additional Parties stopped further provision of funds and services to Direct Vision. In the meantime, in September 2009, Ayunda commenced proceedings in the Indonesian court against, inter alia , the Additional Parties (“the Indonesian Proceedings”). 19. On the basis that the commencement of the Indonesian Proceedings amounted to a breach of the arbitration agreement contained in the SSA, Astro commenced Arbitration No 62 of 2008 (“the Arbitration”) at the SIAC by a notice of arbitration dated 6 October 2008 against Lippo. 20. In the notice of arbitration, Astro sought, inter alia , the following relief against Lippo: (i) an anti‑suit injunction against Ayunda in respect of the Indonesian Proceedings; (ii) declarations that the SSA was the parties’ only joint venture agreement which had lapsed and there was no continuing obligation on the part of Astro to continue to provide funds and services to Direct Vision, and (iii) payment of various sums by way of restitution and/or quantum meruit. 21. In view of the fact that the Additional Parties were not parties to the SSA, Astro stated in the notice of arbitration that the Additional Parties had consented to being added as parties to the Arbitration, and made an application pursuant to rule 24(b) of the 2007 SIAC Rules (“Rule 24(b)”) to join the Additional Parties as parties to the Arbitration (“the Joinder Application”). 22. The Joinder Application was contested by Lippo. 23. Rule 24(b), under the heading of “Additional Powers of the Tribunal”, states as follows: “In addition and not in derogation of the powers conferred by any applicable law of the arbitration, the Tribunal shall have the power to: b. allow other parties to be joined in the arbitration with their express consent, and make a single final award determining all disputes among the parties to the arbitration”. 24. On 7 May 2009, the Tribunal rendered an award (“the Award on Preliminary Issues”), holding that (i) on the true construction of Rule 24(b), it had power to join the Additional Parties as parties to the Arbitration as long as they consented to being joined, and (ii) the power to join the Additional Parties as parties to the Arbitration should be exercised. 25. Thereafter, between 3 October 2009 and 3 August 2010, the Tribunal rendered four other awards, including an interim final award on the merits of the parties’ disputes dated 16 February 2010 (“the Interim Final Award”). 26. The total monetary award made by the Tribunal in favour of Astro against Lippo under the Awards was in excess of US$130 million. 27. Lippo did not take any steps to challenge or apply to set aside the Awards before the supervisory court of the Arbitration (ie the Singapore court). 28. Astro sought enforcement of the Awards in various jurisdictions, including Singapore, Hong Kong, England, Malaysia and Indonesia. I am told that Lippo did not resist proceedings for the recognition and enforcement of the Awards in England or Malaysia, because Lippo had no assets in those jurisdictions on which execution of the judgments giving effect to the Awards could be levied. For the same reason, Lippo did not originally take steps to resist proceedings for the recognition and enforcement of the Awards in Hong Kong, but subsequently adopted a different stance when it transpired that there were assets of Lippo to be found here (disputed by Lippo). Lippo did take active steps to resist proceedings for the recognition and enforcement of the Awards in Indonesia on various grounds which it is not necessary to set out in this judgment. The Singapore proceedings 29. In so far as Singapore is concerned, leave to enforce the Awards was originally granted by the Singapore High Court on 5 August and 3 September 2010 (“the Singapore Enforcement Orders”), but the judgments entered pursuant to those orders on 24 March 2011 were later set aside on 22 August 2011 at the instance of First Media on the ground of irregular service of the enforcement orders. On 12 September 2011, First Media applied (“the Singapore Setting Aside Application”) to set aside the Singapore Enforcement Orders, but its application failed at first instance by a judgment of the Singapore High Court rendered on 22 October 2012. First Media then appealed against the first instance judgment to the Singapore Court of Appeal, which led to the SCA Judgment. 30. In view of the fact that the seat of the Arbitration was in Singapore, the Awards were regarded as “domestic international awards” in so far as proceedings for their recognition and enforcement in Singapore were concerned. The statutory regime governing the enforcement of a domestic international award in Singapore is s 19 of the International Arbitration Act ( Cap 143A , 2002 Rev Ed) (“IAA”), which states as follows: “An award on an arbitration agreement may, by leave of the High Court or a Judge thereof, be enforced in the same manner as a judgment or an order to the same effect and, where leave is so given, judgment may be entered in terms of the award.” 31. The following provisions of the 1985 Model Law on International Commercial Arbitration (“the Model Law”) adopted by the United Nations Commission on International Trade Law (“UNCITRAL”) are relevant for the purpose of understanding the SCA Judgment: (1) Article 16(3) : “The arbitral tribunal may rule on a plea referred to in paragraph (2) of this Article [ie a plea that the arbitral tribunal does not have jurisdiction] either as a preliminary question or in an award on the merits. If the arbitral tribunal rules as a preliminary question that it has jurisdiction, any party may request, within thirty days after having received notice of that ruling, the court specified in article 6 to decide the matter, which decision shall be subject to no appeal; while such a request is pending, the arbitral tribunal may continue the arbitral proceedings and make an award.” (2) Article 34(1) : “Recourse to a court against an arbitral award may be made only by an application for setting aside in accordance with paragraphs (2) and (3) of this article.” (3) Article 34(2) : “An arbitral award may be set aside by the court specified in article 6 only if (a) the party making the application furnishes proof that: (i) … the said agreement is not valid under the law to which the parties have subjected it or … (iii) the award deals with a dispute not contemplated by or not falling within the terms of the submission to arbitration, or contains decisions on matters beyond the scope of the submission to arbitration …” (4) Article 34(3) : “An application for setting aside may not be made after three months have elapsed from the date on which the party making that application had received the award …” (5) Article 36(1) : “Recognition or enforcement of an arbitral award, irrespective of the country in which it was made, may be refused only: (a) at the request of the party against whom it is invoked, if that party furnishes to the competent court where recognition or enforcement is sought proof that: (i) … the said agreement is not valid under the law to which the parties have subjected it or … (iii) the award deals with a dispute not contemplated by or not falling within the terms of the submission to arbitration, or it contains decisions on matters beyond the scope of the submission to arbitration …” 32. The Singapore Court of Appeal found in favour of First Media, for the following reasons (see in particular paragraphs 22, 30, 143, 158, 178, 198, 224 and 230 of the SCA Judgment): (1) The enforcement of domestic international awards is governed by s 19 of the IAA, the construction of which must be consonant with the underlying philosophy of the Model Law. (2) The overarching scheme of the Model Law is to de‑emphasise the importance of the seat of the arbitration and facilitate the uniform treatment of international arbitration awards. (3) The principle of “choice of remedies”, under which passive remedies will still be available to the award debtor who did not utilise his active remedies, is fundamental to the design of the Model Law. In this connection, (i) “active remedies” means taking positive steps to invalidate an arbitral award such as by an application to challenge a preliminary ruling on jurisdiction under article 16(3) of the Model Law or to set aside an award on the grounds set out in article 34(1) of the Model Law, (ii) “passive remedies” means resisting the recognition or enforcement of an award in the jurisdiction where and when the award is sought to be enforced under article 36 of the Model Law, and (iii) “choice of remedies” means the award debtor may resist enforcement of an award by “passive” means even though it had not pursued “active” remedies to challenge the preliminary ruling or set aside the award. (4) It follows that the best way to give effect to the philosophy of the Model Law would be to recognise that the same grounds for resisting enforcement under article 36(1) of the Model Law will be equally available under s 19 of the IAA. (5) Article 16(3) of the Model Law is neither an exception to the principle of “choice of remedies”, nor a “one‑shot remedy” (meaning that a preliminary ruling on jurisdiction must be challenged within the prescribed 30‑day time limit, failing which the party objecting to the ruling will be deprived of any other chance to subsequently raise the same jurisdictional ground in setting aside or enforcement proceedings, and if the preliminary ruling is challenged but not set aside by the supervisory court, the party objecting to jurisdiction cannot raise the same grounds in any subsequent application to set aside the award before the supervisory court, or to resist enforcement of the award before the enforcement court, irrespective of whether the latter is in the same jurisdiction as the supervisory court or elsewhere). (6) As such, pursuant to s 19 of the IAA, First Media may apply to set aside the Singapore Enforcement Orders under any of the grounds which are found in article 36(1) of the Model Law, even though it did not pursue “active remedies” to challenge the Award on Preliminary Issues under article 16(3) of the Model Law or set aside the Awards under article 34(1) of the Model Law. (7) It is a matter to be determined by Singapore law whether the Additional Parties were property joined to the Arbitration so as to establish an arbitration agreement with First Media. (8) Upon the true construction of Rule 24(b), it does not confer on the Tribunal the power to join third parties who are not parties to the arbitration agreement (ie the SSA in the present case) into the Arbitration. (9) Accordingly, the Tribunal’s exercise of its power under Rule 24(b) to join the Additional Parties to the Arbitration was improper with the corollary that no express agreement to arbitrate existed between the Additional Parties and First Media. (10) In addition, First Media did not waive its rights or conduct itself in such a way that it is estopped from raising the joinder objection. (11) In consequence of the foregoing, First Media is entitled to resist the enforcement of the Awards pursuant to s 19 of the IAA. (12) Nevertheless, partial enforcement of the Awards in favour of the 1 st to 5 th applicants (whom First Media did not dispute were proper parties to the SSA and the Arbitration) is viable, and leave to enforce the Awards, to the extent of those parts which are exclusively directed at the 1 st to 5 th applicants, would be granted. 33. In a further judgment rendered by the Singapore Court of Appeal on 11 September 2014 to settle the terms of the order to be made, the Singapore Court of Appeal referred to First Media’s observation or complaint that the SCA Judgment did not address the merits of First Media’s argument that the Tribunal did not have jurisdiction over the 1 st to 5 th applicants on the ground of non‑compliance with the “multi‑tier” dispute resolution mechanism contained in clause 17 of the SSA. The Singapore Court of Appeal noted that the Tribunal had found that the conditions precedent for commencing arbitration had been complied with and there was no basis to reverse the Tribunal’s finding on that specific issue. The Hong Kong proceedings 34. By an order dated 3 August 2010 (ie the first of the two Hong Kong Orders), Mr Justice Saunders: (1) granted leave to Astro to enforce the arbitration awards made by the Tribunal dated: (a) 7 May 2009 (ie, the Award on Preliminary Issues); (b) 3 October 2009 (“the Further Partial Award”); (c) 5 February 2010 (“the Award on Costs for the Preliminary Issues”); and (d) 16 February 2010, as amended by a memorandum of correction dated 23 March 2010 (ie, the Interim Final Award); in the same way as judgments of the High Court of the HKSAR pursuant to ss 2GG and 42 of the Ordinance; (2) entered judgments against Lippo pursuant to s 2GG of the Ordinance giving effect to the aforesaid four arbitration awards; and (3) directed that Lippo might apply to set aside the order within 14 days after the service on Lippo of the order. 35. By a further order dated 9 September 2010 (ie the second of the two Hong Kong Orders), Mr Justice Saunders: (1) granted leave to Astro to enforce the arbitration award made by the Tribunal dated 3 August 2010 (“the Final Award – Interests and Costs”) in the same way as a judgment of the High Court of the HKSAR pursuant to ss 2GG and 42 of the Ordinance; (2) entered judgment against Lippo pursuant to s 2GG of the Ordinance giving effect to the Final Award – Interests and Costs; and (3) directed that Lippo might apply to set aside the order within 14 days after the service on Lippo of the order. 36. No application was made by Lippo to set aside the Hong Kong Orders within the time limit as stipulated in those orders. Accordingly, on 9 December 2010, Mr Justice Saunders entered judgment (ie the Hong Kong Judgment) against Lippo in terms of the Awards, pursuant to s 2GG of the Ordinance. 37. The reason why First Media initially did not take any step to seek to set aside the Hong Kong Orders within the time limit as stipulated in those orders or challenge the Hong Kong Judgment is set out in paragraphs 31 and 32 of the affidavit of Charles William Allen of Sidley Austin (First Media’s former solicitors) filed on 18 January 2012 in support of the present application, as follows: “31. … according to advice received from MR & Partners [First Media’s Indonesian lawyers], First Media did not (and indeed still does not) have any assets in Hong Kong, First Media did not take any steps in the Hong Kong proceedings. In particular, it did not make any application to set aside the Hong Kong Orders. Further, when the Hong Kong Judgment was subsequently entered, First Media remained of the view that it was not necessary for it take any action in Hong Kong. 32. … [Astro] have also registered the Awards in England and Wales, and in Malaysia. Consistent with its position that it has no assets in those jurisdictions either, First Media has taken no steps to set aside those registrations either.” 38. In passing, I should mention that Mr Allen also stated in the said affidavit that, according to preliminary advice which First Media received from MR & Partners, the service of the Hong Kong Orders and Hong Kong Judgment was contrary to Indonesian law. It was said that First Media was entitled to argue that it was not properly served with the Hong Kong Orders and Hong Kong Judgment in accordance with their terms and Order 73, rule 10 and Order 11, rules 5, 6 and 8 of the Rules of the High Court , but nonetheless it did not in fact seek to set aside the Hong Kong Orders and Hong Kong Judgment on that ground. In his oral submissions to the court, Mr Landau made it clear that First Media was not taking the point that it had not been properly served with the Hong Kong Orders and Hong Kong Judgment, but relied on the advice given by the Indonesian lawyers as being relevant to the issue of whether First Media’s conduct (namely, the delay in making the present application) was reasonable. 39. First Media’s stance regarding the Hong Kong proceedings changed, however, when Astro successfully obtained the Garnishee Order Nisi on 22 July 2011 to attach a debt of US$44 million (“the Debt”) due from AcrossAsia Limited (“AAL”) to First Media to answer the Hong Kong Judgment. AAL is a company incorporated in the Cayman Islands, with its shares listed on the Growth Enterprise Market of the Stock Exchange of Hong Kong, and holds 55.1% of all the issued shares in First Media. 40. The Debt arose out of a facility agreement (“the Facility Agreement”) entered into between First Media and AAL on 30 June 2011, whereby First Media granted a loan facility of US$44 million to AAL. 41. On 5 August 2011, the Garnishee Order Nisi was served on First Media. On 16 August 2011, AAL filed an affirmation of Yuk Hung Chan to oppose the grant of a garnishee order absolute, on the principal ground that a Hong Kong garnishee order would not extinguish the underlying debt owed by AAL to First Media which was governed by Indonesian law, because such order would not be recognised by the Indonesian courts. In other words, it was argued that AAL would be at risk of “double jeopardy” in having to pay the Debt twice. In that affirmation, it was also stated that “steps will also be taken by First Media to challenge the applications in Hong Kong to enforce [the Awards]”. 42. On 18 January 2012, First Media took out the present summons seeking an extension of time to apply to set aside the Hong Kong Orders and Hong Kong Judgment, and an order to set aside those orders and judgment and to discharge the Garnishee Order Nisi . 43. On 20 February 2012, Astro issued a summons (“Astro’s Stay Summons”) seeking (i) an order that all further proceedings in this action, including the present summons, be stayed pending the determination by the Singapore court of the Singapore Setting Aside Application, and (ii) an order that pending the final determination of the Singapore Setting Aside Application, AAL was to pay all sums due and payable, or as they became due and payable, to First Media into court. Astro’s Stay Summons came before Deputy High Court Judge Lok on 15 March 2012, who granted the order sought by Astro. 44. In the skeleton argument of Mr Clifford Smith SC, former counsel for Astro, filed in support of Astro’s Stay Summons, it was stated that the basis of the application was that First Media’s present application would require the Hong Kong court to consider and decide issues which: “(i) are the subject of pending proceedings initiated by First Media in Singapore prior to issuing its Summons here, and (ii) are governed by Singapore law.” 45. In the same skeleton argument, Mr Smith identified three issues which is was said would arise for decision in the Singapore court: “(1) Whether First Media is right in contending that the Tribunal had no jurisdiction to join the [Additional Parties] to the arbitration, and whether by ordering such joinder, which it did by its award of 7 May 2009, the Tribunal wrongly interpreted or misapplied Rule 24(b) of the SIAC Rules 2007. (2) The effect of First Media deliberately deciding not to appeal the award of 7 May 2009 and/or of their counsel’s confirmation in the course of the arbitration proceedings that they had abandoned their right to appeal and/or their fully participating in the arbitration thereafter. (3) The effect of First Media signing the Memorandum of Issues dated 31 July 2009 which set out the issues still to be determined and confirmed that certain issues had already been fully and finally determined by the Tribunal’s award of 7 May 2009, including the issue of the Tribunal’s jurisdiction.” Mr Smith further stated that it was common ground that the above questions raised important issues which would be determined by the Singapore court, and the determination of First Media’s present summons would required the Hong Kong court to consider and determine issues of Singapore law which “are identical to those raised by First Media in the pending Singapore proceedings”. 46. There was no appeal against Deputy High Court Judge Lok’s order staying all further proceedings in this action pending the determination of the Singapore Setting Aside Application, but AAL appealed against the order requiring AAL to pay into court all sums due and payable, or as they became due and payable, by it to First Media (“the Payment‑In Order”). On 10 August 2012, the Court of Appeal gave judgment dismissing AAL’s appeal. 47. On 24 September 2012, AAL took out two summonses for (i) an order to set aside the Payment‑In Order, and (ii) an order to lift the stay in respect of the garnishee proceedings and discharge the Garnishee Order Nisi . 48. On 27 September 2012, Deputy High Court Judge Lok made an order lifting the stay in respect of the garnishee proceedings, and directing AAL’s two summonses and the Garnishee Order Nisi be heard at an early date. 49. AAL’s two summonses and the Garnishee Order Nisi were heard by Deputy High Court Judge Mayo in September and October 2013. After a contested hearing involving viva voce evidence given by the parties’ witnesses, Deputy High Court Judge Mayo gave a written decision on 31 October 2013 ordering that the Garnishee Order Nisi be made absolute (“the Garnishee Order Absolute”) and dismissing AAL’s applications to set aside the Payment‑In Order and to discharge the Garnishee Order Nisi . 50. It is apparent from Deputy High Court Judge Mayo’s written decision that the learned judge was highly critical of the conduct of AAL and First Media. In particular, the learned judge expressed the view that: (i) AAL and First Media acted in collusion (paragraphs 202, 203 and 231(5)). (ii) The Facility Agreement, and the “BANI Award” (being a reference to an arbitration award dated 12 September 2012 obtained by First Media against AAL in Indonesia ordering AAL to pay First Media the sum of US$45,774,403 under the Facility Agreement and that this payment should be paid only to First Media in Indonesia within 45 days of the award) and the action consequential thereon, amounted to a “charade” (paragraph 231(b)). (iii) There was no question of AAL being at risk of “double jeopardy”, but even if it did it would have been self inflicted (paragraphs 251 and 259). 51. It will be recalled that it was also on 31 October 2013 that the Singapore Court of Appeal rendered the SCA Judgment. 52. By a notice of appeal dated 27 November 2013, AAL appealed against the aforesaid decision of Deputy High Court Judge Mayo. First Media did likewise by a notice of appeal dated 28 November 2013. These appeals, I understand, have not yet been heard. 53. On 24 January 2014, Madam Justice Mimmie Chan granted a stay of execution of the Garnishee Order Absolute pending the determination of the present application. Astro’s subsequent application seeking leave to appeal against Madam Justice Mimmie Chan’s order was refused by the Court of Appeal on 25 June 2014. 54. It now falls upon me to determine First Media’s summons to set aside the Hong Kong Orders and Hong Kong Judgment. Present application not precluded by entry of judgment 55. Put simply, Astro’s argument under Ground 1 is that once the Hong Kong Judgment was entered, First Media would be barred from applying to set aside the Hong Kong Orders (and any subsequent judgments or orders obtained by Astro pursuant thereto) under Order 73, rule 10 (6) of the Rules of High Court (2009 edition, being the relevant edition at the time of the making of the Hong Kong Orders and Hong Kong Judgment). In what follows, references to Order 73, rule 10 shall be references to the 2009 edition of the Rules of the High Court . First Media’s only remedy, it is said, is to seek leave to appeal against the Hong Kong Orders and Hong Kong Judgement to the Court of Appeal out of time. 56. I am told by Mr Strachan (who presented First Media’s submissions to the court on this issue) that he has not found any authority in Hong Kong, England or elsewhere which supports the proposition that, once a judgment is entered, the court no longer has power to refuse enforcement pursuant to s 44 of the Ordinance. Mr Joseph has not referred me to any such authority either. 57. I shall therefore approach this issue on principle. The statutory scheme permitting an arbitration award to be given effect as a judgment of the court is as follows: (1) S 42 of the Ordinance provides that a “Convention award” shall be enforceable either by action or in the same manner as the award of an arbitrator is enforceable by virtue of s 2GG thereof. There is no dispute that the Awards here are Convention awards. (2) S 2GG(1) of the Ordinance provides that an award, order or direction made or given in or in relation to arbitration proceedings by an arbitral tribunal is enforceable in the same way as a judgment, order or direction of the court that has the same effect, but only with the leave of the court or a judge of the court. If the leave is given, the court or judge may enter judgment in terms of the award, order or direction. (3) Order 73, rule 10(1)(b) provides that an application for leave under s 2GG of the Ordinance to enforce an award on an arbitration agreement in the same manner as a judgment or order may be made ex parte but the court hearing the application may direct a summons to be issued. (4) Order 73, rule 10(3) provides for the form and contents of the leave application. (5) Order 73, rule 10(4) provides that an order giving leave must be drawn up by or on behalf of the creditor and must be served on the debtor. (6) Order 73, rule 10(6) provides that within 14 days after service of the order or, if the order is to be served out of the jurisdiction, within such other period as the court may fix, the debtor may apply to set aside the order and the award shall not be enforced until after the expiration of that period or, if the debtor applies within that period to set aside the order, until after the application is finally disposed of. (7) Order 73, rule 10(7) provides that the copy of the order served on the debtor shall state the effect of paragraph (6). 58. It is clear from the above provisions that the first order to be made by the court in an application to enforce an arbitration award as a judgment of the court should be an order granting “leave” to enforce. Within 14 days of the service of the order granting leave (or such other period as may be fixed by the court in the case of service out of the jurisdiction), the debtor may apply to set aside the order. It seems to me to follow that “judgment” should be entered only after the expiry of the time limit for an application to set aside the order, or after the final disposal of the setting aside application if such application is made by the debtor. 59. I note that in the present case, the Hong Kong Orders granting leave to enforce the Awards also provided for entry of judgment to give effect to the Awards, and the Hong Kong Judgment appeared to duplicate the judgments already entered under the Hong Kong Orders. Notwithstanding this apparent oddity, I do not think they were intended to depart from the statutory scheme mentioned above. 60. As a matter of principle, I see no reason why an order granting leave to enforce an arbitration award made in accordance with the machinery laid down under Order 73, rule 10 should become immune from challenge once judgment is entered. If time for the application is extended, the order granting leave to enforce may be set aside based on well established principles. And once the order granting leave is set aside, the judgment entered pursuant to the order (and further orders made in consequence of the judgment such as a garnishee order nisi or absolute) would logically fall away. 61. Although this issue does not appear to have been expressly considered in previous cases, Mr Strachan has referred me to two decisions, namely, Soinco Saci and Another v Novokuznetsk Aluminium Plant and Others [1988] 2 Lloyd’s Law Rep 337 (English Court of Appeal), and To Ho Sum v Sheenluxe Development Ltd , HCCT 34/2008 (Reyes J, 3 December 2008), where the courts seemed to have assumed or proceeded on the basis that a judgment entered pursuant to an order granting leave to enforce an arbitration award could still be set aside notwithstanding the entry of the judgment. 62. The situation is, it seems to me, analogous with the ordinary situation where the setting aside of a default judgment (whether regular or irregular) would generally result in the setting aside of any garnishee order nisi or absolute obtained by the judgment creditor pursuant to the default judgment. 63. In the absence of any binding authority on this issue, I am not prepared to accept a rigid rule which would preclude an enforcement order made under Order 73, rule 10 from challenge as soon as judgment is entered to give effect to the arbitration award. 64. In all, I do not consider that the entry of the Hong Kong Judgment means that First Media can no longer apply to set aside the Hong Kong Orders. 65. Whether time ought to be extended to permit First Media to apply to set aside the Hong Kong Orders is a separate issue, which I shall consider after I have considered other issues raised by the parties, in particular the merits of the setting aside application. I am conscious of the general undesirability of turning an application for an extension of time (in the present case to apply to set aside an enforcement order) into an occasion for a detailed examination of the merits of the substantive application. Nevertheless, in the present case, the extension of time application and the substantive setting aside application have been fully argued before me, and it is highly likely that whatever my decision, the matter will go further to the higher court(s). In the circumstances, I consider that I ought to express my views on all the major issues raised by the parties, and it would be convenient for me to examine the issue of extension of time after I have dealt with the other issues going to the merits of the substantive application. This must not, however, be treated as a precedent for postponing an application for extension of time to the full hearing of the substantive application: see Terna Bahrain Holding Company WLL v Al Shamsi and Others [2013] 1 Lloyd’s Law Rep 85, at paragraph 34 per Popplewell J. Permitting First Media to resist enforcement of the Awards in Hong Kong would be contrary to the principle of “good faith” 66. In respect of Ground 3, Astro’s argument that First Media should not be permitted to resist enforcement of the Awards is based, essentially, upon a broad principle of good faith which it is said is applicable under the New York Convention. Astro places strong emphasis on the fact that First Media did not challenge the Tribunal’s preliminary ruling on jurisdiction rendered on 7 May 2009 within 30 days after having received notice of that ruling in accordance with article 16(3) of the Model Law. The detailed matters that Astro relies upon in support of this argument include the following: (1) On 20 October 2008, First Media lodged an objection to the Tribunal’s jurisdiction in response to Astro’s notice of arbitration dated 6 October 2008. (2) By a letter dated 11 February 2008 from its lawyers, Drew & Napier LLC, to the Tribunal, First Media proposed that the Tribunal determined the issues of jurisdiction and joinder of the Additional Parties as preliminary issues, on the ground ( inter alia ) that “[t]his would save time and costs in avoiding a situation where the parties proceed to take various steps and file pleadings, only for the Tribunal to decide that it has no jurisdiction, with the arbitration then being terminated. All the time and work done on the substantive issues would then be wasted”. (3) The Tribunal then gave directions for a timetable leading up to the preliminary hearing for the presentation of oral testimony and oral submissions, which took place in April 2009. (4) Following the preliminary hearing, by the Award on Preliminary Issues rendered on 7 May 2009, the Tribunal ruled that it did have jurisdiction over Astro’s claims and ordered the Additional Parties to be joined as parties to the arbitration pursuant to Rule 24(b). (5) In objecting to Astro’s subsequent application to fix an urgent directions hearing for dealing with the substantive merits of the claims, First Media stated, in a letter issued by Drew & Napier LLC dated 19 May 2009, that they were considering an appeal against the Award on Preliminary Issues to the Singapore High Court, and article 16(3) of the Model Law permitted any party to request, within 30 days of receipt of the award, the Singapore High Court to decide the matter. (6) On 20 May 2009, Astro’s lawyers wrote to Drew & Napier LLC attaching a draft “Final Award and Order on Preliminary Issues” and stating that the Tribunal had finally determined the questions of jurisdiction. Paragraph 1 of the draft also stated that the Tribunal had “[f]inally dismisses the Respondents’ challenge to the jurisdiction of the Tribunal”, and paragraph 2 stated that the Tribunal had “[f]inally declares and joins [the Additional Parties] to this arbitral reference … pursuant to Rule 24.b of the SIAC Rules”. (7) In response, Drew & Napier LLC stated that there was no need for any formal order because the conclusion of the Tribunal at paragraph 109 of the Award on Preliminary Issues was entirely clear, but went on to say that “[w]ithout any prejudice to their position on appeal, [Ayunda and First Media] would … have no objection to paragraphs 1 and 2 of the proposed draft, since these accurately reflect the Preliminary Award”. (8) By an email dated 22 May 2009 to the parties, the Tribunal confirmed that the Award on Preliminary Issues finally determined ( inter alia ) the jurisdiction and joinder issues. (9) In the event, none of the Lippo parties, including First Media, sought to challenge the Award on Preliminary Issues before the Singapore High Court pursuant to article 16(3) of the Model Law. (10) At a procedural hearing on 25 June 2009, in response to a question from the Tribunal as to “whether or not there’s a challenge to our award in Singapore”, counsel for First Media stated that “[t]here is no challenge to your award in Singapore”. (11) On 31 July 2009, First Media signed a “Memorandum of Issues”, which stated at its beginning that “[a] number of issues in this arbitration, including that of its jurisdiction, have already been fully and finally determined by the Tribunal in its Award dated 7 May 2009”, followed by a list of the “remaining claims and issues to be determined by the Tribunal” in the arbitration. (12) The arbitration then proceeded to its conclusion, with First Media contesting Astro’s claims on the merits. In particular, First Media resisted Astro’s claim for declaratory relief at a hearing in September 2009 which led to the making of the Further Partial Award dated 3 October 2009, and participated in a ten‑day hearing from 30 November to 11 December 2009 which led to the making of the Interim Final Award dated 16 February 2010. 67. In paragraph 128.14 of his written skeleton argument for Astro, Mr Joseph acknowledges that from time to time in the course of taking the above steps and defending Astro’s claim on the merits, First Media did on occasions, although not at each step, reserve its position regarding the Tribunal’s jurisdiction. However, Mr Joseph argues that First Media’s defence of the claims on the merits, combined with the matters mentioned above, means that First Media can now no longer resist enforcement of the Awards on the ground that the Tribunal had no jurisdiction to make those Awards. 68. In passing, I should also mention that, in paragraph 128.15 of his written skeleton argument for Astro, Mr Joseph refers to the conduct of First Media subsequent to the making of the Awards in support of Ground 3. However, it is clear from Mr Joseph’s oral submissions that Astro relies principally on the facts and matters set out in paragraph 66 above. 69. I now turn to the legal principles relevant to Ground 3. 70. S 44(1) of the Ordinance provides that enforcement of a Convention award shall not be refused except in the cases mentioned in that section. 71. S 44(2) of the Ordinance goes to state ( inter alia ) as follows: “Enforcement of a Convention award may be refused if the person against whom it is invoked proves – (b) that the arbitration agreement was not valid to which the parties subjected it or, failing any indication thereon, under the law of the country where the award was made; or (d) subject to subsection (4), that the award deals with a difference not contemplated by or not falling within the terms of the submission to arbitration or contains decision on matters beyond the scope of the submission to arbitration”. 72. S 44(3) of the Ordinance, while it does not have direct application to the present case, should also be noted: “Enforcement of a Convention award may also be refused if the award is in respect of a matter which is not capable of settlement by arbitration, or if it would be contrary to public policy to enforce the award.” 73. In considering Ground 3, the following basic principles should be borne in mind: (1) S 44 of the Ordinance represents the statutory enactment of article V of the New York Convention on the Recognition and Enforcement of Foreign Arbitral Awards . (2) The Hong Kong courts approach Convention awards with a pro‑enforcement bias: see Werner A Bock KG v The N’s Co Ltd [1978] HKLR 281 at 285 per Huggins JA; China Nanhai Oil Joint Service Corporation Shenzhen Branch v Gee Tai Holdings Co Ltd [1995] 2 HKLR 215 at 226 per Kaplan J; Hebei Import & Export Corp v Polyteck Engineering Co Ltd (1999) 2 HKCFAR 111 at 136A‑B per Sir Anthony Mason NPJ; Societe Nationale D’Operations Petrolieres de la Cote d’Ivoire‑ Holding v Keen Lloyd Resources Ltd [2004] 3 HKC 452 , at paragraph 14 per Burrell J. (3) Enforcement of a Convention award is mandatory unless a case under s 44(2) or (3) of the Ordinance is made out, in which case the court has a discretion to permit or refuse enforcement. (4) The fact that an arbitral award has been refused enforcement by a court in another jurisdiction, even one whose law governs the arbitration agreement or the procedures of the arbitration (sometimes referred to as the curial law), is not a ground for resisting enforcement of the arbitral award in Hong Kong under the New York Convention, because different jurisdictions have different rules, laws and regulations governing enforcement of arbitral awards: Societe Nationale D’Operations Petrolieres de la Cote d’Ivoire-Holding v Keen Lloyd Resources Ltd , supra, at paragraph 14 per Burrell J. In principle, this should be the position even where the court in that other jurisdiction also applies the New York Convention in denying enforcement of the arbitral award, because the Hong Kong court applies s 44 of the Ordinance as a piece of domestic legislation, although it would obviously be desirable for different jurisdictions applying the New York Convention to do so in a consistent manner. (5) Whether a ground has been made out for refusing to enforce a Convention award under s 44(2) and (3) of the Ordinance is a matter governed by Hong Kong law and to be determined by the Hong Kong court. In Hebei Import & Export Corp v Polyteck Engineering Co Ltd , supra, Sir Anthony Mason NPJ stated at 136C‑E that the Convention distinguishes between proceedings to set aside an award in the court of supervisory jurisdiction and proceedings in the court of enforcement. Proceedings to set aside are governed by the law under which the award was made or the law of the place where it was made, while proceedings in the court of enforcement are governed by the law of that forum. At 136G‑H, Sir Anthony Mason NPJ went on to say that where enforcement of an award is resisted on the ground of “public policy” under s 44(3) of the Ordinance, the relevant public policy is that of the jurisdiction in which enforcement is sought. In my view, this is also the position where a party seeks to resist enforcement of an arbitral award on one or more of the discretionary grounds under s 44(2) of the Ordinance. In such a case, the Hong Kong court should apply its own jurisprudence regarding the exercise of its discretion under that section, and approach the matter as one governed by Hong Kong law. 74. Mr Joseph submits that there are two principal questions of Hong Kong law relevant for the purpose of the present discussion: (1) What is the correct legal approach under s 44 of the Ordinance in respect of the circumstances in which a party is precluded from proving a New York Convention ground for resisting enforcement, even if one is otherwise made out? (2) What is the proper approach to the exercise of the discretion under s 44(2) of the Ordinance where a ground for refusing to enforce an arbitral award under that section is made out? 75. The answers to these two questions, according to Mr Joseph, can be found in two particular Hong Kong decisions, namely, that of Mr Justice Kaplan in China Nanhai Oil Joint Service Corporation Shenzhen Branch v Gee Tai Holdings Co Ltd , supra, and that of the Court of Final Appeal in Hebei Import & Export Corp v Polyteck Engineering Co Ltd , supra. 76. China Nanhai Oil Joint Service Corporation Shenzhen Branch concerned an arbitration award rendered by the Shenzhen Sub‑Commission of the China International Economic and Trade Arbitration Commission (“CIETAC”). The defendant opposed enforcement of the award on the ground set out in s 44(2)(e) of the Ordinance, namely, that the composition of the arbitral authority was not in accordance with the agreement of the parties since the arbitration clause provided for disputes to be submitted to CIETAC in Peking, but the plaintiff submitted the dispute to CIETAC in Shenzhen which rendered the award. The defendant had informally raised that issue with one of the appointed arbitrators, who opined that CIETAC in Shenzhen had jurisdiction. Thereafter, the defendant fully participated in the arbitral proceedings, and did not formally raise its objection with the tribunal or communicate its objection to CIETAC in Beijing. 77. Mr Justice Kaplan accepted that technically the arbitrators of CIETAC in Shenzhen did not have jurisdiction, but held that the defendant was not entitled to resist enforcement of the award under s 44(2) of the Ordinance, on two grounds. First, the learned judge considered that upon the true construction of the Convention, there was a general duty of good faith which was distinct from principles of estoppel (and presumably waiver) under domestic or municipal laws. The following passage in the judgment of Mr Justice Kaplan at page 225 of the report encapsulates the reasoning of the learned judge in relation to the application of this principle of good faith: “It strikes me as quite unfair for a party to appreciate that there might be something wrong with the composition of the tribunal yet not make any formal submission whatsoever to the tribunal about its own jurisdiction, or to the arbitration commission which constituted the tribunal and then to proceed to fight the case on the merits and then 2 years after the award attempt to nullify the whole proceedings on the grounds that the arbitrators were chosen from the wrong CIETAC list. I think there is much force in Dr. van den Berg's point that even if a ground of opposition is proved, there is still a residual discretion left in the enforcing court to enforce nonetheless. This shows that the grounds of opposition are not to be inflexibly applied. The residual discretion enables the enforcing court to achieve a just result in all the circumstances although I accept that in many cases where a ground of opposition is established, the discretion is unlikely to be exercised in favour of enforcement. If the enforcing court was obliged to refuse enforcement in the event of the establishing of a ground of opposition, I believe that it would be far harder to import the doctrine of estoppel. But a discretion there is, and I for myself are prepared to hold that on a true construction of the Convention there is indeed a duty of good faith which in the circumstances of this case required the Defendant to bring to the notice of the full tribunal or the CIETAC Commission in Beijing its objections to the formation of this particular arbitral tribunal. Its failure to do so and its obvious policy of keeping this point up its sleeve to be pulled out only if the arbitration was lost, is not one that I find consistent with the obligation of good faith nor with any notions of justice and fair play.” 78. Second, Mr Justice Kaplan considered that, on the particular facts of that case, he ought to exercise his residual discretion under s 44(2) to permit enforcement of the award. 79. Hebei Import & Export Corp concerned a Convention award made in the PRC. The underlying dispute related to the quality of certain equipment sold by the respondent to the appellant which was installed at the end user’s factory. Under the governing Chinese arbitration rules, the tribunal could collect evidence otherwise than in the presence of the parties. The tribunal appointed experts who conducted an examination of the equipment at the end user’s factory. The chief arbitrator was present during the inspection, which was carried out in the absence of the parties, and received communications from the end user’s technicians at the factory. The respondent subsequently became aware of the communications but did not raise the issue of whether it was improper for the chief arbitrator to receive the communications in the respondent’s absence. After the tribunal had made an award in favour of the appellant, the respondent applied, unsuccessfully, to a Beijing court (being the court of supervisory jurisdiction) to set aside the award. The grounds relied upon by the respondent at that stage did not include the complaint that the chief arbitrator received communications from the end user’s technicians at the factory in the absence of the parties. This complaint was also not raised before Mr Justice Findlay at first instance in the enforcement proceedings in Hong Kong, but was raised for the first time in the Court of Appeal. The Court of Appeal considered that there was departure from natural justice and apparent bias as a result of the communications, and held that enforcement should be refused on the ground that it would be contrary to public policy in Hong Kong to enforce the award under s 44(3) of the Ordinance. 80. On further appeal to the Court of Final Appeal, the decision of the Court of Appeal was reversed. The leading judgment of the Court of Final Appeal was given by Sir Anthony Mason NPJ, who held that, in light of the respondent’s conduct in the arbitration, it was not open to the respondent to resist enforcement of the award on any ground arising out of the communications to the chief arbitrator. At 137F‑138H, Sir Anthony Mason NPJ stated the following: “Instead of raising the question on receipt of the letter, the respondent continued to participate in the arbitration. By pursuing this course, the respondent precluded an ascertainment in the arbitration of the extent of the Chief Arbitrator’s participation in the inspection and of the nature of any communications made to him by the technicians. Moreover, had the question been raised, it is possible that action may have been taken by the Tribunal to remedy the situation, assuming that such action was necessary or desirable. Also precluded was an investigation of what happened at the inspection and the part that it played in the report and the Tribunal’s decision. The respondent’s failure to raise the objection in the Beijing Court and before Findlay J., though not directly relevant to the question now under consideration, had a similar effect. The respondent’s conduct amounted to a breach of the principle that a party to an arbitration who wishes to rely on a non‑compliance with the rules governing an arbitration shall do so promptly and shall not proceed with the arbitration as if there had been no compliance, keeping the point up his sleeve for later use (see China Nanhai Oil Joint Service Corp Shenzhen Branch v. Gee Tai Holdings Co. Ltd. [1994] 3 HKC 375 at 387). … The approach was adopted by Kaplan J. in the China Nanhai Oil Case [1994] at 384‑387, a case concerning the constitution of a CIETAC arbitration tribunal. His Lordship held that the Ordinance and the Convention conferred a residual discretion on the court of enforcement to decline to refuse enforcement, even if a ground for refusal might otherwise be made out. I agree with his Lordship that the use of the word “may” in s.44 and Article V of the Convention enables the enforcing court to enforce an award, notwithstanding that a s.44 ground might otherwise be established. Whether a court would so act in such a case would depend in very large measure on the particular circumstances. [It] is difficult to imagine that a court would do so, if enforcement were contrary to public policy, but there is no reason why a court could not do so where, as here, the factual foundation for the public policy ground arises from an alleged non-compliance with the rules governing the arbitration to which the party complaining failed to make a prompt objection, keeping the point up its sleeve, at least when the irregularity might be cured. Whether one describes the respondent’s conduct as giving rise to an estoppel, a breach of the bona fide principle or simply as a breach of the principle that a matter of non‑compliance with the governing rules shall be raised promptly in the arbitration is beside the point in this case. On any one of these bases, the respondent’s conduct in failing to raise in the arbitration its objection arising from the communications to the Chief Arbitrator was such as to justify the court of enforcement in enforcing the Award.” 81. These two decisions support the proposition that the court has a discretion under s 44(2) of the Ordinance to decline to refuse enforcement, even if a ground for refusal might otherwise be made out, in circumstances where there has been a breach of the good faith, or bona fide , principle on the part of the award debtor. The breadth of this principle has not yet been fully set. It is probably not possible, and in any event not desirable, to do so, but it would be wide enough to cover situations recognised under our domestic law as giving rise to an estoppel or waiver. 82. On the other hand, it would appear that there is no general obligation on the part of an award debtor to exhaust his remedies in the supervisory court before he could rely on a Convention ground to resist enforcement in the enforcement court. In Paklito Investment Ltd v Klockner (East Asia) Ltd [1993] 2 HKLR 39 at 48 to 49, the following was stated by Mr Justice Kaplan: “There is nothing in s.44 nor in the New York Convention which specifies that a Defendant is obliged to apply to set aside an award in the country where it was made as a condition of opposing enforcement elsewhere. In my judgment the Defendants were entitled to take this stance. It is clear to me that a party faced with a Convention award against him has two options. Firstly, he can apply to the courts of the country where the award was made to seek the setting aside of the award. If the award is set aside then this becomes a ground in itself for opposing enforcement under the Convention. Secondly, the unsuccessful party can decide to take no steps to set aside the award but wait until enforcement is sought and attempt to establish a Convention ground of opposition. That such a choice exists is made clear by Redfern and Hunter in International Commercial Arbitration p.474 where they state; ‘He may decide to take the initiative and challenge the award; or he may decide to do nothing but to resist any attempts by his adversary to obtain recognition and enforcement of the award. The choice is a clear one – to act or not to act.’” 83. This seems to be consistent with the principle of “choice of remedies” applied by the Singapore Court of Appeal. 84. I may add that, as pointed out in paragraphs 38 to 40 of the SCA Judgment, the principle of “choice of remedies”, which draws upon a distinction between “passive remedies” and “active remedies”, was already a recognized feature of English arbitration law under the 1950 Arbitration Act. In Mustill and Boyd, The Law and Practice of Commercial Arbitration in England (1989), 2 nd Ed, the learned authors describe the operation of “passive remedies” and “active remedies” as follows (at page 546): “A party avails himself of a passive remedy when he does not himself take any initiative to attack the award, but simply waits until his opponents seeks to enforce the award by action or summary process, and then relies upon his matter of complaint as a ground why the Court should refuse enforcement.” 85. The learned authors also explain the options available to parties with jurisdictional objections as follows (at page 545): “If concerned with the existence or continued validity of the arbitration agreement, the validity of the notice to arbitrate or the qualifications of the arbitrator, [a party may] issue an originating summons for a declaration. Alternatively, [that party may] wait until after the award [has been published] and then set aside the award or raise the objection as a ground for resisting enforcement.” 86. The current English position appears to remain the same. In Dallah Real Estate and Tourism Holding Co v Ministry of Religious Affairs of the Government of Pakistan , supra, [2011] 1 AC 763 , at paragraph 98, Lord Collins of Mapesbury JSC stated as follows: “Consequently, in an international commercial arbitration a party which objects to the jurisdiction of the tribunal has two options. It can challenge the tribunal’s jurisdiction in the courts of the arbitral seat; and it can resist enforcement in the court before which the award is brought for recognition and enforcement. These two options are not mutually exclusive, although in some cases a determination by the court of the seat may give rise to an issue estoppel or other preclusive effect in the court in which enforcement is sought. The fact that jurisdiction can no longer be challenged in the courts of the seat does not preclude consideration of the tribunal’s jurisdiction by the enforcing courts”. 87. Mr Joseph has referred me to a number of other Hong Kong decisions, including Jiangxi Provincial Metal & Mineral Import & Export Corp v Sulanser Co Ltd [1995] 2 HKC 373 , Sam Ming City Forestry Economic Co v Lam Pun Hung [2001] 3 HKC 573 , Xiamen Xinjingdi Group Ltd v Eton Properties Ltd [2008] 4 HKLRD 972 , and Incorporated Owners of Tak Tai Building v Leung Yau Building Ltd [2005] 1 HKC 530 , in support of Ground 3, but they do not seem to me to take the matter any further. 88. An important feature present in China Nanhai Oil Joint Service Corporation Shenzhen Branch and Hebei Import & Export Corp , but absent from the present case, is that the award debtor, while being fully aware of the relevant objection, failed to raise it with the arbitral tribunal. 89. In the present case, First Media did raise its jurisdictional objection before the Tribunal, which led to the Award on Preliminary Issues. Although First Media did not challenge the Award on Preliminary Issues pursuant to article 16(3) of the Model Law, the Singapore Court of Appeal considered that First Media never clearly or unequivocally abandoned the objection. First Media’s position was stated in its statement of defence and counterclaim in the Arbitration dated 18 June 2009 served subsequent to the rendering of the Award on Preliminary Issues. There were also other instances where First Media expressly reserved its position as regards the jurisdiction of the Tribunal both before and after the rendering of the Award on Preliminary Issues, details of which are set out in a coloured chart handed up by Mr Landau to the court in the course of his submissions on 8 December 2014, which it is not necessary to recite in this judgment. The question is whether these features are sufficient to distinguish the present situation from that in China Nanhai Oil Joint Service Corporation Shenzhen Branch or Hebei Import & Export Corp v Polyteck Engineering Co Ltd . 90. The Singapore Court of Appeal held that First Media did not waive its right to object to the jurisdiction, or conduct itself in such a way that it was estopped from raising this objection: see paragraphs 199 to 222 and 224(d) of the SCA Judgement. I accept that, in principle, when one is considering whether First Media’s conduct amounts to a breach of the good faith, or bona fide , principle, one cannot, or should not, look at such conduct in a legal vacuum, or divorced from the legal regime governing the conduct in question. As Sir Anthony Mason NPJ remarked in Hebei Import & Export Corp v Polyteck Engineering Co Ltd , supra, at 139‑140, in approaching the question of whether a ground based on s 44(2)(c) and (3) of the Ordinance had been made out for resisting enforcement: “it is relevant to take account of the fact that the parties agreed to an arbitration which was to be governed by the CIETAC Arbitration Rules and the PRC Arbitration Law. The fact that the parties agreed to procedures which differ from those which would ordinarily apply in Hong Kong is a circumstance of which we must take account”. 91. These having been said, the Singapore Court of Appeal’s focus, apparently, was on the issues of waiver and estoppel as a matter of Singapore domestic law, while I am here exercising a discretion under s 44(2) of the Ordinance as a matter of Hong Kong law. In my view, what was considered to be so objectionable in China Nanhai Oil Joint Service Corporation Shenzhen Branch and Hebei Import & Export Corp v Polyteck Engineering Co Ltd was the idea that a party to an arbitration, while being fully aware of an objection (whether in relation to the jurisdiction of the tribunal or the procedure or conduct in the course of the arbitration), should be permitted to keep the objection in reserve, participate fully in the arbitration and raise the objection in the enforcing court only after an award had been made against him by the tribunal. This is effectively what happened in the present case. First Media was fully aware of its right to challenge the Tribunal’s ruling on jurisdiction before the Singapore High Court under article 16(3) of the Model Law, but chose not to do so. It seems clear that what First Media decided to do was to defend the claim on the merits in the hope that it would succeed before the Tribunal, and keep the jurisdictional point in reserve to be deployed in the enforcement court only when it suited its interests to do so. The fact that First Media did raise the objection with the Tribunal should not, in my view, make any difference having regard to its subsequent conduct as summarised in paragraph 66 above. In all the circumstances of the present case, I consider that First Media should not be permitted to rely on s 44(2) of the Ordinance to resist enforcement of the Awards because it has acted in breach of the good faith, or bona fide , principle. 92. If I am wrong in this conclusion, I would have to consider the second question posed by Mr Joseph referred to in paragraph 74(2) above. Generally speaking, it seems clear that the discretion under s 44(2) of the Ordinance to permit enforcement of an arbitral award where the award debtor is able to establish one or more grounds for refusal of enforcement is a narrow one. In particular, it would take a very strong case to permit enforcement of an arbitral award in circumstances where it was made by an arbitral tribunal without jurisdiction: see Dallah Real Estate and Tourism Holding Co v Ministry of Religious Affairs of the Government of Pakistan , supra, at paragraphs 58 and 61 per Moore‑Bick LJ and paragraphs 74, 87 and 89 per Rix LJ (in the Court of Appeal), and paragraphs 67 to 69 per Lord Mance JSC and paragraphs 127 and 131 per Lord Collins of Mapesbury JSC (in the Supreme Court); see also Dardana Ltd v Yukos Oil Company Petroalliance Services Co Ltd [2002] 2 Lloyds Law Rep 326, at paragraphs 8 and 18 per Mance LJ; Kanoria v Guinness [2006] 2 All ER (Comm) 413, at paragraph 25 per Lord Phillips of Worth Matravers CJ and paragraph 30 per May LJ. 93. On the facts of the present case, subject to the application of the good faith principle mentioned above, I would not feel able to exercise my residual discretion to permit enforcement of the Awards in circumstances where they were made by the Tribunal without jurisdiction. The SCA Judgment on joinder/jurisdiction conclusively settles the law on that issue and is binding on Astro 94. Under Ground 4, Mr Joseph argues that the Tribunal’s decision on jurisdiction is correct, and this court is not bound by the decision of another enforcing court, namely, the Singapore Court of Appeal. 95. This ground can be disposed of quickly. The question of whether the Tribunal had power to join the Additional Parties under Rule 24(b), and had jurisdiction to render the Awards as between the Additional Parties and First Media, is governed by Singapore law, which must now be regarded as having been conclusively settled by the SCA Judgment. See Guangzhou Green‑Enhan Bio‑Engineering Co Ltd v Green Power Health Products International Co Ltd [2004] 4 HKC 163 , at paragraphs 2(b) and (c) and 3 per Lam J (as he then was). 96. In any event, the parties before the Singapore Court of Appeal and in the present application are the same, the issue under discussion in this section is identical in the two sets of proceedings, the Singapore Court of Appeal is undoubtedly a court of competent jurisdiction in relation to this issue between the parties, and the SCA Judgment is a final and conclusive judgment on the merits. Accordingly, Astro is bound by the decision of the Singapore Court of Appeal on this issue by virtue of an issue estoppel per rem judicatam . See First Laser Ltd v Fujian Enterprises (Holdings) Co Ltd (2012) 15 HKCFAR 569 , at paragraphs 43 to 49 per Lord Collins of Mapesbury NPJ; The Sennar (No 2) [1985] 1 WLR 490 , at 493F‑494A per Lord Diplock and at 499A‑C per Lord Brandon. 97. In the course of his oral submissions to the court, Mr Joseph referred to paragraph 96 of the Award on Preliminary Issues and contended that, before the Tribunal, First Media had made a concession that the Tribunal had jurisdiction, under Rule 24(b), to join the Additional Parties as parties to the Arbitration, but argued that the Tribunal should not exercise the power to join as a matter of discretion. In paragraph 96 of the Award on Preliminary Issues, it is recorded that First Media, in the course of its closing submissions to the Tribunal, withdrew the argument that the reference to “parties” in Rule 24(b) connoted persons who were themselves parties to the agreement containing the agreement to arbitrate. Mr Landau contended, however, that First Media had never made any “concession” on this issue, and pointed out that the same or similar argument had been raised by Astro before the Singapore Court of Appeal, albeit that it was not expressly dealt with in the SCA Judgment. 98. In any event, the significance of the concession, according to Mr Joseph, is that First Media is now precluded from relying on this ground (ie lack of jurisdiction on the part of the Tribunal to join the Additional Parties) to resist enforcement of the Awards under s 44(2) of the Ordinance. This is effectively the same argument under Ground 3, save that a different facet of First Media’s conduct is relied upon to contend that it should be precluded from relying on the s 44(2) to resist enforcement of the Awards. If First Media did make any concession, it would be a concession on a point of law. Under Hong Kong law, there is no general rule that a party is absolutely bound by an erroneous concession on a point of law (see Paquito Lima Buton v Rainbow Joy Shipping Ltd Inc (2008) 11 HKCFAR 464 , at paragraph 11 per Ribeiro PJ), although circumstances may be such as would make it unjust or unfair to permit the concession to be withdrawn. It seems clear to me, from a perusal of the Award on Preliminary Issues, that the Tribunal would have come to the same conclusion regarding the true construction of Rule 24(b) with or without the alleged concession. In this connection, it is also right to have regard to the fact that the question of an arbitral tribunal’s jurisdiction is a matter of fundamental importance to the process of the arbitration as well as the validity of the awards rendered by the tribunal. Further, it is apparent from the Award on Preliminary Issues that First Media continued to maintain that the Additional Parties could not, and should not, be joined as parties to the Arbitration for a number of reasons. In my view, even if First Media did make a concession as regards the true construction or effect of Rule 24(b) at one stage of the proceedings before the Tribunal, such concession should not lead to First Media being be precluded from relying on s 44(2) of the Ordinance to resist enforcement of the Awards. 99. In all, I do not consider that it is open to Astro in the present application to re‑open the issue of whether the Tribunal had power to join the Additional Parties under Rule 24(b), or had jurisdiction to render the Awards as between the Additional Parties and First Media. Astro is not entitled to raise the contention that the Memorandum of Issues amounted to a binding submission to arbitration 100. Under Ground 5, Astro argues that First Media, by signing the Memorandum of Issues, signed a further agreement for the arbitration of the issues identified in that memorandum which amounted to a binding submission to arbitration. It is also said that the Tribunal has made a further finding to that effect in the Interim Final Award, which has never been challenged or set aside and remains valid and binding. 101. Mr Joseph accepts that whether First Media’s conduct in signing the Memorandum of Issues amounted to a binding submission to arbitration is a question of Singapore law, and further accepts that this issue was raised and argued before the Singapore Court of Appeal. However, it was not expressly dealt with as a separate issue by the Singapore Court of Appeal in the SCA Judgment, but was considered in the context of the argument relating to “waiver” (see paragraphs 218 and 219 of the SCA Judgment). At paragraph 219, the Singapore Court of Appeal stated the following: “In our judgment, the [Memorandum of Issues] cannot be invested with great or particular significance. First, when read as a whole, the main object of the [Memorandum of Issues] was to frame the issues which were yet to be determined by the Tribunal rather than to categorically bind parties to the preliminary ruling … the [Memorandum of Issues] was directed to the converse objective of identifying what remained open before the Tribunal. Second, and for good measure, Ayunda and FM continued to reserve its objection to the Tribunal’s jurisdiction after signing the [Memorandum of Issues].” 102. Mr Joseph’s argument is that, upon the true construction of the document itself, it amounted to a submission agreement. The true construction of the Memorandum of Issues is, however, a question of Singapore law. It is apparent from the above quotation of the SCA Judgment that the Singapore Court of Appeal took the view that the Memorandum of Issues amounted only to a statement of the remaining issues to be determined by the Tribunal in the Arbitration. The Singapore Court of Appeal also emphasised that Ayunda and First Media continued to reserve its objection to the Tribunal’s jurisdiction after signing the Memorandum of Issues. In light of those observations, it seems to me clear that the Singapore Court of Appeal did not regard First Media’s conduct in signing the Memorandum of Issues as amounting to a binding submission to arbitration of the issues identified in the memorandum. 103. In Guangzhou Green‑Enhan Bio‑Engineering Co Ltd v Green Power Health Products International Co Ltd , supra, at paragraphs 2(d) and 3, Lam J (as he then was) accepted the proposition that: “Although there is no specific reference to a particular point in a foreign judgment, so long as the court is satisfied that the point could not have escaped the attention of the foreign court or the parties, the foreign court should be regarded to have decided that point as well.” 104. If the Singapore Court of Appeal was of the view that upon the true construction of the Memorandum of Issues, it amounted to a submission agreement, that would be a complete answer to First Media’s jurisdictional objection and it would be difficult to see how it would have been right to refuse to enforce the Awards. In my view, the Singapore Court of Appeal must, by necessary implication, have rejected Astro’s contention on this matter (see Dicey, Morris & Collins, The Conflict of Laws , 15 th Ed, at paragraph 14‑036). 105. It follows that, as in the case of joinder/jurisdiction point, it is not open to Astro to argue in this application that the Memorandum of Issues amounted to a binding submission to arbitration. First Media is not entitled to re‑open the argument that Astro failed to comply with the “multi‑tier” dispute resolution mechanism 106. There are two other issues raised by First Media which I should deal with before I turn to consider the issue of extension of time. 107. First, it is argued that the 1 st to 5 th applicants failed to comply with the multi‑tier dispute resolution mechanism in clause 7 of the SSA. This is an issue governed by Singapore law. For the same reason that Astro cannot re‑open the issue of whether the Tribunal had power to join the Additional Parties under Rule 24(b), or had jurisdiction to render the Awards as between the Additional Parties and First Media, it is likewise not open to First Media to argue in the present application that the 1 st to 5 th applicants failed to comply with the multi‑tier dispute resolution mechanism. 108. In passing, I should mention that Mr Landau did not, understandably, press this issue, because a central theme of his arguments is that all issues of Singapore law which have been decided by the Singapore Court of Appeal are binding on the parties and cannot be re‑litigated in the Hong Kong court. Stage 1 versus stage 2 enforcement 109. Second, First Media argues that Astro failed to satisfy the statutory pre‑conditions for enforcement of the Awards. 110. The statutory scheme under Part IV of the Ordinance adopts a two stage approach for the enforcement of a Convention award, which is defined in s 2(1) of the Ordinance to mean “an award to which Part IV applies, namely, an award made in pursuance of an arbitration agreement in a State or territory, other than China or any part thereof, which is a party to the New York Convention”. 111. S 43 of the Ordinance, commonly referred to as “stage 1”, provides that the party seeking to enforce a Convention award must produce: (a) The duly authenticated original award or a duly certified copy of it. (b) The original arbitration agreement or a duly certified copy of it. (c) Where the award or agreement is in a foreign language, a translation of it certified by an official or sworn translator or by a diplomatic or consular agent. 112. S 44 of the Ordinance, commonly referred to as “stage 2”, then provides that enforcement of a Convention award shall not be refused except in the cases mentioned in sub‑section (2) and (3) of that section. 113. According to Mr Landau: (1) One of the statutory pre‑conditions for the enforcement of a Convention award prescribed by s 43 of the Ordinance is the production of an “arbitration agreement” which, in view of the statutory definitions of the expressions “Convention award” and “arbitration agreement” and the requirement in s 2 of the Ordinance that an arbitration agreement must be in writing, means a valid written arbitration agreement between the parties. (2) In the present case, the Singapore Court of Appeal has made a full and final determination that there does not exist any arbitration agreement between First Media and the Additional Parties. (3) It follows that Astro cannot satisfy a statutory pre‑condition contained in s 43 of the Ordinance (ie stage 1) for enforcement of a Convention award, with the consequence that the Hong Kong Orders are flawed and the statutory period of 14 days prescribed by Order 73, rule 10(6) of the Rules of the High Court for an application to set aside those orders should have no application. 114. The relationship between stage 1 and stage 2 was the subject of careful consideration by Mance LJ (as he then was) in Dardana Ltd v Yukos Oil Company Petroalliance Services Co Ltd , supra, at paragraph 10, as follows: “I consider that the scheme of the Act is reasonably clear. A successful party to a New York Convention award, as defined in s.100(1) has a prima facie right to recognition and enforcement. At the first stage, a party seeking recognition or enforcement must, under s.102(1), produce the duly authenticated award or a duly certified copy and the original arbitration agreement or a duly certified copy. The arbitration agreement means an arbitration agreement in writing, as defined in s.5. Once such documents have been produced, recognition or enforcement may be refused at the second stage only if the other party proves that the situation falls within one of the heads set out in s.103(2). The issue before us concerns the content of and relationship between the first and second stages. The first stage must involve the production of an award which has actually been made by arbitrators. Mr de Garr Robinson accepted that it would not, for example, be sufficient to produce an award which had been forged. However, it must be irrelevant at that stage that the award is as a matter of law invalid, on any of the grounds set out in s.103(2), since otherwise there would have been no point in including s.103(2). The award so produced must also have been made by arbitrators purporting to act under whatever is the document which is at the same time produced as the arbitration agreement in writing. That, it seems to me, is probably sufficient to satisfy the requirement deriving from the combination of s.100(1) and s.102(1) to produce ‘an award made, in pursuance of an arbitration agreement, ….’. The words ‘in pursuance of an arbitration agreement’ could in other contexts require the actual existence of an arbitration agreement. But they can also mean ‘purporting to be made under’. Construed in the latter sense the overlap and inconsistency to which I have referred are avoided. Any challenge to the existence or validity of any arbitration agreement on the terms of the document on which the arbitrators have acted falls to be pursued simply and solely under s.103(2)(b).” 115. At paragraph 12 of his judgment, Mance LJ continued as follows: “However, one can produce terms in writing, containing an arbitration clause, by reference to which agreement was (allegedly) reached, and one can produce a record of an arbitration agreement made in writing with (allegedly) the authority of the parties to it. That, it seems to me, is all that is probably therefore required at the first stage. That conclusion supports, rather than undermines the further conclusion that, at the first stage, all that is required by way of an arbitration agreement is apparently valid documentation, containing an arbitration clause, by reference to which the arbitrators have accepted that the parties had agreed on arbitration or in which the arbitrators have accepted that an agreement to arbitrate was recorded with the parties' authority. On that basis, it is at the second stage, under s.103(2), that the other party has to prove that no such agreement was ever made or validly made.” 116. Both Part IV of the Ordinance and ss 100‑104 of the Arbitration Act 1996 seek to give effect to the New York Convention. The relevant statutory wording in relation to the two stages for enforcement of a Convention award in the Ordinance and the Arbitration Act 1996 is the same or materially the same. I consider that the above judgment of Mance LJ in Dardana Ltd v Yukos Oil Company Petroalliance Services Co Ltd also correctly states the legal position in Hong Kong as regards the relationship between stage 1 and stage 2 for enforcement of a Convention award. 117. It follow that, in order to satisfy the statutory pre‑conditions contained in s 43 of the Ordinance (ie stage 1) for enforcement of a Convention award, the award creditor is only required to produce, inter alia , (i) the original arbitration agreement or a duly certified copy thereof, and (ii) the duly authenticated award or a duly certified copy of thereof which must have been made by the arbitral tribunal purporting to act under such arbitration agreement. All further arguments relating to the validity of the award, and other grounds for refusal of enforcement of the award, are to be dealt with in stage 2. 118. In the present case, Astro did produce the documents referred to in paragraph 117 above when it applied for the Hong Kong Orders (see the First and Second Affidavits of Chan Kanice Hoi Lam filed herein on behalf of Astro on 2 August 2010 and 23 August 2010 respectively). I conclude therefore that Astro did satisfy the statutory pre‑conditions contained in s 43 of the Ordinance for enforcement of the Awards. Time for First Media to apply to set aside the Hong Kong Orders should not be extended 119. As earlier mentioned, First Media had, under the Hong Kong Orders, 14 days after service of the orders on it to apply to set aside those orders. It is now no longer in dispute that the Hong Kong Orders were validly served on First Media on 18 October 2010, and the 14 day period for applying to set aside the Hong Kong Orders expired on 1 November 2010 (see Skeleton Argument on behalf of First Media dated 1 December 2014, paragraphs 160 and 161). 120. As a matter of fact, First Media’s present summons to set aside the Hong Kong Orders was issued on 18 January 2012, some 14 months out of time. 121. The issue is whether the court should exercise its discretion to extend the time to permit First Media to apply to set aside the Hong Kong Orders in the circumstances of the present case. 122. I have been referred by the parties to a good many authorities regarding the principles for extension of time. On behalf of First Media, Mr Landau strongly relies upon the decision of the Court of Appeal in The Decurion [2012] 1 HKLRD 1063 , which concerned an application by a defendant for an extension of time to file a defence. The application was refused at first instance and judgment was entered against the defendant. In allowing the defendant’s appeal, Cheung JA (with whom the other members of the Court of Appeal agreed) gave the following guidance: (1) The applicable principle in deciding whether time should be extended is to look at all relevant matters and consider the overall justice of the case. A rigid mechanistic approach is not appropriate. (2) There are two conflicting principles at play. First, a party is required to observe the procedural rules, the default of which may result in judgment being entered against it. Second, a party should not be deprived of an adjudication on the merits due to a procedural default unless there is prejudice to the other party which cannot be compensated by costs. These two principles are not absolute. A rigid application of the first principle may lead to dismissal of actions without consideration of whether the defendant has been prejudiced by the default. However, the Court has treated the existence of such prejudice to be crucial and often decisive. Likewise a rigid application of the second principle without exception may enable a wealthy litigant to flout the rules. The resolution of these two conflicting principles is to consider all the circumstances of the case and not confine the decision to the application of a universally applicable rule of thumb. (3) This approach has not been drastically changed by the introduction of the Civil Justice Reform in Hong Kong since 2 April 2009. An expeditious disposal of a case has to be considered together with the equally salutary objective of ensuring fairness between the parties. 123. Mr Landau also argues that: (1) It is incorrect to think that the absence of a good reason for failing to comply with a time limit is always and in itself sufficient to justify the court refusing to exercise its discretion to extend time: see The Mortgage Corporation Ltd v Sandoes & Others [1997] PNLR 263 at 277. (2) Consideration of the merits is a very important feature of the balancing exercise to be undertaken for deciding whether to extend time: see Soinco v Novokuznetsk , supra, at 338. There, it was also said that the following factors, in the context of an application to extend time to apply to set aside an arbitral award, would be relevant: (i) extent of delay, (ii) the excuse for the delay, (iii) the strength of the applicant’s case for setting the order aside if an extension were granted, and (iv) the degree of prejudice to the respondent if the application is granted. 124. Mr Landau places special emphasis on (i) the issue of prejudice and submits that Astro would suffer no substantial prejudice if First Media is permitted to make the present application out of time, and (ii) the merits of the application to set aside the Hong Kong Orders in reliance upon s 44(2) of the Ordinance. 125. In so far as reasons for the delay are concerned, as earlier mentioned, First Media initially took the view that it had no assets in Hong Kong and thus it was not necessary to take any action in Hong Kong. I may add that First Media also referred to the advice that it received from its Indonesian lawyer that the Hong Kong Orders had not been properly served on it as being relevant for the purpose of assessing the reasonableness of First Media’s conduct. The position changed, however, when Astro obtained the Garnishee Order Nisi in circumstances which have already been set out above which meant that First Media had no alternative but to take action to set aside the Hong Kong Orders. I do not understand Mr Landau to be arguing that First Media had “good reasons” for the delay in seeking to set aside the Hong Kong Orders. In any event, in my view, the matters mentioned above provide, at best, an explanation for First Media’s delay in taking action but cannot be regarded as any “good reasons” to excuse the delay. 126. On behalf of Astro, Mr Joseph stresses that the short time limit (14 days) provided for any challenge of an enforcement order is designed to underline and support the important principle of speedy finality which underpins the whole of the Ordinance. He refers to s 2AA of the Ordinance which expressly provides that “the object of the Ordinance is to facilitate the fair and speedy resolution of disputes by arbitration without unnecessary expenses”. In this regard, Mr Joseph prays in aid the following statement of Waller LJ in Soinco v Novokuznetsk , supra, at 338: “It is obvious that where leave has been given to enforce an award as a judgment and judgment has been entered in relation to an arbitration award the Court is in entirely different territory from applications for extension of time for compliance with interlocutory orders or rules applying during the currency of a case … Arbitration is intended as a process for the resolution of disputes similar to the trial process save that it may lack the formality of that process, is confidential and is in most instances conducted more speedily. Once an award has been obtained the Court unless good reason is shown for not doing so, will be prepared to turn that award into a judgment, so as to aid enforcement. In that context the failure to apply within the time limits to set aside the judgment will not be viewed as a mere technicality to be brushed aside even if the application has some chance of success were an extension of time to be granted. All will depend on the circumstances.” 127. I have also been referred to the recent decision of Popplewell J in Terna Bahrain Holding Company WLL v Al Shamsi and Others , supra, which concerned an application for an extension of the 28 day period to challenge a London arbitration award under ss 67 and 68 of the Arbitration Act 1996 (on the grounds of lack of jurisdiction and serious irregularity). The following statements of principle by the learned judge are worth quoting in full: “27 The principles regarding extensions of time to challenge an arbitration award have been addressed in a number of recent authorities … from which I derive the following principles: (1) Section 70(3) of the Act requires challenges to an award under s. 67 and s. 68 to be brought within 28 days. This relatively short period of time reflects the principle of speedy finality which underpins the Act, and which is enshrined in s. 1(a). The party seeking an extension must therefore show that the interests of justice require an exceptional departure from the timetable laid down by the Act. Any significant delay beyond 28 days is to be regarded as inimical to the policy of the Act. (2) The relevant factors are: (i) the length of the delay; (ii) whether the party who permitted the time limit to expire and subsequently delayed was acting reasonably in the circumstances in doing so; (iii) whether the respondent to the application or the arbitrator caused or contributed to the delay; (iv) whether the respondent to the application would by reason of the delay suffer irremediable prejudice in addition to the mere loss of time if the application were permitted to proceed; (v) whether the arbitration has continued during the period of delay and, if so, what impact on the progress of the arbitration, or the costs incurred in respect of the arbitration, the determination of the application by the court might now have; (vi) the strength of the application; (vii) whether in the broadest sense it would be unfair to the applicant for him to be denied the opportunity of having the application determined. (3) Factors (i), (ii), and (iii) are the primary factors. 28 I add four observations of my own which are of relevance in the present case. First, the length of delay must be judged against the yardstick of the 28 days provided for in the Act. Therefore a delay measured even in days is significant; a delay measured in many weeks or in months is substantial... … 30 Thirdly, factor (ii) is couched in terms of whether the party who has allowed the time to expire has acted reasonably. This encompasses the question whether the party has acted intentionally in making an informed choice to delay making the application. In Rule 3.9(1) of the Civil Procedure Rules, which sets out factors generally applicable to extensions of time resulting in a sanction, the question whether the failure to comply is intentional is identified as a separate factor from the question of whether there is a good explanation for the failure. This is because in cases of intentional non compliance with time limits, a public interest is engaged which is distinct from the private rights of the parties. There is a public interest in litigants before the English court treating the court's procedures as rules to be complied with, rather than deliberately ignored for perceived personal advantage. 31 Fourthly, the court's approach to the strength of the challenge application will depend upon the procedural circumstances in which the issue arises. On an application for an extension of time, the court will not normally conduct a substantial investigation into the merits of the challenge application, since to do so would defeat the purposes of the Act. However if the court can see on the material before it that the challenge involves an intrinsically weak case, it will count against the application for an extension, whilst an apparently strong case will assist the application. Unless the challenge can be seen to be either strong or intrinsically weak on a brief perusal of the grounds, this will not be a factor which is treated as of weight in either direction on the application for an extension of time. If it can readily be seen to be either strong or weak, that is a relevant factor; but it is not a primary factor, because the court is only able to form a provisional view of the merits, a view which might not be confirmed by a full investigation of the challenge, with the benefit of the argument which would take place at the hearing of the application itself if an extension of time were granted. 32 The position, however, is different where, as has happened in the current case, the application for an extension of time has been listed for hearing at the same time as the challenge application itself, and the court has heard full argument on the merits of the challenge application. In such circumstances the court is in a position to decide not merely whether the case is ‘weak’ or ‘strong’, but whether it will or will not succeed if an extension of time were granted. The court is in a position to decide whether the challenge is a good or a bad one. If the challenge is a bad one, this should be determinative of the application to extend time. Whilst it may not matter in practice whether the extension is allowed and the application dismissed, or whether the extension is simply refused, logical purity suggests that it would be wrong to extend time in those circumstances: there can be no justification for departing from the principle of speedy finality in order to enable a party to advance a challenge which will not succeed. 33 Conversely, where the court can determine that the challenge will succeed, if allowed to proceed by the grant of an extension of time, that may be a powerful factor in favour of the grant of an extension, at least in cases of a challenge pursuant to s. 68. In such cases the court will be satisfied that there has been a serious irregularity giving rise to substantial injustice in relation to the dispute adjudicated upon in the award. Given the high threshold which this involves, the other factors which fall to be weighed in the balance must be seen in the context of the applicant suffering substantial injustice in respect of the underlying dispute by being deprived of the opportunity to make his challenge if an extension of time is refused. Where the delay is due to incompetence, laxity or mistake and measured in weeks or a few months, rather than years, the fact that the court has concluded that the s. 68 challenge will succeed may well be sufficient to justify an extension of time. The position may be otherwise, however, if the delay is the result of a deliberate decision made because of some perceived advantage.” 128. At paragraph 82 of his judgment, Popplewell J further stated the following: “Even where a party has good grounds for challenging an award under s. 68, if he deliberately chooses not to do so timeously, or deliberately delays in doing so, because of some perceived advantage, there is nothing necessarily unfair in precluding him from resorting to the court when the perceived advantage no longer seems to him sufficiently advantageous. To allow him to do so would undermine the principle of finality, against the background of which questions of fairness fall to be judged. The court will not be sympathetic to those who ask to be relieved of a strict time limit when the failure to observe it has been deliberate and tactical.” 129. In the present case, I consider the following factors to be particularly relevant in the exercise of my discretion whether to extend to time: (1) The length of the delay, namely, 14 months, is a very substantial one, whether viewed on its own or in light of the short period of 14 days provided for in Order 73 , rule 10 of the Rules of the High Court for making the application, and having regard to the context of the application, namely, to resist enforcement of Convention awards. (2) The delay was the result of a deliberate and calculated decision not to take action in Hong Kong. First Media took the view that there was no need to take action in Hong Kong because it thought that it had no assets in Hong Kong upon which execution could be levied to satisfy any judgment which might be entered to give effect to the Awards. It seems to me clear that First Media took a calculated risk regarding the presence, or absence, of assets in Hong Kong. As events turn out, the risk has now materialised. I do not see why the court should then come to the aid of First Media and assist it to get out of its self‑inflicted predicament. (3) Although First Media has successfully resisted the enforcement of the Awards before the Singapore Court of Appeal, the Singapore court was acting in its capacity as the enforcement court and not as supervisory court. The Awards have not been set aside. They are still valid and create legally binding obligations on First Media to satisfy them. The distinction between setting aside proceedings and enforcement proceedings was emphasised by Mr Landau before the Singapore Court of Appeal at paragraph 40 of First Media’s case dated 1 March 2013, as follows: “There is a well‑understood and accepted conceptual difference between setting-aside proceedings and enforcement proceedings. Setting-aside proceedings are a means of ‘recourse against the award’, that is, they are proceedings to attack the award itself. If successful, the award is annulled and (in general) no longer exists. The legal and practical consequence is that (in general) the award is no longer capable of enforcement anywhere else… It also means that the award no longer binds the parties and fresh proceedings may be commenced. This is very different from a party merely raising defences to enforcement. A court’s ruling on whether to enforce an award within its own jurisdiction is not an attack against the award itself but a statement by the court that it will not lend its aid to the enforcement of the award in that jurisdiction. The effect of such a ruling is in principle confined to that jurisdiction alone and it is possible for an award to be refused enforcement in one jurisdiction but enforced in another.” In other words, declining to extend the time for First Media to apply to set aside the Awards merely means that Astro is permitted to obtain satisfaction of a legally binding debt due and owing by First Media to Astro. 130. I have not lost sight of the size of the Awards. I also accept that Astro has not suffered any substantial prejudice (other than costs which can be compensated) as a result of First Media’s delay of 14 months to make the present application. I do not, however, consider that these matters are sufficient to override the three factors mentioned above or tilt the balance in favour of granting an extension. 131. As mentioned above, I have also come to the conclusion that First Media is precluded from seeking to rely on s 44(2) of the Ordinance to resist enforcement of the Awards. If that conclusion is correct, obviously I should decline to exercise my discretion to extend the time for First Media to make the setting aside application. Even if I had come to the conclusion that First Media’s setting aside application had merits and should otherwise succeed based on s 44(2) of the Ordinance, I would still not be prepared to exercise my discretion to extend time by reason of the three factors mentioned above. Conclusion 132. For the reasons stated above, I decline to exercise my discretion to extend the time for First Media to apply to set aside the Hong Kong Orders, with the consequence that First Media’s summons dated 18 January 2012 shall be dismissed in its entirety. In any event, even if I were to grant an extension of time, I would still have refused First Media’s setting aside application on the basis that it is precluded from relying on s 44(2) of the Ordinance to resist enforcement of the Awards. I also make an order nisi that Astro shall have the costs of this application, to be taxed if not agreed, with certificate for three counsel. 133. Lastly, it remains for me to thank counsel for their clear and cogent submissions which have assisted me tremendously in coming to my decision on this interesting but difficult case. (Anderson Chow) Judge of the Court of First Instance High Court Mr David Joseph QC, Mr Bernard Man & Mr Justin Ho, instructed by Clifford Chance, for the judgment creditors (applicants) Mr Toby Landau QC, Mr Mark Strachan SC & Mr Jeffrey Chau, instructed by Stephenson Harwood, for the 2 nd judgment debtor (respondent) Look up this case on Lawcite Noteup",
  "length": 109830,
  "headers_seen": [
    "Introduction",
    "Background facts",
    "The Singapore proceedings",
    "The Hong Kong proceedings",
    "Present application not precluded by entry of judgment",
    "Permitting First Media to resist enforcement of the Awards in Hong Kong would be contrary to the principle of “good faith”",
    "The SCA Judgment on joinder/jurisdiction conclusively settles the law on that issue and is binding on Astro",
    "Astro is not entitled to raise the contention that the Memorandum of Issues amounted to a binding submission to arbitration"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2015/274",
  "query": "enforcement of arbitral award",
  "ts": "2025-10-11T21:03:57",
  "ok": true
}