{
  "title": "L V. M N AND ANOTHER | [2021] HKCFI 2829 | HKLII",
  "court": null,
  "year": 2021,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2021] HKCFI 2829 L V. M N AND ANOTHER Judgment Information Date 20 Sep, 2021 Action No. HCCT6/2021 Neutral Cit. [2021] HKCFI 2829 Download MS Word Judgment Reading Options Translation Toggle Highlight Appeal History HCCT6/2021 HCCT6/2021 L v. M N AND ANOTHER HCCT 6/2021 [2021] HKCFI 2829 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO 6 OF 2021 ____________________ BETWEEN L Plaintiff and M 1 st Defendant N 2 nd Defendant ____________________ Before: Hon Mimmie Chan J in Chambers Date of Hearing: 11 June 2021 Date of Decision: 21 September 2021 _____________ D E C I S I O N _____________ Background 1. On 14 January 2021, the Plaintiff issued these proceedings against the Defendants for damages of $54,369,814.10, for the Defendants’ breach of a Surety Bond dated 3 February 2016 (“ Bond ”), and/or as damages for the 2 nd Defendant’s breach of a contract made between the Plaintiff and the 2 nd Defendant dated 21 April 2016 (“ Contract ”) for construction of the main contract works for the Plaintiff at a development in Yuen Long (“ Works ”). 2. By summons issued on 1 March 2021 (“ Summons ”), the 2 nd Defendant applied for the proceedings to be stayed pursuant to section 20 of the Arbitration Ordinance (“ Ordinance ”), or pending the publication of an award in an arbitration already commenced by the 2 nd Defendant by its Notice of Arbitration dated the 5 January 2021 (“ Arbitration ”), pursuant to an arbitration agreement between the Plaintiff and the 2 nd Defendant as contained in the Contract. 3. The legal principles applicable to the determination of an application for stay under section 20 of the Ordinance are not disputed. They are summarized in Tommy CP Sze v Li & Fung (Trading) Ltd [2003] 1 HKC 418 , and in PCCW Global Ltd v Interactive Communications Service Ltd [2007] 1 HKLRD 309 , and need not be repeated here. The onus is on the applicant for stay to show that there is a prima facie or plainly arguable case that the parties are bound by an arbitration clause, which extends to the dispute in the subject matter of the action sought to be stayed. Unless the point is clear, the action should be stayed for the arbitral tribunal to decide whether it has jurisdiction over the dispute formulated and identified. 4. It is also clear that if there is an agreed procedure for resolution of disputes, the appropriate forum to determine whether the procedure has been duly followed, or if the reference to arbitration is premature, is the tribunal itself ( C v D [2021] 3 HKLRD 1 ). Both questions of admissibility and of jurisdiction in relation to arbitral disputes are matters for the tribunal. 5. As between the Plaintiff and the 2 nd Defendant, there is no dispute that there is an arbitration clause contained in the Contract for the Works. The application for stay is made pursuant to that clause, but the Plaintiff claims that the arbitration agreement had been abandoned and terminated between the parties and therefore ceased to be operative. 6. As between the Plaintiff and the 1 st Defendant, there is no arbitration clause in the Bond to which the 1 st Defendant is a party. In essence, the 2 nd Defendant seeks a case management stay on the basis that it would be just to stay the Plaintiff’s claims against the 1 st Defendant in the event of a stay of the Plaintiff’s action against the 2 nd Defendant. The 1 st Defendant has given a written undertaking that it will abide by any award made in the Arbitration as to the 2 nd Defendant’s liability for breach or non-performance of the Contract. The section 20 stay 7. Article 8 of the Model Law incorporated into section 20 (1) of the Ordinance provides as follows: “A court before which an action is brought in a matter which is the subject of an arbitration agreement shall, if a party so requests not later than when submitting his first statement on the substance of the dispute, refer the parties to arbitration unless it finds that the agreement is null and void, inoperative or incapable of being performed .” 8. Clause 41 of the Contract sets out the procedure for settlement of disputes. In essence, it provides that the parties “shall follow” the dispute settlement procedure outlined, which provides firstly for each party to designate one of its own senior executives as its representative, and for the respective “Designated Representatives” to settle disputes that arise during the carrying out of the Works. If a dispute “arises under or in connection with the Contract”, the Architect shall, at the request of either party, refer the dispute to the Designated Representatives. If the dispute is not resolved by the Designated Representatives within 28 days of the reference, either party may give a notice to the other to refer the dispute to mediation. If the dispute is not settled by mediation within 28 days of the commencement of mediation, either party may give notice to the other and refer the dispute to arbitration which shall take place in Hong Kong. Clause 41.5 provides for the timing of the arbitration, and clause 41.6 provides for the powers of the arbitrator. 9. There is no serious dispute that the claims made by the Plaintiff in these proceedings, for damages payable by the 2 nd Defendant in respect of what the Plaintiff claims to be the 2 nd Defendant’s breach of obligations under the Contract, and claimed to be due from the 1 st Defendant under and pursuant to the Bond for such breach, falls within the scope of the disputes contemplated to be settled in accordance with the procedures set out in clause 41 of the Contract. The Plaintiff’s case is that as evidenced by an exchange of correspondence between the Plaintiff and the 2 nd Defendant in June 2020, the parties had agreed to abandon the arbitration agreement, such that it is no longer operative. 10. On the evidence, it appears that disputes having arisen between the Plaintiff and the Defendants in relation to the Plaintiff’s allegations of (inter alia) delay in the 2 nd Defendant’s execution of the Works and failure to duly perform its obligations under the Contract, and the 2 nd Defendant’s claims of (inter alia) entitlement to extensions of time and for unpaid variation claims, the 2 nd Defendant had attempted to initiate mediation. 11. Neither party had appointed its Designated Representative upon the Plaintiff’s acceptance of the 2 nd Defendant’s tender (pursuant to clause 41.1 (2)), but the 2 nd Defendant proceeded to appoint its Designated Representative on 25 March 2020 and requested the Plaintiff to appoint its Designated Representative, which the Plaintiff did so on 31 March 2020. The Plaintiff then served notice on the Architect on 1 April 2020, and requested for a reference to the Designated Representatives of the dispute as to the Plaintiff’s entitlement to deduct liquidated damages under the Contract. After further correspondence had been exchanged and two meetings had been held, the Plaintiff disagreed with the 2 nd Defendant as to whether the disputes between the parties should proceed to mediation as the 2 nd Defendant wanted, the Plaintiff claiming that mediation was premature under the dispute settlement procedure provided for in clause 41 (“ Procedure ”), and as such was invalid. 12. Against the background of such dispute, the Plaintiff wrote to the 2 nd Defendant on 2 June 2020. In an open letter, the Plaintiff first claimed that the 2 nd Defendant had failed to comply with the Procedure, but disputed the 2 nd Defendant’s claim that the Plaintiff had refused to mediate, pointing out that the Plaintiff was actively considering the candidates proposed by the 2 nd Defendant for the mediation. In the open letter, the Plaintiff stated that it had separately issued a without prejudice letter to propose a proper procedure for resolving the disputes between them, in order to avoid unnecessary jurisdictional disputes later. 13. In the Plaintiff’s without prejudice letter of 2 June 2020 (“ WP 2/6 Letter ”), it made a “proposal for resolution of disputes under the Contract”. The Plaintiff asserted that the Procedure under the Contract did not apply as the parties had failed to appoint their Designated Representatives within the time contemplated under clause 41.1 (2), and that such failure was “irremediable”, absent any express variation agreement. The Plaintiff proceeded to state in the WP 2/6 Letter, as follows: “However, with a view to simplifying matters and avoiding unnecessary jurisdictional disputes between the parties in resolving their disputes, we put forward the following dispute resolution provision in place of parts of Clause 41 (namely Clauses 41.1 to 41.4) of the Contract for your consideration: ‘The parties hereby agree that Clauses 41.1 to 41.4 of the Conditions of Contract, in the contract between L and N dated 21 April 2016 (the “Contract”) for the construction of Main Contract Works for L New Factory Development, shall be deleted and superseded and instead any dispute or difference arising out of or in connection with the Contract shall first be referred to mediation in accordance with the Hong Kong International Arbitration Centre (“HKIAC”) Mediation Rules. If the mediation is abandoned by the mediator or is otherwise concluded without the dispute or difference being resolved, then such dispute or difference shall be referred to and determined by arbitration pursuant to the HKIAC Domestic Arbitration Rules in force when the Notice of Arbitration is submitted (the “Rules”). The parties agree that the List System of appointment pursuant to the Rules shall be used for any appointment of arbitrators by the HKIAC. The law of this arbitration clause shall be Hong Kong law. The seat of arbitration shall be Hong Kong. The number of arbitrator shall be one. All the provisions in Schedule 2 of the Arbitration Ordinance ( Cap. 609 ) shall apply to any arbitration referred under this clause.’” 14. The dispute resolution provision proposed in the WP 2/6 Letter (“ Alternative Procedure ”) was suggested as a dispute resolution procedure to replace entirely (\"delete” and “supercede”) clause 41.1 to 41.4 of the Contract. In essence, the Designated Representatives’ decision or resolution was dispensed with under the Alternative Procedure, and the parties were to mediate their disputes in accordance with the HKIAC Mediation Rules, and then arbitrate their disputes pursuant to the HKIAC Domestic Arbitration Rules, if mediation cannot resolve the disputes. 15. The WP 2/6 Letter pointed out that if the 2 nd Defendant was prepared to agree to the Alternative Procedure, the jurisdictional objections raised by the Plaintiff would be resolved. 16. On 15 June 2020, the 2 nd Defendant replied to the Plaintiff’s WP 2/6 Letter. First, it sought the Plaintiff’s confirmation as to whether the provision for the Alternative Procedure proposed by the Plaintiff was to replace clause 41.1 to 41.4 in their entirety. Then, the 2 nd Defendant invited the Plaintiff “to consider (the 2 nd Defendant’s) proposed forum of litigation in lieu of arbitration”, pointing out that arbitration may not be cost-effective for the project. In its letter, the 2 nd Defendant stated: “Therefore, instead of resorting to arbitration, we are prepared to consent to have all disputes and differences arising out of or in connection with the Contract litigated in the High Court of Hong Kong. One further upside is that the service of the Judges is effectively ‘free’ to both of our organisations. However, this will require your written consent. If you are agreeable to our proposal to have all such disputes and differences litigated in the High Court rather than being arbitrated, please also make all relevant changes to your amended Clause 41.1 to 41.4 of the Conditions of Contract.” Counsel highlighted the fact that the 2 nd Defendant had referred to the clause proposed by the Plaintiff, which had referred to mediation. 17. The Plaintiff maintains that the above without prejudice reply of 15 June 2020 from the 2 nd Defendant (“ 15/6 Letter ”) constituted an offer to litigate and to abandon arbitration, which offer was accepted by the Plaintiff on 22 June 2020, when the Plaintiff wrote to the 2 nd Defendant and stated (“ 22/6 Letter ”): “With a view to avoiding the complications of going through the dispute resolution procedure under the Contract, and having taken into account the reasons raised in your letter, we confirm our agreement to your proposal for all disputes and differences arising out of or in connection with the Contract to be litigated in the Hong Kong Courts rather than being arbitrated. As requested, and for the avoidance of doubt to reflect the above agreement, we propose that: • GCC 41.1 to 41.7 be deleted in its entirety and replaced by the following: ‘Any disputes or differences arising out of or in connection with the Contract shall be resolved in and the parties hereby submit to the exclusive jurisdiction of the courts of the Hong Kong Special Administrative Region’, and • the words ‘Designated Representatives…under clause 41’ in GCC 41.8(1) be deleted and replaced by the word ‘parties’. Please confirm whether you are also agreeable to the above proposed amendments to GCC 41 of the Contract for clarity purposes.” 18. The 2 nd Defendant replied to the Plaintiff’s 22/6 Letter as follows: “We acknowledge receipt of your letter dated 22 June 2020 ref: ISP/CA/008 regarding your latest proposed amendments to Clause 41 of the Conditions of Contract. Please note that as we are still mulling over your aforesaid amendments, we will soonest possible revert to you one way or another. Meanwhile, having due regard to the third paragraph of your open letter dated 2 June 2020, we remain of the view that mediation should in any event precede any contentious proceedings, be it litigation or arbitration. In this regard, please also note that we are still awaiting your response to our three proposed mediators, namely X, Y and Z.” 19. In response, the Plaintiff stated in its letter of 8 July 2020 that its proposed amendments to clause 41 were relatively straightforward “to give effect to the parties’ agreement to litigate rather than arbitrate”. It claimed that as soon as any necessary amendments to clause 41 were agreed, the Plaintiff would revert with its response to the proposed mediators so that the parties could move forward with the dispute resolution procedure. 20. On 16 July 2020, the 2 nd Defendant wrote to the Plaintiff to state that since the Plaintiff was not keen to proceed with mediation, the 2 nd Defendant was considering and would discuss with the Plaintiff “another alternative dispute resolution process to replace mediation”. It further stated: “We consider that after the parties have reached in-principle agreement to the ADR process to be finally adopted, the parties can then thrash out the amended wording of Clause 41 of the Conditions of Contract in one go, taking full account of the mechanics of the contentious proceedings which will be finally agreed between the parties, be it arbitration or litigation.” 21. The Plaintiff disputed the substance of the 2 nd Defendant’s letter of 16 July 2020 and in its letter of 12 August 2020, the Plaintiff pointed out that the parties had agreed to litigate rather than to arbitrate, and that it would treat the parties’ agreement to litigate as superseding the dispute resolution provision in clause 41. 22. In gist, the Plaintiff’s argument is that there was already consensus reached between the Plaintiff and the 2 nd Defendant on 22 June 2020, that they would litigate their disputes and would abandon the agreement to arbitrate contained in clause 41. Their ongoing discussion after 22 June 2020, on 29 June 2020 and followed by the letters in July and August, were only on whether mediation should commence, and/or on other forms of processes to facilitate settlement, and did not affect their agreed position on the arbitration agreement. Counsel for the Plaintiff emphasized that as an arbitration agreement is sevarable from the rest of the underlying contract, it can be terminated specifically, and separately from the underlying contract. 23. The Plaintiff contended that if, on an objective appraisal of the parties’ words and conduct, the parties had to outward appearances agreed on terms and had intended to conclude a legally binding agreement, the fact that certain terms of economic or other significance had not been agreed does not prevent it being concluded that the parties had made a binding agreement. The only requirement is that the parties had agreed all the terms necessary for there to be an enforceable contract. 24. Counsel for the Plaintiff relies on New World Development Co Ltd v Sun Hung Kai Securities Ltd (2006) 9 HKCFAR 403 , to argue that an agreement is not incomplete merely because it leaves something which still has to be determined between the parties. 25. The essence of the decision in New World Development is on parties’ intention to create legal relations, and in the context of whether an agreement may fail for uncertainty, the Court held that if it was satisfied that “there was an ascertainable and determinate intention to contract”, the courts should do their best to give effect to that contract, as an agreement would only fail for uncertainty if the parties had expressed themselves in language that was too uncertain or vague to make their agreements legally enforceable. Following from that, the Court found that an agreement is not incomplete in a fatal sense, if it leaves something which still has to be determined, because it is often possible for the court “to discern in the parties’ agreement” the intended criteria for determining specific contractual rights and liabilities, without requiring them to be further agreed between the parties. 26. On reading the 15/6 Letter from the 2 nd Defendant, it appeared objectively clear that whilst the 2 nd Defendant indicated that it was “prepared to consent” to litigate, this was subject to the Plaintiff’s written consent, and on the parties agreeing to all the relevant changes to clause 41 with regard to the dispute resolution mechanism and Procedure. This was consistently made clear by the 2 nd Defendant, in its subsequent letter of 29 June 2020 (“ 29/6 Letter ”) (where it stated that it was still “mulling over” the amendments to clause 41 proposed by the Plaintiff in the 22/6 Letter). It was not, as the Plaintiff contended, the expression of a determinate intention to agree conclusively to abandon the arbitration agreement, subject only to the formality of drawing up a formal agreement evidenced by an amended version of clause 41. In the 29/6 Letter, the 2 nd Defendant made it clear that mediation should precede either litigation or arbitration, and was still pressing for the Plaintiff’s response to the proposed mediators. This is to be read in the context of the debate and clear disagreement between the parties before 2 June 2020 as to whether there was any valid mediation. 27. As there must be a clear intention to enter into a legally binding agreement, there must likewise be a clear intention to abandon a legally binding agreement. If the intention is objectively ascertainable to be conditional, there is no concluded and certain agreement unless and until the conditions are agreed and fulfilled. 28. On my reading of the correspondence exchanged between the parties in June and July, it is certainly arguable that unless and until the parties have agreed on which parts of the dispute resolution mechanism set out in clause 41 are to be abandoned, and which to be retained, there is no concluded agreement to abandon the arbitration agreement and to litigate instead. The 2 nd Defendant had indicated in the “Subject to Contract” 29/6 Letter that it was important to retain the mediation parts of clause 41, and in the letter of 16 July 2020, the 2 nd Defendant indicated that it would be proposing “another alternative dispute resolution process to replace mediation” since the Plaintiff was “not keen” to proceed with mediation. It had at no time expressed clear agreement to the deletion of clause 41.1 to 41.7 in its entirety, to delete the mediation and arbitration provisions, to indicate any clear intention to conclusively and unreservedly abandon the arbitration agreement. It is arguable that arbitration was to be abandoned only if there was to be mediation. 29. The onus on the 2 nd Defendant in seeking a stay of the action is only to establish a prima facie case of the existence of an arbitration agreement, and I consider that it has discharged such burden. On my reading of the correspondence relied upon by the Plaintiff, I am not satisfied that there is clear agreement to abandon the parties’ arbitration agreement, and it is for the arbitral tribunal to decide on its jurisdiction and on whether any agreed procedure and timing for the arbitration is complied with. 30. The stay is granted under section 20 of the Ordinance in respect of the Plaintiff’s claims against the 2 nd Defendant, as the arbitration clause (which covers any dispute “arising out of, under or in connection with the Contract”) clearly extends to the scope of the claims made by the Plaintiff against the 2 nd Defendant in this action. Case management stay against the 1 st Defendant 31. The 1 st Defendant is not a party to the arbitration agreement set out in the Contract between the Plaintiff and the 2 nd Defendant. 32. However, the Plaintiff does not dispute for the purpose of the application for stay that the Bond is a guarantee, in that the Plaintiff has to establish the 2 nd Defendant’s default under the Contract in order to claim on the Bond. That is clearly consistent with the authorities on the language used in and the effect of the Bond ( Unistress Building Construction Ltd v Top Dollars Development Ltd [2018] 1 HKLRD 237 ). The Bond is a conditional or default bond, and the Plaintiff must first prove a breach by the 2 nd Defendant, and secondly damages. The requirement that the 1 st Defendant should satisfy and pay the damages sustained by the Plaintiff “as certified by the Architect” meant that the Plaintiff’s claim under the Bond must be accompanied by the architect’s certification of the damages. However, if the claim is disputed, the presentation of the certificate is a necessary, but not sufficient, condition for payment under the Bond. In the Arbitration, the arbitrator has the express power under clause 41.6 to open up, review and revise any certificate or assessment which had been issued. 33. On behalf of the Plaintiff, it was argued that a case management stay should not be granted in respect of the 1 st Defendant, in the absence of “very good reasons to the contrary”, when the Plaintiff commenced these proceedings as of right against the 1 st Defendant under the Bond (under which the 1 st Defendant submitted to the non-exclusive jurisdiction of Hong Kong courts). Counsel also pointed out that as the 1 st Defendant is not a party to the Contract or the Arbitration, there is no identity of parties between the Arbitration and these proceedings, and the outcome of one is not binding upon the parties in the other. Any risk of inconsistent findings is inevitable, and it is only in rare and compelling circumstances that a case management stay should be granted in such circumstances. 34. As established in Linfield Ltd v Taoho Design Architects Ltd [2002] 2 HKC 204 , the court must consider what would serve the ends of justice between the parties to the litigation, and the administration of justice general. The Court refused to stay proceedings against the guarantors in Legend Interiors Ltd v Wing Mou Engineering Ltd [2004] 2 HKLRD 435 and in Deutsche Bank AG v Tongkah Harbour Public Company Limited [2011] EWHC 2251, but the emphasis was on the fact that as the guarantor is not a party to the arbitration agreement contained in the contract made with the principal obligor, he is not bound by the findings made in the arbitration, and is also entitled to have all the issues raised in the arbitration reopened in the litigation against him. The risk of inconsistent findings was accepted by the Court to be present and undesirable, but was considered to be unavoidable. 35. A case management stay is an exercise of the Court’s discretion, involving the weighing of all relevant matters, including fairness to the Plaintiff as well as fairness to the Defendant, and the furtherance of the objectives of the CJR in serving the ends of justice and the administration of justice by the Court. 36. The Plaintiff must establish the 2 nd Defendant’s breach of the Contract, and that is to be determined in the Arbitration already commenced by the 2 nd Defendant in January 2021. The 1 st Defendant is of course not a party to the Arbitration, but the important and distinguishing feature in this case is that the 1 st Defendant has given an undertaking in writing that it will be bound by the outcome of the Arbitration between the Plaintiff and the 2 nd Defendant. With this, the risk of inconsistent findings on common facts and issues as to the 2 nd Defendant’s breach of the Contract, and the rights and liabilities of the Plaintiff and the 2 nd Defendant thereunder, can be avoided. The Arbitration has already been commenced and it is unlikely that the present litigation between the Plaintiff and the 1 st Defendant (initiated by the Plaintiff on 14 January 2021) can be concluded before the conclusion of the Arbitration, for the resolution of the Plaintiff’s claim in these proceedings to be delayed by the Arbitration. With these in mind, I consider that it would serve the ends of justice between the parties and the administration of justice by the Court, to grant the stay of the Plaintiff’s action against the 1 st Defendant, pending the resolution of the Arbitration between the Plaintiff and the 2 nd Defendant. Disposition 37. The application for stay as sought in the Summons is granted. An order nisi is made that the costs of the application (including any costs reserved) should be paid by the Plaintiff to the 2 nd Defendant, with certificate for counsel. (Mimmie Chan) Judge of the Court of First Instance High Court Mr Jose Maurellet SC and Mr Brian Fan, instructed by Hogen Lovells, for the plaintiff Mr Peter Clayton SC, instructed by MinterEllison LLP, for the 2 nd Defendant Look up this case on Lawcite Noteup",
  "length": 26564,
  "headers_seen": [
    "Background",
    "The section 20 stay",
    "Case management stay against the 1 st Defendant",
    "Disposition"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2021/2829",
  "query": "seat of arbitration",
  "ts": "2025-10-16T10:49:51",
  "ok": true
}