{
  "title": "ZAC V. OCL | [2025] HKCFI 943 | HKLII",
  "court": null,
  "year": 2025,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2025] HKCFI 943 ZAC V. OCL Judgment Information Date 3 Mar, 2025 Action No. HCCT133/2024 Neutral Cit. [2025] HKCFI 943 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCCT133/2024 html PUBLIC \"-//W3C//DTD XHTML 1.0 Transitional//EN\" \"http://www.w3.org/TR/html4/loose.dtd\" HCCT133/2024 ZAC v. OCL HCCT 133/2024 [2025] HKCFI 943 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO 133 OF 2024 ____________________ IN THE MATTER of a Partial Final Award dated 6 August 2024 in HKIAC/A21039 and IN THE MATTER of section 81 of the Arbitration Ordinance ( Cap 609 ) and article 34 of the UNCITRAL Model Law on International Commercial Arbitration and IN THE MATTER of Order 73 of the Rules of the High Court ( Cap 4A ) ____________________ BETWEEN ZAC Plaintiff (Claimant in the Arbitration) and OCL Defendant (Respondent in the Arbitration) ____________________ Before: Hon Mimmie Chan J in Chambers Date of Hearing: 4 March 2025 Date of Decision: 4 March 2025 _____________ D E C I S I O N _____________ 1. Order 73 rule 5(4) of the Rules of the High Court states that in relation to any application to set aside an award under section 81 of the Arbitration Ordinance , the Originating Summons must state the grounds of the application and if the application is founded on evidence by affidavit, a copy of every affidavit intended to be used must be served with the Originating Summons. 2. In this case, the Originating Summons issued on 5 November 2024 and amended on 12 December 2024 states that the Award dated 6 August 2024 should be set aside on the grounds that the Plaintiff was unable to present its case in the arbitration and that the award is in conflict with the public policy of Hong Kong, with reference to Article 34(2)(a)(ii) and Article 34(2)(b)(ii) of the Model Law. However, it was not filed with any affidavit evidence. 3. Since there is no factual evidence to support the application to set aside, the claims of inability to present case and the award being against public policy remain bare allegations which are totally unsupported. 4. The Court will not allow an application to adduce evidence in support after the issue of the Originating Summons when there is non-compliance with the mandatory requirements of Order 73 without any good or compelling reason or any reason at all furnished, as the failure to comply with Order 73 rule 5(4) has been held to be an abuse of process, when the aims and objective of the Arbitration Ordinance are borne in mind ( KB v S HCCT 13/2015). 5. The Originating Summons is accordingly dismissed on its return day, with costs to the Defendant (if any) on indemnity basis. (Mimmie Chan) Judge of the Court of First Instance High Court Ms Patra Ko, of Zeke Mok & Co, for the plaintiff (pending the coming into effect of the Order made by the Court on 23 January 2025 for Zeke Mok & Co to cease to act for the plaintiff) The defendant was not represented and did not appear Look up this case on Lawcite Noteup",
  "length": 3120,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2025/943",
  "query": "Model Law",
  "ts": "2025-10-16T10:53:19",
  "ok": true
}