{
  "title": "LOUIS DREYFUS TRADING LTD T/A LOUIS DREYFUS SUGAR V. BONARICH INTERNATIONAL (GROUP) LTD | [1997] HKCFI 312 | HKLII",
  "court": null,
  "year": 1997,
  "date": null,
  "content": "HKLII Databases Court of First Instance [1997] HKCFI 312 LOUIS DREYFUS TRADING LTD T/A LOUIS DREYFUS SUGAR V. BONARICH INTERNATIONAL (GROUP) LTD Judgment Information Date 23 Mar, 1997 Action No. HCCL201/1996 Neutral Cit. [1997] HKCFI 312 Parallel Cit. [1997] 3 HKC 597 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCCL201/1996 HCCL000201/1996 LOUIS DREYFUS TRADING LTD t/a LOUIS DREYFUS SUGAR v. BONARICH INTERNATIONAL (GROUP) LTD HCCL000201/1996 IN THE SUPREME COURT OF HONG KONG HIGH COURT COMMERCIAL LIST CL 201 of 1996 ----------------- BETWEEN LOUIS DREYFUS TRADING LTD. t/a LOUIS DREYFUS SUGAR Plaintiff AND BONARICH INTERNATIONAL (GROUP) LTD. Defendant ----------------- Coram: The Hon. Mr. Justice Waung in Chambers Date of Hearing: 23 and 24 January 1997 Date of Handing Down of Judgment: 24 March 1997 ----------------- JUDGMENT ----------------- 1. By its Summary Judgment Application, the Plaintiff seeks judgment against the Defendant for some US$18 million said to be due in respect of a series of 9 sugar contracts made between November 1994 to March 1995 (\"Sugar Contracts\") or alternatively for the same US$18 million said to be due as being admitted under a Memorandum dated 21st December 1995 (\"Memorandum\"). The Defendant resists the Plaintiff's claim for judgment but instead seeks for a stay of the present Hong Kong Court proceedings on the ground that the dispute between the parties should be resolved by arbitration as provided in the Sugar Contracts. 2. The facts of the case are somewhat involved but for the limited purpose of the present Judgment. it is sufficient for me to recite that the Plaintiff is sugar trader in London which entered into the 9 Sugar Contracts with the Defendant, all of which contained the appropriate arbitration clause providing for resolution of dispute arising out of the Sugar Contracts by Sugar Association of London arbitration. By the Sugar Contracts, the Defendant agreed to buy raw sugar, totally almost 2 million metric tons, from the Plaintiff and the Sugar Contracts provided for complicated terms of deliveries calculations of quantities and prices of the sugar supplied under these Sugar Contracts. The Defendant is a Hong Kong company set up by its parent company, the China Agribusiness Development Trust & Investment Foreign Trade Corporation (\"CADTIC\") which is in turn the wholly owned subsidiary of the Ministry of Agriculture of the People's Republic of China. CADTIC undertook by separate Guarantees the performance of the Sugar Contracts should the Defendant failed to do so. 3. Problems arose over the performance of the Sugar Contracts and there were disputes as to cancellations, late deliveries, short deliveries and short shipments and the Defendant's failure to pay various sums due under various Sugar Contracts. There were attempts to work out problems relating to shipments and to resolve the differences between the parties. Various meetings were held and letters exchanged. On the 21st December 1995. a Memorandum in English of that date was made apparently signed by the Plaintiff and Mr. Hua Yun. a Director of the Defendant purportedly on behalf of the Defendant. On this Memorandum in English, there was apparently also a chop of CADTIC but no signature for and on behalf of CADTIC. This Memorandum recited the common understanding of the Plaintiff and the Defendant on a number of matters including:- (1) an initial amount of US$18.145,830.79 (\"Memorandum US$18 Million\") as being due by the Defendant to the Plaintiff in respect of sugar already shipped; (2) payment of US$10 million of the amounts due from the Defendant to the Plaintiff be made with:- (a) US$2 million before 31st December 1995; (b) US$3 million before 30th June 1996; (c) US$5 million before 30th November 1996; (3) The Memorandum does not constitute any amendment or waiver by the Plaintiff of its rights under the Sugar Contracts but merely set forth the process and schedule for the determination of amounts due to the Plaintiff and the payment of the US$10 million of such amounts; This Memorandum has formed the central part of the case of the Plaintiff as it has contended that the Memorandum was a contract and also that in any event it was an admission of the liability of the Memorandum US$18 Million being owing under the Sugar Contracts by the Defendant to the Plaintiff. The Defendant disputes that the Memorandum is a proper document which can be relied on by the Plaintiff and that in particular the Plaintiff knew that it could not rely on the Memorandum which was not signed by the responsible person of either the Defendant or CADTIC, as this made clear to the Plaintiff by a Fax of 28th September 1996 from CADTIC. 4. Neither the Memorandum US$18 Million nor any of the US$10 Million referred to in the Memorandum was paid by the Defendant to the Plaintiff and on the 23rd of July 1996, the Plaintiff issued the Writ in this Action against the Defendant claiming the Memorandum US$18 million or alternatively the US$5 million under the Memorandum. The Statement of Claim made the claims against the Defendant on the twin basis of breach of Sugar Contracts and breach of Memorandum contract. Various interlocutory steps were then taken by the parties including:- (a) the Defendant seeking from the Court and being granted by the Court an order for extension of time for the filing of the Defence; (b) the Defendant seeking from the Court and being granted by the Court an order for security of costs. Shortly after the Defendant taking the above interlocutory steps in this Action, the Defendant served its Arbitration Notices on the Plaintiff in respect of each of the 9 Sugar Contracts. This was in October 1996 and in December 1996. the Plaintiff also served its Arbitration Notices on the Defendant in relation to 8 Sugar Contracts but each with a reservation as to the Hong Kong Action. 5. By its Summons dated 2nd October 1996, the Plaintiff sought judgment against the Defendant for the Memorandum US$18 million on the basis of :- (a) summary judgment and (b) alternatively by reason of admissions made by the Defendant. The Defendant resists this Summons and by the Defendant's Summons dated 9th October 1996 which was subsequently amended at the hearing, the Defendant sought a stay of the present Hong Kong Action on the basis of:- (a) Mandatory Stay for international arbitration pursuant to Article 8(1) of the Model Law and Section 34A and 34C of the Arbitration Ordinance or (b) alternatively under the inherent jurisdiction of the Court. 6. Article 8 of the Model Law states:- \"(1) A court before which an action is brought in a matter which is the subject of an arbitration agreement shall. if a party so requests not later than when submitting his first statement on the substance of the dispute. refer the parties to arbitration unless it finds that the agreement is null and void, inoperative or incapable of being performed. (2) Where an action referred to in paragraph (1) of this article has been brought, arbitral proceedings may nevertheless be commenced or continued and an award may be made, while the issue is pending before the court.\" 7. As the hearing progressed, a number of grounds which were originally in contention fell away. It was very properly conceded by Mr. Coleman for the Plaintiff that the Memorandum could not possibly be contended as a contract between the Plaintiff and the Defendant and no reliance was therefore placed on the Memorandum as a separate contract which gave rise to an independent cause of action by the non-performance of its terms. Mr. Kat for the Defendant on the other hand also informed the Court that for the limited purpose of the hearing of the two Summons, the Defendant would not rely on the matter of illegality as giving rise to a genuine dispute between the parties. 8. What eventually fell to be decided by the Court for the resolution of the two Summons are the following issues :- I. Should Summary Judgment be entered and Stay be refused because unequivocal admissions were made by the Defendant; II. Should Judgment be entered and Stay be refused because of the unequivocal admissions made by the Defendant; III. If no Judgment is to be entered, should the Court grant a Mandatory Stay because the request for arbitration reference by the Defendant was not later than when first submitting its first statement on this substance of dispute; IV. If Mandatory Stay cannot be granted, could the Court grant and should the Court grant under its inherent jurisdiction a stay of proceedings. I-SUMMARY JUDGMENT 9. Even the most casual reading of the long Affirmation of Hua Yun of the Defendant dated 19th November 1996 (\"Hua 2nd Affirmation\") will readily reveal that there are substantial and serious disputes between the Plaintiff and the Defendants in relation to all 9 of the Sugar Contracts. These are factual disputes which in any usual commercial dispute of this kind will entitle the Defendant to at least an order of unconditional leave to defend. That is therefore the primary position in this case and the only matter which introduces the unusual complication is the allegation of Defendant's admissions. 10. Before I proceed to consider the matter of admissions, it is worthwhile to record that the proper approach for the Court when faced with parallel applications of summary judgment and arbitration stay is to apply the test laid down by the Court of Appeal in Tai Hing Cotton Mill Ltd. v Glencore Grain Rotterdam BV [1996] 1 HKC 363 where at page 373H, Bokhary, J.A. said:- \"Under art 8(1) of the Model Law the court is not concerned with investigating whether the defendant has an arguable basis for disputing the claim. If a claim is made against him in a matter which is the subject of an arbitration agreement and he does not admit the claim, then there is a dispute within the meaning of the article. And if he seeks a stay of the action, the court must grant a stay unless the plaintiff can show that the arbitration agreement is null and void, inoperative or incapable of being performed.\" Tai Hing v Glencore was not cited to me during the argument but it confirms the correctness of Zhan Jiang v An Hau [1994] 1 HKC 539 and Guangdong Agriculture v Conagra Industries [1993] 1 HKLR 113 which were referred to by Mr. Kat. 11. It is the submission of Mr. Kat that as shown in the Zhang Jiang judgment, what is required to deprive a party to an arbitration agreement of its right to mandatory stay is the proof of an unequivocal admission as to liability and quantum (see page 543F). Mr. Coleman at the hearing did not dispute this is the correct approach. The real question for the Court therefore is whether there had been unequivocal admissions by the Defendant as to both liability and quantum in relation to each of the 9 Sugar Contracts. 12. The first alleged unequivocal admission relied on by the Plaintiff is the undated Schedule at Exhibit \"PTB-2\" to the Second Affidavit of Mr. Bafitis. This so called Schedule is a curious document purporting to be a Revised Agreed Charges as of 30th September 1995. It also shows on page 2 to be apparently signed by Mr. Hua purportedly on behalf of the Defendant. There was no reference in this Schedule to any of the 9 Sugar Contracts and therefore it is not possible to relate any of the amounts stated in that Schedule to any of the 9 Contracts. Can this Schedule or any part thereof be accepted by this Court as being an unequivocal admission of liability and quantum in respect of any of the 9 Sugar Contracts. The answer to this must be no. 13. But the matter goes somewhat further because it is the common agreed position of the parties that there is ongoing arbitration in relation to all 9 Sugar Contracts, although the contention of the Plaintiff is that the ongoing arbitration in London relates to disputes on the Sugar Contracts not covered by the claim of the Plaintiff in the present Hong Kong Action. It seems to me that if the intention of the Model Law is that the Court should stay out of agreements where the parties have agreed to resolution by arbitration unless when there is really nothing at all to arbitrate because there was an unequivocal admission as to liability and quantum, then there is really no room for the approach of the Plaintiff by isolating an uncertain pan of a contract and say that court judgment should be given because there is no dispute as to quantum arising out of that uncertain part and yet proceed to arbitrate as to the other parts of the same contract. In my judgment this sort of situation is not one where a contract can be shown to be unequivocally admitted both as to liability and quantum. 14. The second alleged unequivocal admission of the Defendant is said to be contained in the Memorandum which was much disputed at the hearing. It is not necessary for me to go into the complicated evidence on this Memorandum because for the same reasons given earlier in relation to the Schedule, this Memorandum is not in my view an unequivocal admission as to liability and quantum in respect of each of the 9 Sugar Contracts. A close reading of for example Clause 3 of the Memorandum makes it quite clear that there was no unequivocal admission of liability and quantum in respect of each of the 9 Sugar Contracts. 15. Further it is to be noted that there is serious dispute between the Plaintiff and the Defendant as to whether the Memorandum was a true or binding admission (see for example the Fax of 28th September 1996 at page 101 of the Bundle) which can be relied on and there is therefore at least a genuine dispute as to whether there was any unequivocal admission as to liability and quantum. 16. In these circumstances, on the First Issue, I have no hesitation in finding for the Defendant. I am satisfied that no unequivocal admission both as to liability and quantum had been made in respect of the 9 Sugar Contracts and I hold therefore that Summary Judgment should not be given for the Memorandum 18 Million. II-JUDGMENT BY ADMISSION 17. For reasons stated earlier, I am not satisfied that binding admissions made been made by the Defendant on the so called Memorandum US$18 million and therefore it follows that I must hold that no Judgment on Admission should be entered against the Defendant. 18. I am however further of the view that there is also another reason why Judgment on Admission should not be entered. The invocation of Order 27 by the Plaintiff in this case for Judgment by Admission is alternative to the Summary Judgment application. It would be unusual if a Court is satisfied that there should be no Summary Judgment but would nevertheless exercise its discretion to grant judgment on admission on the same allegation of admission. The Court is given the discretion to order judgment on admission and the usual reason for the making of the order is the saving of time and costs and that it would be just to do so in the circumstances. But the Court is given the discretion not to make the order. In my judgment, the circumstances of this case do not call for the making of an Order for Judgment on Admission. Apart from the considerations previously mentioned, it seems to be wholly inappropriate when there is a pending international arbitration between the same parties that the Court should take upon itself to become involved in the disputes between the parties which is the spirit underlying the Model law as correctly pointed out by Barnett, J. in the Guangdong Agriculture case. In my view. the correct approach of the court when faced with a situation of a dispute involving a binding arbitration agreement should be to refrain from being involved even on a matter of judgment on admission unless the court comes to the clear view that no stay is to be granted and no arbitration will take place. In that situation, when it becomes obvious that the dispute will have to be resolved by the Court and only by the Court, then it seems to me that the normal discretion of the Court can and should be exercised including the determination of whether judgment on admission and to what extent should be ordered. III-MANDATORY STAY OF PROCEEDINGS 19. At the hearing, there was no dispute that the 9 Sugar Contracts each provided for arbitration by the Sugar Association of London and that these are binding agreements capable of being performed and in the process of being performed so far as arbitration is concerned. The narrow issue of the parties on whether the Court should order Mandatory Stay of Proceedings pursuant to Article 8(1) of the Model law is whether the Defendant had made a first statement on the substance of the dispute before the Defendant made the request for arbitration. The central consideration was given to paragraph 5 of the Affirmation of Ho Kai Cheong dated 30th September 1996, namely whether what was stated therein amounted to a first statement of the Defendant on the substance of the dispute. 20. The chronology of events is that the Defendant made the request for London Sugar Association arbitration on the 9th of October 1996 and also issued on the same day the Defendant's Summons for Stay of Proceedings. On the 30th September 1996, some 9 days before the 9th of October 1996, the Defendant issued a Summons for security of costs supported by the aforesaid Affirmation of Ho Kai Cheong dated 30th September 1996 (\"Ho Affirmation\"). Paragraph 5 of Ho Affirmation said:- \"In this action, the Plaintiff claims against the Defendant for damages arising out of alleged breach of contract for sale and purchase of sugar. The Defendant denies liability to the Plaintiff and will dispute the Plaintiff's claim on the ground that the contracts in question do not bind the Defendant.\" The question which is not easy to answer is whether what is in the last sentence of paragraph 5 of Ho Affirmation amounted to a statement on the substance of the dispute by the Defendant. 21. Mr. Kat submits that the tenor of the Model law is strongly in favour of international arbitration and that the Court should construe the bar to Mandatory Stay in Article 8 narrowly. I accept that submission as obviously it is not the intention of the Model law to take away the strong new right of Mandatory Stay easily by any casual act of the Defendant. It seems to me therefore legitimate to construe Article 8 as contemplating the bar to the right to be some formal act of consequence on the part of defendant in the court action who later seeks to arbitrate the dispute. Article 8(1) requires the act of such defendant to be:- (1) a statement ; (2) a statement which is submitted to the Court by the Defendant; (3) a statement which is on the substance of the dispute ; (4) a statement which is a first statement on the substance of the dispute. For the sake of convenience I have underlined the four separate essential aspects of the bar. In my judgment what Article 8(1) has provided for as a bar to Mandatory Stay is some formal document (probably first in a series) specially submitted by a party to the Court which contains what that party says on the substance of the dispute. A document which readily comes to mind as being such a document under Article 8(1) would be the Defence and Counterclaim of a defendant in an action. What is involved here are 9 Sugar Contracts wherein the substance of the disputes between the parties varied from Sugar Contract to Sugar Contract and even the amount and the nature of its makeup claimed by the Plaintiff under each Sugar Contract (not specified anywhere in the Court papers) varied a great deal. I do not believe that having regard to all the circumstances, what was said in paragraph 5 of the Ho Affirmation can be said to be in respect of each of the 9 Sugar Contracts, a submitted first statement on the substance of the dispute under that Sugar Contract by the Defendant. Having given further mature thought to this Issue. I have reached the conclusion that paragraph 5 of the Ho Affirmation does not present a bar to the Mandatory Stay Order sought by the Defendant. I hold therefore that an order should be made for the Mandatory Stay of Proceedings. IV-DISCRETIONARY STAY OF PROCEEDINGS 22. On the basis of my finding that there should be a Mandatory Stay, strictly speaking it is not necessary for me to make any order on the alternative ground of discretionary stay. But as the point has been argued before me, I will briefly state what would have been my decision on that Issue. 23. Under the Supreme Court Ordinance , it is provided by Section 16(3) that \"nothing in the Ordinance shall affect the power of the High Court to stay any proceedings before it, where it thinks fit to do so\". It seems to me that the High Court of Hong Kong has the jurisdiction to stay any proceedings in the High Court where the High Court thinks fit to do so and express words in another statute will be required to take away or cut down on the power of stay of proceedings expressly recognised in Section 16 (3) of the Supreme Court Ordinance . Mustill & Boyd at page 461 and 462 also seem to confirm this inherent jurisdiction to stay proceedings. 24. The real question under this Fourth Issue is on what basis should the discretion of inherent jurisdiction be exercised where the Court finds that it is disabled by the statutory bar in Article 8(1) from ordering a Mandatory Stay. Mr. Coleman submits that I should apply the domestic arbitration line of approach namely to refuse a stay if there has been any act which amounts to step in the action. Alternatively he submits that I should not depart from the international arbitration bar line so that the result of the residual discretion exercise is not different from the Article 8 exercise. In my view these are really formulas which are too mechanical or rigid to apply. Where by statute, power to stay proceedings is recognised as being exercisable where the Court thinks fit, then I can see no justification for restricting that power or exercise of discretion. All the circumstances must be looked at. And adopting that approach of looking at all the circumstances, I have no doubt that I should exercise my discretion under the inherent jurisdiction to order a stay of proceedings. In reaching that conclusion I take into account all the circumstances but in particular the following:- (1) The existence of the arbitration clause; (2) Neither party had waived its right to arbitrate; (3) The natural forum for the resolution of the disputes between the parties is the London Sugar Arbitration; (4) The London Sugar Association is the best venue to resolve the complex specialist disputes of sugar contracts; (5) There is a pending arbitration in relation to the very same Sugar Contracts; (6) Much expense and delay will be saved by one set of proceedings rather than two sets of proceedings; (7) Confining the disputes between the parties to London Sugar Association arbitration will avoid any possible conflicts of inconsistent findings; (8) The short sentence in paragraph 5 of the Ho Affirmation which if it should lead to the Court not being able to make the Mandatory Stay order is not of such a nature which had either caused prejudice to the Plaintiff or which ought to lead to an otherwise unjust result of shutting out the Defendant from an order of stay of proceedings or which should result in the parties litigating in both the London arbitration and in the Hong Kong Court. It follows that I would have also found for the Defendant on the alternative ground of discretionary stay of proceedings. 25. The conclusion of the Court on the hearing of the two Summons is that the Summary Judgment should be dismissed and that all further proceedings in this Action be stayed. So far as costs are concerned, it seems to me that the proper costs order ought to be:- (1) The Plaintiff to pay the Defendant the costs of the Plaintiff's Summons for Judgment; (2) The costs of the Defendant's Summons for Stay of Proceedings be costs in the London Sugar Association Arbitration. (3) The above costs order is on basis of order nisi and to be made absolute if no application to vary is made 21 days after the handing down of this Judgment. William Waung Judge of the High Court Representation: Mr. Russell Coleman for the Plaintiff instructed by Messrs Richards Butler Mr. Nigel Kat for the Defendant instructed by Messrs David Y.Y. Fung & Co. Look up this case on Lawcite Noteup",
  "length": 24449,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/1997/312",
  "query": "stay of proceedings",
  "ts": "2025-10-14T11:23:03",
  "ok": true
}