{
  "title": "CHEN HONGQING V. THE PERSONS WHOSE NAMES ARE SET OUT IN THE SECOND COLUMN OF THE SCHEDULE TO THE RE AMENDED WRIT OF SUMMONS FILED ON 26 MARCH 2018 AND OTHERS | [2024] HKCFI 3658 | HKLII",
  "court": null,
  "year": 2018,
  "date": "2062-04-16",
  "content": "HKLII Databases Court of First Instance [2024] HKCFI 3658 CHEN HONGQING V. THE PERSONS WHOSE NAMES ARE SET OUT IN THE SECOND COLUMN OF THE SCHEDULE TO THE RE AMENDED WRIT OF SUMMONS FILED ON 26 MARCH 2018 AND OTHERS Judgment Information Date 26 Nov, 2024 Action No. HCA2648/2017 Neutral Cit. [2024] HKCFI 3658 Parallel Cit. [2025] 2 HKC 482 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCA2648/2017 HCA2648G/2017 CHEN HONGQING v. THE PERSONS WHOSE NAMES ARE SET OUT IN THE SECOND COLUMN OF THE SCHEDULE TO THE RE AMENDED WRIT OF SUMMONS FILED ON 26 MARCH 2018 AND OTHERS HCA 2648/2017 [2024] HKCFI 3658 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE ACTION NO 2648 OF 2017 ________________________ BETWEEN CHEN HONGQING (陳宏慶) Plaintiff and The persons whose names are set out in the second column of the Schedule to the Re-amended Writ of Summons filed on 26 March 2018 (其姓名載於2018年3月26日存檔的 再修訂傳訊令狀附表第二欄的人士) 1 st to 2265 th Defendants JINAN INDUSTRIAL DEVELOPMENT INVESTMENT GROUP CO, LTD (濟南產業發展投資集團有限公司) 2,266 th Defendant ________________________ Before: Mr Recorder Eugene Fung SC in Chambers (Open to the Public) Date of Hearing: 27 November 2024 Date of Decision: 27 November 2024 ________________________ D E C I S I O N ________________________ 1. The plaintiff has applied to clarify the costs order made by Deputy High Court Judge To made on 29 May 2018, or alternatively to seek a fresh costs order pursuant to Order 62 rule 4. The application is opposed by the defendants who are represented by Messrs Stephenson Harwood (“the SH defendants”). 2. I have come to the view that the slip rule cannot assist the plaintiff. I am, however, prepared to invoke Order 62 rule 4 to consider the reserved costs. Nonetheless, I take the view that the plaintiff should only get (1) the costs for the preparation of the court documents before 29 December 2017, and (2) the costs in relation to the directions made by Mr Justice Li on 29 December 2017. Here are my reasons. CLARIFICATION OF DHCJ TO’S COSTS ORDER 3. I start with the costs order of Deputy High Court Judge To. In that order, his Lordship ordered that “the costs of the application be to the plaintiff, to be taxed if not agreed, with certificate for two counsel”. 4. By the term “application”, his Lordship was referring to the plaintiff’s application for interlocutory anti-suit injunction made by a summons dated 20 December 2017. This is clear from paragraph 1 of his Lordship’s decision, which was handed down on 29 May 2018. 5. The plaintiff now wishes to invoke the slip rule under Order 20 rule 11 to contend that the costs of the application would include the costs that were reserved pursuant to Mr Justice Li’s order dated 29 December 2017. The alleged omission is that Deputy High Court Judge To omitted to mention the reserved costs in his Lordship’s order on 29 May 2018. 6. There is no dispute on the applicable principles on the operate of the slip rule. An error or omission may be corrected under the slip rule if the error or omission is one in expressing the manifest intention of the original court. The word “manifest” in “manifest intention” is used as an adjective. It means “easily noticed” or “obvious”. So the question for me is whether it is easily noticed or obvious from the orders made by Deputy High Court Judge To on 29 May 2018 that his Lordship intended to award the reserved costs to the plaintiff. 7. As pointed out by the SH defendants, the reserved costs were not mentioned in Deputy High Court Judge To’s decision of 29 December 2018, or the written submissions placed before his Lordship, or during the oral argument before his Lordship on 1 February 2018. 8. I am therefore unable to see upon what basis I can say that his Lordship’s manifest intention was to award the reserved costs to the plaintiff when he made the costs order on 29 May 2018. If his Lordship was not even made aware of the reserved costs before the conclusion of the hearing on the 1 February 2018, I do not think I can say that his manifest intention was to award such reserved costs to the plaintiff around four months later when his Lordship gave the decision on 29 May 2018. 9. I am unable to agree with the plaintiff’s submission that the fact that his Lordship ordered costs of the entire application be to the plaintiff must necessarily or implicitly include the costs of a previous hearing. The present exercise is not to construe Deputy High Court Judge To’s costs order. 10. As I said earlier, the only question is to ask what the manifest intention of his Lordship was, which I have answered. Because the question is what his Lordship’s manifest intention was at the time when he made the costs order in May 2018, it is in my view irrelevant to take into account what his Lordship subsequently said at a call-over hearing on 26 October 2023. 11. For these reasons, I decline to amend Deputy High Court Judge To’s order dated 29 May 2018, and I dismiss paragraph 1 of the plaintiff’s summons. FRESH ORDER UNDER ORDER 62 RULE 4 12. I now proceed to deal with the plaintiff’s alternative application under Order 62 rule 4. The plaintiff submits that the court can, under that rule, make a fresh order to award the plaintiff the reserved costs of the hearing on 29 December 2017. 13. Order 62 rule 4(1) expressly provides that “costs may be dealt with by the court at any stage of the proceedings or after the conclusion of the proceedings”. Although the plaintiff has now discontinued the proceedings, there are remaining taxation issues in the proceedings which need to be resolved. On the wording of Order 62 rule 4(1), it appears possible for this court to deal with the reserved costs order made on 29 December 2017. 14. I am unable to agree with the submissions from the SH defendants that this court is functus officio . The court is said to be functus if it has already decided on the matter. I do not believe it can be said that the position of the reserved costs has already been decided on a prior occasion. 15. In the present case, the fact that the plaintiff has served a notice of discontinuance under Order 21 rule 2 does not mean that the issue on the reserved costs has been decided. I also note that Order 62 rule 10(1) only deals with the defendants’ costs after a plaintiff has discontinued his action and does not appear to affect the plaintiff’s position on costs. 16. I am also not prepared to read into Order 62 rule 4 a long-stop date that the latest time that the court may deal with costs under that rule is the time of discontinuance, as submitted by Mr Lau. That submission does not seem to sit well with the express wording of Order 62 rule 4, which is very wide in scope and has no temporal limitation. Accordingly, I am not persuaded that this court is functus in relation to the reserved costs. 17. The SH defendants further submit that Order 62 rule 4 is inapplicable where a plaintiff has discontinued his action, relying on the District Court case of Lai Wing Kan v Tak Wan Construction & Grilling Company Ltd [2018] HKDC 1254 . 18. In that case, Deputy District Judge K C Chan refused to allow the applicant to rely on Order 62 rule 4 to deal with the question of costs when a notice of discontinuance had been filed by the applicant. I note that the learned Deputy District Judge at [13] said that the applicant’s action has ceased to exist. He was therefore of the view that the applicant could not rely on Order 62 rule 4 where the action has been terminated [17]. 19. Insofar as the learned Deputy District Judge laid down a principle that Order 62 rule 4(1) is inapplicable when a plaintiff has discontinued his action under Order 21 rule 2, I respectfully decline to follow that decision. Order 62 rule 4 is couched in very wide terms and is not expressed to be subject to any exception. 20. The SH defendants further rely on what Master Marlene Ng said in [82] and [85] of the case of Lin Yanjin v Smart Billion Engineering Ltd , HCPI 739/2009, and also what Mr Recorder Patrick Fung SC, said in [6] to [7] of the case of Lu Jun v Yu Qi , HCCW 282/2010. I have considered those passages but do not derive much assistance from them. They do not deal with the question of whether Order 62 rule 4 can be invoked when a plaintiff has discontinued his action. 21. I therefore consider that it is open to me to invoke Order 62 rule 4(1) to deal with the reserve costs now. 22. Despite the contrary submissions made by Mr Lau, I am also prepared to exercise my discretion to consider the reserved costs today. I am not satisfied that the plaintiff has been guilty of any inordinate delay, nor do I think that the SH defendants have demonstrated to the court that great hardship or prejudice will be suffered if the court were to consider the reserved costs today. 23. It seems to me that the reserved costs mainly relate to three matters: (1) the preparation of the documents to support the plaintiff’s application for anti-suit injunction before 29 December 2017, (2) the directions made at the hearing on 29 December 2017, and (3) the plaintiff’s interim-interim application made at the hearing on 29 December 2017. 24. As to the costs attributable to the plaintiff’s application for interim-interim relief, it is not clear to me why the plaintiff should get them now. This is particularly so when Mr Justice Li refused the interim-interim injunction application on 29 December 2017. In this context, it is also relevant to note that Mr Justice Keith Yeung, in his decision dated 30 August 2019, allowed the SH defendants’ jurisdiction challenge and discharged the plaintiff’s anti-suit injunction. 25. As to the costs attributable to (1) the preparation of the documents to support the plaintiff’s anti-suit injunction application before 29 December 2017, and (2) the directions made at the hearing on 29 December 2017, it seems to me that these were necessary steps for the disposal of the plaintiff’s anti-suit injunction application at the time. The hearing was also the first occasion when the plaintiff’s anti-suit injunction application came before the court. It seems to me that the costs associated with these two matters should follow the event. In other words, such costs should be given to the plaintiff. 26. For these reasons, as far as the reserved costs are concerned, I consider that the plaintiff should only be entitled to (1) the costs for the preparation of the court documents before 29 December 2017, and (2) the costs in relation to the directions made by Mr Justice Li on 29 December 2017. This is the order I make in relation to paragraph 2 of the plaintiff’s summons. (Submissions on costs) 27. There be no order as to costs. (Eugene Fung SC) Recorder of the High Court Mr Zenith Chan, instructed by Gallant, for the plaintiff Mr Kevin Lau, instructed by Stephenson Harwood, for the SH defendants Look up this case on Lawcite Noteup",
  "length": 10959,
  "headers_seen": [
    "CLARIFICATION OF DHCJ TO’S COSTS ORDER",
    "FRESH ORDER UNDER ORDER 62 RULE 4"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2024/3658",
  "query": "anti-suit injunction",
  "ts": "2025-10-16T10:47:39",
  "ok": true
}