{
  "title": "CHINA RAILWAY (HONG KONG) HOLDINGS LTD ALSO KNOWN AS CHINA RAILWAY SERVICES (HONG KONG) LTD V. CHUNG KIN HOLDINGS CO LTD | [2023] HKCFI 132 | HKLII",
  "court": null,
  "year": 1996,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2023] HKCFI 132 CHINA RAILWAY (HONG KONG) HOLDINGS LTD ALSO KNOWN AS CHINA RAILWAY SERVICES (HONG KONG) LTD V. CHUNG KIN HOLDINGS CO LTD Judgment Information Date 18 Jan, 2023 Action No. HCA434/2022 Neutral Cit. [2023] HKCFI 132 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCA434/2022 HCA434/2022 CHINA RAILWAY (HONG KONG) HOLDINGS LTD ALSO KNOWN AS CHINA RAILWAY SERVICES (HONG KONG) LTD v. CHUNG KIN HOLDINGS CO LTD HCA 434/2022 [2023] HKCFI 132 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE ACTION NO 434 OF 2022 ________________________ BETWEEN CHINA RAILWAY (HONG KONG) HOLDINGS LIMITED (中國鐵路(香港)控股有限公司) ALSO KNOWN AS CHINA RAILWAY SERVICES (HONG KONG) LIMITED (中國鐵路服務(香港)有限公司) Plaintiff and CHUNG KIN HOLDINGS COMPANY LIMITED (中建集團有限公司) Defendant ________________________ Before: Master Alexander Tang in Chambers (Open to Public) Date of Hearing: 9 January 2023 Date of Decision: 19 January 2023 ________________________ D E C I S I O N ________________________ A. Introduction 1. This is a hearing of the Defendant’s ( D’s ) Summons dated 2 September 2022 to stay the present proceedings in favour of the Court of Wuhan. B. Background B-1. The Initial Agreement 2. This case has a very long history. 3. P and D are both Hong Kong companies. 4. In gist, back in 30 June 1995, by way of a 合作合同 (the Initial Agreement ), P provided HK$40M to D, so as to allow D to construct a hotel in HK. (a) The agreement was expected to last for 1 year. There is an obligation to repay after 1 year. (b) Insofar as the money provided to D was borrowed by P from banks, D had to reimburse P for all interest and fees incurred. (c) D also had to pay P fixed profits of 7% per annum on the amount provided. (d) D had full control of the funds, subject to P’s right to monitor such. (e) P would not bear any risk whatsoever in D’s business. (f) Security was to be provided by D over some real properties in Shanghai, although there was an option for this to be exchanged for the hotel in HK, once constructed. It was provided that:- “抵押物的辦理應符合內地和香港的有關法律規定” (g) There is a governing law and/or jurisdiction clause as follows:- “本合同實施過程中，雙方如發生經濟紛爭，應通友好協商解決，如協商不成， 則循當地法律解決” 5. On 16 Oct 1995, by way of a supplemental agreement, an additional HK$10M was provided on similar terms. 6. Since then, the terms of the agreements were extended. Broadly speaking, this can be broken down to 3 periods. B-2. 1996-1998 (The Initial Extensions) 7. In 1996-97, a number of 再補充協議 were entered into. In gist, they provided for the extension of the agreement period, and with some variations as to the security posted. B-3. 1999-2009 (The Tri-Partite Era) 8. On 21 Jan 1999, a 還款合同 (the Repayment Agreement ) was entered into. (a) It refers to the Initial Agreement and its supplements, and acknowledges the outstanding repayment obligations under the earlier agreements amounted to HK$63,799,517.44. (b) It provides for variations as to the terms, including the payment of interest on top of the payment of fixed profits, and provides for default interest if repayment does not take place by 30 June 1999. (c) The main difference, though, was that an additional party was joined, such being Wu Han Jinyin Lake International Golf Industrial Development Co, Ltd ( Jinyin ). Jinyin is joined as it holds properties in Wuhan, and under the agreement Jinyin promised to provide security for the repayment by mortgaging the properties in favour of P. (d) A jurisdiction clause also exists, providing that:- “本合同如有未盡事宜，有關方協商後可以補充協議方式予以補充， 并(並)具同等法律效力。本合同及有關補充協議執行期間如產生糾紛或爭議，可通過協商解決。協商未果，[P]有權向[Jinyin]所在地仲裁委員會申請仲裁或向[Jinyin]所在地人民法院起訴” 9. On 19 May 1999, another tri-partite agreement, known as the 房屋權屬抵債協議 (the Property Repayment Agreement ) was entered into, where it was contemplated that the whole loan would be repaid by Jinyin transferring to P certain PRC properties, although it is provided that, unless the transfers thereunder are fully completed, the obligations under the Repayment Agreement continues to stand. A jurisdiction clause also exists, providing that:- “協商未果，協議有關方均有權向[Jinyin]所在地仲裁委員會申請仲裁或向[Jinyin]所在地人民法院起訴，訴訟活動所發生的一切有關費用由甲方[D]及[Jinyin]承擔。” 10. However, it appears that this repayment plan did not go through. On 22 Feb 2001, P, D and Jinyin entered into a 償還債務協議, which basically notes that the Repayment Agreement and the Property Repayment Agreement had not been performed (“甲方及其下屬丙方，未能履行1999年1月21日簽訂的還款合同和1999年5月19日簽訂的房屋權屬抵債協議…和1999年6月23日簽訂的房屋權屬抵債協議附件一的有關條款”). It provides for an acknowledgment of past agreements and indebtedness (“甲方繼續確認對乙方的債務，甲方和丙方向乙方保證以往所有協議、合同中直接或間接保護乙方債權利益的一切條款仍然有效”), with a schedule of partial repayment by cash and in properties. 11. Similar tri-partite 償還債務協議 were entered into on 26 Nov 2001, 20 Oct 2003, and 8 Dec 2004, 20 Dec 2005, 20 Dec 2006 and 20 Dec 2007. The 20 Dec 2007 agreement was supplemented by a 補充償債協議 dated 13 Feb 2008, whereby specific properties in Wuhan were contemplated to be used to repay the debt. B-4. 2009-2020 (The Return to Bi-Partite Extensions) 12. On 29 July 2009, a further 補充償債協議 to the 20 Dec 2007 償還債務協議 was signed – but at this point Jinyin dropped out of the picture and was no longer a party. Apart from acknowledging the debt, it mentioned the possibility of using Shanghai properties to repay the debt. Similar agreements were entered into on 28 Dec 2010, 21 Dec 2011, 21 Dec 2012, 24 Dec 2013, 21 Dec 2014, 3 Dec 2015, 22 Dec 2016, 20 Dec 2017, 19 Dec 2018, 27 Dec 2019, and 30 Dec 2020. B-5. The Dispute Herein 13. Finally, on 20 May 2021, P decided to issue a Statutory Demand against D. This was followed by the Action herein taken out on 20 Apr 2022. 14. D does not dispute the written agreements. Instead, D’s defence, in gist, is that:- (a) From about 1995 onwards, D has entered into other business transactions with an associated company of P, 廣州鐵路集團公司 ( Guangzhou Railway ). Guangzhou Railway, back then, agreed to lend RMB 200M to P. (b) However, due to corruption at Guangzhou Railway, P only received less than RMB 100M out of the 200M. To cover up the matter, P was forced to confirm full receipt of RMB 200M, and over the years, made substantial repayment of RMB 220M and also by way of additional transfer of properties in the PRC. This was known to P’s management. (c) P had always accepted and agreed that the total repayment amount by D with all entities controlled under the Ministry of Railway (presumably including P and Guangzhou Railway) should be dealt with at the same time. However, they were unwilling to do proper accounts as this would uncover the corruption. (d) By 2009, P informed D that it considered that D had made sufficient repayments and that P did not intend to pursue the matter further. However, D was required to execute agreements from time to time for P’s internal accounting purposes. This is why (1) there were so many supplemental agreements over so many years despite no substantive performance; and (2) Jinyin dropped out of the picture. The fact that these agreements were not ‘serious’ is evidenced by the fact that since the 29 July 2009 agreement, all subsequent agreements mentioned that D should make repayment via transfer of a property known as 小白樓 to P after litigation over its title is over; and yet, despite the fact that the Supreme People’s Court had settled the litigation in 2013, such clause continued to exist in supplemental agreements post-2013. (e) As such, D contends that its obligation to repay has been performed, varied or discharged altogether. C. Analysis – Jurisdiction Clause – Exclusive or Non-Exclusive? 15. Both P and D are Hong Kong companies. The starting point is that this Action is begun as of right in Hong Kong. It is trite that the burden of proof is on an applicant for stay to show that the foreign forum is clearly and distinctly the more appropriate forum. 16. An issue in hot dispute is whether or not the contracts sued upon by P contain an exclusive jurisdiction clause in favour of Wuhan, as this may affect the whole tenor of the analysis. (a) If there is an exclusive jurisdiction clause in favour of a foreign Court, the Court would normally stay in favour of the foreign Court, unless strong cause is shown to the contrary: see Hong Ziyun v Chan Kwan Ming [2019] 4 HKLRD 405 at §39. (b) If the jurisdiction clause is non-exclusive, the burden remains on the applicant to show that the foreign Court is clearly and distinctly the more appropriate forum. The non-exclusive jurisdiction clause is simply one factor to be placed into the discretionary mix: T & K Electronics v Tai Ping Insurance [1998] 1 HKLRD 172 at 177G-I. 17. As such, whether or not there exists an exclusive jurisdiction clause in favour of Wuhan is a key question to answer. C-1. Issue 1 – Which Jurisdiction Clause Should Apply? 18. The starting point is that, as noted above, there are 3 jurisdiction clauses which can be applicable:- (a) First , there is the one in the 30 June 1995 Initial Agreement. The drafting is not the clearest – the term used is that any disputes should “循當地法律解決”. On a narrow and literal reading, this can be simply a governing law clause; on a more purposive reading, however, this can be both a jurisdiction and governing law clause. On balance, I am more inclined to view it as capable of being both, although, for reasons below, whether or not it constitutes a jurisdictional clause is of no consequence in the present case. (b) Second , there is the one in the 21 Jan 1999 Repayment Agreement. (c) Third , there is the one in the 19 May 1999 Property Repayment Agreement. 19. The first issue then is which, if any, of these three jurisdiction clauses apply to Ps’ claim herein. 20. In this regard, Ps’ claim herein is quite simply a recovery of the debt owed. 21. On this basis, I think one can first rule out the jurisdiction clause under the 19 May 1999 房屋權屬抵債協議. The reason is that, rather than governing the debt itself, it appears to be an ancillary agreement which governs the possibility of a particular means of repayment. This is evident from the fact that, on its own terms, until the 房屋權屬抵債協議 is fully performed, the Repayment Agreement continues to be effective. 22. This leaves the first and the second jurisdiction clauses. 23. D’s argument, as I understand it, is that the Repayment Agreement constitutes a clean break from, and supercedes, the earlier agreements – rather than being an agreement on co-operation, even its name has changed to one for repayment of debt. Further, the later agreements, despite having general references to previous agreements, generally specifically referred back to the Repayment Agreement as a reference point. As such, D argues that the jurisdiction clause in the Repayment Agreement should prevail. 24. I agree that the jurisdiction clause in the Repayment Agreement should prevail, but for different reasons than those put forward by D. (a) At the outset, I would make it clear that I do not accept D’s characterization of the Repayment Agreement as a clean break from the Initial Agreement and its supplements. (b) The distinction may have more attraction if the Initial Agreement were truly a joint venture co-operation agreement of some sort where the parties each bore risk in the property development project, whereby the later Repayment Agreement had the effect of completely recharacterizing the relationship into one of creditor/debtor. (c) This, however, was not the case in fact. As noted above, while the name of the Initial Agreement suggests some form of general commercial co-operation, in substance it is basically a loan agreement. This is because P bore no risk in the property project mentioned, and P only took a fixed profit based on a percentage of the amount provided, which is tantamount to interest. Equally, D’s obligation is basically to repay the amounts provided to P and provide security thereto. (d) Viewed in this context, the Repayment Agreement, in gist, simply refers back to this loan agreement, makes certain amendments to the loan terms thereto, and provides for the posting of different security. It is basically another amendment agreement to the Initial Agreement. (e) It is thus incorrect to say that the Repayment Agreement is a clean break from the past. Instead, in my view, the better characterization is that the Initial Agreement, which in substance is a loan agreement, has been amended from time to time, including by the Repayment Agreement (together, the Debt Agreement ). (f) If so, since the Repayment Agreement is later in time than the Initial Agreement, the jurisdiction clause in the later agreement should normally supercede the one in the earlier Initial Agreement. (g) I can see a counter-argument that, since the focus of the Repayment Agreement is on the posting of security by Jinyin in the Mainland, the jurisdiction clause therein only applies to disputes over Mainland security issues; and that the jurisdiction clause in the Initial Agreement should continue to apply to issues concerning the recovery of debt. However, on balance, I am inclined to the view that the jurisdiction clause in the Repayment Agreement should apply to all issues. The fact is, the Repayment Agreement deals with both the loan and security issues, and the jurisdiction clause makes no attempt to distinguish between the two; instead, on its face, it applies to both issues. One would have thought that commercial parties would prefer a one-stop shop for dispute resolution. 25. On this basis, I am of the view that the jurisdiction clause in the Repayment Agreement, being the latest in time of the whole Debt Agreement, applies to the debt sued upon by Ds in this Action. C-2. Issue 2 – What should the Governing Law of the Jurisdiction Clause be? 26. This moves us on to the second issue – what is the governing law of this jurisdiction clause in the 21 Jan 1999 還款合同? i. Legal Principles 27. In this regard, the law is set out in some detail by the Supreme Court in Enka Insaat ve Sanayi AS v OOO “Insurance Company Chubb” [2020] 1 WLR 4117 , in the context of determining the governing law of a particular type of jurisdiction clause, ie, an arbitration clause. “29. The starting point at common law…is that contracting parties are free to choose the system of law which is to govern their contract , provided only that their choice is not contrary to public policy. The court must therefore construe the contract to see whether the parties have agreed on a choice of law to govern it… … 33. …it is both consistent with authority and sound in principle to apply English law as the law of the forum to ascertain whether the parties have agreed on the law which is to govern their contract (and, if not, what law governs it in the absence of agreement)… … 35. Many of the cases applying the common law rules distinguish between a choice of law which is express or implied. The terminology is useful in reflecting the fact that an agreement on a choice of law to govern a contract, like any contractual term, may be explicitly articulated or may be a matter of necessary implication or inference from other terms of the contract and the surrounding circumstances . The distinction, however, is not a sharp one: language may be more or less explicit and the extent to which a contractual term is spelt out in so many words or requires a process of inference to identify it is a matter of degree. Determining whether the parties have agreed on a choice of law to govern their contract is in every case a question of interpretation. It is also important to keep in mind that whether a choice is described as express or implied is not a distinction on which any legal consequence turns. An implied choice is still a choice which is just as effective as a choice made expressly. 36. Where a choice of law cannot be identified by interpreting the contract, the approach of the common law was at one time to presume that the parties must nevertheless have intended their contract to be governed by one particular system of national law and to impute a relevant intention to them…In the second half of the 20th century, however, the test of presumed intention came gradually to be superseded by an acknowledgement that at this stage of the analysis the court is no longer concerned with intention at all and is applying a positive rule of law, with the rule being that the contract is governed by the system of law with which it has its closest and most real connection… 28. This appears to tally with Hong Kong law: see York Airconditioning & Refrigeration Inc v Lam Kwai Hung [1995] 2 HKLR 256 at 262. 29. Enka provides further that, in the attempt to interpret the contract and discover the intention of the parties, generally a choice of law clause applicable to the main contract would be interpreted as being applicable to the jurisdiction clause as well, as this promotes, inter alia , certainty, consistency, and coherence, and reduces complexities and artificiality. In the words of Lord Hamblen and Leggatt JJSCs:- “54. As a matter of principle and authority there are therefore strong reasons why an agreement on a choice of law to govern a contract should generally be construed as applying to an arbitration agreement set out or otherwise incorporated in the contract.” 30. As to the application of the closest connection test, the majority in Enka held that, insofar as the closest connection test applies, the law of the chosen seat of arbitration will likely apply:- “118… As discussed earlier…the court must in these circumstances determine, objectively and irrespective of the parties’ intention, with which system of law the arbitration agreement has its closest connection. This exercise is different in nature from the attempt to identify a choice (whether express or implied), as it involves the application of a rule of law and not a process of contractual interpretation… 119. Even where the parties have not agreed what law is to govern their contract, it is reasonable to start from an assumption for reasons given earlier that all the terms of the contract, including an arbitration clause, are governed by the same system of law. Where, however, the parties have selected a place for the arbitration of disputes, there is authority for, as a general rule, regarding the law with which the arbitration agreement is most closely connected as the law of the seat of arbitration … 120. There are a number of reasons of principle and policy which in our opinion justify as a general rule regarding the law of the place chosen as the seat of arbitration as the law most closely connected with the arbitration agreement which in the absence of choice will apply by default…” 31. It should be noted, however, that this is partially justified by policy considerations that are unique to arbitration, and may not apply in full force to jurisdiction clauses. ii. Application to the Facts 32. How, then, should the above principles apply to the present case? The parties’ respective arguments are as follows. 33. Following on D’s characterization of the Repayment Agreement as a “clean break” from previous agreements, D’s argument is premised upon focusing on the Repayment Agreement itself. As the Repayment Agreement itself is silent on governing law, D argues that the closest connection test applies. On this basis, D argues that:- (a) First , the jurisdiction clause itself points to the location of Jinyin, which is Wuhan, PRC, and this raises a strong implication that Mainland law should govern, as it is inherently unlikely that the parties intended that the Mainland Tribunals/Court should apply Hong Kong law: see the Hong Ziyun case ( supra ) at §26. (b) Second , the Repayment Agreement, from which the jurisdiction clause can be found, contains a number of clauses which provide that Jinyin ought to provide security for the loan via mortgaging its properties in Wuhan – these also indicate that the parties likely intended Mainland law should govern the jurisdiction clause. 34. P’s argument, on the other hand, in gist goes like this:- (a) First , the Initial Agreement contains an express governing law clause, which in context must be construed as referring to Hong Kong law given that both parties are Hong Kong companies. (b) Second , all subsequent agreements are intimately related to, and amend, the Initial Agreement. There is thus no reason why a different governing law should apply, especially when the subsequent agreements contain no governing law clause. D relies in particular on First National Bank of Chicago v Carroway Enterprises [1990] 2 HKLR 10 , a guarantee case, by analogy. In that case, it was held that the most likely implication is that a guarantee is governed by the same law as that which governs the primary obligation with which it is inter-related [15A-B]. (c) Third , in response to D’s argument that the mortgaging provisions of the Repayment Agreement, which performance is expected in Mainland, points towards an intention that Mainland law should apply, P seems to suggest that this argument is blunted by the fact that different aspects of a contract can be governed by different laws. The example given is the case of Glencore International AG v Metro Trading Inc [2001] 1 All ER (Comm) 103 at §§36-37, where it was determined that the issue of title to properties should be governed by the law of the lex situs (in that case, the law of Fujairah), while the claims based on breach of contract continue to be governed by the chosen law of contract (in that case, the law of England). 35. My analysis is as follows. (a) For reasons given in §24 above, I do not subscribe to D’s “clean break” argument. Instead, in my view, the Initial Agreement and the subsequent agreements, including the Repayment Agreement, together formed one Debt Agreement which P now sues under. (b) Following Enka , the task of the Court is to discover the governing law of the jurisdiction clause by construing it against its context and discovering the parties’ intentions; only if such intentions could not be discovered would one resort to the closest connection test. Further, in its task of construing the parties’ intention, generally an express choice of law clause applicable to the main contract will also apply to the jurisdiction clause. (c) Applying these principles, the only choice of law clause in the whole of the Debt Agreement is the one in the Initial Agreement. Originally, D did not contest P’s proposition that the choice of law clause in the Initial Agreement points to Hong Kong law. However, at the hearing, Mr Wong argued that, as the Initial Agreement also referred to the provision of security in Shanghai and provided that security should comply with both Mainland and Hong Kong laws (see §4(f) above), the phrase “當地法律” meant the law applicable to the issue at hand (which may vary depending on the issue), rather than the laws of Hong Kong where the parties were situated. (d) On balance, I am not inclined to accept Mr Wong’s argument. While it is possible for the Court to find that the parties have chosen different governing laws for different parts of the same contract (see the discussion on the doctrine of dépeçage in Enka at §38 onwards), the general assumption is that, unless there are good reasons to conclude otherwise, all terms are governed by the same law, for it avoids inconsistency and uncertainty: see Enka at §§39-40. On such basis, I accept that, if one had to choose, and given the whole context of the Initial Agreement, the reference to “當地法律” refers to Hong Kong law. (e) If so, this clause is clearly the best indication of the parties’ intentions as to the issue of governing law, and had not been superceded by any subsequent express governing law agreement (nor do I think there are sufficiently clear facts to suggest that one arises by way of necessary implication). It would follow that, applying Enka (see §29 above), the governing law of the jurisdiction clause, which is also interpretively part of the Debt Agreement, should also be Hong Kong law. (f) In this regard, one can see the counter-argument that this case is unique, in that the governing law clause and the jurisdiction clause, while interpretatively forming one whole agreement, was in fact agreed some 4 years apart. If so, it is arguable that one cannot dogmatically apply the general principle set out in Ekna . Instead, in identifying the parties’ intentions, more weight should be given to the terms contemporaneous to the jurisdiction clause, ie, terms of the Repayment Agreement (including the fact that the place of performance of a number of terms is in the Mainland, and the jurisdiction clause itself which opts for Mainland forum ), which arguably point towards the parties intending that Mainland law should apply. (g) I accept that there is strength in this argument. On balance, however, once the Court has concluded that the agreements inter se had to be construed as a whole (ie, as one Debt Agreement), and therein contains an express governing law clause, the Court would be slow to interpret that the parties have changed their minds unless such intention arises by clear (if not necessary) implication from the surrounding facts. In this regard, while some of the contractual terms contemporaneous with the jurisdiction clause has a Mainland dimension, I do not see any difficulty with them being governed by Hong Kong law – at its core, they are promises to procure the execution of mortgages over Mainland property, rather than conveyances in themselves. The fact that the core of the obligations are contractual, rather than proprietary, is also supported by D’s PRC law expert, who opined that any disputes in this case should be characterized as a “合同糾紛” rather than a property claim, ie “因不動產糾紛提起的訴訟”. I therefore take the view that these facts do not raise a clear enough indication of an intention to change the governing law, so as to require departure from the general rule. 36. I therefore take the view that Hong Kong law governs the jurisdiction clause. C-3. Issue 3 – Is the jurisdiction clause exclusive or non-exclusive? 37. It remains to apply Hong Kong law to determine whether or not the jurisdiction clause is exclusive. 38. D’s argument is as follows. (a) First, D relies on Hong Ziyun , where M Chan J followed Bank of China Ltd v Yang Fan [2016] 3 HKLRD 7 and had this to say:- “28…the key question is to construe its meaning as it would convey to a reasonable person having all the background knowledge which would reasonably have been available to the parties in the situation in which they were at the time of the contract, and having regard to the ordinary meaning of the language used. The absence of the words “exclusive”, “must”, “shall”, “應” or “須” in Chinese, is not fatal or conclusive. The test is whether the agreement obliged the Plaintiff to litigate in the chosen jurisdiction.” (b) Second, it relies upon Starlight Shipping Company v Allianz Marine & Aviation Versicherungs AG [2011] EWHC 3381 for the proposition that the Court would favour construing a clause as exclusive if the named forum in any event would have jurisdiction, for otherwise the jurisdiction clause would be otiose [§§19-23]. (c) Third, at the hearing, Mr Wong also argued that the term “有權” in the jurisdiction clause does not entail that P has the option whether to invoke it (thus making it permissive) – rather, the better interpretation is that “有權” refers to P’s right to choose between arbitration and litigation only, both being in Wuhan. There is no right for P to choose to proceed outside of Wuhan. 39. P’s main arguments, on the other hand, are as follows. (a) P’s first point is that the term of the jurisdiction clause at hand does not oblige P to litigate in the Mainland. The wording used is “有權”. This, P says, points clearly such forum clause is being permissive, rather than mandatory, vis-à-vis P. (b) P’s second point is that the jurisdiction clause is asymmetric. The right to litigate in the chosen fori in Mainland is conferred upon P only; there is no mention of D’s right to do so. Put another way, it simply provides that, should P sue in those fori , D is obliged not to object. The converse (ie, P can only sue in those fori ) is not true. This, P says, makes perfect sense as it ensures that its position as creditor is not compromised, and could, if it so chooses, enforce the Repayment Agreement in Wuhan against Jinyin, which is a Wuhan company where the properties are. 40. On balance, I prefer P’s arguments. Construing the clause against the factual matrix, I think there is considerable force for saying that since the Repayment Agreement is basically one designed to protect the interests of P as creditor, the clause was designed to protect P’s interests, by granting it a right (rather than obligation) to sue in two Mainland fori where the security was located, should it so choose. In contradistinction, there is no reason why the parties would wish to preclude P from suing in Hong Kong, where the primary obligor, D, is located. I do not think that the general principles set out in Starlight Shipping Company are very helpful, as it is not clear to me that the Wuhan Courts would in any event have jurisdiction to deal with any dispute arising out of the debt relationship between two Hong Kong parties, ie, P and D. Further, even if it were the case, I do not think this principle overrides the stronger arguments based on the interpretation of the clause against the factual matrix as set out above. 41. To conclude, therefore, I find that the jurisdiction clause is non-exclusive. 42. Finally, in case I were wrong that the jurisdiction clause ought to be governed by Hong Kong law, and that in truth, Mainland PRC law ought to apply, I would still have arrived at the same result. At the hearing, I asked Counsel to address me on the two sides’ respective PRC legal opinions (each taking a contrary view, with D’s expert opining that the clause is exclusive, and P’s expert opining the contrary) and explain to me the reasoning behind the views each expert took. Despite their best efforts, I am unable to formulate a meaningful ratio from either opinion. In such scenario, the Court is not bound to randomly choose one opinion over the other – instead, “ the Court is entitled to (and indeed must) look at the basis of legal reasoning…in determining what weight, if any, should be attached to the Opinion ”: Full Wisdom Holdings Ltd and others v Traffic Stream Infrastructure Co Ltd and others [2004] 2 HKLRD 1016 at §23. In my view, neither opinion renders useful assistance on this point, and I would therefore be left with a linguistic and common sense interpretation – and the same reasoning as per §§37-40 above would apply, with the same conclusion reached. D. Analysis – Forum 43. As noted in §16 above, if the jurisdiction clause is non-exclusive, the burden remains on D to show that the foreign forum is clearly and distinctly the more appropriate forum . The non-exclusive jurisdiction clause is one factor to be placed into the discretionary mix. 44. D’s argument on forum rests mainly on the following:- (a) The issues in dispute are whether the agreements had been performed, varied, or discharged, and should be governed by Mainland law. Further, since certain repayments were by way of transfer of Mainland properties, the validity of these transfers would also be governed by Mainland law. (b) The bulk of the performance concerns security provision and repayments, and these occurred in the Mainland. (c) The non-exclusive jurisdiction clause should be taken into account. (d) The witnesses likely reside in the PRC. 45. P’s arguments are mainly as follows. (a) Contrary to D’s submission, the agreements between the parties are governed by Hong Kong law. (b) The issues in dispute in this case do not concern the security issue. Its performance (or lack thereof) in the Mainland is neither here nor there. (c) In any event, D’s defence is incredible, and a stay will not be granted if there is no arguable defence and no real issue to be tried: Bayer Polymers Co Ltd v Industrial and Commercial Bank of China, Hong Kong Branch [2000] 1 HKC 805 at 807H-808G. 46. In my view, D is unable to satisfy the burden placed upon it and show that Wuhan is clearly and distinctly the more appropriate forum . 47. The starting point is this. In determining the issue of forum , it is trite that the Court does not simply load up connecting factors, but focus on the issues to be tried, and which forum is more convenient to try the matter. Any analysis has to start from identifying the issues . Without knowing the nature of the controversy identified with sufficient particularity, the court is not able to answer the forum question: Madison Communications Private Ltd v Le Ecosystem Technology India Private Ltd [2017] 5 HKLRD 284 at §65. 48. P’s case is simple – it seeks repayment of monies. There is no denial that such a loan once existed. It is for D, therefore, to make clear what exact issues in defence it raises. 49. Unfortunately, D’s case falls short in this regard. Its defence, set out above, is vague in the extreme. No attempt has been made to formulate them with any precision. No particulars are provided as to important allegations thereof, in particular:- (a) save for one episode cursorily mentioned in a letter dated 15 Dec 2021, there is no mention of which exact episodes of repayment are disputed; (b) there is no contemporaneous documentary support for the Guangzhou Railway loan (not a sheet of paper which shows that it even exists has been exhibited); (c) there is no mention of the persons who are said to be responsible for the Guangzhou Railway loan, and where they live; (d) there is no mention of the persons who have agreed on behalf of each party to aggregate the loan herein with the Guangzhou Railway loan, and where they live; (e) there is no mention of the person(s) who, on behalf of P, allegedly told D that it no longer intended to pursue the loans any further etc, and where they live. 50. Without this information, D cannot start to convince this Court that the case would be more suitably tried in the Courts of Wuhan, the burden being on D to show that Wuhan is clearly the more appropriate forum . 51. When I raised this point with Mr Wong, Mr Wong skillfully argued that, at this stage, the defendant has the right to keep his powder dry as to his substantive defence, relying on Lord Neuberger’s dicta in VTB Capital plc v Nutritek International Corpn and others [2013] 2 AC 337 at §§82- 90. This may well be the case – but as his Lordship went on to say at §91:- “…if the defendant chooses to say nothing, then it would be quite appropriate for the court to proceed on the basis that there is no more (and no less) to the proceedings than will be involved in the claimant making, or trying to make, out its case…” 52. This is thus a case where, given the lack of detail of the points in issue, and the likely evidence required, the Court is not in a position to find that the defendant had satisfied its burden to show that Wuhan Courts are distinctly more appropriate. Coupled with my earlier finding that Hong Kong law governs the Debt Agreement, the forum stay must therefore fail. E. Disposition 53. D’s Summons is therefore dismissed. 54. I make a costs order nisi that D shall pay P the costs of the application, to be summarily assessed and payable forthwith. If the parties do not challenge the costs order within 7 days of this decision, P shall lodge its bill within 3 days thereafter; D shall lodge its objections 3 days thereafter; and P shall respond within 2 days thereafter (if any). 55. I thank Counsel on both sides for their most able assistance. (Alexander Tang) Master of the High Court Ms Queenie Lau and Mr Danny Tang, instructed by Ng & Shum, for the Plaintiff Mr Alexsander Wong, instructed by Chong & Partners LLP, for the Defendant Look up this case on Lawcite Noteup",
  "length": 36093,
  "headers_seen": [
    "A. Introduction",
    "B. Background",
    "B-1. The Initial Agreement",
    "B-2. 1996-1998 (The Initial Extensions)",
    "B-3. 1999-2009 (The Tri-Partite Era)",
    "B-4. 2009-2020 (The Return to Bi-Partite Extensions)",
    "B-5. The Dispute Herein",
    "C. Analysis – Jurisdiction Clause – Exclusive or Non-Exclusive?"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2023/132",
  "query": "seat of arbitration",
  "ts": "2025-10-16T10:49:21",
  "ok": true
}