{
  "title": "LIAOYANG SHUNFENG IRON AND STEEL CO LTD AND ANOTHER V. YEUNG TSZ WANG AND ANOTHER | [2011] HKCFI 453 | HKLII",
  "court": null,
  "year": 2011,
  "date": "2025-01-02",
  "content": "HKLII Databases Court of First Instance [2011] HKCFI 453 LIAOYANG SHUNFENG IRON AND STEEL CO LTD AND ANOTHER V. YEUNG TSZ WANG AND ANOTHER Judgment Information Date 12 Jul, 2011 Action No. HCA1415/2010 Neutral Cit. [2011] HKCFI 453 Download MS Word Judgment Reading Options Translation Toggle Highlight Appeal History HCA1415/2010 HCA1415/2010 LIAOYANG SHUNFENG IRON AND STEEL CO LTD AND ANOTHER v. YEUNG TSZ WANG AND ANOTHER HCA 1415 / 2010 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE ACTION NO. 1415 OF 2010 __________________ BETWEEN LIAOYANG SHUNFENG IRON AND STEEL COMPANY LIMITED 1st Plaintiff (遼陽順鋒鋼鐵有限公司) HAWKINS DEVELOPMENT LIMITED 2nd Plaintiff (順勤發展有限公司) and YEUNG TSZ WANG (楊梓鈜) 1st Defendant SUNNY GROWTH ENTERPRISES GROUP LIMITED 2nd Defendant __________________ Before: Hon Au J in Chambers Date of Hearing: 16 June 2011 Date of Decision: 13 July 2011 _______________ D E C I S I O N _______________ A. Introduction 1. This is the hearing of the Plaintiffs’ Amended Summons seeking effectively an anti-suit injunction against the Defendants to restrain them from commencing any litigations in the PRC Court which cover the same or substantially the same subject matters as under a previous litigation (“the PRC Litigation”) commenced by the 2 nd Defendant in the Higher People’s Court of the Liaoning Province (“the Liaoning Court”). 2. The parties have a checkered litigation history in Hong Kong. To properly understand the Plaintiffs’ present application, it is necessary to set out the relevant background first. B. Background 3. Individuals and entities on the Plaintiffs’ side and the Defendants’ side have been engaged in at least 9 pieces of litigation (collectively “the Prior Litigations”) in Hong Kong and the PRC. 4. The major players of the Plaintiffs’ side are Wong Kam San (“Wong”), Liaoyang Shunfeng Iron and Steel Co Ltd (“Shunfeng”) [1] , Hawkins Development Ltd (“Hawkins”) [2] . Shunfeng and Hawkins are respectively the 1 st and 2 nd Plaintiff in the present action and application. 5. The major players of the Defendants’ side are Yeung Wing Keung (“Yeung”), Yeung Tsz Wang (“Yeung Jr”) (the 1 st Defendant herein), Madam Kan Sui Wan (“Kan”), who is Yeung’ sister, Yau Wai Fun and Yeung Yui Ka (Yeung’s wife and daughter), Sunny Growth Enterprises Group Ltd (“Sunny Growth”) (the 2 nd Defendant herein), Chan Che Shing (“Chan”), and Walford International Holdings Inc (“Walford”). 6. For convenience, I would in this Judgment collectively refer to the Plaintiffs’ side as the “Wong Camp” and the Defendants’ side as the “Yeung Camp”. 7. Hawkins was a Hong Kong Company and was acquired by Wong in 1996. Its only business was to hold 80% of Shunfeng. 8. Shunfeng is a Sino-foreign joint venture in the business of iron mining. Hawkins became Shunfeng’s foreign shareholder by a joint venture agreement dated 30 March 1996 between Hawkins and two PRC partners. 9. Sunny Growth is a BVI company incorporated in July 2005. Its major shareholder is Yeung Jr, and Chan is the other shareholder. 10. The Wong Camp and the Yeung Camp have since 2005 been engaged in various disputes in the fight for control of Hawkins and thus Shunfeng. 11. The disputes and fight have led to the Prior Litigations which include, amongst others, the following proceedings: (1) HCA1653/2004. (2) HCA2036/2005. (3) HCA1849/2006. (4) HCCW1083/2007. (5) HCA1083/2007 (6) HCCW215/2007. (7) (2007)遼民四初字第3號. (8) HCA155/2010. 12. In gist, the disputes over the control involve the following material allegations. 13. At various times, the total issued shares of Hawkins (100 in total) were held by Wong’s wife, Liu or Wong’s companies on trust for him. 14. Except during the period from around November 2005 to early 2007 when the Yeung Camp was in control of Hawkins and Shunfeng (in the circumstances described below), Wong was a director of Hawkins and Shunfeng’s authorized legal representative and chairman. 15. In March 2000, Wong caused the transfer of 75 of Hawkin’s issued shares to Yeung and his company. It is Wong’s case that this was done only for the purpose of carrying out the plan to list Hawkins on the GEM Board as suggested by Yeung. 16. In 2004, Wong asked for the return of the 75 shares from Yeung, who refused. On 15 July 2004, Wong commenced HCA 1653/2004 against Yeung and others in relation to these shares. After trial, on 11 April 2006, Deputy High Court Judge L Chan granted the Declaration that those shares were held on trust for Wong and an Order that they be returned to him. The learned judge also granted an injunction (“The HCA1653/04 Injunction”) to restrain the personal defendants from interfering with the business of Hawkins or the joint venture or the mining operation. This judgment was affirmed on appeal by the Court of Appeal. 17. However, when HCA 1653/2004 was in progress, Yeung procured an allotment of 9,900 Hawkins shares to his sister, Kan, in July 2005. Shortly thereafter, Kan transferred those shares to Sunny Growth. 18. On 17 October 2005, Wong commenced HCA 2036/2005 against Yeung, Kan, Sunny Growth and others seeking to set aside the said allotment and the subsequent transfer. After trial, on 11 April 2007, Lam J granted an Order that the allotment and transfer be set aside. This judgment was also later affirmed on appeal by the Court of Appeal. 19. At the same time, apparently Sunny Growth and Shungfeng entered into an investment agreement dated 28 June 2006 (“the Investment Agreement”) whereby Sunny Growth replaced Hawkins as the 80% foreign shareholder of Shunfeng by agreeing to make an investment in Shunfeng in the total sum of RMB246.82 million. By a further share transfer agreement dated 8 December 2006 (“the Share Transfer Agreement”) made between Sunny Growth and Hawkins, Hawkins effectively agreed to transfer its shareholding in Shunfeng to Sunny Growth. 20. Kan appears to be the one who had signed the Investment Agreement on behalf of Shunfeng and the Share Transfer Agreement on behalf of Hawkins. It is noted that these two documents were signed by Kan, if she is the signatory, after the HCA 1653/04 Injunction was granted against her, restraining her from interfering with the business of Hawkins or Shunfeng or the mining operation. 21. In August 2010, Sunny Growth commenced the PRC Litigation against Shunfeng, seeking (a) a declaration that the Investment Agreement is lawful and valid, (b) a declaration that Sunny Growth is the owner of 80% shareholding in Shunfeng, and (c) an order that Shunfeng pay to Sunny Growth profits in the sum of RMB103 million odd on the basis that it is the 80% shareholder of Shunfeng. 22. On 17 September 2010, Shunfeng and Hawkins (now under the control of the Wong’s Camp) commenced the action herein (i.e., HCA 1415/2010) against Yeung Jr and Sunny Growth seeking (a) an injunction against Yeung Jr and Sunny Growth from effectively continuing the PRC Litigation and commencing any other similar litigation in the PRC, and (b) a declaration that, inter alia , the Investment Agreement and the Share Transfer Agreement be null and void. 23. By a Summons dated 21.9.2010 (“the Injunction Summons”) taken out under this action, Hawkins and Shunfeng sought an interlocutory injunction to restrain Sunny Growth from proceeding (and Yeung Jr from causing Sunny Growth to proceed) with the PRC Litigation. 24. On 30 September 2010, at an inter parte hearing, the Court ordered, by consent, that Yeung Jr and Sunny Growth be restrained, until the final determination of the Injunction Summons, from, amongst others, applying for an asset preservation order in the PRC Court which would obstruct or impede Shunfeng’s application to renew its mining licence. 25. However, on 7 December 2010, the Liaoning Court dismissed the PRC Litigation on the basis that: (1) The person who purported to be Sunny Growth’s attorney and signed the Writ for the PRC Litigation as appointed by Yeung Jr in fact had no authority to commence the action on behalf of Sunny Growth. (2) Yeung Jr, being Sunny Growth’s sole director, informed the Liaoning Court that the issue of the Writ in the PRC Litigation did not reflect Sunny Growth’s real intention at that time. 26. After the dismissal of the PRC Litigation on the above grounds, and upon the Plaintiffs’ inquiry, the Defendants effectively indicated that they intended to commence a fresh action in the PRC Court for the same or similar reliefs as sought under the PRC Litigation. 27. On 6 January 2010, the parties appeared at the substantive hearing of the Injunction Summons before Deputy High Court Judge Au-Yeung. In light of the above dismissal of the PRC Litigation and the Defendants’ indication to commence fresh proceedings in the PRC, the learned Judge granted leave to the Plaintiffs to amend the Injunction Summons to instead seek an order to restrain Sunny Growth from commencing (and Yeung Jr from causing Sunny Growth to commence) any other litigation in the PRC Court which cover the same or substantially the same subject matters as the PRC Litigation. The hearing of this Amended Injunction Summons was then further adjourned upon the Defendants’ undertaking not to commence any other such litigation in the PRC Courts until its final determination. 28. This is now the substantive hearing of the Amended Injunction Summons. C. The present application C1 The applicable principles 29. After hearing submissions from the parties and looking at the relevant authorities cited before me, I accept that in considering whether or not to grant an anti-suit injunction, the following legal principles apply. These are principally taken from the skeleton submissions of Mr Ng, SC (for the Plaintiffs) and Ms Wong, SC (for the Defendants). 30. In the absence of special circumstances, a person has no right not to be sued in a particular form, whether foreign or domestic [3] . 31. The fundamental principle is that the jurisdiction to grant an anti-suit injunction is to be exercised only when “ the ends of justice requires it ”, and it must be so exercised “ with caution ”. Comity is an important consideration, which requires that the Hong Kong Court should have a sufficient interest in, or connection with, the matter in question to justify the indirect interference with the foreign Court [4] . 32. The power to grant the injunction is dependent on there being wrongful conduct on the party to be restrained of which the applicant is entitled to complain and has a legitimate interest in seeking to prevent by which must make it necessary to make the order [5] . 33. In relation to these: (1) There is wrongful or unconscionable conduct of the party to be restrained if such conduct amounts to vexation and oppression. (2) At the same time, (where the foreign suit is not in breach of an exclusive jurisdiction clause) the applicant’s said legitimate interest should be the existence of proceedings in Hong Kong and the defendant has in bad faith commenced proceedings in another jurisdiction for the purpose of frustrating and obstructing the Hong Kong proceedings. For these purposes: (a) The applicant must be a party to the existing local litigation (other than the application to the local court for the injunction) at which the wrongful conduct of the party to be restrained is directed. (b) The applicant also has to show a “clear need to protect [local] proceedings”, and such a need may arise where the Court is satisfied that it is necessary to make a restraining order to protect the legitimate interest of the application in the local action [6] . 34. Further, before granting the injunction, the applicant must show, and the Court also has to conclude that: (1) Hong Kong provides the natural forum for the trial of the dispute, to whose jurisdiction the parties are amenable; and (2) Justice does not require that the action should nevertheless be allowed to proceed in the foreign court [7] . 35. In assessing and balancing the end of justice, the Court should take into account not only of injustice to the applicant if the party to be restrained is allowed to pursue the foreign proceedings, but also of injustice to the party to be restrained if he is not allowed to do so. The court will not grant an injunction if, by doing so, it will deprive the plaintiff of advantages in the foreign forum of which it would be unjust to so deprive him [8] . 36. Bearing and applying these principles, I would now turn to consider the Plaintiffs’ application. C. 2 The Plaintiffs’ grounds in summary 37. As pursued at the hearing, the Plaintiffs say the anti-suit injunction sought should be granted because: (1) The PRC Litigation has been brought in bad faith and is unconscionable, vexatious and oppressive, as the purpose of Sunny Growth in instituting it is to forcibly take over Shunfeng from Hawkins (or to undermine Shunfeng’s mining business). (2) The ant-suit injunction is thus necessary: (a) To protect the Plaintiffs’ legitimate legal and economic interests from wrongful interference by Yeung Jr and Sunny Growth; (b) To prevent Yeung Jr and Sunny Growth from continuing to assist a breach of the HCA1653/04 Injunction. (c) To protect the Plaintiffs from further vexatious litigation in the PRC based on the same subject matter. C3. Discussion C3.1 Defendants’ wrongful conduct in bringing the PRC Litigation 38. Mr Ng, leading counsel for the Plaintiffs, submits that the PRC Litigation was brought in bad faith and is unconscionable, vexatious and oppressive because it is clearly without merits. This applies equally (Mr Ng further says) to any other intended litigation to be issued in the PRC for the same subject matter. 39. Although he sets out in his skeleton submissions helpfully three bases why the PRC claims are without merits, Mr Ng focuses (I think fairly so) on only one of these grounds at the hearing. I will thus only deal with this basis in this part of the Decision [9] . 40. Mr Ng says central to the PRC claims is for Sunny Growth to prove that it has in accordance with the Investment Agreement (which the Plaintiffs in any event disputes its authenticity or validity) invested funds totalling US$800,000 and HK$32,460,110.00 into Shunfeng as capital. For this, Sunny Growth seeks to rely on 11 remittance slips dated between 22 June and 8 December 2006 to show that it had done so. 41. However, through the evidence filed for the present purpose in the present action, the Plaintiffs have shown a strong case that these 11 remittance slips have been used by the Defendants or the Yeung Group at different litigations under the Prior Litigations to support drastically different cases. These cases cannot all be correct. In particular, as Mr Ng points out, even in the defence filed in the latest action [10] between the two camps as late as 12 May 2011, it is suggested [11] that these funds or part of these funds were made by Sunny Growth to Hawkins as loans (as opposed to investment in Shunfeng). 42. Mr Ng describes this as the “recycling” of the same evidence, which is clearly unreliable. He therefore submits that the Defendants’ claims in the PRC Litigation is entirely without merits and bound to fail. The claims are therefore clearly brought in bad faith, vexatious and oppressive. This applies with equal force to any fresh actions intended to be brought by the Defendants for the same purpose. 43. Mr Ng has mounted a powerful argument. However, with respect, I do not think on this basis alone I could conclude summarily at this stage that the Defendants’ claims are bound to fail in the PRC Courts. In particular, the mere fact that the 11 remittance slips have been used in previous litigations to support different cases does not per se mean that the way they are now used in the PRC Litigation must be the failed or wrong one. 44. The Court cannot and should not, for the present purpose at interlocutory stage, engage in a mini-trial of this issue based on the affirmation evidence. Whether the Defendants could eventually rely on these 11 remittance slips to support their case of investment in Shunfeng has to be left to trial, if any, after proper cross-examination of the witnesses. 45. I therefore do not accept that the Plaintiffs have demonstrated that it is a wrongful conduct on the part of the Defendants in bringing the PRC Litigation or any further litigation in the PRC Courts concerning the same subject matter of the PRC Litigation. 46. On this ground alone, I would refuse to grant the anti-suit injunction as sought. C3 .2 Whether the Plaintiffs have a legitimate interest that needs and ought to be protected by the anti-suit injunction 47. Given my above conclusion, I would only deal with this question briefly for completeness as follows. 48. In my view, the Plaintiffs have also failed to show that it has a legitimate interest that needs and ought to be protected by the grant of the anti-suit injunction as sought. 49. The Plaintiffs say the intended PRC action would assist a breach of the HCA1653/04 Injunction, thus amount to interference of that local proceedings which the Plaintiffs have a legitimate interest to be protected. 50. But this is incorrect. The Plaintiffs herein are not parties to the HCA1653/04 action. Applying the principles I have set out above at paragraph 33(2), the Plaintiffs could not show (for the purpose of seeking an anti-suit injunction) that they have the necessary and relevant legitimate interest under the HCA1653/04 that prima facie needs to be protected from being interfered with. Looking at it in another way, the Plaintiffs could not have themselves enforced the HCA1653/04 Injunction as they are not parties to it. It is difficult to see how then they could claim that they have a legitimate interest in that injunction that warrants a protection by an anti-suit injunction. 51. Seeing the difficulty he has to overcome by relying on the HCA1653/04 action as the local proceedings to show the necessary legitimate interest, Mr Ng submits alternatively that it is the present action (i.e., HCA 1415/2010) which would be frustrated and obstructed by the intended PRC litigation. As such, the Plaintiffs have a legitimate interest in this local action that needs to be protected by way of the anti-suit injunction. 52. I am equally not persuaded by this argument. 53. I accept the submissions of Ms Wong, leading counsel for the Defendants, that the fallacy of this argument is that it cannot be shown that the intended PRC action is to be issued for the purpose of obstructing or frustrating HCA1415/2010. This is so for the simple reason that HCA1415/2010 was issued after the PRC Litigation. As such, it could not be in any way shown that at the time when the PRC Litigation was issued, it was for the purpose of the obstructing or frustrating the not yet issued HCA1415/2010. When the PRC Litigation was subsequently dismissed for technical reasons, and the Defendants now intend to issue a fresh action for the same or substantially the same subject matter as claimed under the PRC Litigation, the Defendants are only seeking to continue to claim what they have already been claiming under the original PRC Litigation. This alone, and without more, could not per se found or support a purpose on the part of the Defendants to frustrate or obstruct the HCA1415/2010 action by issuing the new PRC action. 54. For these reasons, I would also have concluded that the Plaintiffs have failed to show a legitimate interest that needs and ought to be protected by the anti-suit injunction as sought, and refused to grant it. D. Conclusion 55. The Plaintiffs have failed to show that this is an appropriate case to grant the injunction as sought. I would dismiss the application. 56. I further make an order nisi that costs of the application be to the Defendants, to be taxed if not agreed, with certificate for two counsel. Unless any of the parties applies to vary it by Summons, the costs order nisi shall become absolute 14 days from today. 57. Lastly, I thank counsel for their helpful assistance. (Thomas Au) Judge of the Court of First Instance High Court Mr. Peter K.F. NG S.C., leading Ms. Elizabeth Y. CHEUNG & Mr. Eric H.H. CHOW, instructed by Messrs C.L. Chow & Macksion Chan, for the 1 st & 2 nd Plaintiffs. Ms. Lisa K.Y. WONG S.C., leading Mr. Calvin Y.C. CHEUK, instructed by Messrs Li & Partners, for the 1 st & 2 nd Defendants. [1] A Sino-foreign joint venture in the business of iron mining. [2] A Hong Kong company. [3] Turner v Grovit [2002] 1 WLR 107 (HL) at para 25 per Lord Hobhouse. [4] SNI Aerospatiale v Lee [1987] AC 871 (PC) at 892A-F per Lord Goff; Airbus Industries GIE v Patel [1999] 1 AC 119 at 133D-G and 138G-139F per Lord Goff. [5] Turner v Grovit , supra, at para 27 per Lord Hobhouse. [6] See: Turner v Grovit , supra, at paras 27-29 per Lord Hobhouse; Worth Achieve Associates Ltd v Huang Sheng Yi [2007] 3 HKLRD 797 at paras 51-52, 57 per Lam J; SNI Aerospatiale , supra, at 892A-F, 893E-894D, 896F-H, 899E-F. [7] SNI Aerospatiale , supra, at 895D-E and 896F-G. [8] SNI Aerospatiale , supra, at 892A-B, 895G-H and 896G-H per Lord Goff. [9] The other two bases are that (a) the Investment Agreement, the Share Agreement and some of the minutes used and relied on by Sunny Growth in support of the PRC claims are dubious in nature in light of the history of the matters and the disputes between the parties, and (b) these documents are in any event of dubious legality. If needed, in my view, notwithstanding those submissions made by the Plaintiffs in the skeleton, the Court could not at this stage conclude summarily that these documents are either not authentic or invalid as submitted. [10] HCA468/2011. [11] At paragraph 7(2) of the Defence. Please refer to CACV234/2011 for the relevant appeal(s) to the Court of Appeal. Look up this case on Lawcite Noteup",
  "length": 21855,
  "headers_seen": [
    "A. Introduction",
    "B. Background",
    "C. The present application",
    "C1 The applicable principles",
    "C. 2 The Plaintiffs’ grounds in summary",
    "C3. Discussion",
    "C3.1 Defendants’ wrongful conduct in bringing the PRC Litigation",
    "D. Conclusion"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2011/453",
  "query": "anti-suit injunction",
  "ts": "2025-10-16T10:47:20",
  "ok": true
}