{
  "title": "SEA POWERFUL II SPECIAL MARITIME ENTERPRISES (ENE) V. BANK OF CHINA LTD | [2016] HKCFI 39 | HKLII",
  "court": null,
  "year": 2016,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2016] HKCFI 39 SEA POWERFUL II SPECIAL MARITIME ENTERPRISES (ENE) V. BANK OF CHINA LTD Judgment Information Date 11 Jan, 2016 Action No. HCMP2399/2015 Neutral Cit. [2016] HKCFI 39 Parallel Cit. [2016] 1 HKLRD 1032 [2016] 2 HKC 566 Download MS Word Judgment Corrigendum Reading Options Translation Toggle Highlight Appeal History HCMP2399/2015 HCMP 2399/2015 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE MISCELLANEOUS PROCEEDINGS NO. 2399 OF 2015 ___________________ BETWEEN SEA POWERFUL II SPECIAL MARITIME ENTERPRISES (ENE) Plaintiff and BANK OF CHINA LIMITED Defendant __________________ Before: Hon Anthony Chan J in Court Date of Hearing: 15 and 28 December 2015 Date of Judgment: 12 January 2016 ____________________ CORRIGENDUM ____________________ Please note the following correction in the Judgment handed down on 12 January 2016:- (1) Page 10, paragraph 28, 3 rd line, “alone” should read “along”. Dated this 26 th day of February 2016 (Gladys CHENG) Clerk to Hon Anthony Chan, J HCMP2399/2015 SEA POWERFUL II SPECIAL MARITIME ENTERPRISES (ENE) v. BANK OF CHINA LTD HCMP 2399/2015 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE MISCELLANEOUS PROCEEDINGS NO. 2399 OF 2015 ___________________ BETWEEN SEA POWERFUL II SPECIAL MARITIME ENTERPRISES (ENE) Plaintiff and BANK OF CHINA LIMITED Defendant __________________ Before: Hon Anthony Chan J in Court Date of Hearing: 15 and 28 December 2015 Date of Judgment: 12 January 2016 ________________ J U D G M E N T ________________ 1. By an Originating Summons dated 25 September 2015 (“OS”), the plaintiff applies for an anti-suit injunction against the defendant restraining the latter from continuing proceedings commenced in the Qingdao Maritime Court (“Mainland Proceedings”) against the former in breach of an arbitration clause. 2. In support of its application, the plaintiff relies on the 1 st affidavit of Ms Day, one of its solicitors, and the affirmation of Mr Shen, one of its Mainland legal representatives. In opposition, the defendant relies on the affirmation of Mr Wang, one of its Mainland legal representatives, and the Affirmation of Mr Zhang, a Mainland legal academic. I shall have to say a few words below about the source of the evidence in this case. Background 3. There is little factual dispute in this case. As the owner of the vessel MV Zagora (“Vessel”), the plaintiff entered into a contract of carriage, as contained in a bill of lading (“B/L”) dated 14 December 2013. The defendant’s undisputed case is that it has become the lawful holder of the B/L [1] and thereby assumed all rights and liabilities under the same. 4. On the face of the B/L, it was stated as follows : (a) “TO BE USED WITH CHARTER-PARTIES”; (b) “Freight payable as per Charter Party 19 Nov 2013”; (c) “FOR CONDITIONS OF CARRIAGE SEE OVERLEAF”. 5. On the back of the B/L, it was expressly provided under Conditions of Carriage : “(1) Terms and Conditions. All terms and conditions, liberties and exceptions of the Charter Party, dated as overleaf, including the law and Arbitration Clause, are herewith incorporated. (2) General Paramount Clause. The Hague Rules … dated Brussels the 25 th August 1925 as enacted in the country of shipment, shall apply to this Bill of Lading ….” 6. Under clause 54 of the Charter Party dated 19 November 2013 [2] (“C/P”), the arbitration clause (which included a choice of law), stated as follows : “Any dispute arising out of this Charter Party or any Bill of Lading issued hereunder shall be referred to arbitration in Hong Kong … English law shall apply. … Any claim must be made in writing and the claimant’s arbitrator nominated within twelve months of the final discharge of the cargo under this Charter Party, failing which any such claim shall be deemed to be waived and absolutely barred .” [emphasis added] 7. The cargo in question (71,650 mt of hematite ore lump) was shipped from Western Australia and was fully discharged from the Vessel on 31 December 2013 at Lanshan Port in the Mainland. According to the arbitration clause in question (“Clause”), the limitation period (“Limitation Period”) for the institution of arbitration expired on 30 December 2014. 8. In respect of the Mainland Proceedings, the Vessel was arrested on 29 August 2014, and released on 24 September 2014 after security by way of a bank guarantee (“Guarantee”) was put up by the plaintiff in place of the Vessel. In dealing with the release of the Vessel, the plaintiff had acted via its Mainland lawyers. It is uncontroversial that the arrest procedure was a different set of proceedings from the Mainland Proceedings which followed. 9. A statement of claim (“SOC”) for the Mainland Proceedings, a claim for wrongful discharge of cargo, was issued on 15th September 2014 prior to the release of the Vessel. This constituted the commencement of the Mainland Proceedings. However, it was only served on the plaintiff on 13th May 2015 (a delay of 8 months). It will be seen below that one of the disputes here is the alleged delay on the part of the plaintiff in connection with the Mainland Proceedings. I will flesh out the details below. 10. There was a confirmation letter (“Letter”) issued by the plaintiff to the defendant on 9 January 2015 confirming that the Vessel was not under any bareboat charter at the material time. There is no evidence as to why there was such a letter. However, it appears that the confirmation was actually made to the Qingdao Maritime Court (“QMC”) (quoting the case number of the Mainland Proceedings), and it was signed by the plaintiff as the defendant in that action. This Letter is mentioned because of the reliance placed on it by the defendant, which will be addressed below. 11. The plaintiff applied to challenge the jurisdiction of the QMC on 5 June 2015 based on the Clause. On 19 June 2015, Mr Wang was informed by the QMC about the jurisdictional challenge. It was the first time that Mr Wang and his firm were, to their surprise, made aware of such a challenge. Although there is no evidence from the defendant as to when it had knowledge of the challenge, the reasonable inference is that it would not have such knowledge before Mr Wang learned of it. 12. The jurisdictional challenge was rejected by the QMC on 29 June 2015. It appears from the evidence that, under Mainland law, an arbitration clause would only be validly incorporated into a contract if it is clearly stated on the front side of the contract. The B/L does not meet that requirement. An appeal was lodged on 12 August 2015 by the plaintiff with the Shandong Higher People’s Court in respect of the rejection. That appeal was also rejected on 6 November 2015, after the filing of the OS. Service of the Mainland Proceedings 13. After the acceptance of the defendant’s case by the QMC (this was a specific step in the Mainland civil procedure which involved an examination by the court of the viability of the claim), a hearing was fixed to take place on 7 November 2014. Under Mainland law, service of the SOC (together with related papers) had to be executed by the QMC. The unsuccessful attempts to serve the papers on the plaintiff may be summarised as follows : (a) The QMC tried to serve the SOC and other documents [3] on the plaintiff by post to its registered office in Greece. The documents were returned because, allegedly, there was no such company at the address; (b) As a consequence of the failure to serve the papers on the plaintiff, the hearing on 7 November 2014 had to be cancelled; (c) The QMC then contacted the plaintiff’s Mainland lawyers, who claimed that they had no authority to acknowledge service for the plaintiff; (d) The defendant’s Mainland lawyers also contacted those lawyers repeatedly and were given the same answer; (e) Finally, the QMC had to resort to service by way of public announcement on 3 April 2015; (f) A receipt of service was signed by a representative of the plaintiff on 13 May 2015 thereby formally acknowledging service of documents by the QMC. 14. It is common ground that the plaintiff has not taken any substantive step or submitted to the jurisdiction of the QMC. General legal principles 15. There is no dispute on the legal principles generally applied in an application of the present type, which have been summarised by G Lam J in Ever Judger Holding Co Ltd v Kroman Celik Sanayii Anonim Sirketi [2015] 2 HKLRD 866 at 887, §45 : “It is clear, therefore, as a matter of Hong Kong law that the court in this jurisdiction should ordinarily grant an injunction to restrain the pursuit of foreign proceedings brought in breach of an agreement for Hong Kong arbitration, at any rate where the injunction has been sought without delay and the foreign proceedings are not too far advanced , unless the defendant can demonstrate strong reason to the contrary.” [emphasis added] The issues 16. Mr Sussex SC, who appeared for the plaintiff with Mr Chain, was critical of the “throwing-the-kitchen-sink” approach of the defendant in respect of the number of arguments raised to resist this application regardless of their merits. I am inclined to agree with Mr Sussex. However, the scope of the arguments has been narrowed down at the hearing and are as follows : (a) Whether the Clause had been validly incorporated into the B/L; (b) Whether the injunction should be refused because of : (i) culpable delay on the part of the plaintiff; (ii) comity consideration; (iii) serious prejudice to the defendant by reason of the expiration of the Limitation Period and the loss of security (the Guarantee). 17. The resolution of the above requires the determination of 2 factual issues, namely, whether the plaintiff had deliberately evaded the service of the Mainland Proceedings and whether the defendant had acted reasonably in failing to preserve its right to sue in the contractual forum within the Limitation Period. Incorporation of the Clause 18. With respect, I agree with Mr Sussex that it is quite clear that, in the circumstances of this case, the B/L had validly incorporated the Clause. 19. When deciding whether a choice of law and arbitration clause has been incorporated into a contract, under Hong Kong conflicts rules, Hong Kong courts will regard the chosen law as the applicable law. I have been referred by Mr Sussex to, and I agree with, the dicta of HH Deputy Judge S Chan in Tung Ho Wah v Star Cruises (HK) Ltd [2006] 3 HKLRD 254 at 260D-E, §21 : “As a general rule, issues on the “material validity” of a contract or of any term of a contract, such as formation of the agreement or incorporation of terms, are determined by the putative applicable law of the contract, viz the law which would govern the contract if the contract or term were valid.” See also: The “Parouth” [1982] 2 Lloyd’s Rep 351 at 353 per Ackner LJ; and The “Atlantic Emperor” [1989] 1 Lloyd’s Rep 548 at 554 per Lloyd LJ. 20. In the present case, as the Clause specified the application of English law, English law is the putative applicable law. Under Hong Kong conflicts rules, English law is therefore applicable to the question of whether the Clause was incorporated into the B/L. 21. There is no suggestion of any material difference between English law and Hong Kong law. Therefore, the presumption that the two are the same applies. Indeed, there is often little difference between nations in commercial laws: Muduroglu Ltd v TC Ziraat Bankasi [1986] 1 QB 1225 at 1246B-C per Mustill LJ. 22. It is trite that an express reference to a choice of law and arbitration clause is sufficient for those clauses to be incorporated: The Rena K [1979] 1 QB 377 at 390F-391C per Brandon J; The “Delos” [2001] 1 Lloyd’s Rep 703 at 705-706 per Langley J. 23. In this case, the B/L’s express reference to the “law and Arbitration Clause” of the C/P being incorporated means that the Clause had indeed been validly incorporated into the B/L. Evasion of service 24. Next, I need to resolve the factual issues identified in para 17 above. Firstly, the defendant says that the plaintiff had deliberately evaded service of the Mainland Proceedings on it so that the Limitation Period would expire before any action would be taken by the defendant. 25. The plaintiff’s conduct was strongly criticised by the defendant. Appearing for the defendant with Mr Lam, Mr Wong SC contends that during the 8 months between the commencement of the Mainland Proceedings (September 2014) and the successful service of the same on the plaintiff (May 2015) no mention was ever made by the plaintiff or its lawyers of the Clause, no objection was raised with the institution of the Mainland Proceedings in breach of the Clause, and no suggestion was made of any application for anti-suit injunction. 26. The plaintiff’s conduct has to be viewed in light of the fact that it had instructed lawyers to negotiate with the defendant and its lawyers to secure the release of the Vessel. The Guarantee was provided on 23 September 2014, after the SOC had been filed. It should be noted that in the Ruling by the QMC on the defendant’s application to arrest the Vessel dated 27 August 2014, it was provided that the defendant should commence proceedings before the QMC within 30 days, failing which the arrest order would be lifted [4] . 27. Further, Mr Wong was at pains to stress that the Letter (dated 9 January 2015) referred to the Mainland Proceedings by its case number and the plaintiff referred to itself as “defendant” in that document. 28. In the premises, the plaintiff must have been well aware of the commencement of the Mainland Proceedings, and it was legally advised all alone. Mr Wong submitted that during the 8 months in question, the plaintiff deliberately refrained from authorizing its lawyers to accept service, until May 2015 when it could no longer evade service in light of the service by public announcement. 29. Mr Wong further argued that the plaintiff’s conduct had induced the defendant to believe that no jurisdictional challenge would be raised. Had the plaintiff raised the issue of the Clause or anti-suit injunction after the commencement of the Mainland Proceedings, the defendant could have taken steps to protect itself against the expiration of the Limitation Period, eg, by serving a notice of arbitration on the plaintiff. 30. As to why the plaintiff had failed to authorize its Mainland lawyers to accept service for 8 months, the only answer, provided by Mr Shen, is this : “The Sub-Charter Party was signed by Oldendorff Carriers, which (through its associated company Olderdorff) in turn entered into a Head Charter Party with the Plaintiff’s agent. In the circumstances, the Plaintiff needed to liaise with Olderdorff as to which party should deal with the dispute and, for this purpose, to gain an understanding of the dispute. This explains why it took time to file necessary documents. [5] ” 31. It is not easy to understand the evidence. It is common ground that the parties to the B/L were the plaintiff and the shipper of the Cargo, who was superseded by the defendant. Further, the Vessel was arrested and released. Hence, the plaintiff had been dealing with the dispute and must have a fair understanding of what it was about. I agree with Mr Wong that the lack of any documentary evidence in support of the alleged liaison with Oldendorff further exposes the weakness of this evidence. 32. Moreover, this evidence fails to comply with O 41, r 5 in that the factual contents of an affidavit should come from a deponent with personal knowledge of the same (subject to exceptions which are irrelevant for the present purpose). This evidence came from the plaintiff’s Mainland lawyer and, prima facie , it falls foul of O 41, r 5. 33. In the premises, I place no weight on the purported explanation for the failure by the plaintiff to accept service of the SOC. I believe that the evidence before the court strongly supports the inferences that the plaintiff was evading service and waiting for the Limitation Period to expire, which was the only motive for the delay. Limitation Period 34. The defendant’s evidence that it did not have a copy of the C/P and therefore was unaware of the Clause is not disputed. However, I agree with Mr Sussex that the defendant would have seen that the terms and conditions on the back of the B/L expressly incorporated a choice of law and arbitration clause [6] . Yet it took no step to obtain a copy of the C/P to ascertain the position, and as a result did not become aware of the Clause until June 2015 when the plaintiff challenged jurisdiction for the first time in the Mainland Proceedings. In these circumstances, it is difficult to be sympathetic to the defendant’s failure to protect itself against the expiration of the Limitation Period. 35. In The “Skier Star” [2008] 1 Lloyds Rep 652 at 657-658, §§49-51 per Teare J, it was held that a time bar defence can only be a factor against the grant of an anti-suit injunction if it can be shown that a party acted reasonably in not protecting its claim in the contractual forum. 36. The facts of The Skier Star , where it was held that the cargo interests had failed to act reasonably, closely mirror the present case. In that case, the alleged wrongful discharge of cargo took place in January 2005. Belgian proceedings were commenced in February 2005, and the 1 year limitation period under the Hague-Visby Rules expired in January 2006. Under Belgian law, the London arbitration clause would not have been binding on the cargo interests. Therefore, the cargo interests did not take any step to obtain a copy of the charter party. It was not until November 2007 when the ship owners mentioned the arbitration clause that the cargo interests became aware of it. 37. In that context, the learned Judge held at §51 that : “…the cargo interests were unaware of the London arbitration clause until November 2007 and … that was because they did not have a copy of the charter party. In those circumstances the cargo interests are unable to show that they acted reasonably in not protecting their cargo claim in the contractual forum. It follows that the presence of a time bar defence in the London arbitration cannot amount to a reason, let alone a “strong cause or good reason”, to refuse an anti-suit injunction.” 38. I respectfully agree with Teare J and likewise hold that the defendant had failed to act reasonably in failing to preserve its right to sue in the contractual forum. Delay 39. There is a dispute whether delay can be a free-standing argument which militates against the grant of an anti-suit injunction. Unsurprisingly, Mr Wong argued that it is, whereas Mr Sussex’s argument is that delay is actually irrelevant as long as the plaintiff has not taken any substantive step in or submitted to jurisdiction in the Mainland Proceedings. 40. The parties are in agreement that the fountain head of the applicable legal principles is the English Court of Appeal authority of The “Angelic Grace” [1995] 1 Lloyd’s Rep 87. In particular, at 96 where Millet LJ (as he then was), after referring to the danger of giving an appearance of undue interference with the proceedings of a foreign court, said : “In my judgment, where an injunction is sought to restrain a party from proceeding in a foreign Court in breach of an arbitration agreement governed by English law, the English Court need feel no diffidence in granting the injunction, provided that it is sought promptly and before the foreign proceedings are too far advanced. I see no difference in principle between an injunction to restrain proceedings in breach of an arbitration clause and one to restrain proceedings in breach of an exclusive jurisdiction clause as in Continental Bank N.A. v Aeakos Compania Naviera S.A. , [1994] 1 W.L.R. 588. The justification for the grant of the injunction in either case is that without it the plaintiff will be deprived of its contractual rights in a situation in which damages are manifestly an inadequate remedy. The jurisdiction is, of course, discretionary and is not exercised as a matter of course, but good reason needs to be shown why it should not be exercised in any given case.” 41. Relying upon a recent authority of Essar Shipping Ltd v Bank of China Ltd [2015] EWHC 3266 (Comm) at §42, per Walker J, Mr Wong submitted that the 2 provisos, namely, “that the injunction is sought promptly” and “that the foreign proceedings are not too far advanced” are two separate and cumulative provisos. 42. Also in reliance of Essar Shipping (§§42-43), and Ecobank Transnational Incorporated v Tanoh [2015] EWHC 1874 (Comm) at §§23-24, per Knowles J, Mr Wong submitted that delay alone, without detriment or prejudice, may be a sufficient ground for refusing an anti-suit injunction. I need only refer to Essar Shipping , at §§42-43 : “42. ESL submitted that in the passage cited in section C above Millett LJ identified two provisos that are related. What is important in my view is that they are cumulative provisos: the court need feel no diffidence provided that the injunction is sought promptly and provided that, even if the application cannot be criticised for lack of promptness, the foreign proceedings are not too far advanced. In my view there can be no doubt that lack of promptness alone may justify refusal of an anti-suit injunction. In this regard the bank drew attention to the decision of Knowles J in Ecobank Transnational Incorporated v Tanoh [2015] EWHC 1874 (Comm). In that case a submission that delay does not include periods when jurisdiction was challenged in the foreign court was rejected, as was a submission that delay alone (without detrimental reliance) would not suffice. At paragraphs 21 to 24 Knowles J said: 21. However Mr Coleman, for Ecobank, submits that delay does not include any period during which the applicant sought to challenge the jurisdiction of a foreign court and the period pending the foreign court’s decision on that challenge. 22. I cannot accept that proposition. Leggatt LJ in The Angelic Grace (above, at 95) described graphically the “reverse of comity” were the English court “to adopt the attitude that if [a foreign court] declines jurisdiction, that would meet with the approval of the English court, whereas if [the foreign court] assumed jurisdiction, the English court would then consider whether at that stage to intervene by injunction”. As Christopher Clarke J said in Transfield Shipping Inc v Chiping Xinfa Huayu Alumina Co Ltd [2009] EWHC 3629 at [78] “… comity, which involves respect for the operation of different legal systems, calls for challenges … to be made promptly in whatever is the appropriate court”. … … 23. Mr Coleman sought to draw on a separate discussion of (the defence of) laches in Fisher v Brooker and another [2009] 1 WLR 1764 ; [2009] UKHL 41 at [64], to develop the proposition that delay alone was not sufficient to deny an applicant for an anti-suit or anti-enforcement injunction because detrimental reliance upon the delay must (he submitted) also be shown. 24. I am not able to accept that proposition. It is not supported by authority in the area under consideration, and as a matter of principle it would unnecessarily restrict the approach of the courts. The position is best left that the presence of detrimental reliance may be a relevant circumstance to be taken into consideration, but it is not an essential condition to the preparedness of the courts to uphold or decline to uphold an arbitration agreement (or other jurisdiction clause) ….’ 43. It was suggested in argument by ESL that Ecobank could be distinguished because it concerned an anti-enforcement injunction rather than an anti-suit injunction. It is clear, however, that Knowles J was treating the relevant principles in enforcement cases as being at least no less onerous than those identified in Angelic Grace . Moreover, I consider that the approach adopted by Knowles J is supported by strong public interests in requiring that those who seek an anti-suit or anti-enforcement injunction should act promptly even though, on the facts of a particular case, there has been no detrimental reliance upon the delay. That does not mean that parties much rush to court prematurely. The starting point is that it generally desirable to resolve issues speedily. Moreover, there are significant dangers to the interests of the parties and to the public interest if applications for coercive relief are delayed. If such applications are made promptly they are inherently likely to be much less complicated than will be the case at a later stage. Where a party seeking coercive relief does not act promptly, the other side is likely to be understandably aggrieved by the delay. An anti-suit injunction is a particularly intrusive form of relief, barring a party from access to justice in the forum that it would prefer. In the particular context of anti-suit and anti-enforcement injunctions, lack of promptness will increase the danger that such injunctions, although they are granted against a party and are not directed to the foreign court, will nevertheless be seen as inappropriately interfering with the jurisdiction of the foreign court.” 43. In the best tradition of the Bar, Mr Sussex has referred this court to the Court of Appeal decision in Ecobank Transnational Inc v Tanoh [2015] EWCA Civ 1309 . I agree with Mr Wong that this authority is supportive of his contention that delay is a free-standing argument. At §127, Clarke LJ (whose judgment was agreed by Patten LJ and The Chancellor) held : “I agree with the judge [24] that it is not a precondition to the refusal of an injunction that the respondent should establish detrimental reliance, if by that is meant that he must show (a) that he believed that no application for an injunction would be made or (b) that he believed that and, if he had realised that an application would or might be made, he would have abandoned the foreign proceedings. The existence or otherwise of such reliance is relevant but not determinative. The relevance of delay is wider than that. The need to avoid it arises for a variety of reasons including the avoidance of prejudice, detriment, and waste of resources; the need for finality; and considerations of comity.” 44. The above dicta is supportive of those of Walker J in Essar Shipping , §43, concerning the “strong public interests” in prompt action by the applicant of an anti-suit injunction (see also the Court of Appeal judgment in Ecobank , §§93, 94, 100, 120, 122, 125-130, 132-135 and 137). I respectfully agree. 45. It appears from the above authorities that there are 2 reasons for the court to take into account the promptness with which an anti-suit injunction application is made, namely, discretionary considerations (the court is asked to invoke its equitable jurisdiction) and comity considerations (see Ecobank , CA, §137). 46. Mr Sussex submitted that Essar Shipping was incorrectly decided in respect of the proposition that time-based promptness is a stand-alone requirement, and he sought to distinguish Ecobank on the basis that it was concerned with anti-enforcement injunctions. I believe that such arguments cannot stand in light of the Court of Appeal judgment in Ecobank. 47. Mr Sussex argued that the law on anti-suit injunction should be consistent with that which governs the granting of a stay in favour of arbitration where there is an arbitration clause. A stay in favour of arbitration is mandatory under s.20 of the Arbitration Ordinance , Cap 609 , subject to the only condition that the stay request must be made by a party “not later than when submitting his first statement on the substance of the dispute”. 48. Anti-suit injunctions and stays in favour of arbitration are essentially 2 sides of the same coin : see AES Ust-Kamenogorsk Hydropower Plant LLP v Ust-Kamenogorsk Hydropower Plant JSC [2013] 1 WLR 1889 at 1897G-H, per Lord Mance. Consistent with the law on stay, the court should hold that delay or lack of promptness is of no relevance as long as the plaintiff has not taken any substantive step in the Mainland Proceedings, said Mr Sussex [7] . On the other hand, mere passage of time would be a very uncertain and arbitrary basis to derogate from contractual rights to resolve disputes by arbitration in a chosen forum. 49. There is certainly force in the plaintiff’s arguments. However, I am unable to accept them, especially in light of the latest decision in Ecobank. In §130, the Court of Appeal held, inter alia , that the need to act promptly is well-established on the authorities (see para 62 below). 50. On certainty of the law, where the court is asked to exercise a discretionary power it is inevitable that all the relevant considerations will have to be taken into account (see Ecobank , CA, §122 (quoted below)). Circumstances are never identical. Therefore, it is an inescapable consequence that there is uncertainty in the law, although the court always strives to identify and formulate propositions of principle for future guidance. 51. There is no specific guidance in the authorities on what is or is not to be treated as delay for the present purpose. This is perhaps unsurprising. Delay must be examined against the relevant circumstances of the case. In practice, it is not very difficult to recognise delay where it exists. 52. As regards the plaintiff’s rights under the Clause, I believe that they must be considered in context. There is no suggestion that the plaintiff is being deprived of any entitlement to have defendant’s claim against it adjudicated by a competent tribunal. Further, it is accepted by the plaintiff that the right to arbitration in a chosen forum can be waived by it. Hence, even if the defendant had deliberately instituted the Mainland Proceedings with full knowledge of the Clause, it would not necessarily be opposed by the plaintiff. 53. Turing to the facts of this case, it must follow from this court’s factual findings in para 33 above that the plaintiff had deliberately delayed taking any action to assert its rights under the Clause for 8 months. 54. It was held in Ever Judger , supra , at §81, that in assessing whether there is lack of promptness, time began to run from the start of the foreign proceedings in breach of an arbitration agreement. Once a party is aware of a breach of the arbitration agreement, it is incumbent on him to take steps to rectify the position by applying for anti-suit injunction: see The Skier Star , supra , at §§37, 42-43. 55. The plaintiff’s delay is not confined to the 8-month period. The time taken in challenging the jurisdiction of the QMC should also count against the plaintiff. In §125, the Court of Appeal in Ecobank held : “The judge was, therefore, right [22], in my view, not to accept that any time during which the foreign jurisdiction is challenged is to be left out of account when considering whether to grant an anti-enforcement order …” 56. Almost 4 months elapsed (between June and September 2015) after the plaintiff made its jurisdictional challenge before the QMC and the filing of the OS. It seems to me that, on any reasonable view, the delay in this case by the plaintiff is both inordinate and culpable. I would decline to accede to the injunction application on the ground of delay alone. 57. If it is necessary to identify a time frame with which to measure the delay in question, I would take into account the expiration of the Limitation Period. It is now, prima facie , too late for the defendant to launch arbitration proceedings to recover its losses from the plaintiff [8] . In my view, there is good reason to use the Limitation Period as a reference for the delay. 58. An application for an anti-suit injunction is to enforce a party’s right to arbitration in his chosen forum when that right has been infringed. It stands to reason that if the arbitration has to be brought within a stipulated period of time, the applicant of the injunction should conduct himself in accordance with that time frame. It would be against the notion of justice for the applicant to wait until the 11 th hour or later to make the application so that there would be no arbitration because of time bar. 59. I find support for referring to the Limitation Period in considering delay in Essar Shipping , §§54 and 61 and The “Skier Star” , §43. 60. I have not overlooked the fact that when the Mainland Proceedings were instituted in September 2014, there were only 3 months left to run under the Limitation Period. However, making an anti-suit injunction application based on an arbitration clause is a simple application. There was ample time for the plaintiff to do so, and there is no credible evidence to explain why that could not be done. In Essar Shipping , proceedings were issued by the cargo interests against the ship owner and charterer on 29 September 2014 (§24 of judgment) and the time bar was expiring on January 2015 (§61). The court held that the anti-suit injunction proceedings should have been instituted no later than the end of November 2014 in the absence of some good reason to the contrary (§61). Comity 61. Comity consideration is closely associated with delay. I take into account that : (a) The jurisdictional challenge by the plaintiff had been considered and ruled upon by 2 levels of Mainland court; (b) The uncontradicted evidence of Mr Zhang that the Mainland courts would likely regard this application by the plaintiff as “an intrusion or obstruction of the judicial sovereignty of the Chinese courts” [9] ; (c) The QMC had “accepted” the Mainland Proceedings, which involved a thorough examination of the defendant’s claim in respect of, inter alia , its factual basis and cause(s) of action pursuant to Article 119 of the Civil Procedure Law of the People’s Republic of China. 62. There are much useful guidance to be found in the judgment of the Court of Appeal in Ecobank : “122. … An injunction is an equitable remedy. Before granting it the court must consider whether it is appropriate to do so having regard to all relevant considerations, which will include the extent to which the respondent has incurred expense prior to any application being made, the interests of third parties, including, in particular, the foreign court, and the effect of making such an order in relation to what has happened before it was made. … 126. Moreover the prejudice or detriment which would be involved in Ecobank allowing the proceedings to continue without seeking injunctive relief and then securing an injunction would not have been limited to Mr Tanoh. It extends to third parties involved in the litigation and, most importantly, the foreign courts which, in the present case, have held hearings and produced judgments of considerable length which are obviously the product of much labour. … 129. Further the tenor of modern authorities is that an applicant should act promptly and claim injunctive relief at an early stage; and should not adopt an attitude of waiting to see what the foreign court decides. In The Angelic Grace Leggatt LJ said that it would be patronising and the reverse of comity for the English court to decline to grant injunctive relief until it was apparent whether the foreign court was going to uphold the objection to its exercising jurisdiction and only do so if and when if failed to do so. Whilst those observations related to the approach of the court it seems to me that they are a guide to what should be the approach of a would-be applicant for anti-suit or anti-enforcement relief. 130. The proposition that delay in this field is immaterial in the absence of prejudice and that there is necessarily no prejudice if the respondent is aware of the challenge to the jurisdiction of the foreign court which is being pursued there would have curious consequences. Firstly it would revolutionise the approach that has previously been taken in respect of the need for applicants to act promptly. Secondly it would mean that applicants could have two bites at the cherry. They could, without seeking or threatening any injunctive relief in this country, resist the foreign proceedings on the ground that the issue should be arbitrated and, provided they had not submitted to the jurisdiction, they could then, if the challenge failed, seek an anti-enforcement injunction. The impunity which Mance J had thought “ never [to have] been the law ” or something very like it would have arrived. 132. Comity has a warm ring. It is important to analyse what it means. We are not here concerned with judicial amour propre but with the operation of systems of law. Courts around the free world endeavour to do justice between citizens in accordance with applicable laws as expeditiously as they can with the resources available to them. This is an exercise in the fulfilment of which judges ought to be comrades in arms. The burdens imposed on courts are well known: long lists, size of cases, shortages of judges, expanding waiting times, and competing demands on resources. The administration of justice and the interests of litigants and of courts is usually prejudiced by late attempts to change course or to terminate the voyage. If successful they often mean that time, effort, and expense, often considerable, will have been wasted both by the parties and the courts and others. Comity between courts, and indeed considerations of public policy, require, where possible, the avoidance of such waste. 133. Injunctive relief may be sought (a) before any foreign proceedings have begun; (b) once they have begun; (c) within a relatively short time afterwards; (d) when the pleadings are complete; (e) thereafter but before the trial starts; (f) in the course of the trial; (g) after judgment. The fact that at some stage the foreign court has ruled in favour of its own jurisdiction is not per se a bar to an anti-suit injunction: see AES . But, as each stage is reached more will have been wasted by the abandonment of proceedings which compliance with an anti-suit injunction would bring about. That being so, the longer an action continues without any attempt to restrain it the less likely a court is to grant an injunction and considerations of comity have greater force. 134. Whilst a desire to avoid offence to a foreign court, or to appear to interfere with it, is no longer a powerful a consideration as it may previously have been, it is not a consideration without relevance. A foreign court may justifiably take objection to an approach under which an injunction, which will (if obeyed) frustrate all that has gone before, may be granted however late an application is made (provided the person enjoined knew from an early stage that objection was taken to the proceedings). Such an objection is not based on the need to avoid offense to individual judges (who are made of sterner stuff) but on the sound basis that to allow such an approach is not a sensible method of conducting curial business.” 63. Applying the above dicta to this case, whilst I do not take the view that the Mainland Proceedings are too far advanced, if I were wrong in holding that delay can be a stand-alone ground for declining this application, I would have no hesitation in rejecting the same given the delay in this case coupled with the comity considerations. In particular, I cannot see how it can be right for the plaintiff to blow hot and cold with the jurisdictional challenge in the Mainland depending on the outcome. Prejudice to the defendant 64. I have already dealt with the factual issue whether the defendant had acted reasonably in failing to preserve its right to sue in the contractual forum (see para 38 above). The first limb of the serious prejudice argument (see para 16(b)(iii) above) cannot stand. 65. As regards the loss of security, I agree with Mr Sussex that the court has the power to impose condition in granting an injunction. Therefore, where the justice of the case requires, this court may impose a condition whereby the Guarantee would be preserved. In the premises, I would not decline this application on the ground of serious prejudice to the defendant. Conclusions 66. For the reasons stated above, the OS is dismissed with an order nisi that the costs of and occasioned by the same be to the defendant, with a certificate for 2 counsel. 67. Last but not least, I am grateful to all counsel for their able assistance. (Anthony Chan) Judge of the Court of First Instance High Court Mr Charles Sussex SC and Mr Christopher Chain, instructed by Howse Williams Bowers, for the plaintiff Mr Wong Yan Lung SC and Mr Gary C C Lam, instructed by Zhong Lun Law Firm, for the defendant [1] The B/L was endorsed and delivered to the defendant pursuant to a letter of creditor issued by it. The defendant has not been reimbursed for the payment made under the letter of credit, and hence it is endeavouring to recovery the loss by suing on the B/L. [2] This was actually a Sub-Charter Party, which was a voyage charter. The Head Charter Party was a time charter, which is not important for the present purpose. [3] The evidence of Mr Wang mentioned only a summons that was being served. However, the documentary evidence, and the circumstances, suggest that other documents were also being served, including the SOC – see bundle 2/pp.203-204. [4] There appears to be a minor inaccuracy in the translation at 2/190 in that the Ruling did not refer to arbitration. [5] 1/118, §30. [6] Mr Sussex has made the point that the conditions also referred to the Hague Rules under which there was also a limitation period. However, this does not add much to the debate. [7] It was also argued that delay must be considered in the context of whether it has given rise to prejudice or injustice suffered by the defendant which is not of its own making. [8] The plaintiff says that the time bar defence which it can raise is not an absolute one in light of s.58 of the Arbitration Ordinance , Cap 609 , which allows for time bars to be extended for arbitral proceedings in Hong Kong : see also The Skier Star at §49. [9] Mr Zhang also criticised this application as an abuse of process by the plaintiff in “輸打贏要” (take the winnings and sack the losses) [1/65, §35]. Look up this case on Lawcite Noteup",
  "length": 42378,
  "headers_seen": [
    "Background",
    "Service of the Mainland Proceedings",
    "General legal principles",
    "The issues",
    "Incorporation of the Clause",
    "Evasion of service",
    "Limitation Period",
    "Delay"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2016/39",
  "query": "anti-suit injunction",
  "ts": "2025-10-16T10:47:23",
  "ok": true
}