{
  "title": "CAPITAL WEALTH HOLDINGS LTD AND OTHERS V. 南通嘉禾科技投资开发有限公司 | [2020] HKCFI 3025 | HKLII",
  "court": null,
  "year": 2020,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2020] HKCFI 3025 CAPITAL WEALTH HOLDINGS LTD AND OTHERS V. 南通嘉禾科技投资开发有限公司 Judgment Information Date 18 Oct, 2020 Action No. HCCT66/2020 Neutral Cit. [2020] HKCFI 3025 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCCT66/2020 HCCT66A/2020 CAPITAL WEALTH HOLDINGS LTD AND OTHERS v. 南通嘉禾科技投资开发有限公司 HCCT 66/2020 [2020] HKCFI 3025 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS ACTION NO 66 OF 2020 ________________________ BETWEEN CAPITAL WEALTH HOLDINGS LIMITED (資富控股有限公司) 1 st Plaintiff ENCORE WEALTH INVESTMENTS LIMITED (加豐投資有限公司) 2 nd Plaintiff 南通狮迈汽车科技有限公司 3 rd Plaintiff 如皋萨林混合动力汽车科技有限公司 4 th Plaintiff 南通威蒙汽车科技有限公司 5 th Plaintiff 如皋积泰电动汽车科技有限公司 6 th Plaintiff and 南通嘉禾科技投资开发有限公司 Defendant ________________________ Before: Deputy High Court Judge Sit, SC in Chambers (Open to the Public) Date of Hearing: 19 October 2020 Date of Decision: 19 October 2020 ________________________ D E C I S I O N ________________________ 1. This application concerns an originating summons issued on 5 October 2020, for anti-suit injunction against the defendant in relation to four sets of proceedings before the Intermediate People’s Court in Nantung City, Jiangsu Province, People’s Republic of China in breach of an arbitration agreement. 2. The four sets of proceedings are: first, No. 89 (“ 89 Proceedings ”), which seeks to challenge the validity of an arbitration agreement and is brought against, amongst others, the 1st and 2nd plaintiff. The other sets of PRC proceedings are Nos. 389, 391 and 392, referred to as the “ WFOE Proceedings ”, which is for recovery of loans and enforcement of share pledges and they are against, amongst others, the 3rd to 6th plaintiffs. 3. By way of background, the 1st and 2nd plaintiffs are related company. The 1st plaintiff wholly owns Saleen Motors International LLC, an automotive manufacturing group based in the USA, whose founder, Mr Stephen Saleen, was a well-known race car driver and the Saleen brand is associated with sports car and high performance cars. The business partner of Mr Saleen is one Charles Xiaolin Wang, who is the deponent to the affirmations in this case. The 3rd to 6th plaintiffs are WFOEs wholly owned by the 1st and 2nd plaintiffs, and they also are shareholders in a Project Company which is the subject matter of a joint venture that I will refer to briefly below. The defendant is a state-owned enterprise, wholly owned by the Rugao City Government, and is the City Government’s investment arm. 4. There are three joint venture agreements including a joint venture agreement dated 28 January 2016, a supplemental joint venture agreement dated 21 July 2016 and a second supplemental joint venture agreement dated 15 October 2016. Essentially, these joint venture agreements provide for the setting up of a joint venture between the 1st plaintiff, the 2nd plaintiff and the defendant to manufacture and sell Saleen brand vehicles. 5. The Project Company, which is the vehicle under the joint venture, is a PRC company. Before the dispute erupted between the parties, the defendant held 33.42 per cent shares in the Project Company whilst the 3rd to 6th plaintiffs collectively held 66.58 per cent shares in the Project Company. And the obligations of the joint venture partners were, briefly, on the part of the 1st and 2nd plaintiffs, to inject the assets of Saleen including its intellectual property rights into the Project Company as well as to make capital contribution of RMB 3 billion; and on the part of the defendant, there was a similar capital contribution obligation of RMB 3 billion, together with the obligation to procure production line, availability of favourable land acquisition and other policies for the joint venture, as well as to provide guarantee for the Project Company’s financing of up to RMB 4 billion. 6. Clause 12 of the joint venture agreement (“ JVA ”) is the dispute resolution clause which provides for the substantive law governing the parties’ relationship to be the law of the PRC and that any dispute should be resolved by the “Hong Kong Arbitration Committee using PRC law as substantive law and Hong Kong International Arbitration Ordinance as the means to resolve such dispute”. 7. The JVA was concluded between the 1st plaintiff, the defendant and the Project Company. For the supplemental joint venture agreement (“ SJVA ”), the parties to that were the 1st plaintiff, the 2nd plaintiff and the defendant. The 3rd to 6th plaintiffs were referred to in the recitals to the SJVA as the WFOEs incorporated by the 1st and 2nd plaintiffs to be shareholders in the Project Company, and there were also various clauses in the SJVA concerning the 3rd to 6th plaintiffs with respect to the injection of capital to the Project Company, the provision of cross-guarantees and the restriction to seek intellectual property rights registration by the 3rd to 6th plaintiffs. 8. As I have indicated, the dispute clauses can be found in JVA clause 12 as well as SJVA clause 10.2. Essentially, the dispute is to be referred to “Hong Kong Arbitration Centre” by reference to PRC law as the substantive law and “Hong Kong International Arbitration Ordinance ”. 9. The current application is a consequence of the dispute between the Mainland and foreign parties under the joint venture. The precise timing of such dispute arising is unclear from the evidence. Mr Wang’s first affirmation refers to various allegations of embezzlement of the Project Company’s funds in the Mainland media. But beyond that, there does not seem to be any further particulars on the issue. But for present purposes, it is clear that parties have been in dispute since late May 2020 at the latest when there was an issue concerning the obtaining of corporate seals of the Project Company. 10. On 9 June 2020, the defendant commenced the WFOE Proceedings against the 3rd to 6th plaintiffs (amongst others). On 4 July 2020, the plaintiffs have called for an interim general meeting of the Project Company and it is said that certain resolutions were passed at that general meeting, whereupon the defendant had commenced action in the Mainland on 13 July 2020 to set aside those resolutions. Thereafter, on 4 August 2020, the defendant called an interim general meeting of the Project Company, and the 3rd to 6th plaintiffs’ PRC lawyers complained to the local Administration of Industry and Commerce as well as commenced an action in the Mainland on 26 August 2020 to seek to set aside the resolutions passed at that interim general meeting. 11. On 28 August 2020, the 1st to 6 th plaintiffs (amongst others) commenced arbitration against the defendant before the HKIAC and the notice of arbitration was served on the defendant. Thereafter, on 3 September 2020, the defendant commenced the 89 Proceedings which I have referred to earlier against the 1st and 2nd plaintiffs and the Project Company seeking to challenge the validity of the arbitration clause in the JVA and the SJVA. 12. On 4 and 10 September 2020, the defendant responded to the notice of arbitration issued by the plaintiffs’ side, albeit by way of holding responses (and so far there has not been a substantive response). On 17 September 2020, Messrs. Baker & McKenzie’s Hong Kong office confirmed to be the solicitors for the defendant in the HKIAC arbitration. 13. I now give a brief description of the 89 Proceedings. The evidence indicates that it is the invocation of a special procedure under Mainland law that after docketing of the case, the proceedings should be determined within 30 days unless an extension of time is granted by the court; the PRC law in evidence suggests that there is no mandatory requirement for a hearing or a minimum period of notice to be given to the defendant. 14. On 22 September 2020, the plaintiffs’ PRC lawyers learnt from the judge in charge of service in the 89 Proceedings that service on the plaintiffs had not yet been effected, and I am informed this morning that to date the 1st and 2nd plaintiffs still have not been served in the 89 Proceedings. The PRC law in evidence before me also indicates that if, upon conclusion of the 89 Proceedings, a finding is made as to the invalidity of the arbitration agreement, then the plaintiffs would have no chance of seeking enforcement in the Mainland even after an arbitral award is made in their favour. 15. As to the WFOE Proceedings, they are concerned with eight loan agreements made between the defendant as lender and the Project Company as borrower, totalling RMB 1.8 billion, as well as various share pledges given by the 3rd to 6th plaintiffs on the shares they held in the Project Company as security for such loans. Both the loan agreements and the share pledges were tripartite agreements between the Project Company, the defendant, as well as the 3rd to 6th plaintiffs. The loan agreements contain no jurisdiction clause. The share pledges have a clause saying that both sides have the right to apply to PRC court to resolve their dispute, which appears to be a non-exclusive jurisdiction clause. 16. As to the progress of the WFOE Proceedings, the PRC law in evidence before me suggests that regardless of whether or not the proceedings would be served on the 3rd to 6th plaintiffs, there would be deemed service on them by 2 November 2020, whereupon the 3rd to 6th plaintiffs would have to file their defence by 17 November 2020 and their evidence by 2 December 2020, and it is expected that a hearing would then take place between 8 to 10 December 2020. 17. The plaintiffs appear before me on an inter parte summons for an interim anti-suit injunction, initially on 9 October 2020. I was not satisfied at that stage that given the attempted service on or drawing of attention of the same to the defendant took place over the National Day holidays, there was sufficient opportunity to do so, and hence I adjourned the matter to today (19 October 2020). I have evidence before me that the plaintiffs attempted to draw to the attention of the defendant the hearing today as well as all the materials that they have put before the court, but the defendant did not appear. 18. I am satisfied that I have jurisdiction to grant an interim injunction under section 45 of the Arbitration Ordinance . 19. In relation to that, foreign proceedings in breach of arbitration agreement is a breach of contract which ordinarily will be restrained by the grant of injunction restraining the party in breach from conducting such proceedings unless there are strong reasons to the contrary shown, and where an interim injunction is sought, the applicant must show to a high probability that its case is right given the impact of the injunction if granted on the proceedings before the foreign court. See Giorgio Armani SpA v Elan Clothes Company Limited [2019] HKCFI 530 , [2019] 2 HKLRD 313 at paragraphs 27 and 31. The mere fact that the foreign court will not grant a stay of the proceedings instituted is not sufficient for the purpose of strong reason in resisting an interim injunction, see GM1 v KC [2019] HKCFI 2793 , [2020] 1 HKLRD 132 at paragraph 24. 20. Now, there is an issue as to whether or not the law governing the arbitration clause is Hong Kong law or PRC law because as indicated above, the relevant dispute clauses refer to the resolution of dispute by “Hong Kong Arbitration Centre”, which I am satisfied is sufficiently clear to refer to the HKIAC, applying PRC law as “substantive law” and the “Hong Kong International Arbitration Ordinance ”, which again I am sufficiently satisfied that it is intended to be a reference to the Arbitration Ordinance in Hong Kong. 21. Mr Lam has drawn to my attention the recent development in the case law, a very recent case of the UK Supreme Court in Enka v OOO Insurance Chubb [2020] UKSC 38 . In my view, given the developing case law and taking into account the different approaches to the question, at the end of the day, it is a matter of looking at the relevant arbitration clause and considering what was the parties’ intention as to what should be the governing law for the arbitration agreement. 22. In this case, I am satisfied on the matters identified by the plaintiffs that there is a sufficiently strongly arguable case that the arbitration agreement is governed by Hong Kong law, because (i) PRC law has been identified as the substantive law only and there is express reference to “Hong Kong International Arbitration Ordinance ” which as I have indicated I am satisfied to be a reference to the Arbitration Ordinance , as well as (ii) I accept the submissions of Mr Lam that given the deliberate choice of HKIAC as the seat of arbitration by a US party and a PRC party intending that to be a neutral forum for the resolution of their dispute, that points strongly to the intention of the parties being that the governing law of the arbitration clause should be Hong Kong law. 23. In relation to the 89 Proceedings, I am satisfied that an interim anti-suit injunction should be granted for the following reasons: (1) There is an arbitration agreement between the 1st plaintiff, the 2nd plaintiff and the defendant, and as I have indicated, despite the references to “Hong Kong Arbitration Centre” and “Hong Kong International Arbitration Ordinance ”, it is tolerably clear, looking at the matter as a whole, that the parties intended that it should be arbitration before the HKIAC. (2) The arbitration has already been commenced by the plaintiffs (amongst others) before the HKIAC, and the defendant so far has participated in such arbitration. (3) In the premises, I am satisfied that the arbitral tribunal as formed can and should rule on the validity of the arbitration agreement. 24. I wish to point out that the interim injunction granted is directed against the defendant in personam and in no way deprives the PRC court of its jurisdiction. Given the Hong Kong arbitration, the arbitral tribunal should be allowed to rule on its own competence and jurisdiction, subject to review by the supervisory court, which is Hong Kong court. As and when an award is made and enforcement is sought in the Mainland, the PRC court will have jurisdiction to deal with the issue if the losing party resists enforcement there. See GM1 v KC paragraph 22. 25. As to the WFOE Proceedings, the modern approach to construction of arbitration agreement is to give effect, so far as the language used by the parties will permit, to the commercial purpose of the arbitration clause, namely, to have disputes that may arise out of the agreement containing the arbitration clause to be decided by a chosen tribunal. 26. Construction of a clause should start with the presumption that the parties are rational businessmen, are likely to have intended that any dispute arising out of their relationship into which they have entered to be decided by the same tribunal unless the language makes it clear that certain questions were intended to be excluded from the arbitrator’s jurisdictions. See Fiona Trust & Holding Corporation v Privalov [2007] UKHL 40 , [2007] 4 All ER 951 and Giorgio Armani (No. 1) paragraphs 33 to 34. 27. In this case, the 3rd to 6th plaintiffs are not parties to the JV agreements. So there are two issues arising for consideration. The first is whether the dispute between them and the defendant forms part of or arising from the JV agreements. The second is on construction of whether it is intended that such disputes should be determined by the same arbitral tribunal. In this regard, as I have indicated earlier, the loan agreements in question contain no jurisdiction clause but the share pledges contain a non-exclusive jurisdiction clause in favour of the PRC court of the Project Company’s place of incorporation or seat. 28. On the first issue, the plaintiffs’ claim is that it is the defendant’s obligation under clause 2.5 of the JVA and clause 2.2.3 of the SJVA to provide guarantees for up to RMB 4 billion of financing to the Project Company, and by advancing loans to the Project Company without providing a guarantee and then to enforce such loans on the basis of non-payment is a breach of the defendant’s obligation with respect to the RMB 4 billion. I have previously raised the issue with the plaintiffs as to whether the loan agreements should properly fall within clause 2.2.2, which provides for a guarantee concerning the plaintiffs’ RMB 3 billion capital contribution and also expressly provides for the 3rd to 6th plaintiffs’ cross-guarantee which contemplates the entering into of separate agreement for such purpose. The plaintiffs submit that these are separate and different obligations and the defendant’s loan should properly fall under clause 2.2.3. 29. I have also been referred to a WeChat dated 29 July 2019 where there is a reference to the obligation of up to RMB 4 billion guarantee. It is suggested at that point that there had already been RMB 2.5 billion advanced and the plaintiffs were seeking the guarantee of the defendant with respect to a proposed RMB 1.5 billion loan from a bank. The amount of RMB 2.5 billion exceeds the amount of the loan agreement which came up to a total of RMB 1.8 billion. 30. Overall, I am persuaded by the plaintiffs that there is a strong argument that the obligation of the defendant to provide guarantee under clause 2.2.3 is triggered with respect to the loan agreements in question, and I say that for the following reasons: (1) First, it is clear that the loans were for working capital and not capital contribution. (2) Second, even if the loans did not strictly fall within clause 2.2.3, since the clause contemplates the creditor to be a third party and not the defendant, the intention is sufficiently clear that the defendant would provide a guarantee to ensure that the Project Company could get financing for its operations up to RMB 4 billion. 31. In the circumstances, I am satisfied that it is strongly arguable that if for some reason the financing was provided by the defendant as opposed to an outsider, the defendant’s obligation to ensure that the Project Company would not be at the mercy of the lender remains. 32. On the second issue, namely, whether or not as a matter of construction, it is intended that the disputes with the 3rd to 6th plaintiffs should be determined by the same arbitral tribunal, I consider that although the 3 rd and 6 th parties are not parties to the various JV agreements, on their proper construction there is a strongly arguable case that it is intended that disputes concerning them with respect to the provision of financing to the Project Company and the use of their shares as security for that would also be intended by the parties to be referable to the same arbitral tribunal for determination, and I say that for the following reasons: (1) The various terms in the JV agreements providing for the 3rd to 6th plaintiffs’ capital injection, provision of cross-guarantee, restriction to seek intellectual property rights registration and also terms preventing the 1st and 2nd plaintiffs from relying on separate legal personality as a basis to resist the defendant’s claim for breaches committed by the 3rd to 6th plaintiffs. (2) The overall effect of the JV agreements is to provide for the setting up, contribution and operation of the Project Company with the 3rd to 6th plaintiffs as shareholders. In the premises, I am persuaded that it is strongly arguable that the parties intended that the dispute arising from financing-related obligations for the Project Company should be adjudicated by the same arbitral tribunal. 33. As such, although the argument may not be as strong as that in relation to the 89 Proceedings, I am satisfied that it meets the threshold of a strongly arguable case that the disputes in the WFOE Proceedings are also covered by the arbitration clause. 34. In the premises, I will be granting an interim anti-suit injunction with respect to both the 89 Proceedings as well as the WFOE Proceedings. 35. Finally, on the question of substituted service. As indicated, I was not prepared to grant substituted service at the first hearing on 9 October 2020 but I gave the plaintiffs liberty to apply again. It is not disputed that normally one needs to show it is impracticable to effect service through the ordinary channels and if there is no unsuccessful attempts to effect service under Order 11, rule 5A, usually it would be inappropriate to order substituted service. See Deutsch Bank AG Hong Kong Branch v Zhang Hong Li [2016] 3 HKLRD 303 paragraphs 5, 73 and 78. 36. However, there is also a provision under Hong Kong Civil Procedure 2021 paragraph 11/5/18 which explains it is common practice in an ex parte injunction situation to grant substituted service on existing lawyers acting for the foreign party without the need to demonstrate existing difficulty in personal service, and this is to recognise an injunction by their nature would require proper notice so that substituted service would be appropriate. 37. In light of the fact that I am prepared to grant the injunction, I am likewise prepared to grant an order for substituted service on the Hong Kong lawyers of the defendant instructed for the HKIAC arbitration because, firstly, that I have granted an anti-suit injunction which by its nature require proper notice be given, and in particular, secondly, the timetable of the 89 proceedings as well as the WFOE proceedings require that prompt notice be given to the defendant for the grant of the anti-suit injunction. 38. Costs reserved. (Eva Sit, SC) Deputy High Court Judge Mr Gary C C Lam and Mr Avery Chan, instructed by DLA Piper Hong Kong, for the plaintiffs The defendant was not represented and did not appear Look up this case on Lawcite Noteup",
  "length": 21896,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2020/3025",
  "query": "seat of arbitration",
  "ts": "2025-10-16T10:49:46",
  "ok": true
}