{
  "title": "THE PERSONAL REPRESENTATIVE OF LAU FUNG CHIM V. LAU SIU KWONG DAVID AND OTHERS | [2001] HKDC 126 | HKLII",
  "court": null,
  "year": 2001,
  "date": null,
  "content": "HKLII Databases District Court [2001] HKDC 126 THE PERSONAL REPRESENTATIVE OF LAU FUNG CHIM V. LAU SIU KWONG DAVID AND OTHERS Judgment Information Date 19 Jul, 2001 Action No. DCMP1767/2001 Neutral Cit. [2001] HKDC 126 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History DCMP1767/2001 DCMP001767/2001 XCHRX THE PERSONAL REPRESENTATIVE OF LAU FUNG CHIM v. LAU SIU KWONG DAVID AND OTHERS DCMP001767/2001 DCMP 1767/2001 IN THE DISTRICT COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION MISCELLANEOUS PROCEEDINGS NO. 1767 of 2001 ---------------- IN THE MATTER OF Section 7(2) and 17 of the Limitation Ordinance , Cap. 347 AND IN THE MATTER OF declaration for adverse possession all that 1/21st part or share of and in Kowloon Inland Lot No. 7206 (2/F, Nos 24 & 24A, Bowring Street, Kowloon) Between THE PERSONAL REPRESENTATIVE OF LAU FUNG CHIM alias LAU FUNG JIM DECEASED Plaintiff AND LAU SIU KWONG DAVID, LAU SHUI CHEN CONSTANCE, LAU SHIU HUNG, LAU SAU WAH CHRISTINE and LAU SAU YEE Defendant ---------------- Coram: LI, District Judge in chambers Date of Hearing: 10 July 2001 Date of Handing Down Judgment: 20 July 2001 ___________ Judgment ___________ 1. This is an application under Order 7 Rule 2 and Order 15 Rule 6A of the Rules of the District Court Cap. 336 for an order that :- (1) Lau Sau Ping Cons be appointed to represent the estate of Lau Fung Chim alias Lau Fung Jim for the purpose of the proceedings herein and that the proceedings herein be carried on as if she has been substituted for the estate of Lau Fung Chim. (2) a declaration that Lau Fung Chim alias Lau Fung Jim has since 19th July 1986 obtained good possessory title of the Property known as ALL THAT one equal undivided 21st part or share of and in Kowloon Inland Lot No. 7206 (2/F, Nos. 24 and 24A Bowring Street, Kowloon, Hong Kong) (\"the Property\"). (3) The name of Lau Fung Chim alias Lau Fung Jim be entered in the Land Registry Record as beneficial owner of the Property. 2. The Plaintiff is actually the estate of Lau Fung Chim alias Lau Fung Jim, deceased (\"the deceased\"). Mr. Lam, solicitor for the Plaintiff, informed me at the hearing that in fact there is no personal representative of the deceased because there has been no grant of probate or letters of administration in respect of the estate of the deceased. Hence part of the application before me is for an order that Lau Sau Ping Cons (\"Madam Lau\") be appointed to act for and on behalf of the Plaintiff. Mr. Lam also advised me that the Defendants in this case have filed acknowledgement of service indicating that they would not oppose any part of the application; thus the entire application can be treated as unopposed. 3. According to an affirmation by Madam Lau dated 20 June 2001, by an assignment of the Property dated 18th August 1961 and registered by Memorial No. 348644 one LEE On-yuen (\"LEE\") became the registered owner of the Property under a Government Lease for 150 years commencing 25th December 1887. In or about 1961, i.e. the time LEE became the registered owner, the deceased started to live in the Property as licensee of LEE. LEE died intestate in 1966. Shortly after the death of LEE the deceased started exclusive possession, use occupation and control of the Property by partitioning the Property into several rooms and sub-letting the same. From then on the deceased also publicly and expressly claimed to be the owner of the Property by appropriating all the rental income. In fact, all through these years, no one has ever appeared to claim any interest in the Property on behalf of the estate of LEE. In October 1971 the deceased at his own expenses applied and installed water supply to the Property. Since or at least commencing from November 1971 Rates Demand Notes in respect of the Property were addressed to the deceased who duly paid the same. Since or at least commencing from June 1979 Premium Demand Notes in respect of the Property were addressed to the deceased who duly paid the same. Since or at least commencing from 1979 the deceased paid Property Tax for the rental income derived from the Property. In short, all the evidence indicate that the deceased had since 18th July 1966 been in adverse possession of the Property against LEE. The current annual rateable value of the Property is $70,800.00. 4. Madam Lau further deposed that the deceased himself passed away on 7th August 1998. Madam Lau and all the Defendants herein are in fact children (now all adults) of the deceased. In November 2000, Madam Lau and all the Defendants herein applied to the Court of First Instance under Action No. 10001 of 2000 against the estate of LEE for a declaration, inter alia, that they have obtained good possessory title of the Property. The Court of First Instance refused to make the declaration in their favour but declared that LEE's title to the Property had extinguished and that LEE's estate had lost the right to recover the Property. The Court of First Instance was of the view that only the deceased (not his children) had adverse possession of the Property. Hence the present application before me for a declaration to rectify the title of the deceased to the Property so that, presumably, in due course Madam Lau and her siblings can inherit the Property. 5. Action No. 10001 of 2000 was decided by Recorder Chan. The crucial parts of the judgment by the learned Recorder delivered on 9th April 2001 say that :- \"The Plaintiffs were children of the said Lau Fung Jim. They had been residing in the property since about 1966. I am satisfied that they were in turn the licencees of Lau Fung Jim, their father. It appears to me to clear that since the death of Lee On Yuen, the property had been occupied by Lau Fung Jim and also his children as his licencees and also other persons claiming title through him, like his tenants. In the circumstances, since the termination of the licence to Lau Fung Jim on the date of the death of Lee On Yuen, the property was in adverse possession by Lau Fung Jim and also persons claiming title through him. There was no action taken by the estate of Lee On Yuen for the recovery of the possession of the property. Hence by now any action taken by or on behalf of the estate of Lee On Yuen to recover the property would be barred by section 7 of the Limitation Ordinance . Furthermore under section 17 of the Limitation Ordinance the title of Lee On Yuen or his estate to the property would have been extinguished after the expiration of 20 years from the date when the property was in adverse possession. This would mean that the title was extinguished by 19 July 1986. Accordingly I am satisfied that the Plaintiffs are entitled to the declarations in paragraphs (a) and (b) of the Prayer to the Statement of Claim. I am however not in favour of granting a declaration in terms of paragraph (c) where the Plaintiffs asked me to grant a declaration that the Plaintiffs had acquired a good possessor title to the property. The reason is that on the face of the Pleading, the Plaintiffs are licensees of Lau Fung Jim and while I am satisfied that the property had been in adverse possession as against the deceased Lee On Yuen since the date of his death, there is no evidence of any dispossession of Lau Fung Jim by the Plaintiffs. Furthermore I am of the view that since the Plaintiffs were licensees of Lau Fung Jim, they derived their title to the property from Lau Fung Jim, and unless they had since dispossessed Lau Fung Jim, their father, they could not claim a better possessory title to the property than Lau Fung Jim. I am likewise not prepared to grant an order under paragraph (d), which asked for an order that the registration of the deceased as the owner of the property be vacated. I could not see how that could be done. The land registry is a document registry. All that was registered in favour of Lee On Yuen was the assignment in his favour dated 18 August 1961. There was no registration of ownership as such. Thus to conclude, I will grant the Plaintiff declarations in terms of paragraphs (a) and (b) of the prayer to the Statement of Claim, that is a declaration that the Defendant has lost the right to bring any action to recover the property by virtue of Section 7 (2) of the Limitation Ordinance , and a declaration that the deceased's title to and interest in the property has prior to this action been extinguished by virtue of Section 7 (2) & 17 of the Limitation Ordinance . I make no order as to costs.\" To leave the matter in no doubt, the precise terms of the order made by Recorder Chan are that :- \"(1) the Defendant has lost the right to bring any action to recover the property as more particularly set out in the schedule hereto or any part thereof by virtue of Section 7 (2) of the Limitation Ordinance , Cap. 347 , Laws of Hong Kong (\"the said Ordinance\"); (2) Lee On Yuen, the deceased's title to and interest of and in the property has prior to the beginning of this action, been extinguished by virtue of Section 7(2) and 17 of the said Ordinance; (3) There be no order as to costs\" 6. In the light of the decision by Recorder Chan, Mr. Lam suggested, it is more a matter of formality that I should make an order in terms of the application before me. I wish the matter is as simple as that. The Limitation Ordinance 7. The Limitation Ordinance , Cap. 347 provides that :- 7. Limitation of actions to recover land (1) No action shall be brought by the Crown to recover any land after the expiration of 60 years from the date on which the right of action accrued to the Crown or, if it first accrued to some person through whom the Crown claims, to that person. (2) No action shall be brought by any other person to recover any land after the expiration of 12 years from the date on which the right of action accrued to him or, if it first accrued to some person through whom he claims, to that person : Provided that, if the right of action first accrued to the Crown through whom the person bringing the action claims, the action may be brought at any time before the expiration of the period during which the action could have been brought by the Crown, or of 12 years from the date on which the right of action accrued to some person other than the Crown, whichever period first expires. 8. Accrual of right of action in case of present interests in land (1) Where the person bringing an action to recover land, or some person through who he claims, has been in possession thereof, and has while entitled thereto been dispossessed or discontinued his possession, the right of action shall be deemed to have accrued on the date of the dispossession or discontinuance. (2) Where any person brings an action to recover any land of a deceased person, whether under a will or on intestacy, and the deceased person was on the date of his death in possession of the land or, in the case of a rentcharge created by will or taking effect upon his death, in possession of the land charged, and was the last person entitled to the land to be in possession thereof, the right of action shall be deemed to have accrued on the date of his death. (3) Where any person brings an action to recover land, being an estate or interest in possession assured otherwise than by will to him, or to some person through whom he claims by a person who, at the date when the assurance took effect, was in possession of the land or, in the case of a rentcharge created by the assurance, in possession of the land charged, and no person has been in possession of the land by virtue of the assurance, the right of action shall be deemed to have accrued on the date when the assurance took effect. 13. Right of action not to accrue or continue unless there is adverse possession (1) No right of action to recover land shall be deemed to accrue unless the land is in the possession of some person in whose favour the period of limitation can run (hereafter in this section referred to as adverse possession) and where under the foregoing provisions of this Ordinance any such right of action is deemed to accrue on a certain date and no person is in adverse possession on that date, the right of action shall not be deemed to accrue unless and until adverse possession is taken of the land. (2) Where a right of action to recover land has accrued and thereafter, before the right is barred, the land ceases to be in adverse possession, the right of action shall no longer be deemed to have accrued and no fresh right of action shall be deemed to accrue unless and until the land is again taken in adverse possession. (3) For the purposes of this section- (a) possession of any land subject to a rentcharge by a person (other than the person entitled to the rentcharge) who does not pay the rent shall be deemed to be adverse possession of the rentcharge; and (b) receipt of rent under a lease by a person wrongfully claiming, in accordance with section 12(3), the land in reversion shall be deemed to be adverse possession of the land. 16. Administration to date back to death For the purposes of the provisions of this Ordinance relating to actions for the recovery of land, an administrator of the estate of a deceased person shall be deemed to claim as if there had been no interval of time between the death of the deceased person and the grant of the letters of administration. 17. Extinction of title after expiration of period Subject to the provisions of section 10, at the expiration of the period prescribed by this Ordinance for any person to bring an action to recover land (including a redemption action), the title of that person to the land shall be extinguished. Adverse possession 8. Although the decision of Recorder Chan in HCA10001 of 2000 does not amount to res judicata so far as the case before me is concerned because the parties in the two cases are not identical, the evidence and facts before the learned Recorder and those before me are virtually the same. I have no difficulty in coming to the conclusion as the learned Recorder did that the deceased had since 1966 to the date of his death exclusive possession of the Property otherwise than by way of tenancy or licence. However, whether such exclusive possession constituted adverse possession depends on ownership of the Property. 9. Since LEE died in 1966, and from that time to now no person has come forward to obtain representation of his estate, it is not unreasonable to hold that LEE died intestate leaving no one to succeed him. To come straight to the point, LEE's estate became bona vacantia and it is almost common knowledge that bona vacantia passes to the government. In other words, after LEE's death, the Property became Property of the government. In such case, assuming there was adverse possession, it would be adverse possession against the government and not adverse possession against LEE or LEE's estate. If this analysis is correct, it cannot be said that LEE's title and interest in the Property had been extinguished by adverse possession by the deceased. 10. On the basis that the deceased had adverse possession against the government, section 7 (1) of the Limitation Ordinance , Cap. 347 provides that the government has 60 years to take action to recover the Property. So, now and for many more years to come, the government is not barred from taking action. 11. It is also arguable that possession, although exclusive, by the deceased since 1966 was not even adverse possession against the government because the deceased must have paid up all government rent payable on the Property thereby acknowledging the government as landlord. 12. In the premises, I cannot share the view expressed by Recorder Chan in his judgment that the deceased had obtained good possessory title. 13. From a practical point of view, until such time the question of the government's right to take action in relation to the Property as bona vacantia has been conclusively determined, a potential purchaser of the Property may well query the title to the Property of a vendor based on adverse possession. 14. Accordingly, I am not yet prepared to make a declaration in terms of paragraph (2) of the application until the position that the government may take has been ascertained. It may be that the government, after learning the circumstances of this case, decide not to claim the Property as bona vacantia . It may also be that even treating the Property as bona vacantia , the government decides to abandon the Property to the deceased's family. Hence, if for whatever reason the government claims no interest in or forgoes the Property, I would be happy, and it will be safe, to grant the Plaintiff's application in terms sought. On the other hand, should the government wishes to recover possession of the Property as bona vacantia , I expect the government to apply to join in as a party and present case so that the other parties herein may reply. 15. For all the reasons given, I direct that the Plaintiff serves a true copy of the Originating Summons, supporting affidavits and this judgment on the Secretary for Justice as the government's legal representative. In default of response from the Secretary for Justice within one month after service as ordered, it would be fair to assume that the government has for whatever reason decided not to claim any interest in the Property and I shall deal with the matter as I see fit. Z.E. Li District Judge Representation: Mr. David Lam of messrs. C.Y. Lam & Co. for the Applicant 1st, 2nd, 3rd, 4th and 5th Respondents unrepresented, absent. Look up this case on Lawcite Noteup",
  "length": 17608,
  "headers_seen": [
    "The Limitation Ordinance",
    "Adverse possession"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkdc/2001/126",
  "query": "adverse possession",
  "ts": "2025-10-17T10:44:15",
  "ok": true
}