{
  "title": "SANO SCREEN MANUFACTURERS LTD. V. J & R BOSSINI TRADING LTD. | [2001] HKCFI 1354 | HKLII",
  "court": null,
  "year": 2001,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2001] HKCFI 1354 SANO SCREEN MANUFACTURERS LTD. V. J & R BOSSINI TRADING LTD. Judgment Information Date 17 Oct, 2001 Action No. HCA12351/1998 Neutral Cit. [2001] HKCFI 1354 Download MS Word Judgment Reading Options Translation Toggle Highlight Appeal History HCA12351/1998 HCA012351B/1998 XCHRX SANO SCREEN MANUFACTURERS LTD. v. J & R BOSSINI TRADING LTD. HCA012351B/1998 HCA 12351/1998 and HCA 12352/1998 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE ACTION NO. 12351 OF 1998 ____________ BETWEEN SANO SCREEN MANUFACTURERS LIMITED Plaintiff AND J & R BOSSINI TRADING LIMITED Defendant IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE ACTION NO. 12352 OF 1998 ____________ BETWEEN TRI-STAR FABRIC PRINTING WORKS LIMITED Plaintiff AND J & R BOSSINI TRADING LIMITED Defendant (Consolidated pursuant to the Order of the Hon Sakhrani J dated 15 June 2000) ____________ Coram: Hon Chung J in Chambers Date of Hearing: 18 October 2001 Date of Decision: 18 October 2001 _______________ D E C I S I O N _______________ 1. This is the Judgment Debtor's application (taken out on 15 October) for an interim stay of proceedings until the determination of the summons dated 12 October (returnable on 22 October). Although the last-mentioned summons has been described in the summons dated 15 October as the Judgment Debtor's summons, the summons dated 12 October was on its face taken out by a Mr Law Ka Sing, a former director of the Judgment Debtor (who has been represented by a different firm of solicitors in these proceedings). When that matter was raised with counsel for the Judgment Debtor, he informed me that a mistake has been made by his solicitors (who have been acting for the Judgment Debtor) in the description of the applicant in the summons dated 12 October. 2. The Judgment Creditor earlier applied for the hearing of the 15 October summons to be adjourned to another date but that was refused. The Judgment Debtor has indicated (at the court's suggestion) that it is agreeable to having the 2 summonses heard together today. The hearing scheduled for 22 October is accordingly brought forward so that it can be heard together with the Judgment Debtor's application for an interim stay of proceedings. 3. The background leading to the 2 applications has been set out in: (1) the Judgment dated 16 June 2000; (2) the Decision dated 12 March 2001; (3) the Court of Appeal's Judgment dated 20 July 2001. 4. Although it has not been expressly stated, the purpose of the present applications apparently to stay the oral examination of Mr Law which has been scheduled to take place before the Master at 10.00 am today. No other mode of enforcement of the Judgment dated 16 June 2000 has been made known to me. The ground put forth in support of these applications is that a petition for the winding up of the Judgment Debtor has been presented on 9 August 2001. Relying on Hong Kong Civil Procedure 2001 , para. 47/1/6 (at p. 660), counsel for the Judgment Debtor submits that in order for the Judgment Creditors to successfully resist these 2 applications, the Judgment Creditors must establish exceptional circumstances which justify the refusal of a stay of proceedings. 5. I consider that there are such exceptional circumstances because: (1) the history of the proceedings shows that Mr Law has earlier attempted to avoid his oral examination by relying on arguments which had been held both at first instance and on appeal to be unmeritorious; (2) the winding up petition was then presented at a time which is after the appeal referred to in (1) above and close to the time scheduled for Mr Law's oral examination; (3) it was presented by a company owned by Bossini Investments Ltd and J & R Bossini Holdings Ltd and can aptly be considered to be a company within the so-called \"Bossini Group\"; (4) the oral examination is a proceeding involving Mr Law and the Judgment Creditors. Counsel for the Judgment Debtor submits that it is possible that costs of the oral examination may be included in the judgment. He argues that it is therefore possible that the Judgment Creditors may gain priority over other creditors in the Judgment Debtor's liquidation (if a winding up order is made). 6. Costs are of course a matter in the discretion of the Master hearing the examination. It is possible that the Master may refuse to award costs against the Judgment Debtor when he or she is made aware of the presentation of the winding up petition. Even if such costs are included in the judgment, the Judgment Creditors will still have to rank pari passu with the other creditors in the event of the Judgment Debtor's liquidation. I therefore do not consider the argument set out in sub-para. (4) above to be valid. 7. Although it is unnecessary for me to include this in my consideration or determination, I find it surprising that the solicitors for the Judgment Debtor should mistakenly name Mr Law as the applicant of the summons dated 12 October. 8. By reason of the above matters, I find it appropriate to exercise my discretion to refuse the stay of proceedings sought by the 2 summonses. Both summonses are therefore dismissed. (Andrew Chung) Judge of the Court of First Instance High Court Representation: Mrs Dora K H Chan, instructed by Messrs Fred Kan & Co., for the Plaintiffs/Judgment Creditors Mr Delaney, instructed by Messrs Au Yeung, Lo & Chung, for the Defendant/Judgment Debtor Look up this case on Lawcite Noteup",
  "length": 5554,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2001/1354",
  "query": "stay of proceedings",
  "ts": "2025-10-14T11:23:07",
  "ok": true
}