{
  "title": "HARJIT SINGH V. MR. LAW MAN CHING, VIO AND OTHERS | [2025] HKCFI 100 | HKLII",
  "court": null,
  "year": 2025,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2025] HKCFI 100 HARJIT SINGH V. MR. LAW MAN CHING, VIO AND OTHERS Judgment Information Date 5 Jan, 2025 Action No. HCAL2393/2024 Neutral Cit. [2025] HKCFI 100 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCAL2393/2024 html PUBLIC \"-//W3C//DTD XHTML 1.0 Transitional//EN\" \"http://www.w3.org/TR/html4/loose.dtd\" HCAL2393/2024 HARJIT SINGH v. MR. LAW MAN CHING, VIO AND OTHERS HCAL 2393/2024 [2025] HKCFI 100 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTITUTIONAL AND ADMINISTRATIVE LAW LIST NO 2393 OF 2024 ________________________ BETWEEN HARJIT-SINGH Applicant and MR. LAW MAN-CHING, VIO 1 st Respondent and MRS. ROMLAH 2 nd Respondent and HONG KONG POLICE FORCE TO ICAC 20+ HK DEPARTMENTS 3 rd Respondent ________________ Before: Hon Coleman J in Chambers (Open to Public) Date of Decision: 6 January 2025 _________________ D E C I S I O N _________________ A. Introduction 1. By his application dated 6 December 2024, the Applicant seeks a writ of habeas corpus . The application was filed together with a supporting affirmation of the same date. 2. But the Applicant has not requested an oral hearing – indeed, he ticked the box to show he did not want an oral hearing – and I am satisfied that it is appropriate to deal with this application on the papers. B. Fundamental Misconception 3. An application for writ of habeas corpus may be applicable when the applicant suggests that he or she is the subject of unlawful detention. 4. However, nothing in the present application or in the supporting affirmation suggests that the Applicant is currently being detained. Indeed, the application appears to contain his own residential address, and mobile telephone numbers. On this basis, the habeas corpus application is entirely inappropriate, and it falls to be dismissed. C. Unintelligible Complaints 5. In fact, the supporting affirmation and its attachment seem potentially to identify an entirely different grievance – though the matters set out are, with respect, largely unintelligible. The body of the affirmation reads as follows (capitals in original) (sic): 1. 2011 to CRIME-CYBERCRIME, Google account hack-log in MR. VIO and MRS ROMLAH. 2. 22 DEC 2014 to NOW MY THOUSEND COMPLAINTS ON – CHEATING/FRAUD with CLOSED. MY COMPLAINT POLICE TO ALL NOT GIVE FINAL RESULT COPY. 3. CAPO-WANCHAI HQ 21-07-2015 on give me 3-page fake copy. Police tuen mun nt in next later 2 months written fake report. 4. Police to all in my name on Mr. VIO team send fake letters (closed complaint). 5. [2 telephone numbers set out] Google ACCOUNT IN LOGIN-ALL Mobie system HACK. 6. 31-12-2015 to want SWD welfare 50 month not give me 76-year old me road on sleep. 7. More 4 Page on affirmation. 6. There are indeed 4 attached pages, but I do not intend to rehearse the contents of those pages in this Decision. Suffice it to say that, in so far as the matters set out are intelligible at all, the complaint seems to be about the way that the Police and the Complaints against Police Office have handled his reporting of a crime that his Google account may have been hacked. He also refers to having filed complaints with more than 20 government departments, yet no one has been able to help him. I acknowledge some level of desperation in, for example, the Applicant’s statement that if what he puts forward is not true he suggests that he wants “full life prison or hang me”. 7. However, even if the application is taken to be some form of application for leave to apply for judicial review, no specific public law grounds of review have been identified – contrary to the mandatory requirements under the Rules of High Court Order 53 rule 3(4). The matters referenced also seem to go back many years, despite the requirement that any application for leave to apply for judicial review should be made promptly and in any event within 3 months of the impugned decision. D. Result 8. As an application for a writ of habeas corpus , the application is fundamentally flawed and misconceived because it is clear that the Applicant is not actually detained (whether lawfully or otherwise). 9. As an application for leave to apply for judicial review, the Applicant has failed to identify any reasonably arguable public law grounds of review with any realistic prospect of success, and most of the matters touched on are in any event stale for judicial review purposes. 10. The Applicant’s application is dismissed. I make no order as to costs. (Russell Coleman) Judge of the Court of First Instance High Court The applicant, acting in person Look up this case on Lawcite Noteup",
  "length": 4687,
  "headers_seen": [
    "A. Introduction",
    "B. Fundamental Misconception",
    "C. Unintelligible Complaints",
    "D. Result"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2025/100",
  "query": "cybercrime",
  "ts": "2025-10-17T10:44:35",
  "ok": true
}