{
  "title": "CHOI CHUEN YAU T/A CUTTING DE HEART AND CUTTING DE HEART NO 2 AND ANOTHER V. THE PRUDENTIAL ASSURANCE CO LTD | [2006] HKCA 545 | HKLII",
  "court": null,
  "year": 2006,
  "date": null,
  "content": "HKLII Databases Court of Appeal [2006] HKCA 545 CHOI CHUEN YAU T/A CUTTING DE HEART AND CUTTING DE HEART NO 2 AND ANOTHER V. THE PRUDENTIAL ASSURANCE CO LTD Judgment Information Date 23 Mar, 2006 Action No. CACV7/2006 Neutral Cit. [2006] HKCA 545 Parallel Cit. [2006] 3 HKLRD 158 [2006] HKCLRT 65 Download MS Word Judgment Reading Options Translation Toggle Highlight Appeal History CACV7/2006 CACV000007X/2006 CHOI CHUEN YAU t/a CUTTING DE HEART and CUTTING DE HEART NO 2 AND ANOTHER v. THE PRUDENTIAL ASSURANCE CO LTD [English Translation – 英譯本] CACV 7/2006 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF APPEAL CIVIL APPEAL NO. 7 OF 2006 (ON APPEAL FROM DCCJ NO. 1386 AND 2571 OF 2005) ------------------------------------- BETWEEN CHOI CHUEN YAU trading as CUTTING DE HEART and CUTTING DE HEART NO. 2 1 st Plaintiff RICH GROUP HOLDING LIMITED 2 nd Plaintiff and THE PRUDENTIAL ASSURANCE CO. LTD. Defendant ------------------------------------- Before: Hon Woo VP and Cheung JA in Court Date of Hearing: 17 March 2006 Date of Judgment: 24 March 2006 ------------------------ JUDGMENT ------------------------ Hon Woo VP (delivering the judgment of the Court): Introduction 1. This appeal stems from two actions in the District Court, DCCJ 1386/2005 and DCCJ 2571/2005. The plaintiff in DCCJ 1386/2005 was Choi Chuen Yau (“Mr Choi”) trading as Cutting de Heart and Cutting de Heart No. 2 (“Cutting”). The plaintiff in DCCJ 2571/2005 was Rich Group Holding Limited (“Rich Ltd”). The defendant in both actions was The Prudential Assurance Co. Ltd., the Chinese name of which is 英國保誠保險有限公司. 2. The claim in DCCJ 2571/2005 was initially brought before the Small Claims Tribunal, which subsequently transferred the claim to the District Court. 3. On 19 July 2005, upon the defendant’s application, District Judge Chow made an order consolidating the above two actions. 4. Cutting and Rich Ltd jointly took out insurance with the defendant. The insurance policy (“Policy”), the number of which was 900000382398, covered the salon business and assets of Cutting and Rich Ltd at Mezzanine and Ground Floors, 208 Sai Yeung Choi Street, Kowloon (“Insured Premises”). The Policy covered the period from 9 March 2004 to 8 March 2005. 5. On 22 May 2004, a fire occurred at the Insured Premises. Thereafter, Cutting and Rich Ltd claimed an indemnity from the defendant under the Policy. The claim comprised the following items: Policy Section Description Section IA Contents Section IB Sample and Trade Stocks Section II Business Interruption Section III Money Protection 6. The Extensions of Section I of the Policy provided as follows: Cost of Removal of Debris The Company will pay for the costs and expenses incurred with the Company’s consent in removing debris of Contents Sample and Trade Stocks following loss or damage insured under Section I for an amount not exceeding 10% of the Sum insured of Section I for any one year. 7. The above paragraph means that, following the insured loss or damage of all items, samples and trade stocks covered by Section I, the insurance company (i.e. the defendant) will pay for the expenses incurred with the company’s consent in removing debris of those items, provided that the amount to be paid will not exceed 10% of the sum insured under Section I for every year. 8. On 16 August 2004, the plaintiffs signed a consent document prepared by the defendant, which confirmed that the plaintiffs accepted the following sums: (1) $704,806.86 being the amount of indemnity in respect of all items at the Insured Premises covered by Section IA; (2) $169,329.47 being the provisional amount of indemnity in respect of samples and trade stocks covered by Section IB; and (3) $57,195.29 being the amount of indemnity in respect of samples and trade stocks covered by Section IB, but this amount was in dispute and to be dealt with later. 9. On or about 26 August 2004, the plaintiffs were paid the amounts of indemnity set out under (1) and (2) above, totalling $874,136.33. 10. Thereafter, the parties continued to negotiate the aforesaid amount of indemnity of $57,195.29 and, in the end, agreed that the sum was $55,444.34. They also agreed that the amount of loss under Section III was $3,000. 11. However, there was still a matter in dispute between the parties. The matter arose in this way. The defendant engaged Toplis, a surveying firm, to deal with the fire incident. On the plaintiffs’ version of events, Mr Buddy HS Tsang (“Mr Tsang”), a representative of the surveying firm, contacted the plaintiffs on 7 July 2004, suggesting that they should first engage Johnson Lam Trading Co., the so-called “junk collector”, to remove the samples and stocks covered by Section IB, and then Rich Ltd would remove the debris at the scene, and the costs incurred in the removal exercise would be dealt with in accordance with the Extensions of Section I of the Policy. 12. The $50,000 that Rich Ltd claimed against the defendant in the Small Claims Tribunal represented the costs incurred in the above removal exercise. However, upon transfer of the case to the District Court, Rich Ltd added a plea of fraud in its Statement of Claim and included a claim for damages for fraud. Cutting’s claims were for the above sums of $55,444.34 and $3,000, but upon transfer of Rich Ltd’s claim to the District Court, Cutting also amended its Statement of Claim by adding the same allegation of fraud. 13. Although the parties have agreed the amounts of indemnity of $55,444.34 and $3,000, the defendant has, up to now, neither admitted liability for the costs incurred by Rich Ltd in clearing up the scene nor agreed that those costs amounted to $50,000. And it is because of the dispute over those removal costs that the defendant has not paid, nor have the plaintiffs received, the aforesaid $55,444.34 and $3,000. 14. The correspondence between the parties reveals the defendant’s case to be that the removal costs are already included in the $874,136.33 being the agreed amount of indemnity. This is the crux of the dispute between the parties. Issues in this appeal 15. Relying on Condition 16 of the Policy, the defendant applied to the District Court for dismissal or stay of the plaintiffs’ two actions. Condition 16, which contains an arbitration agreement between the parties, provides as follows: Arbitration All differences arising out of this Policy shall be referred to the decision of an Arbitrator to be appointed in writing by the parties in difference or if they cannot agree upon a single Arbitrator to the decision of two Arbitrators one to be appointed by each of the parties in writing or in case the Arbitrators do not agree to the decision of an Umpire appointed by the Arbitrators in writing before entering upon the reference and the making of the award shall be a condition precedent to any liability of the Company or any right of action against the Company in respect of any claim. 16. The above paragraph means as follows: Any difference that arises out of the Policy will be referred to the decision of an arbitrator who is to be appointed in writing by the parties concerned. If the parties cannot agree upon the appointment of a single arbitrator, the difference will be referred to the decision of two arbitrators, one to be appointed in writing by each party. If the two arbitrators cannot agree upon a decision, they will appoint in writing an umpire to make the decision. An award made by this means will be a condition precedent to any liability of the insurance company and to any action against the insurance company in respect of any claim. 17. The defendant’s application was heard before District Judge Chow. In his written judgment of 21 October 2005, the learned Judge held that the plaintiffs’ allegations against the defendant involved the question whether the defendant had been guilty of fraud, and therefore refused the defendant’s application pursuant to Section 26 (2) of the Arbitration Ordinance ( Cap. 341 ). Section 26(2) provides as follows: (2) Where an agreement between any parties provides that disputes which may arise in the future between them shall be referred to arbitration, and a dispute which so arises involves the question whether any such party has been guilty of fraud, the Court shall, so far as may be necessary to enable that question to be determined by the Court , have power to order that the agreement shall cease to have effect and power to give leave to revoke the authority of any arbitrator or umpire appointed by or by virtue of the agreement. (emphasis added) 18. The defendant now appeals against the Judge’s decision. Grounds of appeal 19. The defendant puts forward a number of grounds of appeal, which can be summarized as follows: (1) The Judge had no jurisdiction to apply Section 26(2) of that Ordinance because only the Court of First Instance could exercise that jurisdiction. (2) The Judge had not made sufficient findings of fact or had failed to particularize the fraud that the plaintiffs alleged; and the plaintiffs had neither provided sufficient evidence nor specified in their Statements of Claim that the defendant had been guilty of fraud, so as to trigger the application of Section 26(2) to the present case. (3) The Judge had erred in applying Section 26(2) to the present case and, having failed to consider Sections 6(2)(a) and 6(2)(b) of the same Ordinance, had wrongly refused the defendant’s application. (4) The Judge had simply accepted the plaintiffs’ generic allegations of “fraud” without taking into account all relevant factors, and had therefore wrongly exercised the discretion under Section 26(2) in refusing the defendant’s application. Powers of the District Judge 20. The first question to be considered is whether a District Judge has the power to apply Section 26(2) of the Ordinance. 21. The “Court” referred to in the Arbitration Ordinance is defined in Section 2 of the Ordinance to mean the Court of First Instance. However, Section 2 states that the definition is to be used “unless the context otherwise requires”. The “Court” under Section 26(2) has power to order that an arbitration agreement shall cease to have effect and power to give leave to revoke the authority of any arbitrator or umpire appointed by or by virtue of an arbitration agreement. These are wide-ranging powers, and that section refers to the “Court” and not a “court” in the general sense of the word. Therefore, the “Court” under Section 26(2) may likely refer only to the Court of First Instance and not the District Court. Nevertheless, for the reasons to be set out below, it is not necessary for us to make a conclusive determination on this question. Also for the reasons below, we do not agree with the contention that Judge Chow did not have power to refuse the defendant’s application. 22. The defendant’s application before Judge Chow was made pursuant to Section 6(2) of that Ordinance, which provides as follows: (2) … if a party to an arbitration agreement that provides for the arbitration of a dispute involving a claim or other matter that is within the jurisdiction of the Labour Tribunal or a person claiming through or under such a party, commences legal proceedings in any court against any other party to the agreement or any person claiming through or under that other party, in respect of any matter agreed to be referred, and any party to those legal proceedings applies to that court after appearance and before delivering any pleadings or taking any other step in the proceedings, to stay the proceedings, the court or a judge of that court may make an order staying the proceedings, if satisfied that ― (a) there is no sufficient reason why the matter should not be referred in accordance with the agreement ; and (b) the applicant was ready and willing at any time the proceedings were commenced to do all things necessary for the proper conduct of the arbitration, and remains so. (emphasis added) 23. Section 6(2) is expressly made applicable to any court and empowers the relevant court to make an order staying the legal proceedings. In the application by the defendant to stay the two actions in question, Judge Chow had power under Section 6(2) to allow the application and, naturally, also had power under the same section to refuse the application. Judge Chow would take into account the conditions set out under Section 6(2) in determining whether or not to allow the application, but he was also entitled to have regard to other factors specified in the Ordinance, including the element of fraud under Section 26(2), in order to decide whether the matter should not be referred to arbitration in accordance with the arbitration agreement. The Judge was not exercising a power under Section 26(2), but was applying the factor set out in that section. Section 2AA(2)(b) of the Ordinance provides that: The Court should interfere in the arbitration of a dispute only as expressly provided by this Ordinance. The law as to whether a matter should be referred to arbitration 24. Mr Gidwani, Counsel for the defendant, referred to the decision of the UK Court of Appeal in Cunningham-Reid & Anor v Buchanan-Jardine [1988] 1 WLR 678 and also Wan Chung Construction Ltd v Lingnan University & Anor , HCCT 43/2001, in which the Court of First Instance held that Cunningham-Reid was applicable to Hong Kong. In respect of the question whether a dispute is to be referred to arbitration or remain to be tried by the court if a party to the dispute raises an allegation of fraud, Cunningham-Reid has elucidated the relevant legal principles and the factors to be considered by the court. These principles and factors are summarized as follows: (1) Under normal circumstances, the court should give effect to an arbitration agreement, which is an agreement between the parties. It follows that, where a party applies for a stay of legal proceedings so that the dispute can be referred to arbitration, the court should, in the absence of exceptional circumstances, allow the application. (2) The party opposing arbitration bears the burden of satisfying the court that there are sufficient reasons for not referring the dispute to arbitration in accordance with the arbitration agreement (as required by Section 6 (2)(a) of the Arbitration Ordinance ). (3) The desire of the party opposing arbitration to have a trial in open court is not a sufficient reason for refusing to stay the proceedings to arbitration. (4) There must be a prima facie case with convincing evidence to support the allegation of fraud. (5) Where there is a strong prima facie case of fraud and the party charged with fraud opposes arbitration, the court will definitely refuse to stay the legal proceedings. (6) Where the party alleging fraud relies on the allegation as the sole reason for opposing arbitration, the court will usually refuse to accede to that party’s request. (7) Where the party alleging fraud opposes arbitration, the court has a discretion to allow or refuse a stay of the legal proceedings, but the discretion must be exercised in light of all the circumstances of the case, such as whether the case is particularly suited to trial by a court rather than arbitration, or whether the case involves a special public interest aspect so that it is undesirable for the case to be dealt with by arbitration. 25. In Wan Chung Construction , Kwan J pointed out that, under Section 26 (2) of the Arbitration Ordinance , unless the court considers it necessary for an issue in dispute to be determined by the court, it should not refuse to refer the dispute to arbitration pursuant to Section 26(2). Whether sufficient evidence of fraud 26. On the question whether the plaintiffs have adduced sufficient evidence to show that the two actions in question involve the issue of whether any party thereto has been guilty of fraud, we have to point out that the consolidated action which forms the subject of this appeal has only reached the stage where the plaintiffs have amended their Statements of Claim. The defendant has not yet filed and served a Defence. The evidence on fraud may not be as complete or detailed as it should be. As long as there is sufficient material on the question of fraud on the part of any of the parties, the court can take into account the question of fraud in determining the application to stay the actions. 27. The material that pertains to fraud, as gathered from Cutting’s Amended Statement of Claim, Rich Ltd’s Statement of Claim and other relevant documents, is as follows: (1) On 7 July 2004, Mr Tsang of the surveying firm requested Rich Ltd, which was represented by Mr Choi, to clear up the scene and said that the expenses incurred in the exercise would be dealt with as an item of indemnity under the Policy. Accordingly, as far as the provision on removal of debris under Extensions of Section I of the Policy was concerned, Mr Tsang, as a representative of the defendant, had promised Mr Choi and Rich Ltd to indemnify Rich Ltd for the removal costs in accordance with the said provision. (2) After the scene was cleared up, Mr Tsang told Mr Choi that the removal costs would be dealt with after the other indemnity issues were resolved. (3) On 16 August 2004, the plaintiffs signed a consent document to confirm their acceptance of the aforesaid sum of $874,136.33 as the amount of indemnity. This notwithstanding, the defendant had not paid Rich Ltd the removal costs in accordance with the relevant provision under the Policy; rather, in a letter of 16 November 2004, the defendant stated that the plaintiffs’ claims had not been shown to include a claim for removal costs. (4) Further, in a letter of 1 December 2004, the defendant asserted that it had indemnified Rich Ltd for the removal costs, which had been assessed at $40,000. (5) Subsequently, in a letter of 20 December 2004, the defendant stated that the removal costs would, in the surveyor’s view, not exceed $20,000, and that on 6 July 2004 Mr Choi told Mr Tsang he accepted that the removal costs had been included in the amount of indemnity which was in excess of $700,000. (6) In its letter of 26 January 2005, Toplis stated that the defendant would pay $55,444.34 in full settlement of all outstanding claims for indemnity in respect of the plaintiffs’ goods. However, in the draft confirmation of indemnity attached to that letter, which the plaintiffs were requested to sign, the said $55,444.34 was expressed to be in full settlement of all outstanding items of indemnity under Section I of the Policy. 28. On the basis of the above, the plaintiffs’ case is that, on 7 July 2004, when Mr Tsang requested Rich Ltd to clear up the scene and promised that the defendant would compensate Rich Ltd for the removal costs in accordance with the Policy, he knew that the defendant would not pay that amount to Rich Ltd. 29. Mr Gidwani referred to a “confirmation of consent” document dated 7 March 2005 that the defendant prepared and requested the plaintiffs to sign. Mr Gidwani contended that the document, which expressly stated that acceptance of the $55,444.34 (and the parties subsequently also agreed upon the $3,000) by the plaintiffs would not prejudice the plaintiffs in the dispute over the removal costs, showed that the defendant would not deceive the plaintiffs. However, Mr Choi submitted that, in a subsequent “confirmation of consent” document dated 24 March 2005 that the defendant prepared and requested the plaintiffs to sign, the acceptance by the plaintiffs of $58,444.34 (the sum total of $55,444.34 and $3,000) was expressed to be in full settlement of all claims by the plaintiffs under the Policy. For this reason, the plaintiffs refused to sign that document and up to now have not received the $55,444.34 and $3,000, and this showed that the defendant intended to deceive the plaintiffs. 30. After the hearing of the present appeal on 17 March 2006, the plaintiffs twice wrote to this Court, complaining that the defendant had adduced untruthful evidence and made misrepresentations on the ground that the plaintiffs had never received the “confirmation of consent” document dated 7 March 2005. We must point out that, for the sake of fairness, after the conclusion of a trial, this Court will not consider any submission made unilaterally by one of the parties, and it is improper for a party to provide the court with further information or make further submissions with a view to influencing the court’s decision. In the present case, however, this Court received a letter dated 23 March 2006 from Messrs. Winnie Leung & Co, solicitors for the defendant, admitting that the defendant had made a mistake in that it had in fact not delivered the “confirmation of consent” document dated 7 March 2005 to the plaintiffs. We will not separately deal with this incident, which in our view does not have a bearing on the present appeal. Any party who wishes to make a complaint regarding the incident may do so by proper legal means. 31. The plaintiffs also referred to Clark and Lindsell on Torts (18 th Edition) para. 15-09 (the relevant legal principles are now set out in para. 18-10 of the 19 th Edition), which states that if a promisor does not intend to keep a promise when he makes the promise, then his act is fraudulent. Mr Gidwani did not dispute this legal principle. 32. In our view, the various allegations of the plaintiffs as set out above do support their plea of fraud. The claim in the Small Claims Tribunal 33. The claim in DCCJ 2571/2005 was initially brought in the Small Claims Tribunal and was subsequently transferred to the District Court. Mr Gidwani submitted that the original claim was only for $50,000 being removal costs and did not raise any allegation of fraud or include a claim for fraud, and therefore the allegation of fraud now made by the plaintiffs was open to doubt. 34. In response, Mr Choi submitted that the action was transferred pursuant to a request by the defendant and not by him. He said that his original intention was only to make a claim in the Small Claims Tribunal for the $50,000 removal costs and therefore no allegation of fraud was made. Upon transfer of the case to the District Court, Mr Choi thought that the plaintiffs should not relinquish or be deprived of the right to make a claim for fraud. 35. The Small Claims Tribunal has no jurisdiction over claims exceeding $50,000. Even if Rich Ltd included a plea of and a claim for fraud on top of its claim for removal costs, there would still be no room for increasing the amount of claim. It was therefore reasonable for Rich Ltd not to raise the issue of fraud. 36. In our view, since the claim was transferred to the District Court pursuant to the defendant’s application to the Tribunal, the fact that the plaintiffs did not make allegations of and claims for fraud until after the transfer does not render those allegations questionable. Other reasons for opposing arbitration 37. As stated above, the relevant legal principle is that, where the party alleging fraud relies on the allegation as the sole reason for opposing arbitration, the court will usually refuse to accede to that party’s request. It is therefore necessary for us to consider all the circumstances of the case. 38. Mr Gidwani submitted that, despite the allegation of fraud, there were no circumstances that made the present case particularly suitable for trial rather than arbitration, because an arbitrator should be competent enough to deal with the allegation of fraud which did not appear to be complicated. Mr Choi did not object to the contention that an arbitrator should be competent enough to deal with the allegation of fraud. Costs of arbitration 39. Mr Choi said that he had no idea whether the costs of arbitration would be higher than those of legal proceedings, but the plaintiffs were not wealthy and matters on costs would have a significant impact on their business. Given the party opposing arbitration bears the burden of satisfying the court that there are sufficient reasons for not referring the dispute to arbitration in accordance with the arbitration agreement, and since Mr Choi has not adduced evidence to show that the costs of arbitration would definitely be higher than those of legal proceedings, this in our view cannot constitute a reason for refusing arbitration. Furthermore, even if there is evidence showing that the costs of arbitration would definitely be higher – or even much higher – than those of legal proceedings, this is something which the parties should have taken into account in agreeing to refer disputes to arbitration. Therefore, generally speaking, arguments as to large amount of costs will not be accepted by the court. Another contract 40. The plaintiffs submitted that, looking at the matter from another perspective, the agreement between Mr Choi and Mr Tsang, or Mr Tsang’s promise, was an agreement between Mr Tsang on behalf of the defendant and Mr Choi on behalf of Rich Ltd, whereby the parties agreed that, if Rich Ltd cleared up the scene, the defendant would pay for the removal costs. This oral agreement can at law constitute a valid contract. Although this contract originated from the Policy, it can also be regarded as unrelated to the Policy and not governed by the provisions in the Policy. At the same time, this oral contract does not comply with Section 2AC (1) of the Arbitration Ordinance , which provides that an agreement is not an arbitration agreement unless it is in writing. Therefore, the agreement between Mr Choi and Mr Tsang is not governed by the Arbitration Ordinance . 41. Mr Gidwani contended that we should not consider this point since it was not raised before District Judge Chow. However, in our view, where the point is supported by facts, we can and should take it into consideration. 42. In our view, the point that the plaintiffs raised about the agreement being an independent contract is not unarguable. The court should take this into account in exercising the discretion under Section 6 (2)(a) of the Arbitration Ordinance . Transfer of the claim from the Tribunal to the District Court 43. As stated above, the claim by Rich Ltd was initially brought in the Small Claims Tribunal. It was subsequently transferred to the District Court and became DCCJ 2571/2005. Mr Choi said that the claim was transferred pursuant to an application not by him but by the defendant to the Tribunal. 44. But for the transfer, Rich Ltd could have enjoyed its right to pursue its claim in the Small Claims Tribunal free from the risk of being ordered to pay substantial costs. Now that the case is with the District Court, in the event of judgment being entered against the plaintiffs, they will most likely be ordered to pay the costs of the opposite party. This affects Rich Ltd’s rights and exposes it to a higher risk in terms of costs. The defendant’s present application to refer the case to arbitration is, in effect, seeking yet another transfer of the case, which is a waste of money and time and is unfair to the plaintiffs. This is another factor that we have to consider in determining how the discretion is to be exercised. The claim by Cutting 45. Cutting’s claim for the sums of $55,444.34 and $3,000 is obviously based on the Policy and is subject to the arbitration agreement in the Policy. As the relevant documents indicate, and as Mr Gidwani has not denied, those two sums have already been agreed by the parties although, for some unknown reason, the defendant has thus far not paid those sums. Nor has the defendant contended that there is any difference between the parties on those two sums. We therefore take the view that this claim is not a “difference” within the meaning of Condition 16 of the Policy and is not covered by the arbitration agreement under that Condition, and the legal proceedings should not be stayed merely because the defendant wishes to have the claim arbitrated. Another reason for not staying the proceedings is that, on the evidence, the defendant does not have any valid defence to the claim. 46. Furthermore, as the consolidation of the two actions indicates, there should be a close nexus between the claim for $55,444.34 and $3,000 and the claim for removal costs. In order to simplify the issues in dispute and avoid waste of costs, the actions should be tried by the same court. This was precisely why the defendant applied for consolidation of the two actions. Action should be tried in open court 47. Mr Choi also submitted that he desired to have the case tried in the open court because the plaintiffs would like to give evidence at trial on the defendant’s attitude and conduct in relation to indemnity matters following the fire incident as well as the way in which the defendant dealt with the plaintiffs’ claims, so that the public would be given an opportunity to learn how insurance companies treated their insured clients. This, Mr Choi said, would have a positive effect on consumer protection. 48. We consider this argument reasonable. The documents provided by the plaintiffs reveal that, even though the parties had reached a consensus on the amounts of indemnity for certain items only, the “confirmation of consent” document that the defendant prepared and requested the plaintiffs to sign stated that the plaintiffs agreed to accept the said sums in full settlement of all of their claims under the Policy. This kind of practice should put insured clients on full alert. They should be made aware of the undesirable consequences of signing such documents. Furthermore, despite the agreement between the parties on the sums of $55,444.34 and $3,000, the defendant has not made any payment thus far. This must be highly questionable, particularly in the absence of any explanation for the non-payment. On the other hand, although the defendant contended that the court should give effect to the arbitration agreement and that the defendant did not want what it regarded as unsubstantiated and false allegations of fraud to be ventilated at trial as this would adversely affect the defendant’s goodwill, we believe that, if those allegations of fraud are false or unarguable, the court will no doubt deliver the appropriate judgment after trial so that justice is done to the defendant. No damage will therefore be done to the defendant’s goodwill. Conclusion 49. For the above reasons, we see no room for interfering with the exercise by District Judge Chow of his discretion to refuse the defendant’s application. The appeal is accordingly dismissed. We also make an order nisi that the defendant is to bear the plaintiffs’ costs of this appeal, such costs to be taxed if not agreed. (K H Woo) (Peter Cheung) Vice President of the Court of Appeal Justice of Appeal The 1 st plaintiff (respondent) in person. The 2 nd plaintiff (respondent) represented by Mr Choi Chuen Yau, director. Mr Victor Gidwani, instructed by Winnie Leung & Co, for the defendant. Translated by Mr. Edmund Cham, Solicitor. Look up this case on Lawcite Noteup",
  "length": 31076,
  "headers_seen": [
    "Introduction",
    "Issues in this appeal",
    "Grounds of appeal",
    "Powers of the District Judge",
    "The law as to whether a matter should be referred to arbitration",
    "Whether sufficient evidence of fraud",
    "The claim in the Small Claims Tribunal",
    "Other reasons for opposing arbitration"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkca/2006/545",
  "query": "costs of arbitration",
  "ts": "2025-10-16T10:45:08",
  "ok": true
}