{
  "title": "OCBC WING HANG BANK LTD V. KAI SEN SHIPPING CO LTD | [2020] HKCFI 375 | HKLII",
  "court": null,
  "year": 2020,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2020] HKCFI 375 OCBC WING HANG BANK LTD V. KAI SEN SHIPPING CO LTD Judgment Information Date 3 Mar, 2020 Action No. HCAJ5/2019 Neutral Cit. [2020] HKCFI 375 Parallel Cit. [2020] 1 HKLRD 1217 [2020] 4 HKC 503 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCAJ5/2019 HCAJ5/2019 OCBC WING HANG BANK LTD v. KAI SEN SHIPPING CO LTD HCAJ 5/2019 [2020] HKCFI 375 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE ADMIRALTY ACTION NO 5 OF 2019 ____________ BETWEEN OCBC WING HANG BANK LIMITED (華僑永亨銀行有限公司) Plaintiff and KAI SEN SHIPPING COMPANY LIMITED (凱晟船務有限公司) Defendant ____________ Before: Hon Au-Yeung J in Chambers Date of Hearing: 27 November 2019 Date of Decision: 4 March 2020 _____________ D E C I S I O N _____________ Introduction 1. This is the application of Kai Sen (“ Kai Sen ”) to stay this action in favour of arbitration as required under an arbitration agreement. OCBC (“ OCBC ”), as holder of the bills of lading, denies that it is a party to any arbitration agreement. 2. On 22 January 2019, OCBC issued the writ of summons in these proceedings, seeking damages against Kai Sen arising from alleged misdelivery of cargo carried on “YUE YOU 903” (“ the Vessel ”). The statement of claim was filed on 19 March 2019. 3. Kai Sen is the owner of the Vessel and carrier of Cargoes described in 4 tanker bills of lading all dated 12 April 2018 (“ the Bills of Lading ”). The Cargoes were to be shipped from Dumai, Indonesia to Huangpu, China. The Bills of Lading were negotiable bills marked “To order”. 4. OCBC claims to have granted facilities in late April 2018 to Twin Wealth Oils and Fats (Hong Kong) Ltd, with Twin Wealth Comercial Offshore de Macau Limitida named as guarantor (collectively the “ Borrowers ”) and received from the Borrowers the original Bills of Lading and commercial invoices. OCBC thus claims to be lawful holder of the Bills of Lading and entitled to immediate possession of the Cargoes. 5. Kai Sen released the Cargoes without presentation of the original Bills of Lading. 6. OCBC claims damages against Kai Sen for breach of the contracts of carriage contained in or evidenced by the Bills of Lading, and breach of Kai Sen’s duty as carrier or bailee. 7. On 16 April 2019, Kai Sen applied for a stay of this action pursuant to Section 20 of the Arbitration Ordinance ( Cap 609 ) (“ the Ordinance ”) on the grounds that OCBC’s claim is subject to an arbitration agreement that has been incorporated into the Bills of Lading by reference. Kai Sen also claims that OCBC has unequivocally elected to proceed with arbitration by issuing a notice to commence arbitration dated 28 March 2019 (“ the Arbitration Notice ”). 8. OCBC submits that the validity of the purported arbitration agreement in this case is to be governed by English law, which provides that an arbitration agreement can only be incorporated into a bill of lading by specific words of incorporation. The position under Hong Kong law is the same. There are no such specific words of incorporation in respect of the Bills of Lading. Further, OCBC had no knowledge of the terms of the Charterparty until this dispute arose. OCBC only processed documents on D/P basis (documents against payment) subject to the Uniform Rules for Collections. The Arbitration Notice was issued to beat the limitation time and was not a submission of OCBC to arbitration. The relevant arbitration clause 9. The relevant provision of the Bills of Lading provides as follows: “This shipment is carried under and pursuant to the terms of the Contract of Affreightment/ Charter Party dated 2 nd March 2018 between [Kai Sen] as owner and TWIN WEALTH MACAO COMMERCIAL OFFSHORE LTD As Charterers, and all conditions, Liberties and exceptions whatsoever of the said Charter apply to and govern the rights of the parties concerned in this shipment…” 10. Clause 36 of the Charter Party dated 2 nd March 2018 (“ Charterparty ”) as referred to in the Bills of Lading provides an arbitration clause as follows: “ARB, IF ANY, IN HONGKONG UNDER ENGLISH LAW.” The relevant provisions under the Ordinance governing arbitration agreements 11. The Ordinance applies to an arbitration under an “arbitration agreement”, whether or not the agreement is entered into in Hong Kong, if the place of arbitration is in Hong Kong: Section 5 of the Ordinance. 12. Section 20(1)(1) of the Ordinance (which gives effect to Article 8 of the UNCITRAL Model Law) provides that: “A court before which an action is brought in a matter which is the subject of an arbitration agreement shall, if a party so requests not later than when submitting his first statement on the substance of the dispute, refer the parties to arbitration unless it finds that the agreement is null and void, inoperative or incapable of being performed.” 13. Section 19 of the Ordinance (which gives effect to Article 7 of the UNCITRAL Model Law (Option I) defines “arbitration agreement” as follows: (1) Section 19(1)(1): “Arbitration agreement” is an agreement by the parties to submit to arbitration all or certain disputes which have arisen or which may arise between them in respect of a defined legal relationship, whether contractual or not. An arbitration agreement may be in the form of an arbitration clause in a contract or in the form of a separate agreement.”; and (2) Section 19(1)(6): “The reference in a contract to any document containing an arbitration clause constitutes an arbitration agreement in writing, provided that the reference is such as to make that clause part of the contract .” (emphasis added) 14. In Yun Kwan Construction Engineering Ltd v Shui Tai Construction Engineering Co Ltd [2019] HKCFI 1841 , §5, G Lam J explains the legal position as follows: “(1) By Art 8(1) of the UNCITRAL Model Law, given effect by s 20 (1) of the Arbitration Ordinance ( Cap 609 ), this court must refer any matter which is the subject of an arbitration agreement and, therefore, stay further proceedings in the action to that extent. (2) Art 7 of the UNCITRAL Model Law (Option I), given effect by s 19 (1) of the Arbitration Ordinance , makes provision as regards what constitutes an “arbitration agreement”. In particular, Art 7(6) prescribes how an arbitration clause in a separate document may be incorporated as part of the contract: “The reference in a contract to any document containing an arbitration clause constitutes an arbitration agreement in writing, provided that the reference is such as to make that clause part of the contract.” Section 19 (3) of the Arbitration Ordinance likewise provides: “A reference in an agreement to a written form of arbitration clause constitutes an arbitration agreement if the reference is such as to make that clause part of the agreement.” (3) For the purpose of Art 7(6), it is not essential for there to be an explicit reference to the arbitration clause itself . Reference to a document, which contains the arbitration clause relied upon, may be sufficient, provided “the reference is such as to make that clause part of the contract” : Astel-Peiniger Joint Venture v Argos Engineering & Heavy Industries Co Ltd [1995] 1 HKLR 300 , 305-307; Gay Construction Pty Ltd & Another v Caledonian Techmore (Building) Ltd (Hanison Construction Co Ltd, Third Party) [1994] 2 HKC 562 , 566D. (4) The document referred to need not be a contract between the same two parties . It is possible under Art 7(6) to incorporate into a contract between A and B an arbitration clause, by reference to an agreement between B and C or even between X and Y or to an unsigned standard form of contract, which contains the arbitration clause: Astel-Peiniger , p 307. (5) Insofar as authorities in other jurisdictions suggest that for incorporation of an arbitration clause into a contract between A and B by reference to an agreement between B and C or X and Y, there must be a specific reference to the arbitration clause itself, they do not reflect the law of Hong Kong which is based on Art 7(6) and which has been established since Astel-Peiniger for 25 years. (6) The question of incorporation, in particular whether the reference is such as to make the arbitration clause part of the contract, is one of construction. The task of the court is to ascertain, with no preconceived notions, the parties’ intentions when they entered into the contract by reference to the words that they used : Astel-Peiniger , pp 311 & 313. (7) Like other questions of contractual construction, this involves examining the wording of the documents against the relevant background to identify what a reasonable person would have understood the parties to be using the language in the contract to mean: see eg Building Authority v Appeal Tribunal (Buildings) (ENM Holdings Ltd) (2018) 21 HKCFAR 194 , §53.” (Underline added) 15. The onus is on an applicant seeking a stay in favour of arbitration to show that there is a prima facie case that the parties are bound by an arbitration clause. Unless the point is clear, the court should not attempt to resolve the issue and the matter should be stayed for arbitration. See Truearns Co Ltd v Wealthy Fountain Holdings Inc [2019] HKCFI 1840 , at §14, DHCJ MK Liu. 16. The applicant only needs to show an arguable case. If whether or not an arbitration clause has been incorporated is capable of giving rise to respectable arguments from both sides, the issue should be resolved in favour of arbitration. See §24 of Truearns . The parties’ respective case and the issues 17. Mr Hau, solicitor advocate for Kai Sen, submits that in view of the statutory provisions, the arbitration clause in the Charterparty had been incorporated into the Bills of Lading and so this action should be stayed for arbitration. 18. OCBC does not dispute the above general principles but heavily relies on T W Thomas & Co Ltd v Portsea Steamship Co Ltd [1912] AC 1 for the proposition that an arbitration clause can only be incorporated into a bill of lading by express reference. Mr Luxton, counsel for OCBC, submits that to see if an arbitration clause has been incorporated into a bill of lading, one has to see if the purported arbitration clause has stipulated the governing law. If it has, it is the governing law which would decide whether or not the arbitration clause was incorporated. The purported arbitration clause in question stipulates English law to be the governing law. Thomas v Portsea is still valid English law. 19. Mr Hau, submits that application of the Ordinance is not confined to particular types of arbitration agreement. Since Astel-Peiniger , Thomas v Portsea has no application in Hong Kong after the Ordinance adopted Article 7 of the UNCITRAL Model Law. In any event, Thomas v Portsea was decided more than 100 years ago at the time when the UK House of Lords had expressed reservation about ousting the jurisdiction of the court. These reservations have no application to modern circumstances of Hong Kong after the Ordinance has adopted the UNCITRAL Model Law. The Ordinance renders the role of the Hong Kong court to basically one of support for the arbitral process and gives full effect to the principle of full party autonomy. See Astel-Peiniger , at pages 310-311. 20. The issues are therefore as follows: (1) What is the governing law of the arbitration agreement which governs the obligation to arbitrate? (2) Under that governing law, are specific words of incorporation required to incorporate an arbitration clause into a bill of lading? (3) Under Hong Kong law, are specific words of incorporation required to incorporate an arbitration clause into a bill of lading? (4) Whether OCBC’s commencement of arbitration amounted to unequivocal election to arbitration? Issue 1: What is the governing law of the arbitration agreement which governs the obligation to arbitrate 21. There are 3 types of law that apply in relation to arbitration: (1) The proper law of the contract that governs the substance of the dispute; (2) The law of the arbitration agreement, which governs the obligation to submit to arbitration; and (3) The procedural law that governs the conduct of the arbitration. See PCCW Global Ltd v Interactive Communications Service Ltd [2007] 1 HKLRD 309 , §§16-17, Tang VP (as he then was); Arbitration in Hong Kong: a Practical Guide, 2017, 4 th ed, §§6.009-6.010. 22. This stay summons is about type (2). 23. Under English law, the validity of an agreement to arbitrate must be tested by reference to the law which, assuming the validity of the clause, would have applied to it: Merkin, Arbitration Law, Service Issue No. 81, March 2019, §7.6.1. If there is such an express term, that choice will be regarded as conclusive even if the nominated law has no connection with the underlying contract to which it relates, given the divisibility of the arbitration agreement and the underlying contract: §7.8. 24. The principles in §25 were applied in Hong Kong in Sea Powerful II Special Maritime Enterprises (ENE) v Bank of China Ltd [2016] HKLRD 1032. The bill of lading expressly provided for all terms and conditions of the charterparty, “including the law and Arbitration Clause” to be incorporated. This was a judgment given when the Ordinance has come into force. 25. Anthony Chan J held that when deciding whether a choice of law and arbitration clause has been incorporated into a contract, “under Hong Kong conflicts rules, Hong Kong courts will regard the chosen law as the applicable law” (§19). The learned judge further held that as the arbitration clause in the charterparty specified the application of English law, English law was the putative applicable law. Under Hong Kong conflicts rules, English law was applicable to the question of whether the arbitration clause was incorporated into the bill of lading (§20). 26. The same conclusion was reached in Klöckner Pentaplast GmbH & Co KG v Advance Technology (HK) Co Ltd [2011] 4 HKLRD 262 , §26. Saunders J held that the starting point must be the terms of the particular clause and the contract in question. The contract between the parties including the arbitration clause must be examined to see if there was any agreement, express or implied by the parties as to the lex arbitri . It was only if agreement could not be found that the implication arose from the choice of seat, that the law of that place would be the lex arbitri . The reasoning was upheld by Tang VP in dismissing the plaintiff’s application for leave to appeal: HCMP 1836/2011, 19 October 2011, §§2, 7-8. 27. In the present case, the governing law, as stipulated in the purported arbitration agreement under the Charterparty, is English law, although the seat of arbitration is Hong Kong. Applying Sea Powerful II and Klöckner , it is English law that should govern the incorporation of an arbitration agreement into the Bills of Lading. Issue 2: Under English law, are specific words of incorporation required to incorporate an arbitration clause into a bill of lading? 28. Under English law, specific words of incorporation are necessary to incorporate “collateral” or “ancillary” clauses such as arbitration clauses or jurisdiction clauses: Aikens, Lord and Bools, Bills of Lading, 2016, 2 nd ed, §7.108(5); Merkin, Arbitration Law, §5.29.3; Scrutton on Charterparties and Bill of Ladings, 2017, 23 ed, §6-031. 29. The leading authority is Thomas v Portsea , §6, which held that general words of incorporation in a bill of lading will not normally be sufficient to incorporate an arbitration clause in a charterparty. 30. This continues to be good law as shown in eg The Delos [2001] 1 Lloyd’s Re 703, §§15-16. 31. Incorporation of the “conditions” of the charterparty does not suffice to incorporate an arbitration clause into a bill of lading: The Varenna [1983] 2 Lloyd’s Rep 592, p597lhs, CA. The addition of the words “whatsoever” makes no difference: The Delos, §16; Siboti K/S v BP France SA [2004] 1 CLC 1, §46. 32. The rationale for the rule in Thomas and Portsea, which has existed for over a century, is as follows. 33. Firstly, bills of lading are negotiable instruments which may pass through many hands internationally. There are jurisdictional consequences to incorporation of an arbitration clause. See The Federal Bulker, p105rhs, Bingham LJ; Siboti K/S v BP France SA , §§34-35, Gross J. 34. Secondly, charterparties commonly contain terms that are not relevant to the legal relationship between the carrier and the holder of the bill of lading. Terms of the charterparty are only incorporated by general words to the extent that they are directly germane to the matters covered by the bill of lading, ie those clauses relating to the shipment, carriage and delivery of goods; but does not include an arbitration clause. See Siboti, §24(iii). 35. Thirdly, this is an area where the law should be clear, certain and well understood and the court should try to give effect to settled authority as best we can: The Federal Bulker, at p105rhs, Bingham LJ. 36. Applying English law, the arbitration agreement in the Charterparty has not been incorporated into the Bills of Lading by specific reference. Whether OCBC had knowledge of the terms of the Charterparty was irrelevant. Ken Sai’s application for stay must be dismissed. Issue 3: Under Hong Kong law, are specific words of incorporation required to incorporate an arbitration clause into a bill of lading? 37. If I am wrong in my analyses of issue 2, there is no difference to the result even if Hong Kong law applies to the Bill of Ladings. I have alluded to the cased of Klöckner full II and Klöckner above, which upheld the parties’ choice of English law to the bill of lading and applied the Thomas v Portsea principle. 38. Further, 2 Privy Council decisions on appeal from the Hong Kong courts confirmed that Thomas v Portsea only applied to bills of lading or negotiable instruments but not to other contracts: The Pioneer Container [1994] 2 AC 324 ; The Mahkutai [1996] 2 HKC 1 , pp 15I-16A, Lord Goff. 39. In The Pioneer Container, the Privy Council, had to decide if cargo owners were bound by an exclusive jurisdiction clause, pursuant to the doctrine of sub-bailment on terms. The Privy Council acknowledged that application of the Thomas v Portsea principle in bills of lading occupied a “special corner of the law”. Lord Goff held, at p345H-346C: “In support of this submission, they relied on the well-known line of authority concerned with the incorporation of charter party terms into bills of lading, of which Thomas & Co. Ltd. v. Portsea Steamship Co. Ltd. [1912] AC 1 is perhaps the most familiar. However the present context is by no means identical with that in the Thomas v Portsea line of cases, which have been described as a special corner of the law (see The Varenna [1983] 2 Lloyd’s Rep 592, 594 per Sir John Donaldson, M.R.). In this line of cases, the question is whether general words incorporating the terms of a charter party into a bill of lading contract are effective to incorporate, for example, an arbitration clause in the charter party; and it is readily understandable that, in so transporting terms from one contract of carriage to another, some limit should be placed on the incorporation by relating it to the subject matter of the receiving contract. Here, however, the question is whether consent given by the owner of goods to his bailee to bail the goods to a sub-bailee on any terms is wide enough to embrace an exclusive jurisdiction clause in the contract governing the sub-bailment; and their Lordships do not perceive a similar need to limit the terms so consented to.” (Underline added) 40. Mr Hau, relies heavily on Astel Peininger at 310(35) which held that an arbitration clause in a sub-contract could be incorporated by reference into a sub-sub-contract. It was a construction dispute and both parties were in possession of the relevant terms and conditions. In the course of his judgment, Kaplan J highlighted the special status of bills of lading as negotiable instruments and refused to apply Thomas v Portsea to contracts beyond bills of lading. “In my judgement, the real problem facing the House of Lords in Thomas v. Portsea was the question of negotiability of the bill of lading. Bills of lading are not signed by both parties to them and the owner of the goods and subsequent owners would have no knowledge of the terms of the charterparty between the shipper and the owner of the ship. It is easy to see why the House was reluctant to incorporate by reference on the facts of that case. Nevertheless, as can be seen from some of the authorities cited above, there has been a sea change of opinion and attitude as exemplified by the 1979 Act in England, the 1982 and 1989 amendments in Hong Kong and the adoption of Model Law in Hong Kong and in other jurisdictions. It seems to me that Thomas v Portsea must be viewed in the context of dealing with a negotiable instrument, namely a bill of lading. Different considerations can be said to apply in those circumstances. It is also [a] case which must be considered in the light of the actual words relied upon to support the argument in favour of incorporation. The expressions of reservations about ousting the jurisdiction of the court in that case fall on infertile ground in Hong Kong at the end of the twentieth century, a fortiori, when the legislature has enacted the Model Law which relegates the role of the court to basically one of support for the arbitral process and gives full effect to the principle of full party autonomy . In the light of my construction of Article 7(2) of the Model Law discussed above, I am therefore quite satisfied that insofar as Thomas v Portsea is authority for the proposition that the arbitration clause must be specifically referred to before it can be satisfactorily incorporated, it has no application in Hong Kong. The task before the Court in determining whether or not there has been incorporation by reference is one of construction; namely, to ascertain the parties’ intentions when they entered into the contract by reference to the words that they used.” (Underline added) 41. The Chief Justice of the Singapore Court of Appeal adopted Kaplan J’s ruling in International Research Corp PLC v Lufthansa Systems Asia Pacific Pte Ltd [2014] 1 SLR 130 , at §33(a) and 34. It involved a contract on a maintenance, repair and overhaul system. Sundaresh Menon CJ opined that the strict rule in Thomas v Portsea “ has been overextended impermissibly from its original application in the context of bills of lading and charterparties. It clearly should not be taken as a rule of general application.” 42. In the following cases, the Hong Kong Court declined to apply the Thomas v Portsea principle to non-bill of lading contracts. (1) Contracts relating to international sale of crude oil in Saberu Co Ltd v Marubeni International Petroleum Co Ltd, HCA 3244/1988, 12 December 1988, §14, p6, DHCJ Rogers QC (as he then was); (2) Shareholders’ dispute in Dickson Valora Group (Holdings) Co Ltd v Fan Ji Qian [2019] 2 HKLRD 173 , G Lam J, §24; and (3) Construction dispute in Yun Kwan v Shun Tai. 43. Mr Hau points out that the Bills of Lading do not contain separate provisions on matters such as choice of law or dispute resolution, which are of particular importance to shipments involving multiple parties and jurisdictions. The absence of choice of law/ dispute resolution clause in the contract itself is an important factor that the Court considers that an arbitration clause must have been incorporated: Dickson Valora , at §§25 and 26. 44. With respect, under type (2) law (paragraph 21(2) above), if an arbitration clause is not incorporated by express words into a bill of lading, the lack of separate provisions on matters such as choice of law under type (3) law is irrelevant. 45. In summary, in Hong Kong, the rule in Thomas v Portsea is still good law in relation to bills of lading. An incorporation by general reference to the arbitration clause in the Charterparty could not meet the proviso in Section19(1)(6) of the Ordinance. If Hong Kong law applies, this application would still be dismissed. Other common law jurisdictions 46. All Model Law countries have consistently restricted the application of Thomas v Portsea to bills of lading cases. (1) Singapore: International Research v Lufthansa System ; Rals International Pte Ltd v Cassa di Risparmio di Parma e Piacenza SpA [2016] 5 SLR 455 , §48, CA (a case on promissory notes); (2) Australia: Hi-Fert Pty Ltd v Unites Shipping Adriatic Inheritance claim (1998) 89 FCR 166 , §176B-E, Emmett J of the Federal Court; (3) Canada: Dongnam Oil & Fats Co Ltd v Chemex Ltd, 2004 FC 1732 , §28. 47. Adoption of a consistent approach with these common law jurisdictions, would promote certainty in interpretation of arbitration agreement in bills of lading. 48. OCBC’s evidence was that it was not aware of the terms of the Charterparty. Kai Sen submitted that the arbitration clause was a usual term in a typical charterparty, so with more than 30 years’ experience in the business of handling export bill transactions, OCBC must have been aware of it. These are irrelevant to the question of whether the arbitration clause has been incorporated to the Bills of Lading. Issue (4): Whether OCBC’s commencement of arbitration amounted to unequivocal election to arbitration? 49. Parties may impliedly agree to arbitration by commencing or participating in arbitration without reservation. Such an ad hoc agreement may constitute an arbitration agreement which binds the parties. In The Amazonia [1990] 1 Lloyd’s Rep 236, Staughton LJ stated (p 243rhs): “The rule ought to be that if a person wishes to preserve his rights by taking part in arbitration under protest, he must make his objection clear at the start – or at least at a very early stage. Otherwise he ought to be bound.” 50. In The Marques de Bolarque [1984] 1 Lloyd’s Rep 652, the respondent to an arbitration had written to the claimant to say that, “without prejudice to such rights as owners may have”, they were nominating an arbitrator. Hobhouse J held that those words were a sufficient reservation of the right to object to the jurisdiction of the arbitrator, and so did not confer jurisdiction on the arbitrators which they did not otherwise have. 51. In Allied Vision Limited v VPS Film Entertainment GmbH [1991] 1 Lloyd's Rep 392, Potter J followed the same approach, noting that “subsequent participation in the arbitration under the umbrella of the original reservation will not, without more, amount to a waiver or ad-hoc submission” (p 398lhs). 52. Article 7(5) of the Model Law provides that an arbitration agreement is in writing if it is contained in an exchange of statements of claim and defence in which the existence of an agreement is alleged by one party and not denied by the other: Section 19(1) of the Ordinance. 53. Ken Sai submits that OCBC has submitted to arbitration by giving the Arbitration Notice. That notice expressly refers to Clause 36 of the Charterparty ( ie the arbitration clause). Ken Sai has accepted the commencement of arbitration. 54. OCBC explains that its reason for commencing arbitration was to beat the limitation period. For a claim in misdelivery of the Cargoes under the Bills of Lading, Ken Sai has a one-year limitation period pursuant to Art III, r6 of the Hague-Visby Rules. OCBC was caught in a difficult situation. The Bills of Lading were issued on 12 April 2018. OCBC did not know when the Cargoes were delivered. The limitation period would have expired in April 2019 if the misdelivery occurred in April 2018. 55. In February 2019, OCBC’s invited Ken Sai to withdraw its dispute to the court’s jurisdiction but it was not accepted. In March, OCBC invited Ken Sai to consent to a general extension of time for commencement of arbitration due to this jurisdictional challenge. Again, that was not accepted. 56. The notice to commence arbitration was issued on 28 March 2019. The cover letter of the same date expressly disclaimed admission to Ken Sai’s position and maintained OCBC’s pleaded position that Hong Kong courts have jurisdiction. The cover letter stated that: “All our client’s rights (including but not limited to their rights to continue with the Hong Kong court proceedings, action numbered HCAJ 5/2019) and remedies remain expressly reserved.” This stay summons was issued by Kai Sen on 16 April 2019, over a year from the date of the Bills of Lading. 57. Given OCBC’s clear position in the pleadings and the cover letter, the existence of the arbitration agreement has been clearly denied by the Plaintiff, within the meaning of article 7(5), Model Law. 58. I find that commencement of arbitration was plainly OCBC’s act to preserve its claim pending resolution of the jurisdictional dispute rather than submission to arbitration. I dismiss Kai Sen’s argument. Conclusion 59. Although the general position under the Ordinance is that an arbitration agreement can be incorporated into a contract by reference, it is not the same with a bill of lading. The starting point of the court is to look at the bill of lading to ascertain the intention of the parties. In this case, the governing law under the purported arbitration clause is English law, which requires incorporation of an arbitration clause into a bill of lading by express wording under the authority of Thomas v Portsea. That special principle has been preserved under Hong Kong law by the Privy Council and applies to bills of lading and other negotiable instrument. For other contracts, incorporation of an arbitration clause is permissible by virtue of Section 19(1) of the Ordinance. As the arbitration clause in the Charterparty was not incorporated, the Hong Kong Court has jurisdiction. 60. I therefore order as follows: (1) The summons for stay of proceedings in favour of arbitration be dismissed; (2) On a nisi basis, costs of the summons be to OCBC to be summarily assessed on 1 April 2020; costs statement and grounds of objection are to be faxed to Au-Yeung, J’s clerk; and (3) Ken Sai do file and serve its defence within 28 days from the date of this decision. 61. I thank Mr Luxton and Mr Hau for their thorough preparation of this case. (Queeny Au-Yeung) Judge of the Court of First Instance High Court Mr Nick Luxton, instructed by Stephenson Harwood, for the Plaintiff Mr Hau Pak Sun, Solicitor Advocate, of Charles Chu & Kenneth Sit, for the Defendant Look up this case on Lawcite Noteup",
  "length": 30589,
  "headers_seen": [
    "Introduction",
    "The relevant arbitration clause",
    "The relevant provisions under the Ordinance governing arbitration agreements",
    "The parties’ respective case and the issues",
    "Issue 1: What is the governing law of the arbitration agreement which governs the obligation to arbitrate",
    "Issue 2: Under English law, are specific words of incorporation required to incorporate an arbitration clause into a bill of lading?",
    "Issue 3: Under Hong Kong law, are specific words of incorporation required to incorporate an arbitration clause into a bill of lading?",
    "Other common law jurisdictions"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2020/375",
  "query": "seat of arbitration",
  "ts": "2025-10-16T10:49:56",
  "ok": true
}