{
  "title": "PREMIERE AGRI TECHNOLOGIES ASIA INC AND ANOTHER V. WONG SIU HUNG JOHN AND ANOTHER | [2002] HKCFI 732 | HKLII",
  "court": null,
  "year": 2002,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2002] HKCFI 732 PREMIERE AGRI TECHNOLOGIES ASIA INC AND ANOTHER V. WONG SIU HUNG JOHN AND ANOTHER Judgment Information Date 25 Sep, 2002 Action No. HCA790/2001 Neutral Cit. [2002] HKCFI 732 Download MS Word Judgment Reading Options Translation Toggle Highlight Appeal History HCA790/2001 HCA000790/2001 PREMIERE AGRI TECHNOLOGIES ASIA INC AND ANOTHER v. WONG SIU HUNG JOHN AND ANOTHER HCA000790/2001 HCA 790/2001 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE ACTION NO. 790 OF 2001 ______________ BETWEEN PREMIERE AGRI TECHNOLOGIES ASIA INC 1st Plaintiff JIP HONG INTERNATIONAL (HK) LIMITED 2nd Plaintiff AND WONG SIU HUNG JOHN 1st Defendant SANDAL EAGLE LIMITED 2nd Defendant ______________ Coram: Hon Ma J in Chambers Date of Hearing: 26 September 2002 Date of Decision: 26 September 2002 Date of Handing Down of Reasons for Decision: 2 May 2003 _______________________ REASONS FOR DECISION _______________________ The summonses before the court 1. On 26 September 2002, I dealt with two summonses:- (1) The 1st Defendant's summons dated 15 March 2002 to strike out the Statement of Claim. (2) The Plaintiffs' summons dated 8 May 2002 for leave to amend the Writ and Statement of Claim seeking, inter alia, to add a third defendant, being the wife of the 1st Defendant. 2. After hearing submissions, I made the following orders:- (1) On the 15 March 2002 summons to strike out the Statement of Claim, I dismissed the summons with the costs of and occasioned by the summons to be to the Plaintiffs, such costs to be taxed on and indemnity basis, if not agreed, and paid forthwith. (2) On the 8 May 2002 summons for leave to amend, I gave leave to amend in terms of paragraphs 1, 2 and 4 of that summons except that the costs of and occasioned by the hearing itself were to be to the Plaintiffs in any event. 3. The Writ in the present action was issued on 17 February 2001. It was endorsed with a Statement of Claim which was the subject matter of the 15 March 2002 summons. There have been three versions of the Defence of the 1st Defendant (the original Defence is dated 23 March 2001, the Amended Defence is dated 1 September 2001 and the Re-Amended Defence is dated 9 October 2001). The action has progressed to the stage of witness statements having been exchanged in December 2001 and January 2002. Only after this exchange did the 1st Defendant decide to apply to strike out the Statement of Claim. The Plaintiffs' claims in the Statement of Claim 4. As pleaded in the Statement of Claim:- (1) The Plaintiffs carry on business in the bioproducts industry and are part of a group known as the Archer Daniel Midlands Group of companies. The 1st Plaintiff is a US incorporated company (but registered under Part XI of the Companies Ordinance ). The 2nd Plaintiff is a Hong Kong registered company carrying on the business of trading in amino acid lysine in the Mainland. (2) The 1st Defendant was employed by the 1st Plaintiff under an employment agreement dated 18 May 1994 (\"the Employment Agreement\") whereby he was engaged as the general manager of the 2nd Plaintiff. Contractual duties were owed by the 1st Defendant to the1st Plaintiff (by reason of the Employment Agreement). Fiduciary duties were also owed by the 1st Defendant towards both Plaintiffs (by being the employee of the 1st Plaintiff and also the agent of the 2nd Plaintiff). (3) In addition, the 1st Plaintiff and the 1st Defendant entered into a Non-Disclosure Agreement also dated 18 May 1994 (\"the Non-Disclosure Agreement\") whereby the 1st Defendant agreed, whether by himself or his wife (the 3rd Defendant brought in by the proposed amendments to the Writ), not to have a financial interest greater than 10% in any company or enterprise which was in competition with the 1st Plaintiff and also to file a list of any such interests greater than 2% with the Secretary of the 1st Plaintiff. There is said to have been a breach of this Agreement by the fact that the 1st Defendant caused to be incorporated in the British Virgin Islands, the 2nd Defendant, obviously without the Plaintiff's knowledge. (4) As the general manager of the 2nd Plaintiff, the 1st Defendant entered into a number of transactions on behalf of that company. One was an Import Agency Agreement made on or about 1 June 1999 (\"the Import Agency Agreement\") whereby the 2nd Plaintiff engaged a company called Shanghai MT Industrial Limited (\"SMIL\") to assist in its operations of selling lysine in the Mainland, including associated matters such as the transportation and warehousing of that commodity. (5) Another transaction made by the 1st Defendant on the 2nd Plaintiff's behalf in or about August 1999 was the sale by the 2nd Plaintiff of 340 metric tonnes of lysine to a PRC entity called Sichuan Poultry Husbandry (\"SPH\") for the price of US$442,000.00. (6) After the delivery of the 340 metric tonnes of lysine to SPH, the 1st Defendant arranged, through the 2nd Defendant, the payment of only US$212,000.00 to the 2nd Plaintiff. It was represented by the 1st Defendant that the balance US$230,000.00 had been paid directly by SPH to SMIL in relation to various charges due to SMIL under the Import Agency Agreement. (7) On 6 January 2000, the 1st Defendant was dismissed by the 1st Plaintiff. By a written statement dated 7 January 2000, the 1st Defendant made various representations (which were no doubt intended as admissions of breaches of contract and duty on his part). I need only refer to two of these representations for the time being:- (a) that while he acknowledged that the sale of the lysine to SPH involved the 2nd Defendant as an intermediary (unknown to the Plaintiffs since the only intermediary known to them was Shanghai Jiao Da Ang Li BioProducts Limited but the contract with this entity was a forgery), nevertheless of the said purchase price of US$442,000.00, $212,000.00 was paid to the 2nd Plaintiff while the balance of US$230,000.00 was indeed paid to SMIL; (b) that he (the 1st Defendant) was liable to the 2nd Plaintiff for US$180,000.00. (8) Relying on these representations made by the 1st Defendant, the 2nd Plaintiff and the 1st Defendant then entered into a termination agreement (\"the Termination Agreement\") whereby it was agreed that the 1st Defendant's employment would be terminated for gross misconduct and that provided the 1st Defendant paid to the 2nd Plaintiff the said sum of US$180,000.00, the 2nd Plaintiff would not pursue any claims it had against the 1st Defendant arising out of or in connection with the matters stated in the first paragraph of the Termination Agreement. (9) The Plaintiffs now wish to rescind the Termination Agreement on the basis of misrepresentation. Again, I need only refer to two such allegations. First, it is now discovered that far from US$230,000.00 having been paid to SMIL, this was not received by SMIL at all. SMIL has since claimed successfully in arbitration proceedings in Shanghai against the 2nd Plaintiff for this sum. The relevant award is dated 25 December 2000. It is alleged by the Plaintiffs that in fact US$200,000.00 of this sum was transferred to a time deposit in the 2nd Defendant's name. Secondly, various unauthorised transfers totalling US$740,000.00 of the 2nd Plaintiff's money were made to the 2nd Defendant's account on 23 and 28 June 1999. This had been asserted by the 1st Defendant to be some indebtedness owed presumably by the 2nd Plaintiff to SPH. By a contract dated 23 June 1999, however, the 2nd Defendant agreed to purchase 510 metric tonnes of lysine as for its own account from BASF China Limited (\"BASF). On 29 June 1999, the 2nd Defendant used $490,000.00 of the said sum of US$740,000.00 to make payment to BASF. (10) The Plaintiff also claims against the 1st Defendant in relation to the said sum of US$230,000.00 and other breaches of duty, some of which I have already referred to above. There is also a claim based on the 1st Defendant making unauthorised amendments to the Import Agency Agreement which is alleged to have caused the 2nd Plaintiff loss and damage. (11) In summary, the relief claimed by the Plaintiffs against the 1st Defendant include the rescission of the Termination Agreement, damages (both common law and equitable) and an account of profits. The application to strike out 5. In the 1st Defendant's summons to strike out, the stated grounds are that the Statement of Claim discloses no reasonable cause of action or is frivolous or vexatious or is otherwise an abuse of the process of the court. 6. The first ground requires the court to look only at the Statement of Claim itself with no extraneous evidence. In my judgment, it clearly discloses viable causes of action on its face. 7. The other grounds permit affidavit evidence to be adduced but the same rule of practice applies on a consideration of a strike-out application based on these grounds. It is only in clear and obvious cases that a striking out order will be made. The reason of this is of course simple: a party should not be deprived of the right to have its claims resolved at trial unless it is clear and obvious that its claims are unsustainable. 8. In the hearing before me, two hearing bundles were prepared comprising some 800 pages and these bundles contained:- (1) 4 affirmations or affidavits. (2) 7 witness statements. (3) Other documents which Mr Edward Chan (who represented the 1st Defendant) said comprised most but not all of the relevant documents in the action. 9. The 1st Defendant's application to strike out was based essentially on:- (1) The implausibility or sheer improbability of the Plaintiffs' version of events. (2) Inconsistencies in the Plaintiffs' evidence. (3) Contrary versions of the relevant events proffered by the 1st Defendant himself. 10. It is clear that the disputes between the parties will have to be resolved at trial. Even on the 1st Defendant's own version of events, his allegations will need to be tested by cross-examination. For example, in relation to the written statement dated 7 January 2000 which he signed after meeting with various representatives from the Plaintiffs, the 1st Defendant says his signature was procured by threats, duress and inducements. In relation to the said sum of US$230,000.00 which SMIL has apparently successfully claimed against the 2nd Plaintiff in arbitration proceedings, the 1st Defendant maintains that of this sum, US$50,000.00 was paid to a Mr Shi Yue Hing of SMIL on his instructions with the balance US$180,000.00 being left in the 2nd Defendant's account pending further instructions from this Mr Shi. Mr Shi is said by the 1st Defendant to have been in charge at SMIL. 11. In a case involving allegations of fraud, duress and breaches of fiduciary duty, an application to strike out requiring the court not only to go though quite voluminous documentation but also to reach findings of credibility based purely on affidavit evidence and witness statements, is really quite hopeless. 12. Ultimately, I think Mr Chan did not really press these points with too much enthusiasm. His main argument, rather, was that since the 2nd Plaintiff had already received payment of US$180,000.00 from the 1st Defendant under the Termination Agreement, the case based on the rescission of that Agreement was not possible without first returning this sum to the 1st Defendant. This is correct only insofar as credit will have to be given to the 1st Defendant should the Plaintiff succeed, but it is quite wrong to say that the claim for rescission must fail unless this sum (representing restitutio in integrum ) is first paid \"upfront\". It will go into the final reckoning should the Plaintiff succeed. In any event, had this sum been repaid to (and accepted by) the 1st Defendant, there must be an argument open to the Plaintiffs that by such an acceptance, the 1st Defendant would have implicitly accepted that the Termination Agreement should indeed be set aside. 13. I have no hesitation in dismissing the 1st Defendant's application to strike out. The order for costs reflects the lack of merit in the application. The application for leave to amend the Statement of Claim 14. In resisting the application for his client, Mr Chan submitted that there was an insufficient case of conspiracy pleaded against the proposed 3rd Defendant. I would dispose of this objection quite shortly. Quite apart from the fact it is questionable whether this point is open to the 1st Defendant to take (albeit he is the 3rd Defendant's husband), the pleading when read as a whole is sufficient in my view. In particular, see paragraphs 15A and 35A of the amended pleading. (Geoffrey Ma) Justice of Appeal Representation: Mr Roger Beresford, instructed by Messrs Baker & McKenzie, for the Plaintiffs. Mr Edward M.H. Chan, of Messrs Chan, Wong & Lam, for the 1st Defendant. Look up this case on Lawcite Noteup",
  "length": 12932,
  "headers_seen": [
    "The summonses before the court",
    "The Plaintiffs' claims in the Statement of Claim",
    "The application to strike out",
    "The application for leave to amend the Statement of Claim"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2002/732",
  "query": "non-disclosure agreement",
  "ts": "2025-10-17T10:45:11",
  "ok": true
}