{
  "title": "THE SUMITOMO BANK LTD. V. XIN HUA ESTATE LTD. AND OTHERS | [1999] HKCFI 315 | HKLII",
  "court": null,
  "year": 1999,
  "date": null,
  "content": "HKLII Databases Court of First Instance [1999] HKCFI 315 THE SUMITOMO BANK LTD. V. XIN HUA ESTATE LTD. AND OTHERS Judgment Information Date 4 Feb, 1999 Action No. HCCL256/1998 Neutral Cit. [1999] HKCFI 315 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCCL256/1998 HCCL000256/1998 XCHRX THE SUMITOMO BANK LTD. v. XIN HUA ESTATE LTD. AND OTHERS HCCL000256/1998 HCCL256/98 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE COMMERCIAL LIST NO.256 OF 1998 --------------- BETWEEN THE SUMITOMO BANK LIMITED Plaintiff AND XIN HUA ESTATE LIMITED 1st Defendant HONG KONG SUN WAH FINANCE HOLDINGS LIMITED 2nd Defendant GUANGDONG DEVELOPMENT BANK 3rd Defendant --------------- Coram : The Hon Mr Justice Stone in Chambers Date of Hearing : 5 February 1999 Date of Delivery of Judgment : 5 February 1999 ____________________ D E C I S I O N ____________________ 1. I have before me this morning an anti-suit injunction pursuant to a summons issued by the Plaintiff dated 26th October 1998. By this summons the Plaintiff asks that the 1st Defendant be restrained from continuing or prosecuting or assisting in the prosecution of proceedings commenced by the 1st Defendant against the Plaintiff in the Guangdong Higher People's Court, People's Republic of China on 13th May 1998, and from commencing proceedings elsewhere other than the courts of Hong Kong as regards any dispute arising out of, or in connection with the facility agreement dated 26th March 1997 between the Plaintiff and the 1st Defendant. 2. The injunction itself is highly contested and I have had the considerable advantage this morning of the parties being represented by Mr Geoffrey Ma, S.C., for the Plaintiff, and Mr Warren Chan, S.C., for the 1st to the 3rd Defendants. 3. At the outset of the hearing the Court raised a concern of its own volition. It is this : the Court wished to know, before embarking upon argument upon this anti-suit injunction, whether there had been any attempt by the Plaintiff to dispute the jurisdiction of the Guangdong Court. The answer to this was \"Yes\". Mr Ma, S.C., helpfully told me that an application disputing the jurisdiction had been made before that Court in June 1998 and that, subsequent to hearings which took place in September and October 1998, as further supplemented by written submissions, the Guangdong Court has reserved its decision upon the issue. 4. I am further told that the writ in the present proceedings, which is of course the vehicle for the anti-suit injunction with which I am presently seized, was not issued until 26th October 1998, that is exactly a week after the date of the last written submission put in by the present Plaintiff in support of its application disputing the jurisdiction in Guangdong. This raises a factual situation with regard to which both leading Counsel tell me they have been unable to locate any authority which is directly on point. 5. And the immediate point is this : it seemed to the Court to be essential, before embarking upon full argument in an anti-suit injunction such as this, to be satisfied that the application could not be regarded as premature, and that this application would be so regarded because at this stage the matter is before the Guangdong Court for decision upon whether that Court will or will not decline further to exercise its jurisdiction. 6. Now, comity is a pervasive theme in these cases and as a matter of basic instinct this Court felt disinclined to embark upon hearing the substance of the present application because it seemed to the Court that any determination of the present application at this stage would not accord with considerations of comity, in that the Guangdong Court is currently deliberating upon the jurisdiction issue. 7. In this connection I have been considerably assisted by both Counsel with particular reference to the case of Amchem Products Inc v British Columbia (Workers' Compensation Board) (1993) 102 DLR (4th) 96, a case in the Supreme Court of Canada, and in particular to certain extracts from the judgment of Sopinka J. at pages 118 - 119 where the learned Justice observed, inter alia : \"...the anti-suit injunction is unique in that the applicant does not have to establish that the assumption of jurisdiction by the foreign court will amount to an actionable wrong. Moreover, although the application is heard summarily and based on affidavit evidence, the order results in a permanent injunction which ordinarily is granted only after trial. In order to resort to this special remedy consonant with the principles of comity, it is preferable that the decision of the foreign court not be pre-empted until a proceeding has been launched in that court and the applicant for an injunction in the domestic court has sought from the foreign court a stay or other termination of the foreign proceedings and failed. If the foreign court stays or dismisses the action there, the problem is solved. If not, the domestic court must proceed to entertain the application for an injunction but only if it is alleged to be the most appropriate forum and is potentially an appropriate forum...\" (emphasis added) 8. The judgment of Sopinka J. was also cited with approval, as Mr Ma has very helpfully showed me, by Lord Goff in his speech in the case of Airbus Industrie GIE v Patel [1998] 2 WLR 686 , at 699 - 700 : \" I approach the matter as follows. As a general rule, before an anti-suit injunction can properly be granted by an English court to restrain a person from pursuing proceedings in a foreign jurisdiction in cases of the kind under consideration in the present case, comity requires that the English forum should have a sufficient interest in, or connection with, the matter in question to justify the indirect interference with the foreign court which an anti-suit injunction entails. In an alternative forum case, this will involve consideration of the question whether the English court is the natural forum for the resolution of the dispute. The proper approach in such cases was considered in some depth by Sopinka J. in Amchem Products Inc. v. Workers' Compensation Board, 102 D.L.R. (4th) 96, where he said at pp.118-119: ' The first step in applying the S.N.I. analysis [ Soci é t é Nationale Industrielle Aerospatiale v. Lee Kui Jak [1987] A.C. 871] is to determine whether the domestic forum is the natural forum, that is the forum that on the basis of relevant factors has the closest connection with the action and the parties. I would modify this slightly to conform with the test relating to forum non conveniens. Under this test the court must determine whether there is another forum that is clearly more appropriate. The result of this change in stay applications is that where there is no one forum that is the most appropriate, the domestic forum wins out by default and refuses a stay, provided it is an appropriate forum. In this step of the analysis, the domestic court as a matter of comity must take cognisance of the fact that the foreign court has assumed jurisdiction. If, applying the principles relating to forum non conveniens outlined above, the foreign court could reasonably have concluded that there was no alternative forum that was clearly more appropriate, the domestic court should respect that decision and the application should be dismissed. Where there is a genuine disagreement between the courts of our country and another, the courts of this country should not arrogate to themselves the decision for both jurisdictions. In most cases it will appear from the decision of the foreign court whether it acted on principles similar to those that obtain here, but, if not, then the domestic court must consider whether the result is consistent with those principles. In a case in which the domestic court concludes that the foreign court assumed jurisdiction on a basis that is inconsistent with principles relating to forum non conveniens and that the foreign court's conclusion could not reasonably have been reached had it applied those principles, it must go then to the second step of the [ Aerospatiale ] test.' (i.e., whether to grant an injunction on the ground that the ends of justice require it). His exposition is of considerable interest; for present purposes, however, it is not necessary for me to give the matter detailed consideration.\" 9. Mr Chan, S.C., has also kindly drawn my attention to an extract from the speech of Lord Scarman in British Airways Board v Laker Airways Ltd [1985] 1 AC 58 , where his Lordship observes as follows, at 95E : \"...The approach has to be cautious because an injunction restraining a person within the jurisdiction of the English court from pursuing a remedy in a foreign court where, if he proves the necessary facts, he has a cause of action is, however disguised and indirect, an interference with the process of justice in that foreign court. Caution is needed even in a 'forum conveniens' case, i.e., a case in which a remedy is available in the English as well as in the foreign court. Caution is very clearly very necessary where there is no remedy in the English court in respect of the cause of action which, if the facts be proved, is recognised and enforceable in the foreign court. ....\" 10. The caution which the Court instinctively felt had, Mr Chan, S.C., confessed, been the subject of some reflection by himself the night before this application, and upon the Court at the outset expressing its instinctive reservations about the present state of play, Mr Chan was then minded to make a formal adjournment application. In the course of his application, I think it fair to say most of the points were made which are revealed in the various extracts placed before the Court when Counsel were seeking to assist the Court in evaluating the present situation. Possibly the only point Mr Chan, S.C., did not mention is one which was referred to by Sopinka J in Amchem , as approved by Lord Goff, which is that the very treatment by the foreign court of the dispute as to jurisdiction before it is and can be an integral element of the analysis to be conducted by the domestic forum during applications of this type, namely whether Hong Kong is an appropriate forum for the trial of this issue. 11. Accordingly, I have decided to grant the adjournment application. I think in this very particular factual situation it is simply inappropriate to jump the gun, so to speak, in terms of an anti-suit injunction when the very question of the continued jurisdiction of the Guangdong Court is presently being considered by the learned Judges in that Court. 12. In my judgment, considerations of comity dictate this adjournment, and the only gloss which Mr Ma, S.C., would put upon this decision is to caution against this being, in effect, an open-ended adjournment. He is concerned that there will be a considerable further lapse of time before the Guangdong Courts hand down their judgment upon the Plaintiff's dispute to the jurisdiction, and that if this is the case his client will be unduly prejudiced. Mr Ma suggests that if the Court is minded to grant the adjournment in question, there should be liberty to apply to deal with such a situation should it arise. I grant such liberty to apply, and indeed Mr Chan, S.C., does not object. All the Court would add, I think, is that in the context of any such further application, if it be required, the status and content of the Guangdong application be adverted to in rather more detail than I think is presently in the papers, so that in that situation the Court is in the position to make an informed judgment in terms of the balancing exercise that it must exercise in these situations. 13. Accordingly my Order, subject to the further comments of Counsel, is simply that this application for an anti-suit injunction be adjourned sine die with liberty to restore and that there be, as I have said, liberty to apply. (Submissions from Counsel) 14. Having now heard Counsel on the question of costs, it is agreed, and indeed the Court feels this is entirely appropriate, that the costs of today be reserved. Accordingly, I look forward to further argument if such be necessary, either after the determination by the Guangdong Court of the Plaintiff's application, which determination itself would form an element of the Court's consideration of the anti-suit application, or alternatively of the restored summons before such determination has taken place if, in the view of the Plaintiff, an excessive amount of time has passed and it is felt that the Plaintiff is consequently being prejudiced. 15. I thank Counsel for their considerable assistance on what is an interesting, if less than straightforward matter. (William Stone) Judge of the Court of First Instance Representation: Mr Geoffrey Ma, S.C., inst'd by M/s Richards Butler, for the Plaintiff Mr Warren Chan, S.C., inst'd by M/s C.L. Chow & Co., for the 1st to 3rd Defendants Look up this case on Lawcite Noteup",
  "length": 13028,
  "headers_seen": [
    "(Submissions from Counsel)"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/1999/315",
  "query": "anti-suit injunction",
  "ts": "2025-10-16T10:47:01",
  "ok": true
}