{
  "title": "FLYING DRAGON ELECTRONIC CO., LTD V. KWAN SUN YU | [2011] HKDC 1473 | HKLII",
  "court": null,
  "year": 2011,
  "date": null,
  "content": "HKLII Databases District Court [2011] HKDC 1473 FLYING DRAGON ELECTRONIC CO., LTD V. KWAN SUN YU Judgment Information Date 7 Nov, 2011 Action No. DCCJ2856/2009 Neutral Cit. [2011] HKDC 1473 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History DCCJ2856/2009 DCCJ2856/2009 FLYING DRAGON ELECTRONIC CO., LTD v. KWAN SUN YU DCCJ2856/2009 IN THE DISTRICT COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION CIVIL ACTION NO. 2856 OF 2009 -------------------- BETWEEN FLYING DRAGON ELECTRONIC CO., LIMITED Plaintiff and KWAN SUN YU Defendant -------------------- Coram: Deputy District Judge J. Wong in Court Dates of Trial: 27 to 29 July 2011 Date of Handing Down Judgment: 8 November 2011 -------------------- J U D G M E N T -------------------- Introduction 1. This is an employer and employee dispute. The Plaintiff sues the Defendant for, inter alia,:- (a) an account of a sum of $100,000 paid and thereafter, payment of sums found due, as well as (b) surrender of documents and/or information obtained in the course of employment. Background 2. By an employment contract dated 1 March 2008, the Plaintiff employed the Defendant as its R&D Manager at a monthly salary of $43,000, probationary period being 6 months. 3. The Defendant further signed a Non-Disclosure Agreement (“the Non-disclosure Agreement”) on 17 March 2008. For the present purpose, 2 clauses are relevant:- “2. CONFIDENTIAL INFORMATION. Theemployee understands and agrees that during the term of Employment, he or she may receive or otherwise has access to non-public information that the company considers to be of a confidential, proprietary, or trade secret nature, including but not limited to Company technologies, systems, and processes, as well as other financial, business and technical information, marketing, engineering and other plans financial statements and projections, customer and supplier information, research, designs, plans, compilations, methods, techniques, processes, procedures, and know-how of the Company, whether in tangible or intangible form, and whether or not stored, compiled or memorialised physically, electronically, graphically, photographically, or in writing (collectively, the “ Confidential Information ”) …… 3. OWNERSHIP. The employee agrees that all Confidential Information of the company is and at all times shall be the exclusive property of the company, to be used by the employee only for the specific purposes for the Company’s product development or continuous process improvement. Upon the termination of the Employment Contract, or at the request of the Company at any time, the employee shall promptly destroy all of its copies of such compliance with the terms of this provision.” 4. A few months later, on 3 July 2008 an agreement (‘the Agreement”) occurred leading to the present dispute between the parties:- (a) By the Agreement, the Plaintiff was desirous of developing a piece of software to be put in a device called “Digital Baby Monitor”. Such device consists of two parts, the parents unit and the baby unit. Briefly, it allows the parents, to detect the condition of the baby, at a distance, by listening to the sound or noise. (b) This is however only one contracting party on the face of the Agreement, namely, the Plaintiff. (c) Although the Defendant did sign on the Agreement, he was described as witness merely. 5. There come the direct conflict of evidence between the parties:- (a) The Plaintiff’s witness Ms. Irene Chong (Ms. Chong”) said in her 1 st witness statement:- “9. …… The Defendant told the Plaintiff that an external developer (the “Developer”) is required for the development of such software. An agreement was reached with the so-called Developer with details of development and payment schedule listed in the agreement. However the Plaintiff had never seen this Developer. All the payments were made through the Defendant. The Defendant signed on the agreement as witness and acknowledged such payment. When asked who this Developer was, the Defendant said that the Developer was one of the professors he knew when he was teaching at the university. In all material time, the Plaintiff has no contact with the said Developer as the Defendant refused to provide his contact details to the Plaintiff without giving any reasons. The reason why the Plaintiff agreed to such agreement was that the Plaintiff needed the Product urgently and that the Defendant claimed that he was incapable of writing the software for the Plaintiff.” (b) However, the Defendant disagreed and gave another account of story. In his 1 st witness statement, he said:- (i) “2. Payment to external part-time temporarily software development staff was made by the boss AFTER the software was delivered to the company and tested satisfactory.” (Section D2C, para. 2 of the 1 st witness statement of the Defendant) (ii) “37. According to contract between boss and the external part-time temporarily software development staff, total of HKD100,000 (HKD50,000 for project-start, HKD25,000 each for 2 nd and 3 rd phase software delivery payment) was paid by boss to external part-time temporarily software development staff ……” (Section D6, para. 37 of the 1 st witness statement of the Defendant) (c) The Defendant further supplemented orally in the witness box that there had been at least 4 face-to-face meetings among the Developer, the Defendant and the Plaintiff (Ms. Chong as well as her parents, Mr. Chong and Mrs. Chong). 6. As such, in light of the nature of the conflict, either of the parties is not telling the truth. 7. Anyway, the Plaintiff later paid a total of $100,000 by mid-October 2008, out of the total price for $250,000. (a) The Plaintiff said that the money was paid to the Defendant, for and on behalf of the Developer. (b) The Defendant denied it and said that they were paid directly to the Developer. 8. As the matter developed, the Plaintiff complained that the software was of unsatisfactory quality. The Defendant strongly denied it. 9. Parties’ relationship went worse. In November 2008, the Plaintiff issued a warning letter to the Defendant making quite some general complaints against him together with 2 specific ones relating to the software. “致Simon Kwan（關燊如）HKID: DXXXXXX 有關2008年11月14日你回廠之事及各項目未能完成之問題： 1. 2008年11月13日星期三你親筆簽署，承諾公司於11月14日回廠會好好處理同事之間的關係、不會製造是非節外生事。結果11月14日在莊生等香港同事離廠後，故意與廠部郭經理吵鬧兼搬弄是非，你的所作所為，令同事之間的關係變得惡劣。 2. 11月14日下午約2時於辦公室，召開工程部、莊生及莊太等人電話會議時，自言承諾下午會把FD-D5G充電座之問題解決。事實上，到今天（20/11）為止，充電座還在測試當中。 3. 於當晚7時許，你自行去辦公室，在多個同事面前說自己因為沒做好工作需要留廠繼續研究，着莊生無需等候。隨後卻在電話內對莊太說是莊生叫你留廠，不負責任的話似是想惹是生非，歪曲事實。 4. 留廠期間，不尊重、無禮貌地對待郭經理，輕視郭經理學習能力，說甚麼50多歲的人學不到手…… 等等，狂言歧視他人。在工程部內故意大肆亂說，刻意在下屬面前挑起事端搬弄是非，挑撥郭經理與工程部人員的關係，擾亂人心、影響工作效率、浪費公司的時間及資源。不給郭經理看工作記錄，故意說明在我司設計過程中的資料是自己擁有的而不是公司的，違反與公司簽署之保密合同（Non-Disclosure Agreement dated 17 March 2008關於Ownership之條例）。 5. 辦公室同事好心代買飯盒，你不滿意飯盒內的餸菜、嘮嘮叨叨挑剔食物蛋白質高不合口味，對郭經理諸多不滿，無理取鬧胡說公司削減你一半人權，以後買飯應先詢問你。公司從沒有列明買飯盒先詢問員工這回事，對於員工有特別之食物要求，公司一定會酌情處理。你還語無倫次數說公司在合約上已註明是包食包住包車費，但公司與你簽定【Employment Contract dated 17 March 2008】合同上並沒有註明這字句，又再語無倫次歪曲事實。 6. 11月15日上午充電座還沒做出結果就嚷着要返港，不按規辦事，浪費長途電話費。 7. 企圖擾亂公司決策，挑剔排斥公司請來的新工程師，故意在大眾同事面前詆毀污辱新同事的工作能力，反映出你藐視公司自私霸道的行為，令眾同事憎厭。 8. 以上幾點多次犯規事例，給公司及同事之間帶來極壞的影響，公司必保留追究權。 9. 當初你為了要排斥其他工程師，曾經誇口說會輕易解決 所有 的技術問題，但至今FD-D5G還沒得到解決，使出貨期一拖再拖，令公司蒙受極大之金錢損失及公司聲譽受損。2008年11月19日約下午6時半於香港辦公室內，你再次承諾公司2天之內（即11月21日下午前）一定解決轉燈問題。 10. Digital baby monitor project：你亦承諾公司於2008年12月1日前完成RF測試，BOM，detailed technical specification etc.（2008 SMART Objectives dated 13-11-2008）。 11. 公司有言在先：如果你再三違反以上承諾，繼續拖延時間，必須要承擔拖延工程失職責任的重大後果，即公司有權追討因為拖延出貨之損失及公司已交付給你的新產品開發之所有費用，不得異議。” The Defendant signed the letter with the writing of “acknowledged” on it. 10. Parties could not work together any more. (a) On 5 December 2008, the Plaintiff dismissed the Defendant verbally. (b) On 17 December 2008, the Plaintiff further demanded for return of the payment and tools for the software. “…… (1) Per the attached report in the photo, there are two pcs of development PCB: MCU development kits: MCU-C0851-F310 for C8051F310DK. Please return to us. (2) TI CHIPCON CC110EMK868-915 à please return the development tools to us (2 sets). (3) Return of development charges. Please return all the above items to us by Friday 19of December 2008! ……” (e-mail of 17 December 2008) 11. Subsequently, (a) The Defendant commenced LBTC 751/2009 in the Labour Tribunal against the Plaintiff for a total sum of $102,457.75. (i) Wages in lien of notice $42,968.90 (ii) Arrears of wages 48,774.19 (iii) Annual leave pay 7,131.34 (iv) Rest day pay 3,583.32 $102,457.75 =========== (b) The parties settled the case at the 1 st call over hearing on 17 February 2009, by the sum of $48,774.19. (c) As to the software, the Plaintiff instructed its solicitors to send a formal demand letter to the Defendant on 19 February 2009. The Plaintiff also reported the matter to the police. (d) The Defendant did not reply to the formal demand letter. After investigation, the police took no step against any of the parties. (e) On 16 June 2009, the Plaintiff commenced the present proceedings. 12. They went through the usual stages of litigation, including the pleadings and the discovery. On 19 May 2011, they attended before me at the pre-trial review. The followings matters were noted. (a) In the Reply, the Plaintiff said that the Defence and Counterclaim contained a lot of irrelevant matters. It reserved the right to apply for striking out. To save time and costs, the Plaintiff did not pursue it, but still held such stance. (b) The “Counterclaim” of the Defendant in fact only raised the question of costs. They were to be dealt with at the end of the trial, after judgment. (c) The Defendant filed an “Expert Report of Defendant” on 4 November 2010 herein. As no leave had ever been granted by the Court to adduce expert evidence, the said document was not to be relied upon. (d) At one stage, the parties had agreed some issues in dispute. However, they no longer held good. Instead, they prepared their own statement of issues. 13. Parties ultimately appeared before me on the scheduled trial dates. The Plaintiff was represented by Mr. Lam Shum Chiu of Counsel. The Defendant appeared in person. Ruling 14. Upon consideration of all the evidence, authorities and submissions before me, I have decided to rule in favour of the Plaintiff in the circumstances. In short, the Plaintiff’s case is to be preferred to than that of the Defendant, in terms of the documents submitted, oral evidence adduced and the inherent probability/improbability of the case advanced. The Documents 15. The Agreement itself is only a “neutral” document. It can fit in both of the cases of the parties. The same applies to the communications between them in relation to the progress of the software. 16. However, the fact that the Defendant did not make any reply to the said warning letter and the said demand letter is to the disadvantage of his case. As observed by me during the trial, the Defendant is someone who should have no fear to defend for his own case. The warning letter contains strong comment. The demand letter is even clearer. It does not make sense to me that the Defendant could decide to acknowledge and receive them, without stating his position, unless, of course, there is some substance in the documents. The Witnesses 17. Two witnesses appeared at the trial, Ms. Chong for the Plaintiff and the Defendant himself. On balance, the evidence of Ms. Chong is to be accepted. (a) Although there are minor problems with the evidence of Ms. Chong, they do not touch on her integrity. (i) She deposed that the probation period of the Defendant had been extended for 3 months. She said that she had a document to prove it. However, the document was only an assessment report of the Defendant dated 10 November 2008. “評估人其他建議 (Comments) 具有良好技術基礎，好學，技術水平可肯定。無奈自信心太高，自專性太強，交談上理解能力差，不尊重上司，沒有團隊精神，不能調動屬下的積極性，對下屬初初有所讚揚，後來不誠心提攜指教卻採取放棄了結。另外，經常不開手機，使公司無法聯絡，影響工作。 指定未來要求目標 (Objectives) 必須徹底改善人際關係及溝通技巧，放下自以為是的態度，凡事以公司利益為前提，建立好團體精神，帶領下屬，完成和改進所有公司產品的技術問題，盡快做好開發新產品有關技術問題。” (ii)Upon being questioned as to whether the Defendant should still be liable personally, when the Developer did exist, she simply maintained the position without giving any logical and legal basis. (b) However, on the other hand, the “problems” with the evidence of the Defendant do affect his integrity and credibility. (i) He said that the Developer was teaching in a University. However, upon being cross-examined as to the information about him, he deposed that he only had his mobile phone number, but not home/office address and office telephone. When he was further challenged as to why he could not name of the University, he insisted that he knew it, but only did not know the “room number” of the Developer thereof. Such explanation is far from satisfactory. (ii) It was his case that the software was in order. He did not hear anything wrong of it from the Plaintiff. Nevertheless, the matter was clearly raised by paragraphs 10 and 11 of the said warning letter. Upon being further questioned, he explained that he did not read the warning letter although he “acknowledged” it. It was not necessary to read it because he knew what was written there. With respect, such explanation is far from believable. (iii) Much effort was spent and indeed wasted by the Defendant in trying to defend for the quality of the software, despite that it was not a contest between the Defendant and the Developer, i.e. the writer of the software. There was no direction given by this Court to adduce expert evidence to show the quality of the software. The quality is not and cannot be an issue within the present proceedings. However, the stance of the Defendant has just been too obvious: the software was functioning properly, the payment was therefore made, and there could not be any repayment at all. He has been defending the case, in the capacity of the writer of the software. Inherent Probability 18. The Defendant deposed that the Developer did not want to disclose his identity because he did not want the University to know that he was taking up “freelance” job. However, it was also the Defendant’s sworn evidence that the Developer attended 4 face-to-face meetings with the Plaintiff wherein they discussed the software and made payment directly. 19. Such story must be highly improbable. There are only 8 Universities in Hong Kong. It cannot be too difficult to chase the identity of a lecturer or professor who is able to produce the subject software. Further, how possibly one’s identity can still be kept secret if you have already met the other party for 4 times? 20. The Defendant further tried to justify, again and again, the quality of the software by saying that, the Plaintiff contacted him again, after his dismissal. The Plaintiff wanted to hire him as a coordinator at cheap price to follow up and liaise with the Developer, to continue to work on the software. The Plaintiff did not dispute it. It might be a point justifying the quality of the software. However, it supports the Plaintiff’s case that it has no contact of the Developer and had to rely on the Defendant. The Plaintiff agreed to do so because it needed the software urgently. 21. In the end, the Plaintiff had to enter a new contract on 14 January 2009 with another developer. The work was done and price was fully paid. Finding of Facts 22. As such, on balance of probabilities, I have the following finding of facts in relation to the present proceedings:- (a) From 1 March 2008, the Plaintiff employed the Defendant as it s R&D Manager at a monthly salary of $43,000. There was a probation period of 6 months. (b) In June/July 2008, the Plaintiff told the Defendant that it wanted to develop the software. (c) The Defendant replied that an external developer was needed. He further told the Plaintiff that the external developer was a professor teaching at the university, and as such his identity could not be revealed. However, in fact, there was no such professor. The Defendant only made up the story to earn the extra fees himself. (d) The Plaintiff agreed to the arrangement as it needed the software urgently. (e) The Agreement was prepared by the Defendant. There was only one contracting party, the Plaintiff. The Defendant signed as a “witness” and received the payment. (f) On the one hand, the software was developed by the Defendant secretly. On the other, he also, acted as the R&D Manager for the Plaintiff, prepared the test reports, certifying that it was up to the standard required. (g) The Plaintiff effected a total payment of $100,000. On each occasion of payment, the Plaintiff paid it to the Defendant directly, believing that he would pay to the Developer. (h) However, in the meantime, the Defendant did not get along with his colleagues. There were quite some problems occurring. (i) The Plaintiff therefore warned the Defendant and extended his probation period for 3 months. (j) It not only did not help improving the situation, but also made it even worse. (k) There were problems with the progress and performance of the software. (l) Ultimately, the Plaintiff decided to lay off the Defendant. Despite request and demand, he did not return to the Plaintiff the documents, tools, and so forth in his possession. The Plaintiff still however wanted him to help coordinating the “Developer” for the software. Of course, it would not work. (m) The Plaintiff had to turn to another external developer for the software. 23. With the above findings, (a) The Defendant shall return the sum of $100,000 to the Plaintiff, by reason of either account of secret profit made or damages caused by breach of fiduciary duties. (b) He shall also comply with paragraph 3 of the Non-Disclosure Agreement, including returning the 2 sets of tool (No. MCU-C0851-F310) or alternatively $1,040. Answers to the Issues 24. I will move on to answer the issues as identified by the parties although it might not be absolutely necessary for me to do so. 25. The Plaintiff said in its Statement of Issues in Dispute dated 30 March 2011:- “(1) Whether the Defendant is acting as an agent? (2) Whether the Defendant has received HK$100,000 from the Plaintiff? (3) Whether the Non-disclosure agreement is validly entered between the Plaintiff and the Defendant? (4) Whether the software development is completed as scheduled? (5) Whether the Defendant is liable to reply the HK$100,000 (if any) to the Plaintiff?” I answer them in the followings:- (1) No. (2) Yes. (3) Yes. (4) Not relevant, but in case that it was relevant, then “No”. (5) Yes.” 26. On the other hand, for the 11 issues set out by the Defendant on 12 March 2011:- “(1) Whether “goods was first delivered and checked before EACH of the three time-sequential phased payments of total HK$100,000” implied satisfactory? (2) Whether the discontinuance of the development is due to the Plaintiff defaulting (i) fourth-phase payment to the external part-time temporarily software development staff and (ii) also defaulting the Defendant’s salary that Labour Tribunal later ruled the Plaintiff losing the case. (3) Whether the discontinuance of the development is due to dissatisfactory quality and timeliness as alleged by the Plaintiff in view of many evidence showing machine working well and fairly accurate timing (exact timing was affected by external suppliers and China Factory and beyond control.) (4) Whether the machine was (a) GOOD working in accordance with contract, specifications, industry and ‘university-teaching’ good practices OR (b) unsatisfactory quality as alleged by Plaintiff STATEMENT OF CLAIM item 10 (without any proof of what exactly was ‘unsatisfactory’)? (5) Whether the Defendant has any responsibility/liability for the agreement made between the Plain and external part-time temporarily software development staff? (6) Whether the software development of the product for the Plaintiff was (a) conducted by a third party OR (b) as alleged by the Plaintiff, by the middle-aged over 50 years old Defendant himself needing working full-time 10 to 12 hours daily, 5.5 days per week with one long China work 8AM to mid-night? (7) Whether the Plaintiff suffered any financial loss from item 8 and 9, if (a) machine production know how had been transferred to factory with full set of document AND (b) the Defendant afterward did not join another company working on same product? (8) Whether the Non-disclosure agreement is validly entered between the Plaintiff and Defendant as specifically stated in the Plaintiff’s STATEMENT OF CLAIM item 3? (9) Whether the Defendant has a duty to account and return all materials, documents etc. of the Development under the Non-disclosure agreement and Employment Contract? (10) Whether the Plaintiff alleged that he cannot follow the machine HARDWARE was due to the low technical level of the Plaintiff’s new hardware staff even full circuit and samples already produced at factory? (11) Whether the Plaintiff alleged that he cannot follow the machine SOFTEARE was due to the work specification as shown in Plaintiff’s document set (page 2, 5 th line) that “NO SOURCE CODE” will be provided (This terms and conditions were same as all previous projects conducted by other external part-time temporary software staff)?” The following answers are provided by me. (1) Not irrelevant, but in case that it were relevant, it is open for the Plaintiff to challenge that the software was not satisfactory. It is because the Plaintiff only paid according to the reports prepared by the Defendant. (2) The discontinuance of the development is due to dismissal of the Defendant by the Plaintiff, but not otherwise. (3) No. See also (2) above. (4) Not relevant, but in case that it were relevant, in the absence of any expert evidence herein, together with the ruling on balance that the Plaintiff’s case is to be preferred to, the machine (including the software) was not in its proper order. (5) There is no Developer at all. It is fictitious only. (6) The software was done by the Defendant. (7) Not relevant at all. (8) Yes. (9) Yes. (10) Not relevant at all. (11) Not relevant at all. Assessment of Costs 27. At the end of the hearing, I invited parties to submit their respective Statement of Costs for the purpose of a lump sum assessment of the costs of the proceedings. Both of them agreed to the suggestion. The Plaintiff asked for $128,146, and the Defendant $216,521. 28. The starting point is of course that the Plaintiff is the winning party. I see no reason to depart from the general principle that it is entitled to the costs from the Defendant. As to quantum, I find the Plaintiff’s suggestion generally reasonable. (a) There are 3 fee earners involved, 2 junior solicitors and 1 litigation clerk. They ask for the hourly rates at $1,680, $1,280 and $600 respectively. These rates are reasonable in the circumstances. (b) As to the time involved for a case lasting for about 2 years with 3 days’ trial, the fee earners spent a total of about 4 hours, 23 hours and 11 hours respectively. I also find them justified, especially in light of the effort spent by the Defendant. I will only disallow the sums of $1,000 and $400 for the CMC hearing on 23 August 2010 and summons on 7 August 2009. These costs were assessed immediately after the hearings, and it is therefore not necessary to do it again. (c) Two Counsel are involved. Mr. Ko asked for $7,500 in having a conference settling the Statement of Claim. Mr. Lam, on the other hand charged $40,000 for his brief, refreshers, pre-trial conference and so forth. I see no reason to tax off any of the Counsel fees. (d) Photocopying charges of $1,200 is allowed in full, but not the proposed mechanical preparation of $50 per page. Under the new rules (see Item 1 of Part I at Schedule I of HKCP 2011 (Vol. 3) at p. 220), only $4 per page is to be allowed. (e) Finally, the total filing fees of $1,260 are allowed without deduction, but not the travelling expenses and postage. They should from part of the general expenses of running a law firm, and is reflected by the hourly rates charged by fee earners. (f) To conclude, I will summarily assess the Plaintiff’s costs at $97,546. Conclusion 29. To sum up, I make the following orders:- (a) The Defendant shall pay the Plaintiff the sum of $100,000. (b) Within 14 days from the date hereof, the Defendant do return the 2 sets of tool (no. MCU-C0851-F310) to the Plaintiff, or alternatively a payment of $1,040. (c) Within 14 days from the date hereof, the Defendant do comply with clause 3 of the Non-Disclosure Agreement by filing and serving an affirmation in the present proceedings confirming that he has either destroyed all of its copies of the Confidential Information or returned the same to the Plaintiff. (d) There is an order nisi, which will become absolute 14 days from the date hereof, that the Defendant do bear costs of the Plaintiff, including costs of the proceedings all costs reserved and Certificate for Counsel for the trial before me, in the assessed sum of $97,546. (J. Wong) Deputy District Judge The Plaintiff was represented by Mr. Lam Shum Chiu of Counsel, instructed by Messrs. K. Y. Lo & Co. The Defendant acted in person. Look up this case on Lawcite Noteup",
  "length": 25240,
  "headers_seen": [
    "Introduction",
    "Background",
    "Ruling",
    "The Documents",
    "The Witnesses",
    "Inherent Probability",
    "Finding of Facts",
    "Answers to the Issues"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkdc/2011/1473",
  "query": "non-disclosure agreement",
  "ts": "2025-10-17T10:45:10",
  "ok": true
}