{
  "title": "RE DAVID PERRY, QC | [2020] HKCFI 1796 | HKLII",
  "court": null,
  "year": 2020,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2020] HKCFI 1796 RE DAVID PERRY, QC Judgment Information Date 30 Jul, 2020 Action No. HCMP751/2019 Neutral Cit. [2020] HKCFI 1796 Download MS Word Judgment Corrigendum Reading Options Translation Toggle Highlight Case History HCMP751/2019 HCMP 751/2019 [2020] HKCFI 1796 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE MISCELLANEOUS PROCEEDINGS NO 751 OF 2019 ________________________ In the Matter of the application by David Perry, QC, to be approved, admitted and enrolled as a barrister of the High Court of the Hong Kong Special Administrative Region for the purpose of a particular case and In the Matter of section 27 of the Legal Practitioners Ordinance, Cap 159 ________________________ Before: Hon Poon CJHC in Court Dates of Written Submissions: 22 and 24 July 2020 Date of Decision on Costs: 31 July 2020 Date of Corrigendum: 10 August 2020 _______________________ CORRIGENDUM _______________________ 1. At page 4, the representation of the Secretary for Justice should read “Mr Jonathan Kwan, instructed by the Department of Justice, for the Secretary for Justice.” (Hebe Lam) for Registrar, High Court HCMP751A/2019 RE DAVID PERRY, QC HCMP 751/2019 [2020] HKCFI 1796 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE MISCELLANEOUS PROCEEDINGS NO 751 OF 2019 ________________________ In the Matter of the application by David Perry, QC, to be approved, admitted and enrolled as a barrister of the High Court of the Hong Kong Special Administrative Region for the purpose of a particular case and In the Matter of section 27 of the Legal Practitioners Ordinance , Cap 159 ________________________ Before: Hon Poon CJHC in Court Dates of Written Submissions: 22 and 24 July 2020 Date of Decision on Costs: 31 July 2020 _______________________ DECISION ON COSTS _______________________ 1. By a judgment handed down on 10 July 2020 ( [2020] HKCFI 1521 ), I allowed the applicant’s application for ad hoc admission in CACC 368/2016 . The usual practice is to make no order as to costs of the application. 2. Both the applicant and the Bar Association agree that, following the usual practice, there shall be no order as to costs. However, the Secretary for Justice seeks costs of and incidental to the adjourned hearing of the application dated 31 May 2019, although she customarily does not seek costs in admission proceedings as her role is to provide assistance to the court in the public interest: Re Robin Potts QC , HCMP 5047/2001, unreported, 19 December 2001, at [15]. 3. As alluded to in [2] of the judgment, the applicant sought to rely on the proposed constitutional challenge to section 137 (1) of the Crimes Ordinance , Cap 200 . The challenge was referred to in the joint certificate of counsel and the applicant’s written submissions lodged for the hearing. But it had not found its way into the then Grounds of Appeal yet. The hearing on 31 May 2019 was then adjourned to enable the appellants to obtain the requisite leave from the Court of Appeal to raise it in the coming appeal. Mr Jonathan Kwan, for the Secretary, submitted that in the circumstances the adjournment was caused entirely by the applicant’s fault for which he should bear the costs wasted. 4. As a preliminary point, Ms Catherine Wong, for the applicant, submitted that on a proper construction, the court’s power to grant costs in admission proceedings under rule 3 (2)(b) of the Barristers (Admission) Rules , Cap 159AA , is only engaged if the application is dismissed, citing Re Perry QC [2016] 2 HKLRD 647 , at [41] in support [1] . There is thus no power to grant costs to the Secretary where the application is successful. 5. I doubt if Ms Wong’s construction of rule 3(2)(b) is correct. However, for present purpose, it is not necessary to determine the point. Assuming that rule 3(2)(b) does not limit my jurisdiction on costs as contended by her, I do not consider it appropriate to depart from the usual practice of making no order on costs. 6. As pointed out by Ms Wong, the constitutional challenge had been raised as a matter of substance before the adjourned hearing. The parties were quite ready to proceed with the application there and then. I allowed the adjournment simply to ensure that the appellants would be able to raise the challenge at the appeal. It did not materially affect the Secretary’s role of providing assistance to the court. Further, I did not allow the application purely because of the constitutional challenge. I also allowed it on the unusual complexity limb [2] ; the substantial impact limb [3] ; and the CFA factor [4] . Having regard to the overall circumstances and how the application was disposed of, I do not see any sufficient basis for me to depart from the usual practice on costs. 7. In consequence, I will make no order as to costs of the application. (Jeremy Poon) Chief Judge of the High Court Ms Catherine Wong, instructed by Francis Kong & Co. for the applicant Anthony Chiang & Partners, for the Bar Council of the Hong Kong Bar Association Mr Johnathan Kwan, instructed by the Department of Justice, for the Secretary for Justice [1] Rule 3(2) provides: “The Court, upon hearing the Secretary for Justice or such counsel and upon hearing any representation which may be made by or on behalf of the Secretary for Justice and the Bar Council, may – (a) upon being satisfied that the person concerned is eligible for admission as a barrister, order that the person concerned be admitted as a barrister; or (b) if the Court is not so satisfied, dismiss the application upon such terms as regards costs or otherwise as the Court may think appropriate.” [2] [29] - [31] of the judgment. [3] [33] of the judgment. [4] [35] of the judgment. Look up this case on Lawcite Noteup",
  "length": 5844,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2020/1796",
  "query": "constitutional challenge",
  "ts": "2025-10-17T10:43:30",
  "ok": true
}