{
  "title": "W V. P | [2016] HKCFI 316 | HKLII",
  "court": null,
  "year": 2016,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2016] HKCFI 316 W V. P Judgment Information Date 18 Jan, 2016 Action No. HCCT55/2015 Neutral Cit. [2016] HKCFI 316 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCCT55/2015 HCCT55/2015 W v. P HCCT 55/2015 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO 55 OF 2015 ______________ IN THE MATTER of a First Partial Final Arbitration Award dated 17 November 2015 in Arbitration HKIAC/A14127 made by HKIAC and IN THE MATTER of Order 73 of the Rules of the High Court ( Cap 4A ) and IN THE MATTER of Section 81 of the Arbitration Ordinance , Cap 609 and Article 34 of UNCITRAL Model Law on International Commercial Arbitration ______________ BETWEEN W Applicant and P Respondent ______________ Before : Hon Mimmie Chan J in Chambers Date of Hearing : 19 January 2016 Date of Decision: 19 January 2016 ______________ D E C I S I O N ______________ 1. W (“ W ”) applies to set aside a Partial Final Award dated 17 November 2015 (“ Award ”) made by the arbitral tribunal in an arbitration (“ Arbitration ”) between W and P (“ P ”) subject to the HKIAC Rules. In its Originating Summons, W claims that it had been unable to present its case in the Arbitration, that the arbitral procedure was not in accordance with the parties’ agreement, that the Tribunal had dealt with a dispute not contemplated by or falling within the terms of the submission to arbitration, and that the Award contained matters beyond the scope of the submission. Before any evidence was filed in opposition to the application, P applied at the 1 st hearing of the Originating Summons to strike out W’s application, on the ground that it discloses no reasonable cause of action, is frivolous or vexatious and otherwise an abuse of the process of the court. 2. Having reviewed the submissions made by Counsel, the affirmation filed on behalf of W, the Award which sets out the dispute and the arguments made before the Tribunal which led to the Award, I agree that it is plain and obvious that the application to set aside the Award is devoid of merit, and should be dismissed, without the need to proceed to a further hearing. 3. The substance of W’s complaint is that the Award which determined the Further Refund Claim did not fall within the terms of the reference to the Arbitration, and that the Further Refund Claim (as defined in the Award) should not have been disposed of by the Tribunal summarily, but should have been determined with the entirety of the claims made in the Arbitration, after discovery, the proper filing of witness statements and cross-examination of the relevant witnesses. Hence, it was argued, W had been deprived of the opportunity to present its case in the Arbitration. 4. The claim that W had been unable to present its case is without substance. P applied to the Tribunal on 30 June 2015 for a partial final award, pursuant to Article 34 of the HKIAC Rules and s 71 of the Arbitration Ordinance , in respect of its claim for the Total Refund (as defined in the Award), which was made on the basis of the price adjustment provisions in the underlying agreement between W and P (“ Agreement ”) for sale and purchase of iron ore lumps (“ Cargo ”), as distinct from its claim for damages in respect of W’s breach of the Agreement. W opposed the application, and the Tribunal issued directions for the parties to file submissions in writing. Submissions were so filed, and a hearing took place on 20 October 2015, when the Tribunal heard oral submissions made by the parties, who were represented by counsel. 5. It is clear from the Award that arguments had been presented on behalf of W and P, and that such arguments and submissions made by W had been duly considered, analyzed and determined by the Tribunal in the Award, when it allowed P’s claim for the Total Refund. The Tribunal pointed out that W did not challenge the power of the Tribunal to make a partial final award, that the Agreement, the loading port analysis and the discharge port analysis of the Cargo, containing figures relating to the weight of the Cargo, its iron content and its physical composition by size, were all admitted documents. Although W had initially challenged the authenticity of the CIQ certificates, such challenge was not pursued before the Tribunal at the hearing. On that basis, the Tribunal found that the relevant documents were authentic, that the calculations of price adjustments provided for under Clause 5 of the Agreement are correct (the calculations of which were not in fact disputed by W at the hearing, apart from its jurisdictional and procedural objections), and that W is liable to make the refund covered by the Award. 6. The Tribunal clearly has power under the Ordinance and the HKIAC Rules to make separate awards regarding different issues at different times. The Tribunal had given W the opportunity to make submissions in writing and orally, as to whether a partial final award should be given on the Total Refund Claim, after the Statement of Claim and the Statement of Defence were filed. Having had the fair opportunity, between 30 June 2015 and 20 October 2015, to prepare for and to present to the Tribunal its arguments as to whether a partial final award should be made on the Total Refund Claim, I fail to see how it can be claimed that W had been unable to present its case. 7. Significantly, W has failed to establish to this court what evidence it seeks to present and what further arguments it could have made, if it had been given the opportunity to fully present its case, which would have a material impact on the Award, or which can establish (after discovery, witness statements or cross-examination as W seeks) that P is not entitled to make the price adjustments under the Agreement. The authorities are clear, that even if W can establish a permitted ground to set aside the Award, the court may enforce the Award where there is no perceived injustice or serious prejudice sustained by W as a result of any inability on its part to present its case in the Arbitration. 8. Counsel for W sought to rely on P’s non-production of the agreement made between P’s purchaser and its purchaser (“ Resale Agreement ”), claiming that this was only discovered after the hearing for the Award. The facts relied upon are not referred to in the affirmation filed by W and served with its Originating Summons, as required under Order 73 rule 5 (4) RHC. No leave has yet been granted for the 2 nd affirmation of W to be used for the Originating Summons. Even if I should be prepared to consider the contents of the 2 nd affirmation, the point sought to be made is simply that W was prevented from arguing that inferences could be drawn from the non-production of the Resale Agreement, as to the authenticity of the CIQ certificate on which the Award was based. 9. As Counsel for P pointed out, W and its team of lawyers had the opportunity before October 2015 to inspect and challenge the CIQ Certificates put before the Tribunal, but had elected not to do so, choosing instead not to dispute the authenticity of any of the documents relating to the quality and specifications of the Cargo. I am not satisfied that the non-production of the Resale Agreement, and any inferences to be drawn therefrom, are either material to the Award or can constitute any prejudice to W. 10. The Tribunal had explained (paragraph 25 of the Award) that it was in the interests of efficiency and economy to deal with the Total Refund Claim by a Partial Final Award. It further explained in the Award (under paragraphs 68 to 75) why it was prepared to deal with the Total Refund claim in isolation from the “wider dispute” argued on behalf of W. The disputed facts as to whether the final invoice put forward by a Mr X on behalf of W were irrelevant, in the view of the Tribunal, as to the claims made for price adjustments under the Agreement. The Tribunal clearly took the view that there were no factual disputes which were relevant to and could have any impact on the Award. 11. As for the complaint on jurisdiction, I am satisfied, after reviewing the Notice of Arbitration, the Statement of Claim filed in the Arbitration, and the Award, that the Tribunal was clearly correct in its finding that P’s claims for price adjustments under Clause 5 of the Agreement, on the basis of the discrepancies in weight, content and specifications by physical composition and size of the Cargo, are all within the reference to the Arbitration. Claims that an award is outside the terms of the submission to arbitration are construed narrowly, to only include those decisions which are clearly unrelated to or not reasonably required for the determination of the issues that have been submitted to arbitration ( Grant Thornton International Limited v JBPB & Co (A Partnership) unreported, HCCT 13/2012, 5 April 2013). The claim as to the adjustments made on the basis of the discrepancies as to the weight, content and physical composition by size of the Cargo, and the facts relied upon, are all referred to in the Statement of Claim filed in the Arbitration, and that is adequate ( S Co v B Co [2014] 6 HKC 421 ). 12. In short, there is nothing serious or egregious in any error in the conduct of the Arbitration, no prejudice to W established, and hence no ground to set aside the Award. The application is simply an attempt to revisit the merits of the decisions made by the Tribunal, and should be struck out, with costs on an indemnity basis. (Mimmie Chan) Judge of the Court of First Instance High Court Ms Rachel Lam, instructed by Squire Patton Boggs, for the applicant Mr Douglas Lam SC and Mr Jonathan Chan, instructed by Reed Smith Richards Butler, for the respondent Look up this case on Lawcite Noteup",
  "length": 9865,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2016/316",
  "query": "Model Law",
  "ts": "2025-10-15T11:34:50",
  "ok": true
}