{
  "title": "CHINA REIT LTD V. SU PING AND OTHERS | [2007] HKCFI 282 | HKLII",
  "court": null,
  "year": 2007,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2007] HKCFI 282 CHINA REIT LTD V. SU PING AND OTHERS Judgment Information Date 25 Mar, 2007 Action No. HCA1831/2006 Neutral Cit. [2007] HKCFI 282 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCA1831/2006 HCA001831/2006 CHINA REIT LTD v. SU PING AND OTHERS HCA 1831/2006 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE ACTION NO. 1831 OF 2006 ______________________ BETWEEN CHINA REIT LIMITED Plaintiff (中國房地產投資基金有限公司) and SU PING (蘇萍) 1 st Defendant 沈建程 (SHEN JIANCHENG) 2 nd Defendant 上海昌輝企業發展有限公司 3 rd Defendant (SHANGHAI CHANGGHUI GROUP DEVELOPMENT CO. LTD.) ______________________ Before : Hon Fung J in Chambers Date of Hearing : 15 March 2007 Date of Judgment : 26 March 2007 ______________________ J U D G M E N T ______________________ 1. This is an application by the 1 st and 2 nd defendants that: (1) The relief for an order that the 1 st and 2 nd defendants do procure the 3 rd defendant to withdraw its legal proceedings against the plaintiff in Shanghai be struck out; (2) Further or alternatively, all further proceedings herein be dismissed or stayed for forum non conveniens . Background 2. The 1 st and 2 nd defendants are the beneficial owners of the 3 rd defendant. Before the completion of a series of shares transfer agreements involving, inter alia , the plaintiff as purchaser, the 1 st and 2 nd defendants held 25% and the 3 rd defendant held 75% of the share capital of 上海世紀靜安房地產開發有限公司 (“JV Company”). The 1 st and 2 nd defendant’s 25% shareholding in the JV Company was through their 100% shareholding in Honourlink Holdings Ltd, which in turn through its 100% subsidiary Jetking Ltd holding 25% of the JV Company. 3. The JV Company is the owner of the right to use a piece of land in Shanghai. The JV Company entered into a Demolition and Relocation Agreement with the Shanghai Jing An District People’s Government whereby the latter was appointed to undertake demolition of houses and relocation of residents on the land for the JV Company, and the total amount payable as compensation for demolition, relocation expenses and ancillary Government payments was RMB 382,000,000. 4. By the Heads of Agreement for Sale and Purchase of Shares dated 21 October 2004 (“HOA”), the 3 rd defendant and Jetking agreed to sell their respective 75% and 25% share holdings in the JV Company to 上海嘉盛置業有限公司 (“Jia Cheng”) and its nominee. 5. Under the HOA, the 3 rd defendant entered into the PRC Shares Transfer Agreement dated 1 December 2004 with Jia Cheng and 上海盛瀚投資有限公司 (“Cheng Han”) for the sale of 75% equity in the JV Company to the 2 companies. The HOA is silent on forum and choice of law. 6. The plaintiff was nominated by Jia Cheng under the HOA to purchase the other 25% of the JV Company by taking up the entire share capital of Honourlink (instead of Jetlink) from the 1 st and 2 nd defendants. On 4 January 2005, the plaintiff and 1 st and 2 nd defendants entered into a sale and purchase agreement (“Honourlink Agreement”) for the acquisition of the issued capital of Honourlink. The purchase price paid by the plaintiff was RMB 187,500,000. 7. After the completion of the series of agreements, the Jia Cheng and Cheng Han became the 75% shareholders of the JV Company, and the plaintiff the indirect 25% shareholder (through Honourlink and Jetking) of the JV Company. 8. The present dispute related to the payment of the unpaid compensation of RMB 90,892,090.51 to the Jing An district authority. The unpaid compensation was paid by the 3 rd defendant on 10 November and 9 December 2004. But whether the liability is on the vendors or the purchasers is in dispute. The relevant agreements are in Chinese, and the effect of the relevant terms are set out herein. 9. Under Clause 2(2) of the PRC Share Transfer Agreement, the 3 rd defendant agreed with Jia Cheng that the JV Company had already paid part of the compensation to the relevant authority, but as at 31 October 2004, RMB 90,892,090.51 remained unpaid, and the 3 rd defendant agreed to paid the unpaid compensation on the due date. The PRC Shares Transfer Agreement has no jurisdiction clause, but there is an arbitration clause in Shanghai, and the choice of law is Chinese law. 10. Under the Honourlink Agreement, the 1 st and 2 nd defendants agreed with the plaintiff to procure the 3 rd defendant (and to provide the necessary funding) to pay the unpaid compensation to the Jing An District People’s Government in accordance with the PRC Shares Transfer Government, and should the 3 rd defendant fail to pay the unpaid compensation, the 1 st and 2 nd defendants should assume joint liability to pay the unpaid compensation and to compensate the plaintiff for any loss and damage arising therefrom (Clause 9.5); and the 1 st and 2 nd defendants warranted to the plaintiff, and the purchasers under the PRC Shares Transfer Agreement (i.e. Jia Cheng and Cheng Han), inter alia , that the purchasers would own the assets in the JV Company including the land use certificate of the land in Shanghai with all compensation and other charges paid in full, and the assets would be free from all encumbrances (Clause 5.1 and Clause 2.2 of Schedule 3); and the 1 st and 2 nd defendants guaranteed that they would indemnify and keep the plaintiff harmless in the event of breach of any warranty given (Clause 5.5). The Honourlink Agreement has a Hong Kong non-exclusive jurisdiction clause and choice of law clause (Clause 14). 11. The 3 rd defendant signed an Undertaking dated 24 November 2004 in favour of the plaintiff whereby it undertook to apply the purchase price of RMB 187,500,000 under the Honourlink Agreement towards the payment of the unpaid compensation. 12. The 3 rd defendant also executed a Guarantee dated 4 January 2005 in favour of the plaintiff whereby it unconditionally and irrevocably guaranteed that the 1 st and 2 nd defendants would comply with and perform the Honourlink Agreement. The choice of law is Chinese law. 13. In June 2006, the 3 rd defendant commenced legal proceedings in the Shanghai No.2 Intermediate People’s Court against the JV Company for the reimbursement of the unpaid compensation of RMB 90,892,090 paid to the Jing An District People’s Government on behalf of the JV Company. The 3 rd defendant relied on the Shanghai Transaction Agreement dated 28 March 205 (“Shanghai Agreement”) between the 3 rd defendant and Jia Cheng/Cheng Han. Clause 8 of the Shanghai Agreement stated that the transfer of the properties would be completed between 24 March 2005 and 30 June 2005, and the profits, loss and risk between the cut-off date of 31 October 2004 and the completion date would be borne by Jia Cheng/Cheng Han. The 3 rd defendant alleged that “to pay” means actual payment, without prejudice to the ultimate liability. As the unpaid compensation was paid in November and December 2004, it should be borne by Jia Cheng/Cheng Han. The 3 rd defendant also relied on the audit report for 2005 of the JV Company in which the unpaid compensation of RMB 90,892,090.51 was booked as a loan by the 3 rd defendant to the JV Company. 14. Jia Cheng and Cheng Han had applied to be joined as parties to the Shanghai proceedings. The 2 nd defendant appeared as the statutory representative of the 3 rd defendant. The parties appeared in the Shanghai Court in August and September 2006. 15. By the Writ with the Statement of Claim endorsed dated 23 August 2006, the plaintiff pleaded that the Shanghai proceedings were in breach of the Honourlink Agreement and the Guarantee. The relief prayed for are: (1) an order that the 3 rd defendant do forthwith withdraw and discontinue the Shanghai legal proceedings; (2) an order that the 1 st and 2 nd defendant do procure the 3 rd defendant to forthwith withdraw and discontinue the Shanghai legal proceedings; (3) damages to be assessed. 16. The damages were said to have been suffered by reason of the plaintiff’s inability to sell the interests in the JV Company by reason of the Shanghai proceedings. 17. The 1 st defendant is resident in Canada, and the 2 nd defendant is resident in Shanghai. The 3 rd plaintiff was incorporated in the Mainland and has not been served outside jurisdiction. 18. In October 2006, the trial in the Shanghai proceedings took place, and judgment dismissing the 3 rd defendant’s claim was handed down on 23 November 2006. In gist, the Shanghai judgment was based on the interpretation of all the relevant agreements, which were more conclusive than the audit report. On 1 December 2006, the 3 rd defendant lodged an appeal. Applicant’s case 19. On the striking out, Mr. Wong for the 1 st and 2 nd defendants submitted that: (1) there is no reasonable cause of action for the anti-suit injunction by reason of: (i) the 1 st and 2 nd defendants have no interest in the matter in question in the Shanghai proceedings in that those proceedings have nothing to with the 1 st and 2 nd defendant’s obligations under the Honourlink Agreement; and/or (ii) the JV Company, a party related to the plaintiff; has submitted to the jurisdiction of the Shanghai Court; and/or (2) it is clear and obvious that the anti-suit injunction would be refused in the exercise of the court’s discretion; and/or (3) it is an abuse of process in that the plaintiff has no intention to proceed with the anti-suit injunction given the progress and development of the Shanghai proceedings. 20. On forum non conveniens , Mr. Wong submitted that the Shanghai Court is the most appropriate forum by reason of that the land is located in Shanghai, the documents and the key witness are in Shanghai, and the choice of law (except for the Honourlink Agreement) is Chinese law. Relevant principles 21. It is only in plain and obvious cases that the court should exercise the summary jurisdiction to strike out any pleading as disclosing no reasonable cause of action (See Hong Kong Civil Practice 2007 para. 18/19/4). 22. On anti-suit injunction, in Airbus Industrie CIE v. Patel & ors [1999] 1 AC 119 , Lord Goff of Chieveley said at p. 133D-F that: “The broad principle underlying the jurisdiction is that it is to be exercised when the ends of justice requires it. Generally speaking, this may occur when the foreign proceedings are vexatious or oppressive. Historically these terms have different meanings (see Société Nationale Industrielle Aérospatiale v. Lee Kui Jak [1987] AC 871 , at pp. 893B-E and 893H-894G); but in Amchem Products Inc v. British Columbia (Workers’ Compensation Board) [1993] 1 SCR 897 Sopinka J at p. 932 expressed a preference for a formulation of the principle based simply on the ends of justice, without reference to vexation or oppression. But, as was stressed in the Aérospatiale case (see, in particular p. 895D-H), in exercising the jurisdiction regard must be had to comity, and so the jurisdiction is one which must be exercised with caution: see p.892E-F.” And at p. 138 G-H: “Comity I approach the matter as follows. As a general rule, before an anti-suit injunction can properly be granted by an English court to restrain a person from pursuing proceedings in a foreign jurisdiction in cases of the kind under consideration in the present case, comity requires that the English forum should have a sufficient interest in, or connection with, the matter in question to justify the indirect interference with the foreign court which an anti-suit injunction entails. In an alternative forum case, this will involve consideration of the question whether the English court is the natural forum for the resolution of the dispute…” 23. In Dicey, Morris and Collins on The Conflict of Laws Vol. 1 (14th ed, 2006), the learned authors stated at p. 508, para. 12-078: “ The timing of the application. In principle, the sooner the application for an injunction is made the better the Chances of success, for the amount of wasted time and money will increase the longer the application is delayed. Moreover, the application may well be defeated if the applicant has already submitted to the jurisdiction of the foreign court…” 24. In Svendborg v. Wansa [1996] 2 Lloyd’s Rep 559, Clarke J said at p. 571: “There is no doubt that the plaintiffs submitted to the jurisdiction of the High Court in Sierra Leone on June 4, 1994. Mr. Collins submits that in those circumstances, and having regard to the lapse of time since then, no injunction should now be granted. There is considerable force in that submission. In ordinary circumstances it would certainly succeed.” 25. In First Laser Ltd v. Fujian Enterprises (Holdings) Co Ltd & anor , HCA 4414/2001 (date of judgment 12 December 2002), a case involving an anti-suit injunction against the defendant from continuing proceedings in a foreign court, Deputy Judge Lam (as he then was) said at para. 67 that the progress of the proceedings in the foreign court must be a relevant factor. 26. On the lack of intention to prosecute the claim as amounting to abuse of the process of the court, in Grovit v. Doctor & ors [1997] 1 WLR 640 (HL), Lord Woolf said at 647G-648A : “… I am satisfied that both the Deputy Judge and the Court of Appeal were entitled to come to the conclusion which they did as to the reason for the appellant’s inactivity in the libel action for a period of over two years. This conduct on the part of the appellant constituted an abuse of process. The courts exist to enable parties to have their disputes resolved. To commence and to continue litigation which you have no intention to bring to conclusion can amount to an abuse of process. Where this is the situation the party against whom the proceedings is brought is entitled to apply to have the action struck out and if justice so requires (which will frequently be the case) the courts will dismiss the action. The evidence which was relied upon to establish the abuse of process may be the plaintiff’s inactivity. The same evidence will then no doubt be capable of supporting an application to dismiss for want of prosecution. However, if there is an abuse of process, it is not strictly necessary to establish want of prosecution under either of the limbs identified by Lord Diplock in Birkett v James [1978] AC 297 . In this case once the conclusion was reached that the reason for the delay was one which involved abusing the processing of the court in maintaining proceedings when there was no intention of carrying the case to trial the court was entitled to dismiss the proceedings.” 27. In Chevalier (E&M Contracting) Ltd v. Rotegear Development Ltd & ors [2005] 4 HKLRD 30 , I observed that the court’s power to strike out on the basis of an abuse of process under the principle in Grovit v. Doctor is likely to be restricted to cases of exceptional nature. 28. On forum non conveniens , in DGC v. SLC (née C) [2005] 3 HKC 293 , Cheung JA in giving the judgment of the Court of Appeal said at p. 297E to 298B that: “The principles governing a stay of a Hong Kong proceeding by reason of forum non conveniens or forum non conveniens (the term is the same) have been set out by the House of Lords in Spiliada Maritime Corp v. Cansulex Ltd, The Spiliada ) [1987] 1 AC 460 . The principles are adopted by this court in The Adhiguna Meranti [1987] 2 HKC 126 , [1987] HKLR 904 (Yang VP (as he then was), Hunter JA and Nazareth J (as he the was)) and Louvet v. Louvet [1990] 1 HKLR 679 (Fuad VP, Hunter and Penlington JJA). The Principles are: 1. The single question to be decided is whether there is some other available forum, having competent jurisdiction, which is the appropriate forum for the trial of an action, i.e. in which the action may be tried more suitably for the interests of all the parties and the ends of justice? 2. In order to answer this question, the applicant for the stay has to establish that first, Hong Kong is not the natural or appropriate forum (‘appropriate’ in this context means the forum has the most real and substantial connection with the action) and second, there is another available forum which is clearly or distinctly more appropriate than Hong Kong. Failure by the applicant to establish these two matters at this stage is fatal. 3. If the applicant is able to establish both of these two matters, then the plaintiff in the Hong Kong proceeding has to show that he will be deprived of a legitimate personal or juridical advantage if the action is tried in a forum other than Hong Kong. 4. If he plaintiff is able to establish this, the court will have to balance the advantages of the alternative forum with the advantages that the plaintiff may suffer. Deprivation of one or more personal advantage will not necessary be fatal to the applicant for the stay if he is able to establish to the court’s satisfaction that substantial justice will be done in the available appropriate forum.” 29. His Lordship further said at p. 300A that: “We accept that generally speaking, multiplicity of actions of the same subject matter in different jurisdictions should be avoided. But very often when parties realized that they have to face multiple proceedings, they would choose to pursue one set of proceedings. In any event this problem will not by itself cause the Hong Kong proceeding to be stayed because ultimately the real issue is still whether Hong Kong is not the appropriate form to try the case. Lord Diplock in The Abadin Daver [1984] 1 AC 398 has clearly stated that, … but as a general rule the fact that to permit in England action to be pursued would result in concurrent actions on the same subject matter proceeding in two different jurisdictions could not be sufficient to justify depriving the plaintiff of the advantage to which he was entitled, if an English court of competent jurisdiction could be found, to choose it as the forum in which he preferred to litigate the matter.” 30. The existence of non-exclusive jurisdiction clause is simply one factor to be taken into account when considering which forum is the most appropriate one for the dispute (see T & K Electronics Ltd v. Tai Ping Insurance Co Ltd [1993] 3 HKC 330 ). Discussion 31. On the lack of interest in the matter in question in the Shanghai proceedings, Mr. Wong submitted that the Honourlink Agreement only imposes an obligation on the 1 st and 2 nd defendants to compensate the plaintiff in the event the 3 rd defendant fails to pay the unpaid compensation, and it does not oblige the 1 st and 2 nd defendants to procure the 3 rd defendant not to claim reimbursement of the unpaid compensation. The Shanghai proceedings are concerned with the Shanghai Agreement and the apportionment of liabilities between the 3 rd defendant and the JV Company, and have nothing to do with the obligation to pay compensation by the 1 st and 2 nd defendant. The 3 rd defendant is not a live party herein. In any case, the remedy of the plaintiff is limited to damages and no injunction should issue. 32. Further, Mr. Wong submitted that the plaintiff is bound to fail in an anti-suit injunction because the JV Company has already submitted to the jurisdiction of the Shanghai Court. 33. On the exercise of the discretion, Mr. Wong submitted that it is against the notion of justice to deny the 3 rd defendant a right of appeal when the Shanghai proceedings was allowed to proceed to trial and judgment was delivered against the 3 rd defendant. He said it was “heads I win and tails you lose”. 34. Mr. Wong said one has to look at the matter practically in considering comity. According to the 3 rd defendants’ lawyer in Shanghai, the appeal must be heard within 3 months of the judgment at first instance under Chinese law. Although 3 months have now elapsed, it can be assumed that the appeal be heard soon, and most probably before the anti-suit injunction is tried here. It can already be said now that it is too late to stop the Shanghai proceedings, and equity will not act in vain. Although the lapse of time since the issue of the Writ was not substantial by itself, taking into account the expeditious progress of the Shanghai proceedings, the plaintiff’s failure to seek the anti-suit injunction (whether by speedy trial or interlocutory relief) demonstrated the lack of intention to proceed with the matter as amounting to an abuse of process of the court. 35. Mr. Wong submitted that with the exception of the Honourlink Agreement, it is not disputed that all other agreements have Chinese law as the choice of law by express provision or necessary implication as the subject land is in Shanghai. The understanding of Chinese law and conveyancing practice are essential to the resolution of the dispute. The parties, witnesses and documents are in Shanghai. The only connection with Hong Kong is the non-exclusive jurisdiction and choice of law clauses in the Honourlink Agreement. Hence, Shanghai is the most convenient forum for the resolution of the dispute. 36. In response, Mr. Chang for the plaintiff submitted that the plaintiff’s action herein is in fact an injunction to restrain the 1 st and 2 nd defendants from the breach of the Honourlink Agreement, or alternatively, specific performance of the 1 st and 2 nd defendant’s obligation to procure the payment of the unpaid compensation by the 3 rd defendant. As the 3 rd defendant is disclaiming liability to pay the unpaid compensation, and the 1 st and 2 nd defendants are in control of the 3 rd defendant, the 1 st and 2 nd defendants are in fact repudiating their liability to guarantee the payment by the 3 rd defendant and/or to pay and/or to apply the purchase price under the Honourlink Agreement towards the unpaid compensation. Hence, the plaintiff has an interest in the matter in question in Shanghai. 37. On the other hand, although the 1 st and 2 nd defendants are in the driving seat of the 3 rd defendant, the same cannot be said about the plaintiff and the JV Company. Granted that the plaintiff was nominated by Jia Cheng to purchase 25% of the JV Company as held by Honourlink, there is no evidence that the plaintiff is a nominee of Jia Cheng, or they are ultimately controlled by the same person. The plaintiff has never submitted to the jurisdiction of the Shanghai Court, and cannot be equated to have done so by reason of its 1 25% shareholder of the JV Company. 38. Mr. Chang submitted tat the 3 rd defendant is clearly in breach of the PRC Shares Transfer Agreement. He submitted that actual payment of the unpaid compensation after the cut-off date under the Shanghai Agreement is a red herring, as it is subject to and without prejudice to the express undertaking to pay the unpaid compensation upon the due date under clause 2(2) of the PRC Shares Transfer Agreement. Liability of the 3 rd defendant is clear, as so held by the Shanghai Court. The 3 rd defendant’s payment of the unpaid compensation was warranted by the 1 st and 2 nd defendants under clause 9.5 of the Honourlink Agreement. The 1 st and 2 nd defendants will have no defence under the Honourlink Agreement as their defence would be the same as the 3 rd defendant’s case in Shanghai as indicated. 39. Mr. Chang submitted that the court will not be acting in vain as the Shanghai proceedings are not complete until the appeal is heard. The damage caused to the plaintiff by the lis pendens is continuing. In restraining the breach of contract, it is better late than never. Mr. Chang likened it with enjoining an assault from being committed notwithstanding that there is an undertaking to pay the medical expenses. 40. Mr. Chang submitted that the plaintiff has a good claim for under the Honourlink Agreement, which provided for Hong Kong non-exclusive jurisdiction and choice of law. Whatever forum, both Chinese and Hong Kong laws are relevant. Hence, the applicable law point is neutral. 41. I find that the 1 st and 2 nd defendants have failed to demonstrate it is clear and obvious that the plaintiff has no reasonable cause of action against the 1 st and 2 nd defendants for breach of contract or it has no interest in the Shanghai proceedings. The plaintiff has contracted to buy from the 1 st and 2 nd defendants the 25% shares of the JV Company free from the encumbrances, inter alia , the unpaid compensation. The 1 st and 2 nd defendants have agreed to procure the payment of the unpaid compensation by the 3 rd defendant. The 3 rd defendant is owned and controlled by the 1 st and 2 nd defendants. It lies at the suit of the plaintiff to enjoin the 1 st and 2 nd defendants to procure the 3 rd defendant to perform its obligation, which is warranted by the 1 st and 2 nd defendants. 42. The plaintiff is not a party to the Shanghai proceedings, and it cannot be said that the plaintiff has submitted to the jurisdiction of the Shanghai Court. The issue is that assuming the plaintiff has a good case in breach of the Honourlink Agreement, whether it is clear and obvious that the plaintiff is bound to fail in getting the injunction as opposed to damages by reason of delay, the progress of the Shanghai proceedings, comity and forum conveniens , and adequacy of damages to the plaintiff. 43. There is considerable delay on the part of the plaintiff having regard to the progress of the Shanghai proceedings. The JV Company had submitted to jurisdiction in Shanghai Court and the matter was already tried at first instance. 44. Moreover, the Shanghai judgment is not adverse to the plaintiff and there is no indication that it had suffered any prejudice or loss of juridical advantage. 45. Although the loss of injunctive relief is disadvantageous to the plaintiff, having regard to the other factors, there is no indication that damages would not be enough at the end of the day. 46. In the premises, it demonstrably certain now that the anti-suit injunction will be refused by the court. Hence, I order that the relief for an order that the 1 st and 2 nd defendants do procure the 3 rd defendant to withdraw its legal proceedings against the plaintiff in Shanghai be struck out. 47. I wish to add that I do not consider that the abuse of process point has been made out. 48. As to forum non conveniens on the rest of claims, while not conceding the point, Mr. Wong did not argue it strenuously. 49. I note there are connecting factors pointing to Shanghai as submitted by Mr. Wong. But the claim here is founded on the Honourlink Agreement, the main agreement between the plaintiff and the 1 st and 2 nd defendants. It has expressly provided for Hong Kong non-exclusive jurisdiction and choice of law. There is no proceedings on foot in Shanghai on the Honourlink Agreement. And if so, Hong Kong law would be relevant. It cannot be said that the Hong Kong court is not the natural forum. I have also considered the multiplicity of suits, but having regard to the arguments of the 3 rd defendant in Shanghai and those of the 1 st and 2 nd defendants here, there is unlikely to be any irreconcilable decisions in the different fora. Hence, I refuse to stay the rest of the proceedings on the ground of forum non conveniens . Costs 50. The plaintiff and the defendants have each won some and lost some. The arguments presented are really relevant to both issues. I consider the just order is to make no order as to costs on the summons and the hearing. I shall make such as order nisi , to be made absolute in 14 days. (B Fung) Judge of the Court of First Instance High Court Mr Jonathan Chang, instructed by Messrs Chiu & Partners, for the Plaintiff Mr Anson Wong, instructed by Messrs Tsang, Chan & Woo, for the 1 st & 2 nd Defendants 3 rd Defendant: in person, absent Look up this case on Lawcite Noteup",
  "length": 27631,
  "headers_seen": [
    "Background",
    "Applicant’s case",
    "Relevant principles",
    "Discussion",
    "Costs"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2007/282",
  "query": "anti-suit injunction",
  "ts": "2025-10-16T10:47:36",
  "ok": true
}