{
  "title": "LFW V. LSH AND OTHERS | [2015] HKFC 138 | HKLII",
  "court": null,
  "year": 2015,
  "date": null,
  "content": "HKLII Databases Family Court [2015] HKFC 138 LFW V. LSH AND OTHERS Judgment Information Date 8 Oct, 2015 Action No. FCMC237/2013 Neutral Cit. [2015] HKFC 138 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History FCMC237/2013 FCMC237/2013 LFW v. LSH AND OTHERS FCMC 237 /2013 IN THE DISTRICT COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION MATRIMONIAL CAUSES NO. 237 OF 2013 ---------------------------- BETWEEN LFW Petitioner and LSH Respondent LYW 1st Intervener LKM 2nd Intervener CCC 3rd Intervener ---------------------------- Coram: Deputy District Judge G. Own in Chambers (Not Open to Public) Date of Hearing: 11 September 2015 Date of Decision: 9 October 2015 ------------------------- J U D G M E N T ------------------------- Introduction 1. This is the 1 st Respondent Wife’s (“Wife”) application for maintenance pending suit against the Petitioner Husband (“Husband”) by way of Summons issued on 20 March 2015 seeking a monthly sum of HK$11,370 commencing the 7 th day after the Order was granted and thereafter on or before the 3 rd day of each succeeding month. The Wife is legally aided and was represented by Counsel for this hearing. The Husband with legal representation opposed the application. The Issue 2. The main issue to be determined is whether the Husband should be ordered to pay maintenance to the Wife, on an interim basis and assessed on a broad brush approach, having regard to the reasonable and immediate needs of the Wife and the Husband’s ability to pay. Background 3. The parties married in September 2006. They separated in March 2010 which is only about 3 ½ years later. At the time of the marriage, the Husband was a widower aged 63. The Wife was a divorcee at the age of 36. This is a ‘no child’ and relatively short marriage. 4. On 4 February 2013, the Husband presented his Petition for divorce on the fact of ‘One Year Separation and Consent’. On the same day before service, the Petition was amended pursuant to Rule 16 of the Matrimonial Causes Rules , Cap.179A , as a ‘Two Year Separation’ case. 5. The Husband is a retired person. He is the owner of a few plots of land in the New Territories which he alleged were from inheritance and are agriculture lands under the Block Crown Lease. Admittedly there were illegal structures on those lands where he had received some income. At present, some of the illegal structures had been demolished pursuant to demolition orders by the Lands Department. There are only 2 illegal structures left behind which would generate income of around HK$7,400 a month to him. With the likely demolition of these remaining illegal structures by the Lands Department in due course, he expects this source of income would also cease. He is also receiving monthly allowance of GBP 475.36 (approximately HK$6,000) from the United Kingdom Government. Such allowance was paid into a joint name bank account with his daughter in the United Kingdom. His daughter would take away about half of such allowance. Besides, he is receiving some sort of elderly monthly allowance in the region of HK$1,180 from the Hong Kong Government. 6. The Wife claimed to be a housewife although she has had earned some income through carrying out renovation and painting work for some of the neighbourhood. She deposed at paragraph 4 of her 7 th Affirmation that the Husband had been giving her HK$4,800 maintenance a month during marriage. At paragraph 6 of the same Affirmation, she deposed that since separation she relied upon rental incomes from 3 structures erected upon 3 plots of land. I will refer to these 3 plots of Land as Lot Nos.493, 494 and 500 which generated rental income of HK$4,000, HK$5,000 and $5,500 respectively. The Husband was the owner of Lot Nos.493 and 494. For Lot No.495, the owner was a different person. She was told by the Husband that the owner of Lot No.495 might have died and the Husband had wrongly trespassed upon such plot of land and erected an illegal structure there to earn rental income. 7. To account for the several deposits and withdrawals seen in her Bank of China account passbook, the Wife explained the moneys were received from helping out a villager in a project of repairing the roof, whitewashing and painting the doors and also some other odd jobs. Around the latter part of October 2014, she was appointed by a neighbour Mr. Yeung to repaint the outside wall of his village house. She was given a sum of HK$30,000 which can also be seen in her bank passbook. Deducting all the expenses, she only earned HK$500 on this project. The law on maintenance pending suit 8. Section 3 of the Matrimonial Proceedings and Property Ordinance , Cap.192 (“MPPO”) provides the Court with discretion to make orders requiring either party to the marriage to make to the other such periodical payments for his or her maintenance as the court thinks reasonable having considered all the circumstances of the case (see HJFG v. KCY [1012] 1 HKLRD 95 ). The overriding principle is one of ‘reasonableness’. 9. It is useful to recite those paragraphs of Hartmann JA (as he then was) in the HJFG case :- “33. Jurisdiction to award maintenance pending suit to a spouse is statutory, being governed by the provisions of s.3 of the Matrimonial Proceedings and Property Ordinance , Cap.192 . By that section the court is given a discretion to make an order requiring either party to the marriage to make to the other such periodical payments for his or her ‘maintenance’ as the court thinks ‘reasonable’, subject to the condition that the duration of any such order is limited to the period of what may broadly be called the divorce litigation. 34. By definition, therefore, maintenance pending suit is restricted to payments which constitute ‘maintenance’, which are reasonable in the circumstances and which will endure for no longer than it takes to determine the divorce litigation. ‘Maintenance’ is a broad concept. I do not seek to define its exact meaning but it seems to me that it must be restricted to those payments necessary to meet the recurring costs of living at whatever standard of living is appropriate. That being the case, no matter how great the wealth of the parties and how unevenly distributed that wealth may be at the time an application for interim maintenance is made, the court has no jurisdiction to make orders which for all practical purposes result in a form of pre-trial capital re-balancing. In the present case, the judge recognised the long-established approach of looking to the “immediate and reasonable needs” of the wife and son. 35. As to the amount of maintenance pending suit that may be paid, the Ordinance provides only that it must be ‘reasonable’, that is having regard to the circumstances of the case, that it must be fair. 36. An important factor in determining fairness is a consideration of the marital standard of living. In this regard, each case must be considered according to its own circumstances. It is not simply to be assumed that great wealth equates to great extravagance. Some married couples who enjoy great wealth spend with comparative modesty and with a discipline born of discretion, others enjoy consumption on a grand scale. 37. The principles that have emerged over time to guide judges in matters of interim maintenance have been fashioned in the main to ensure fairness. This is well illustrated in the judgment of Nicholas Mostyn, QC, sitting then as a deputy High Court judge, in TL v. ML and Others (Ancillary Relief : Claim against Assets of Extended Family) [2006] 1 FLR 1263 , at 1289, in which, having looked at earlier authorities, he derived the following principles that speak specifically to fairness or are based on the need to ensure it. For present purposes, it is sufficient to cite the relevant principles without citing the judge’s reference to the source of those principles : i. The sole criterion to be applied in determining the application is ‘reasonableness’, which is synonymous with ‘fairness’. ii. A very important factor in determining fairness is the marital standard of living. This is not to say that the exercise is merely to replicate that standard. iii. In every maintenance pending suit application there should be a specific maintenance pending suit budget which excludes capital or long-term expenditure, more aptly to be considered on a final hearing. That budget should be examined critically in every case to exclude forensic exaggeration. iv. Where the affidavit or form E disclosure by the payer is obviously deficient, the court should not hesitate to make robust assumptions about his ability to pay. The court is now confirmed to the mere say-so of the payer as to the extent of his income or resources. In such a situation, the court should err in favour of the payee. 38. Finally, it is to be noted that in applications for interim maintenance, when the amount to be paid is for a limited period only and not all of the evidence is necessarily before the court, it is not appropriate, nor indeed in most cases possible, for the court to conduct a detailed investigation into the finances of the parties. While, in order to determine what is or is not reasonable, some analysis is always required, that analysis can be conducted on a ‘broad brush’ basis. The Wife’s case 10. The Wife’s case is simple and straight forward. She said she was a housewife after the marriage and helped the Husband in taking care of the Husband’s mother until her death in 2009. Her education level is even lower than primary level, with no special skills or expertise, could only perform some low income work such as domestic carer or labourer, doing some painting or mending work. 11. Since the Husband stopped providing her with maintenance, and also caused the occupants of those plots of land from whom she used to collect ‘ rent ’ stopped paying her, she was forced to take up odd jobs from neighbours for repairing some village houses in order to make a living. 12. The Wife’s maintenance pending suit budget table was set out at paragraph 10 of her 7 th Affirmation as follows :- “Rent $ 4,800 Utilities (water, electricity, gas & telephone charges) $ 850 Food $ 3,600 Miscellaneous charges $ 200 Travelling expenses $ 300 Clothing and Personal Grooming $ 300 Medical and Dental Expenses $ 100 Life Insurance (average per month) $ 1,220 $ 11,370” The Husband’s case 12. 12. The Husband’s case is also simple and straight forward. Being a retired person depending upon monthly allowances from the United Kingdom and Hong Kong Government, he simply could not afford to pay the Wife any maintenance. The Husband made no challenges over any of the Wife’s items of expenses in the budget table. The Husband’s opposition simply based upon his limited financial resources, that is to say, his inability to pay and also asserting the Wife having earning capacity to support and maintain herself. 13. As to the ‘ rent ’ issue which was received from occupants of various illegal structures erected on different plots of land owned by the Husband, he is running the case that since all these ‘ rent ’ are for the use and occupation of illegal structures, the income are therefore tainted with illegality of which the Court should not recognise as a legitimate source of the Husband’s income. To do so would be in contravention of public policy. 14. The Husband provides his monthly expenses as follows :- “Meals outside home $ 5,000 Travelling Expenses $ 300 Clothing and Shoes $ 700 Personal Grooming $ 500 Entertainment/Gifts $ 500 Holidays $ 1,000 Medical/Dental Expenses $ 700 Others (Salary for hiring Part Time Maid look after me and miscellaneous Expenses) $ 4,500 $ 13,200” Discussion (a) Reasonable and Immediate needs of the Wife 14. Since the Husband does not contend any of the items in the Wife’s maintenance pending suit budget, both in terms of their necessity and amount, there is no need for this Court to go into any more detail other than to accept the amount of claim of HK$11,370 as reasonable. Save and except for the item of insurance premium of HK$1,220, I also find the other items in the budget table totalling HK$10,150 (i.e. HK$11,370 less HK$1,220 = HK$10,150) are immediate needs as they cover day to day living costs and expenses. (b) The ability to pay by the Husband 15. The monthly allowance from the United Kingdom Government is around GBP 475.36 which is around HK$6,000. The elderly allowance in Hong Kong, as per exhibit “L7-3” attached to his 7 th Affirmation, is around HK$1,180. In his Form E at paragraphs 3.1 and 3.2, he deposed having an income of HK$8,600 plus “生果金” of HK$2,200, thus making a total monthly income of HK$10,800. There is no dispute by him that the Government allowances from these two jurisdictions are part of his income. 16. Miss Yanky Lam, Counsel for the Wife, in her supplemental written submissions stated that there was nothing to suggest those other structures on other plots of land were erected in breach of the Government Lease or without the licence or approval of the Government. There was no evidence of warning letter issued by the Lands Department in respect of structures on the other lands were also erected illegally similar to the case of the structure on Lot No.494 which had been determined as illegal and already demolished. Having said, there was nothing to support the Husband’s case that those ‘ rental ’ are unlawful or illegal in law and in fact. No enforcement action or warning letters had been issued by the Lands Department on those other structures. 17. The proper question to be asked is whether the Court, when considering a maintenance pending suit application, would have to make findings of fact on specific issues raised by respective parties where such specific issues could only be determined by microscopic investigation ? In my view, the answer must be “No”. It is trite and settled law that maintenance pending suit applications do not call for any viva voce evidence or any expert evidence. The Court’s discretion is widely exercised on a ‘broad brush’ basis for the ultimate aim of achieving ‘reasonableness’, taking into account the needs of the party applying and the ability of the paying party (see the HJFG case, supra). 18. As to the matters which the Court should consider when determining an application for maintenance pending suit, it was said in Rayden and Jackson on Divorce and Family Matters , 18 th Edition, as follows :- “16.17….. There is no hard and fast rule, and no fixed proportion: each case depends on its own facts. It has been said that the approach to maintenance pending suit should be empirical, and that ‘in the ordinary sort of case the district judges who deal with these applications will have to take a broad view of means on the one hand and income on the other and come to a “rough and ready” conclusion’, or take a ‘broad brush’ approach. The overriding consideration is the actual needs of the parties pending suit. ….. 16.18….. In practice, as oral evidence is rarely given, it will be unusual for the court on an application for maintenance pending suit to be in a position to make findings of fact on issues in dispute…… ” 19. Notwithstanding the Husband’s lawyers who produced 61-page of the Block Crown Lease dated back to 27 March 1905 of the relevant demarcation district lots in question as exhibit “L3-1” in the Husband’s 3 rd Affirmation, it is my decision that this Court in the present maintenance pending suit application would not have to determine the issue of ‘legality or illegality’ of the ‘ rent ’ derived from those structures erected on the other plots of land of the Husband. 20. Whilst I agree with Counsel Miss Lam’s submission (at paragraph 8 of her supplemental submission) that this Court should consider whether those ‘ rental ’ income is actually received by the Husband now but not to determine, through this hearing, whether the income is ‘unlawful’ or ‘illegal’ as Husband so alleged when deciding his ability to pay, I have reminded myself that the ultimate aim of achieving ‘reasonableness’ must not be overlooked. ‘Reasonableness’ can only be achieved, in my view, by consideration of all the surrounding circumstances and relevant objective factors. 21. To determine ‘reasonableness’ in the present case, the proper question is whether it is reasonable for the Wife to sit back and seek maintenance from the Husband ? The answer depends on the Wife’s capability to make a living for her own and if so, would her income be sufficient to cover her daily needs pending determination of any ancillary reliefs claim she may have in these proceedings against the Husband. 22. The Wife’s evidence as to her earning capacity is that she was a full time housewife and was educated only up to primary level. She was fully and financially dependent on the Husband during the 3 ½ year marriage. On the Wife’s own admission, however, she has had helped out in carrying out some repair works for villagers’ houses from which she received HK$30,000 and, after deducting all expenses, she only had HK$500 wages for that piece of work. Admittedly she had also carried out some other repair work for 4 village houses but in any event the net income so received was minimal and unstable. She was once employed as a domestic helper but was sacked shortly afterwards due to poor performance. The Wife also claimed that her health condition also affects the kind of work which she could do. 23. Although there is no sufficient evidence to support the Husband’s assertion that the Wife was a skilled worker capable to carry out house maintenance work, painting, piping, woodwork, cement etc somehow akin to a contractor, the vast number of deposits and withdrawals revealed from her bank passbook with the Bank of China Account No.012-xxx100-xx438 clearly suggests that she did engage in certain kinds of activities with moneys changed hands. The Wife fairly conceded that she had undertaken certain work for reward during this period of time. The Husband’s lawyers have picked 7 deposit entries in the Wife’s said bank account of the amount over HK$10,000 per entry from March 2013 to October 2014 (about 20 months), it added up to HK$335,899.46 which averaged out at HK$16,794.97 or round up to, say, HK$16,800 a month. The Wife in her affirmation deposed that there were expenses and labour costs which she would have to pay out of the moneys she received. The figures seen should not be taken at its face value as her net income earnings. 24. I am not entirely convinced by the Wife’s evidence. Her assertion in the absence of any direct or indirect documentary evidence to show those withdrawals out of moneys received by her were for paying others and thus, off-setting one against the other, only left with her meagre net income can hardly be accepted. Viewing the matter objectively and assessing her evidence on balance of probabilities, it is more likely than not that she would have earned more than she alleged. In any event, I think the core issue is whether she has the earning capacity to make a living for her own as opposed to whether she did earn enough to cover her daily needs and expenses. On this issue, I find the Wife who is now at the age of 45 has a much better earning capacity vis-à-vis the Husband who has passed his 72 years old birthday in August this year. 25. To sum up, I find the Wife has earning capacity to make a living (see paragraph 24 above) and her reasonable and immediate financial needs are HK$10,150 a month (see paragraph 14 above). 26. Now I will turn to the Husband’s budget. I agree with the Wife’s Counsel Miss Lam that some of the items there should either be removed for non existing or should be discounted for being excessive or over estimation. 27. On the Husband’s items under his budget of expenses, I will make adjustments and the revised amounts are as follows in bold print :- “Meals outside home $ 3,600 Travelling Expenses $ 300 Clothing and Shoes $ 300 Personal Grooming $ 200 Entertainment/Gifts $ 100 Holidays $ 200 Medical/Dental ExpensesOthers (Salary for hiring Part TimeMaid look after me and miscellaneous $ 300 Expenses) $ 0 $ 5,000 ” 28. To sum up, I find the Husband’s monthly budget should be HK$5,000 instead of HK$13,200. Should the Husband be ordered to pay maintenance pending suit ? 29. On the findings above and adopting a ‘broad brush’ approach assessment, I believe it is reasonable for the Husband to pay a monthly sum of HK$4,800 as maintenance pending suit to the Wife. This amount is also within the Husband’s financial ability when taking into account the significant downward adjustment of his monthly expenses budget from HK$13,200 down to HK$5,000 (that is, a reduction of HK$8,200 a month). Further, this amount of maintenance pending suit plus the Husband’s adjusted monthly expenses of HK$5,000 is within the Husband’s deposed income of HK$10,800 a month (see paragraph 15 above). 30. Moreover, this amount of HK$4,800 is equivalent to the amount of rental which the Wife is now paying leaving behind her other daily needs and expenses to be taken care of by herself through her own earning capacity. As seen in the Wife’s budget table and from our day to day experience, rental payment is always the largest portion of monthly expenses and there is no exception here in the Wife’s case. 31. I direct the maintenance pending suit to commence on the 1 st day of November 2015 until further Order. Such maintenance pending suit would be subject to any First Charge of the Director of Legal Aid that may be applicable. 32. Payment be made to the Wife’s solicitors or otherwise arranged with the Director of Legal Aid. Costs 33. Both parties have not exchanged any open proposals before this trial. The sum of maintenance pending suit now ordered by this Court is nowhere close to the Wife’s or the Husband’s stance. I believe it is fair and reasonable to make no Order as to costs of this application. Orders 34. I now grant the following Orders :- (a) The Petitioner do pay the 1 st Respondent maintenance pending suit in the sum of HK$4,800 a month, subject to any Director of Legal Aid’s First Charge that is applicable, commencing 1 November 2015 and thereafter on or before the 1 st day of each succeeding month pending further Order; (b) Payment be made to the 1 st Respondent’s solicitors or otherwise arranged with the Director of Legal Aid; (c) There be no Order as to costs of this application including all costs reserved; (d) 1 st Respondent’s own costs be taxed in accordance with Legal Aid Regulations . 33. This is a costs order nisi which will become absolute if no application for variation is made by either party within 14 days. (George Own) Deputy District Judge Mr. Yau Chap Yin of Messrs. Raymond Cheung & Chan, Solicitors for the Petitioner Miss Yanky Lam instructed by Messrs. Annie Leung & Co., Solicitors for the 1 st Respondent Look up this case on Lawcite Noteup",
  "length": 22953,
  "headers_seen": [
    "Introduction",
    "The Issue",
    "Background",
    "The law on maintenance pending suit",
    "The Wife’s case",
    "The Husband’s case",
    "Discussion",
    "(a) Reasonable and Immediate needs of the Wife"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkfc/2015/138",
  "query": "maintenance pending suit",
  "ts": "2025-10-16T12:10:56",
  "ok": true
}