{
  "title": "CHIMBUSCO INTERNATIONAL PETROLEUM (SINGAPORE) PTE LTD V. FULLY BEST TRADING LTD | [2015] HKCFI 2196 | HKLII",
  "court": null,
  "year": 2015,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2015] HKCFI 2196 CHIMBUSCO INTERNATIONAL PETROLEUM (SINGAPORE) PTE LTD V. FULLY BEST TRADING LTD Judgment Information Date 2 Dec, 2015 Action No. HCA2416/2014 Neutral Cit. [2015] HKCFI 2196 Parallel Cit. [2016] 1 HKLRD 582 [2016] 1 HKC 149 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCA2416/2014 HCA2416/2014 CHIMBUSCO INTERNATIONAL PETROLEUM (SINGAPORE) PTE LTD v. FULLY BEST TRADING LTD HCA 2416/2014 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE ACTION NO 2416 OF 2014 ____________ BETWEEN CHIMBUSCO INTERNATIONAL PETROLEUM (SINGAPORE) PTE LTD Plaintiff and FULLY BEST TRADING LIMITED (沛佳貿易有限公司) Defendant ____________ Before: Hon Mimmie Chan J in Chambers (open to public) Date of Hearing: 30 November 2015 Date of Reasons for Decision: 3 December 2015 ________________________ REASONS FOR DECISION ______________________ 1. The plaintiff commenced proceedings against the defendant in November 2014, to seek payment of sums due under an agreement for its supply of fuel oil, made between the plaintiff and the defendant in July 2014. The Statement of Claim was filed on 2 December 2014. 2. On 4 March 2015, the defendant applied by summons for a stay of the action to arbitration, pursuant to an arbitration clause contained in the agreement. The hearing of the stay application was adjourned to 30 November 2015. 3. On 19 November 2015, the plaintiff confirmed that it consents to the defendant’s application for stay of this action. The remaining issue relates to whether the plaintiff should pay the defendant’s costs on an indemnity basis, or whether, as the plaintiff claims, the costs should be in the cause of the arbitration. 4. In A v R (Arbitration: Enforcement) , [2009] 3 HKLRD 389 , the arbitration judge Reyes J explained: “As I pointed out in Xiamen Xingjingdi Group Ltd v Eton Properties Ltd [2008] 4 HKLRD 972 (at paras 61-63), an agreement that parties are to settle disputes through arbitration in some place X, is equivalent in law to an exclusive jurisdiction clause. The agreement gives exclusive jurisdiction to the Courts of X as far as supervising the conduct of the relevant arbitration is concerned.” 5. Since A v R (Arbitration: Enforcement) , where a party unsuccessfully applies to appeal against, set aside, or refuse enforcement of an arbitral award, it has been the practice in Hong Kong to order costs on an indemnity basis, unless special circumstances can be shown. As Reyes J also explained in A v R : “Parties should comply with arbitration awards. A person who obtains an award in his favor pursuant to an arbitration agreement should be entitled to expect that the court will enforce the award as a matter of course. Applications by a party to appeal against or set aside an award or for an order refusing enforcement should be exceptional events. Where a party unsuccessfully makes such application, he should in principle expect to have to pay costs on a higher basis. This is because a party seeking to enforce an award should not have to contend with such type of challenge. Further, given the recent introduction of Civil Justice Reform (CJR), the court ought not normally to be troubled by such type of application. A party unmeritoriously seeking to challenge an award would not be complying with its obligation to the court under O 1A r 3 to further the underlying objectives of CJR, in particular the duty to assist the court in the just, cost-effective and efficient resolution of a dispute. If the losing party is only made to pay costs on a conventional party-and-party basis, the winning party would in effect be subsidising the losing party’s abortive attempt to frustrate enforcement of a valid award. The winning party would only be able to recover about two-thirds of its costs of the challenge and would be out of pocket as to one-third. This is despite the winning party already having successfully gone through an arbitration and obtained an award in its favour. The losing party, in contrast, would not be bearing the full consequences of its abortive application. Such a state of affairs would only encourage the bringing of unmeritorious challenges to an award. It would turn what should be an exceptional and high-risk strategy into something which was potentially “worth a go”. That cannot be conducive to CJR and its underlying objectives.” (Emphasis added) 6. In Wing Hong Construction Ltd v Tin Ho Engineering Co Ltd, unreported, HCCT 13/2010, 3 June 2010, the arbitration judge Saunders J also observed: “The whole principle of arbitration is that a person who obtains an award in his favor is entitled to expect that the Court will enforce the award as a matter of course. It is not necessary for a party successfully resisting an application seeking to challenge the award, to establish the application itself as an abuse of process to justify indemnity costs. The nature of arbitration is such that, having regard to the underlying objectives in the RHC, an unsuccessful application to challenge an arbitrator’s award will normally attract indemnity costs against the applicant.” (Emphasis added) 7. This principle of awarding costs on an indemnity basis in the absence of special circumstances has been approved by the Court of Appeal as “a salutary practice”, in Grand Pacific Holdings Ltd v Pacific China Holdings Ltd (in liq) (No 2) [2012] 4 HKLRD 569 and in Gao Haiyan v Keeneye Holdings Ltd [2012] 1 HKLRD 627 . 8. In Gao Haiyan v Keeneye Holdings Ltd (No 2) CACV 79/2011, 12 January 2012, Tang VP (as this Lordship then was) observed in the judgment of the Court of Appeal (at p 494): “We must give effect to the underlying objectives of CJR when we exercise our powers. We have to consider whether the new practice of ordering indemnity costs in these proceedings is appropriate having regard to CJR. ... In my view, such provisions also support the view that under the CJR, the court may be more ready to consider it appropriate to order indemnity costs. Experienced judges in charge of the Construction and Arbitration List have adopted the approach that, in proceedings arising out of or in connection with arbitral proceedings , in the absence of special circumstances, the court will normally consider it appropriate to order costs on an indemnity basis.” (Emphasis added) 9. In this case, the plaintiff seeks to distinguish indemnity costs being awarded in cases of challenges against an arbitral award, on the basis that in such cases, the parties have already gone through arbitration and had the opportunity to argue their case. Having succeeded before the tribunal, the winning party should not be taxed again by the losing party rearguing the case before the Court, and there are only limited grounds to set aside or refuse recognition of an award. In the present case, there is no arbitration yet, and no award. 10. The basis of awarding costs on an indemnity basis, when a party unsuccessfully seeks to challenge an arbitral award, either to set it aside or to resist its enforcement, is that the arbitral award is made under a consensual agreement, whereby the parties have agreed that they will submit their dispute to arbitration, and that the award made under such an arbitration agreement will be treated by them as final and binding. 11. The modern trend of the courts is to uphold arbitration agreements, to facilitate arbitrations, and (save in circumstances necessary to safeguard due process and as allowed under the international Conventions) not to intervene in an arbitration, which is the parties’ free choice as to the method of dispute resolution, and the substantive law and forum to govern and oversee the arbitration. 12. As a matter of public policy, Hong Kong as a party to the New York Convention has the duty to comply with its duties under Article II of the Convention: to recognize and enforce an arbitration agreement and to stay actions before the Court in breach of a valid and subsisting arbitration agreement. Under s 20 of the Arbitration Ordinance , a Court before which an action is brought in a matter which is the subject of an arbitration agreement “shall” refer the parties to arbitration, unless the Court finds that the agreement is null and void, inoperative or incapable of being performed. The Court has the duty to stay an action in accordance with the arbitration agreement found to exist. 13. As emphasized by the arbitration judge in A v R (Arbitration: Enforcement) and as endorsed by the Court of Appeal in Gao Haiyan v Keeneye Holdings Ltd (No 2) , the objectives of the Civil Justice Reform must also be borne in mind when the question of costs is considered. In Grand Pacific Holdings Ltd v Pacific China Holdings Ltd (in liq) (No 2) [2012] 4 HKLRD 569 , the Court of Appeal referred in its judgment to the decisions of the Victorian Court of Appeal, as to whether indemnity costs are wrong in principle, and came to the considered view that the Hong Kong Court should give effect to and recognize the practice of specialist judges in charge of the Construction and Arbitration List to order indemnity costs in proceedings arising out of or in connection with arbitral proceedings. In connection with this practice of ordering indemnity costs save in special circumstances, Tang VP observed: “Nor do I believe that this practice is wrong in principle. It might be regarded as wrong in principle, if notwithstanding Civil Justice Reform and its implications, indemnity costs could only be awarded when special circumstances are established. However, I believe indemnity costs may be awarded under O 62 r 5 (1) in an unsuccessful application to set aside an arbitral award or to resist enforcement “to ensure fairness between the parties”. Unless such practice is wrong in principle, we cannot interfere. Nor can I agree that such practice amounts to an abrogation of discretion. The practice has left room for special circumstances; what are special circumstances in this context have to be worked out in due course. However, I cannot accept that the fact that the challenge was reasonably arguable is a special circumstance. That would neutralize the practice.” 14. I see no reason at all to differentiate between unsuccessful attempts to resist enforcement of an arbitral award made under an arbitration agreement, and unsuccessful attempts to resist enforcement and recognition of the arbitration agreement itself. The reasons and observations made by Reyes J in A v R , that recourse should not be made to the Court, that parties should comply with arbitration awards made under the arbitration agreement, all apply with equal force to a case where a party to the arbitration agreement unmeritoriously seeks to challenge the arbitration agreement, and refuses to refer the dispute to arbitration in accordance with the agreement. Parties to an arbitration agreement should expect that the Court will recognize and enforce the arbitration agreement, and if they take the risk of instituting court proceedings in breach of such an agreement, they should expect to pay costs on a higher scale if they fail in their attempt to impeach the agreement. 15. The observations made by Reyes J and the Court of Appeal as to the need to further the objectives of the CJR are equally applicable, as justification for awarding costs on an indemnity basis where there are challenges to an arbitration agreement. Unmeritorious challenges to an arbitration agreement, and the use of court proceedings when the parties have agreed to have their rights and disputes resolved by arbitration cannot be conducive to the underlying objectives of the CJR, bearing in mind the duties of the parties, and their lawyers , to assist the Court in the cost-effective and efficient resolution of a dispute, and to ensure the fair distribution of the resources of the Court. 16. After the application made by the defendant in this case in March 2015 for the action to be stayed in pursuance of the arbitration agreement, the plaintiff finally agreed, in November 2015, to stay the action for arbitration. The defendant is successful in obtaining the stay sought in its summons. I see no reason to deprive it of its costs. 17. On the facts and evidence, there is a clear case of an arbitration agreement between the parties. I am not satisfied that such arbitration agreement is null and void by reason of any uncertainty as alleged by the plaintiff, or that it is inoperative or incapable of being performed. The parties clearly expressed their intention to refer disputes arising out of or in connection with their contract, including any question regarding its existence, validity or termination, to be referred to arbitration in Singapore, expressed to be arbitration in SIAC in accordance with the Singapore Bunker Claims Procedure. 18. Unless there is clear and unequivocal admission of both liability and quantum, there is a dispute between the parties ( Tommy CP Sze & Co v Li & Fung (Trading) Co Ltd [2003] 1 HKC 418 ). 19. Unless the point is clear, that there is no valid arbitration agreement, the Court should not attempt to resolve the issue, and the matter should be stayed to arbitration ( PCCW Global Ltd v Interactive Communications Service Ltd [2007] 1 HKLRD 309 ). The Court should not usurp the function and role of the tribunal, which may rule on its own jurisdiction, and procedure, including the rules to apply to the arbitration. This has been made clear by the Court of Appeal since PCCW Global Ltd v Interactive Communications Service Ltd , the distinction being that there is no provision similar to O 73 r 6(2) of the English rules to allow the Court to determine the question as to the conclusion of the arbitration agreement at this initial stage. It should therefore be an exceptional case when a party seeks recourse from the Court, instead of the arbitral tribunal, when there is an arbitration clause in an agreement between the parties. 20. The fact that challenges to the arbitration agreement, or to the arbitral award, are not unarguable, does not constitute a special circumstance( Gao Haiyan v Keeneye Holdings Ltd (No 2) CACV 79/2011, 12 January 2012). 21. None of the matters raised by the plaintiff (as to the merits of the existence or otherwise of a valid arbitration agreement; and as to the conduct of the parties) constitute a special circumstance to justify the Court departing from the general rule that the costs to be borne in an unsuccessful challenge to an arbitration agreement should be ordered on an indemnity basis. 22. Lucky-Goldstar International (HK) Ltd v Ng Moo Kee Engineering Ltd [1993] 1 HKC 404 is clear authority that where the parties have clearly expressed an intention to arbitrate, the agreement is not nullified even if they chose the rules of a non-existent organization. In the present case, the parties expressed the manifestly clear intention to have their disputes submitted to arbitration in Singapore. Such agreement is capable of being performed in Singapore, and it is for the tribunal to decide on its own jurisdiction, and on the rules to be adopted. If necessary, the parties can apply to the Singapore court to appoint the arbitrator(s). 23. Any silence or inactivity on the part of the defendant, after its part payment of the sum claimed by the plaintiff, cannot be unequivocal admission of its liability for payment of the balance, nor of its agreement to waive the arbitration agreement and to proceed with legal action instead. In any event, if there had been any room for doubt, the defendant made its stance plain by its summons issued in March 2015 for stay of the action to arbitration. In default of payment, there was no reason why the plaintiff should not have commenced arbitration for recovery of the unpaid balance of the sum it claims to be due, instead of commencing legal proceedings in Hong Kong in November 2014. If the plaintiff decided to take a risk, then upon the defendant’s application for stay of those proceedings in March 2015, it should have agreed to the stay for arbitration, or face the costs consequences. 24. For all the above reasons, I ordered the plaintiff on 30 November 2015 to pay the costs of the defendant’s application to stay these proceedings, on an indemnity basis. (Mimmie Chan) Judge of the Court of First Instance High Court Mr Jason Yu, instructed by Reed Smith Richards Butler, for the plaintiff Mr Edward Alder, instructed by FitzGerald Lawyers, for the defendant Look up this case on Lawcite Noteup",
  "length": 16583,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2015/2196",
  "query": "arbitration",
  "ts": "2025-10-14T11:21:03",
  "ok": true
}