{
  "title": "K V. T | [2022] HKCFI 1194 | HKLII",
  "court": null,
  "year": 2022,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2022] HKCFI 1194 K V. T Judgment Information Date 25 Apr, 2022 Action No. HCCT53/2021 Neutral Cit. [2022] HKCFI 1194 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCCT53/2021 HCCT53/2021 K v. T HCCT 53/2021 [2022] HKCFI 1194 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO 53 OF 2021 ____________________ IN THE MATTER of an Arbitral Award dated 15 th August 2019 in HKIAC/18059 made by the HKIAC and IN THE MATTER of section 81 of the Arbitration Ordinance ( Cap 609 ) and Article 34 of the UNCITRAL Model Law on International Commercial Arbitration and IN THE MATTER of Order 3 Rule 5 and Order 73 Rule 5 of the Rules of the High Court ( Cap 4A ) ____________________ BETWEEN K Plaintiff and T Defendant ____________________ Before: Hon Mimmie Chan J in Chambers Dates of Written Submissions: 10 and 11 February 2022 Date of Decision: 26 April 2022 _____________ D E C I S I O N _____________ Background 1. This is an application made by the Plaintiff for extension of time to set aside an arbitral award dated 15 August 2019 (“ Award ”), on the grounds referred to in sections of the Arbitration Ordinance (“ Ordinance ”) cited in the Originating Summons (“section 81 (2)(1)(ii) and (iv)”), which are erroneous. I am prepared to consider the application on the basis that the grounds relied upon are those stated in the Plaintiff’s affirmation filed together with the Originating Summons (“ Affirmation ”): that she was not given proper notice of the appointment of the arbitrator, and that the composition of the tribunal or the arbitral procedure was not in accordance with the parties’ agreement, ie under Article 34 (2)(a)(ii) and (iv) of the Model Law applied by section 81 of the Ordinance. 2. As neither the Originating Summons nor the Affirmation referred to any other ground set out in Article 34 of the Model Law, only the specified grounds of Article 34 (2)(a)(ii) and (iv) will be considered. The ground of public policy referred to by Counsel in the written submissions, under Article 34 (2)(b)(ii), or the Arbitration/Award being against natural justice, was never stated in the Originating Summons, as required under Order 73 rule 5 (4) RHC, and will not be entertained. 3. Under Article 34 (2) (a) of the Model Law, the party making the application to set aside must furnish proof of the existence of one or more of the grounds for setting aside. The burden is on the applicant, and the Court has the discretion whether to set aside the award if a ground is made out. Whether proper notice had been given 4. The ground set out in Article 34 (2) (a) (ii) is that the party seeking to set aside an arbitral award was “not given proper notice of the appointment of an arbitrator” or of the arbitral proceedings or was otherwise unable to present his case. The ground is not that the party “had never agreed with or approved of the appointment of the arbitrator”, as Counsel for the Plaintiff argued. If a party had been given proper notice of the appointment of a particular arbitrator, in the manner agreed under the arbitration agreement, such party has no ground to complain that he or she was not happy with or did not approve of the appointment of the particular arbitrator. 5. In this case, an HKIAC arbitration was commenced by the Defendant against the Plaintiff (“ Arbitration ”), the Notice of Arbitration (“ NOA ”) for which was served by the Defendant and dated 23 March 2018. 6. The Plaintiff has no ground to claim that she had never agreed to resolve the dispute between the Plaintiff and the Defendant by arbitration. In the written submissions filed for the Plaintiff, Counsel claimed that there was no provision in a loan agreement stating that the parties would resolve their dispute by arbitration. This totally ignores the fact that the claims made by the Defendant against the Plaintiff in the Arbitration were made pursuant to and under a Shareholders Agreement dated 13 November 2015 (“ Shareholders Agreement ”) made between the Plaintiff and the Defendant, and a Repayment Schedule Agreement dated 25 May 2017 (“ Repayment Agreement ”) made between the same parties, for sums invested by the Defendant pursuant to the Shareholders Agreement, and which the Plaintiff had agreed to return to the Defendant by way of installment payments, in accordance with a schedule set out in the Repayment Agreement. Both the Shareholders Agreement and the Repayment Agreement contain an arbitration clause, stating that the agreements shall be governed by Hong Kong law and that “any dispute or difference arising out of, or in connection with” the agreements shall (if not mediated) be referred to and determined by arbitration at HKIAC in accordance with its Domestic Arbitration Rules (“ Rules ”). Pursuant to the arbitration clause, the Plaintiff had clearly and plainly agreed to arbitrate the dispute in relation to the Defendant’s demands for the sum of $356,500 claimed to be outstanding under the Repayment Agreement, in accordance with the Rules and by reference to the HKIAC. 7. In essence, the Plaintiff alleges that the Award issued in the Arbitration is invalid, because she had never approved or confirmed the appointment of Mr To (“ Arbitrator ”) as the arbitrator in the Arbitration. She claimed that the fee asked for by the Arbitrator was unreasonably high and disproportionate to the sum in dispute, to which she had not agreed, and further, that she had informed the Arbitrator that she would not provide the deposit of $75,000 demanded of her and which the Arbitrator had asked for when he accepted his appointment by the HKIAC on 3 July 2018. The Plaintiff claimed that the Arbitrator had nevertheless, on the Defendant’s application, proceeded with the Arbitration and conducted a hearing on 4 March 2019, and thereafter issued the Award on 15 August 2019. 8. In the NOA served by the Defendant, the Defendant had provided details of the Plaintiff’s address at “Flat E, 15/F, Fullview Court, 32 Fortress Hill Road, Hong Kong” (“ Address ”). Incidentally, the Address was also stated as the Plaintiff’s address in the Repayment Agreement. 9. Article 1 of the Rules (of 1 November 2014) requires a party commencing an arbitration to send to the respondent a written notice requiring the respondent to appoint or concur in appointing the arbitrator, which shall include a proposal that either HKIAC appoints the arbitrator, or list up to 3 names from which the respondent may choose an arbitrator. At paragraph 21 of the NOA, the Defendant proposed that as the arbitration agreement between the parties did not specify the number of arbitrators, a sole arbitrator should be appointed by the HKIAC. 10. On 7 May 2018, the Defendant’s solicitors applied to the HKIAC for an arbitrator to be appointed for the Arbitration, and informed HKIAC on 16 May 2018 that the NOA had been sent by ordinary post and registered post to the Plaintiff, and that the letter sent by ordinary post had not been returned, whilst the letter sent by registered post was pending collection by the Plaintiff. The letter of 7 May 2018 was copied to the Plaintiff and sent by post to the Address. 11. On 21 May 2018, HKIAC wrote to both the Defendant’s solicitors and the Plaintiff (at the Address), to acknowledge the letters received from the Defendant’s solicitors. The HKIAC referred to Article 2.2 (c) of the Rules and ( inter alia ) invited the Plaintiff to submit any comments she may have on the Defendant’s proposal (made in the letter of 16 May 2018) for the appointment of a “less senior arbitrator”. 12. Not having received any comments from the Plaintiff in response, the HKIAC proceeded to appoint the Arbitrator, and notified the parties of this by letter of 15 June 2018, sent to the Defendant’s solicitors by email, and by courier to the Plaintiff at the Address. 13. HKIAC’s appointment of the Arbitrator was made in accordance with the Rules and section 23 of the Ordinance. 14. The Plaintiff has never claimed in the Affirmation filed in these proceedings that she had not received the NOA, or the letters sent by HKIAC or the Defendant’s solicitors to her at the Address. 15. On 3 July 2018, the Arbitrator emailed both the Defendant’s solicitors and the Plaintiff (via an email address of the Plaintiff at yahoo.com (“ Email Address ”) which had been provided by the Defendant’s solicitors, and which was known to them as the Plaintiff’s last known email address). The Arbitrator informed the parties that he agreed to act as the sole Arbitrator, and issued a set of directions for the provision of documents, including a direction that the parties should make an initial deposit with HKIAC for the Arbitrator’s fees, in the sum of $150,000 to be equally shared between the parties (“ Deposit ”). 16. Significantly, the Plaintiff then sent an email to the Arbitrator from her Email Address, on 5 September 2018. She attached a copy of her “response in defence”, with relevant attachments, for the Arbitrator’s reference. Clearly, the Plaintiff had notice at the very least of the Arbitrator’s emails to her. 17. Further correspondence ensued between the Plaintiff and the Arbitrator. 18. On 6 September 2018, the Arbitrator emailed the parties, and sought clarification from the Plaintiff as to whether the documents sent with the Plaintiff’s email of 5 September 2018 were intended as her Defence in the Arbitration, or were to be treated as submissions. In particular, the Arbitrator asked whether the Plaintiff was prepared to provide her share of the outstanding Deposit of $75,000. 19. The Plaintiff sent an email to the Arbitrator on 21 September 2018, in which she stated ( inter alia ): “1. My email on 5 September 2018 (including its attachment) does not intend to stand as a Defence to the whole proceedings nor as a submissions ( sic ) by my side to the other side’s application for an award against me. I will not participate in any of the said proceedings. My email served the purpose of submitting a supported recount of the case. 2. Consequently, I will not provide any deposit from ( sic ) the sum of $75,000 to the Hong Kong International Arbitration Centre.” 20. On the Defendant’s part, her solicitors asked the Arbitrator by their email of 21 September 2018 (copied to the Plaintiff at the Email Address) to give an award against the Plaintiff, stating that the Plaintiff had no intention to defend the Defendant’s claim in the Arbitration. 21. After 21 September 2018, as evident from the Arbitrator’s email to the Plaintiff of 28 September 2018, the Plaintiff asked for additional time to deal with the proceedings with the assistance of lawyers, and sought a period of 3 months before the Arbitrator should come to a final conclusion. The Arbitrator indicated in his email of 28 September 2018 to the parties that “subject to the parties’ submissions by the end of business on 3 October 2018”, the Arbitrator was minded to consider an order on the basis of the Plaintiff’s provision of her share of the Deposit within a short period of 7 days. 22. On 3 October 2018, the Arbitrator ordered that unless the Plaintiff should provide her share of the Deposit by 5 pm on 10 October 2018, she shall be debarred from adducing her Statement of Defence and other evidence for the Arbitration, and her application for additional time shall be dismissed with costs (“ Unless Order ”). The Arbitrator further stated in the Unless Order that he was minded to proceed with the Arbitration and to make an award notwithstanding the failure or refusal of the Plaintiff to comply with the Arbitrator’s directions of 3 July 2018. 23. No payment was made by the Plaintiff, nor was any further Defence or submissions filed by her. 24. The Arbitrator proceeded with the hearing of the Arbitration on 4 March 2019 as originally scheduled. The Plaintiff did not attend the hearing. The Arbitrator duly handed down the Award on 15 August 2019. He reminded himself in the Award that he had the duty to evaluate the evidence, and that the Plaintiff’s non-participation by her failure to file a Defence and failure to attend the hearing did not abrogate such duty, and was not to be treated as an admission of the Defendant’s case. The Arbitrator duly considered the claims made by the Defendant in the Arbitration and the evidence adduced, and found that he was not satisfied that the Plaintiff had made out any defence against the repayment obligations set out in the Repayment Agreement. The Arbitrator accordingly ordered the Plaintiff to pay to the Defendant the sum claimed of $356,500, with interest and costs. 25. From the letters sent by the HKIAC to the Plaintiff, and as evidenced by the emails exchanged between the Plaintiff and the Arbitrator in September 2018, it is clear that the Plaintiff had received notice from the HKIAC and from the Arbitrator himself that the Arbitrator had been appointed, pursuant to and under the provisions of the Rules which govern the Arbitration – and in accordance with what the parties had agreed in the arbitration clause contained in the Shareholders Agreement and the Repayment Agreement. The Plaintiff had the opportunity and did send to the Arbitrator her “recount of the case” made against her by the Defendant in the Arbitration. It was the Plaintiff’s own choice not to submit any statement of Defence, or submissions, in the Arbitration, after she had knowledge of the appointment of the Arbitrator. Her disagreement with the Arbitrator’s fees, and her refusal to pay same, cannot mean that she had not been given notice of the appointment of the Arbitrator. If she considered the fees to be unreasonable, there were avenues open to her to challenge same. That is a separate matter to the question of whether she had been “given proper notice of the appointment of an arbitrator or of the arbitration”. 26. I conclude that the Plaintiff has failed to furnish proof (as required under Article 34 (2) of the Model Law) that the Award should be set aside on the ground of Article 34 (2) (a) (ii) as contended. Whether the composition of the tribunal or the arbitral procedure was in accordance with the parties’ agreement 27. This ground was set out in the Affirmation as one relied upon for the setting aside application. However, the Affirmation only referred to the same matters as those dealt with above, namely, that she had not approved or confirmed the appointment of the Arbitrator, as she did not agree with the fee proposed by him, and had never indicated that she agreed to his appointment. 28. So far as the procedure for the appointment of the Arbitrator is concerned, I am satisfied on the evidence that the appointment was made pursuant to and in accordance with the Rules which were agreed by the parties to govern and to apply to the Arbitration of their dispute. The arbitration clause did not contain any procedure for the appointment of arbitrators, nor did it specify the number of arbitrators. The Defendant was entitled under the Rules to apply to the HKIAC to appoint a sole arbitrator, which the HKIAC accordingly did, and was entitled to do under the Rules and under section 23 of the Ordinance. There is no requirement for both parties to approve or consent to the candidate appointed by the HKIAC. 29. There is no claim made by the Plaintiff that the Arbitrator did not have power to proceed with the hearing of the Arbitration in her absence and in default of any statement of Defence having been filed by her. Nor is there any claim that but for the Unless Order, the Plaintiff would have been in a position to file a statement of Defence in the Arbitration. The Plaintiff has not adduced any evidence in these proceedings to show what defence she had, to the claims made against her for the sums she had covenanted to repay to the Defendant under the Repayment Agreement. I fail to see any prejudice that may have been suffered by the Plaintiff, even if there was any default in compliance with the Rules with regard to the process of appointment or the agreed procedure (which I have not found). 30. The Plaintiff has likewise failed to discharge her burden of furnishing proof that the composition of the arbitral tribunal or the arbitral procedure was not in accordance with the parties’ agreement. Whether application out of time and whether extension of time should be granted 31. I have dealt with the Plaintiff’s application for setting aside on the merits, and it is not necessary to decide further whether there is evidence that her application was made in time, and whether extension of time should be granted. The only explanation offered by the Plaintiff for the delay, from the time of the issue of the Award in 2019 to the date of the application made in June 2021, was that she had “overlooked” the Arbitrator’s email enclosing the Award, as she had not expected it. If the Court has the power to grant an extension of time to the Plaintiff to make the application, it can only do so in exceptional circumstances, and this Court sees no good reason to exercise the discretion in the Plaintiff’s favour, by virtue of the undue delay, and the absence of any good defence to the claims made against her in the Arbitration. Disposition 32. There is no merit whatsoever in the Plaintiff’s application. For all the reasons set out above, the application to set aside the Award is dismissed, with costs (including any costs reserved) to be paid by the Plaintiff, on indemnity basis, with Certificate for Counsel. The order nisi shall be made absolute unless application for variation is made within 14 days. (Mimmie Chan) Judge of the Court of First Instance High Court Ms Lau Chui Ling Wendy, instructed by Bill Tong & Co, for the plaintiff Ms Denise Souza, instructed by Yung, Yu, Yuen & Co, for the defendant Look up this case on Lawcite Noteup",
  "length": 17945,
  "headers_seen": [
    "Background",
    "Whether proper notice had been given",
    "Whether the composition of the tribunal or the arbitral procedure was in accordance with the parties’ agreement",
    "Whether application out of time and whether extension of time should be granted",
    "Disposition"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2022/1194",
  "query": "Model Law",
  "ts": "2025-10-16T10:53:25",
  "ok": true
}