{
  "title": "SK GLOBAL ASIA-PACIFIC PTE LTD. AND ANOTHER V. THE OWNERS AND/OR DEMISE CHARTERERS OF THE SHIP \"AL DHHABIYYAH\" AND OTHER | [1999] HKCFI 424 | HKLII",
  "court": null,
  "year": 1999,
  "date": null,
  "content": "HKLII Databases Court of First Instance [1999] HKCFI 424 SK GLOBAL ASIA-PACIFIC PTE LTD. AND ANOTHER V. THE OWNERS AND/OR DEMISE CHARTERERS OF THE SHIP \"AL DHHABIYYAH\" AND OTHER Judgment Information Date 27 Jun, 1999 Action No. HCAJ3/1999 Neutral Cit. [1999] HKCFI 424 Parallel Cit. [1999] 4 HKC 414 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCAJ3/1999 HCAJ000003/1999 XCHRX SK GLOBAL ASIA-PACIFIC PTE LTD. AND ANOTHER v. THE OWNERS AND/OR DEMISE CHARTERERS OF THE SHIP \"AL DHHABIYYAH\" AND OTHER HCAJ000003/1999 AJ Folio 3 of 1999 IN THE HIGH COURT OF THE HONG KONG SAR COURT OF FIRST INSTANCE ADMIRALTY JURISDICTION _________________________________ Admiralty Action in Rem against the Ship \"AL DHABIYYAH\" and other vessels referred to in Appendix 1 to the Writ BETWEEN SK GLOBAL ASIA-PACIFIC PTE LTD. (formerly SUNKYONG ASIA-PACIFIC PTE. LTD.) 1st Plaintiff SSANGYONG OIL REFINERY CO. LTD. 2nd Plaintiff AND THE OWNERS AND/OR DEMISE CHARTERERS OF THE SHIP \"AL DHHABIYYAH\" & OTHER VESSELS REFERRED TO IN APPENDIX 1 TO THE WRIT Defendant _________________________________ Coram: The Hon. Mr. Justice Waung in Chambers Date of Hearing: 2 and 23 June 1999 Date of Delivery of Judgment in Court: 28 June 1999 _________________________________ J U D G M E N T _________________________________ APPLICATIONS 1. There are before this Admiralty Court, an application by the Defendant requiring the Plaintiffs to file their Statement of Claim within 7 days and an application by the Plaintiffs for a temporary stay of proceedings pending the resolution of the jurisdiction dispute between the parties in Singapore. HISTORY LEADING TO APPLICATIONS 2. At all material times, the Defendant was owner of the vessel Al Dhabiyyah (\"Vessel\"). The Defendant issued a Bill of Lading dated 25th December 1997 (\"BL\") for carriage of a cargo of gas oil shipped on board the Vessel from Onsan, South Korea to Xiamen, China. The 2nd Plaintiff, a Korean company is the shipper under the BL. The 1st Plaintiff, a Singapore company is an associate of the 2nd Plaintiff, both Plaintiffs being part of the well known conglomerate Sun Kyung now renamed SK. The case of the Plaintiffs is that the two Plaintiffs are the owners of the cargo and/or holders and/or indorsees of the BL. It is not disputed that the Cargo was carried pursuant to a Charterparty between the Defendant and a Hong Kong company, South View Holdings Ltd. (\"South View\") which had subsequently been wound up. 3. Upon the Vessel arriving in Xiamen, the Cargo was unfortunately released by the Defendant without the production of the BL but against a letter of indemnity provided by South View. Therefore the Plaintiffs make the claim against the Defendant. Two in rem writs were issued in Singapore. The 1st in Rem Writ issued in Singapore was dated 10th November 1998 and was issued by the 2nd Plaintiff. The 2nd in Rem Writ issued in Singapore was dated 7th of January 1999 and was issued by the 1st Plaintiff and the 2nd Plaintiff. What happened is that on 14th December 1998 the ship \"Al Diyyinah\" was arrested (as a sister ship) in the 1st Singapore Action by the 2nd Plaintiff. Security was put up for the Defendant by West of England P & I Club. Then upon the issue of the 2nd Singapore Action, the Defendant acknowledged also the 2nd Singapore Writ and caused the security originally provided to be replaced by an amended security (\"Singapore Security\") which covers the claims of the Plaintiffs in both set of Singapore Actions. As a protective measure, the Plaintiffs issued the Hong Kong In Rem Writ dated 7th January 1999. The Hong Kong In Rem Writ was issued as a precaution because the Defendant was disputing jurisdiction in Singapore and had applied to set aside the arrest and the Singapore Security which dispute was still ongoing in Singarpore. 4. The Defendant applied to stay the Singapore Actions on the ground of arbitration clause for London arbitration and on the ground of forum non conveniens contending that Singapore is not the appropriate forum but Hong Kong is the appropriate forum. On 12th April 1999, the Singapore Court refused to stay the proceedings in favour of London arbitration and there is no appeal from that order. On 28th May 1999, the Assistant Registrar of the Singapore High Court ordered a stay on ground of forum non conveniens. Apparently as customary, no reason was given. An appeal to a Judge in Chambers had been lodged by the Plaintiffs and this appeal will be heard on 6th of July 1999. 5. In Hong Kong, the protective In Rem Writ although issued by the Plaintiffs on the 7th of January 1999 (1 day before the expiry of the one year time limit for the mis-delivery claim) was not served. On the 5th of May 1999, an Acknowledgement of Issue of Writ of Summons of Action in Rem (\"Voluntary Appearance\") was filed purportedly by the Defendants, the owners of the ship JANANA. 6. By Summons dated 20th of May 1999, the Defendant asks this Court for an order that the Plaintiffs be required to serve a Statement of Claim in this Hong Kong Action within 7 days. By Summons dated 24th May 1999, the Plaintiffs ask this Court for an order that all further proceedings in the Hong Kong Action be stayed pending the determination of the question of the jurisdiction of the Singapore Court in the two Singapore Actions. PLAINTIFFS' APPLICATION FOR TEMPORARY STAY 7. What is in dispute between the parties at the hearing is whether the Hong Kong proceedings should be given a temporary halt pending the determination by the Singapore Court of the stay application of the Defendant. If the Plaintiffs are allowed by the Singapore Court to proceed in Singapore, they wish to do so and discontinue the Hong Kong proceedings. The Defendant opposes a temporary halt in Hong Kong and says that it is entitled to insist upon the continuation of the Hong Kong proceedings even though this is an action in rem which has not been served by the Plaintiffs and in respect of which although the Defendant has entered voluntary appearance, the Defendant is unwilling to put up security for the Hong Kong proceeding and has refused to do so. The Defendant contends that the Court, even in the absence of Hong Kong security and in the face of opposition by the reluctant Plaintiffs in rem, should force the Plaintiffs to proceed by the service of the Statement of Claim within 7 days. 8. It is not in dispute that this Court has the jurisdiction and power to grant a stay of proceedings on the application of a plaintiff or of the defendant. Stay applications by the defendants in favour of another jurisdiction whether on the ground of an exclusive jurisdiction clause or on the ground of forum non conveniens are well known to everyone. What is unusual is a plaintiff asking for stay of proceedings which he himself has initiated. Mr. Dunlop for the Defendant does not dispute the jurisdiction of the Court to grant to the plaintiff stay of proceedings. The existence of the jurisdiction and the power is plainly to be seen in Section 16 (3) of the High Court Ordinance :- \"Nothing in this Ordinance shall affect the power of the Court of Appeal or the Court of First Instance to stay proceedings before it, where it thinks fit to do so, either on its own motion or on the application of any person, whether or not a party to the proceedings.\" 9. The exercise of this jurisdiction is not frequent but that is because only in unusual situations, would a plaintiff or for that matter the court invoke this power. But there are a number of cases where this power was used. In The Sylt [1991] 1 Lloyd's Rep. 240, Mr. Justice Sheen referred to the use of the power in the case of The Attorney General v Arthur Anderson Co. being an unreported judgment of 30th March 1988 of the English Court of Appeal. The transcript of the Arthur Anderson Judgment has been made available at my request and it is highly relevant. The facts of the Arthur Anderson case are very similar to the facts of our case. There the plaintiff who had a claim against the defendant accountants for negligence wished to pursue the claim in the New York action but the defendant sought a stay of the New York action, wanting to litigate in England under the English action, commenced by the plaintiff by means of a protective writ. There would be a determination in the near future by the New York Court as to whether the New York action could proceed or be stayed and the plaintiff asked the English Court to stay the English action pending the determination by the New York court of the question of jurisdiction of the New York proceedings. At first instance, Steyn, J. granted the stay and the English Court of Appeal dismissed the appeal. Lord Justice Mustill (as he then was) said that:- \"... the plaintiff wishes to leave the action in abeyance until he sees how things turn out elsewhere. It may or may not be fair that he should be allowed to do so, but the task of deciding where the justice lies is not to my mind furthered by asking whether the defendant is thereby vexed or abused, or by calling in aid decision such as Spiliada Maritime Corp. which were concerned with a very different problem.\" Then he went on to say later that:- \"The question for the learned judge, and for us also when reviewing his decision, is to my mind no more than this, whether the good management of the concurrent sets of proceedings clearly requires the English court, in charge of one set of those proceedings, to decree that a temporary halt should be called - temporary, because we must wait to discover what the American court is going to do.\" Finally he concluded by saying that as this is essentially the exercise of discretion by the learned judge of common sense management of a case in his list, the Court of Appeal saw no basis to interfere with the decision, specially when the Court of Appeal was clearly of the view that the judge was right. 10. In Deaville v Aeroflot Russian International Airlines [1997] 2 Lloyd's Rep. 67, Deputy Judge Brice, Q.C. also granted a temporary stay to the plaintiff. There the plaintiffs wished to pursue their French action but issued protective writ in England. The defendant Aeroflot disputed the French jurisdiction. The defendant applied to the English Court for anti-suit injunction and the plaintiff applied to the English Court for stay of its own English proceedings on two different basis, the first being made under the court's inherent jurisdiction and the second being pursuant to the European Judgment Convention. The English Court refused the anti-suit injunction but granted the stay of proceedings under its inherent jurisdiction on the ground that such an order was sensible pending the outcome of litigation in France on the jurisdictional questions and it made no sense to compel the plaintiffs to be put to additional expenses in pursuing English proceedings until the outcome of the French proceedings on jurisdiction was known. The learned judge rejected the defendant's argument that the plaintiffs were obliged to elect between French Action and English Action and said that the time for election had not yet arisen. 11. The Arthur Anderson and Aeroflot decisions are both in favour of a temporary stay pending the result of the foreign jurisdiction dispute, as there was no sense in forcing the local proceedings to continue when a favourable outcome in favour of the foreign proceedings (in Arthur Anderson's case New York, in Aeroflot case France and in our case, Singapore) would render it unnecessary to further continue with the local proceedings. In both cases, that was obviously the just and right thing to do and therefore in both cases, the English Court thought \"fit to\" so order the temporary stay pursuant to its inherent jurisdiction as confirmed by the English statutory equivalent of our Section 16(3). 12. The very simple question in our case is should I apply the same reasoning and decision as made in Arthur Anderson case and the Aeroflot case. I have no doubt that the answer is yes. I can put my yes answer on a number of basis:- 1. Because I think fit to do so, using the language of Section 16 (3) of the High Court Ordinance ; 2. Because as a matter of case management of my Admiralty List, I regard it as right that a temporary halt of this Hong Kong Action should be called pending the outcome of the Singapore jurisdictional dispute. In arriving at this decision, I take into account not only the balancing exercise between the Plaintiffs and the Defendant but also the wasted demand made on the Admiralty Court's time and resources to continue with this Hong Kong Action which very likely might be abandoned some months later. Modern case management considerations certainly call for my exercise of discretion in favour of the Plaintiffs; 3. Because it would be unjust not to do so, as the Plaintiffs would be exposed to the wastage of time and expense in the event that the Plaintiffs are successful in Singapore resulting in their not pursuing the Hong Kong Action whereas the only disadvantage to the Defendant by the order of temporary stay is that this High Court Action might be delayed by a few months, if it should later continue. There is further the possibility though disadvowed by Mr. Dunlop that the Defendant will use any refusal to stay or continuation of Hong Kong proceedings as part of its reason for seeking the Singapore stay. 13. In the particular circumstances of this case, I have little hesitation in exercising my discretion in favour of the stay sought by the Plaintiffs and this is without even taking into account, the fact that the continuation of this Hong Kong Action is pressed by the Defendant which had entered voluntary appearance in the Hong Kong Action but had refused to give any security for this Hong Kong Action in Rem and in circumstances when the Plaintiffs had issued the Writ in Rem as protective writ only and had not elected to pursue the Hong Kong Action and that normally under the Hong Kong Admiralty practice the Plaintiffs have the full one year during the currency of the Writ to elect to arrest a vessel of the Defendant or to seek the usual extension of the in Rem Writ on the ground that there had been no opportunity to arrest during the currency of the Writ. 14. Mr. Dunlop in a courteous and firm submission which is nevertheless wholly devoid of merit, argues that this Court is restricted from granting a temporary stay of proceedings. His arguments are difficult to understand at times because the case he advances is so extreme and unprecedented. I find all his objections without merit or substance and without undue discourtesy to him, I will only deal with some of his objections to the temporary stay:- (1) Mr. Dunlop argues that the exercise of the power of stay of proceedings is limited to only two situations of forum non conveniens or abuse of process. I disagree, firstly because it is contrary to the express words of Section 16(3) or the wide scope of inherent jurisdiction, secondly because it is contrary to the good authority of Arthur Anderson and Aeroflot decisions, thirdly because there is no authority in support and finally because it is against principle to limit the jurisdiction in such a narrow way; (2) It was argued by Mr. Dunlop that the jurisdiction of the court in admiralty action in rem is to determine the claim on the merits and reliance was placed on The Cap Bon [1967] 1 Lloyd's Rep. 543 and Anna H. [1995] 1 Lloyd's Rep. 1. What he argued is that as the Defendant has rightly invoked the jurisdiction of the Court to determine the claim on the merits, it is no function of the court to stop this exercise of the court's jurisdiction and function. What Mr. Dunlop has overlooked is that the primary function and object of the admiralty action in rem is to \"provide security for a plaintiff in respect of any judgment which he may obtain as result of the hearing and determination of the claim. This is the purpose of proceeding in rem.\" (page 547 of The Cap Bon ). The purpose of the proceeding in rem has not been realised here and in fact has been frustrated by the Defendant refusing to give security. I do not see how in these circumstances the Defendant can say that it is no function of the court to stop this action in rem; (3) Mr. Dunlop tried to distinguish this case from the Arthur Anderson case but none of his distinctions are valid. There are however two important distinctions with Arthur Anderson which he did not mention. The first is that we are discussing actions in rem and not in personam as in Arthur Anderson and the second distinction is that in the Hong Kong Action in rem which is sought to be stayed, the Plaintiff is without security which provides an essential reason why the Plaintiff ought not be compelled to continue with such action prior to the Singapore's determination on jurisdiction; (4) It was argued as a backup position that if I were minded to order a stay then the question is not to stay until 14 days after Singapore decided on jurisdiction question but to extend the time of Statement of Claim until 14 days after Singapore decided on jurisdiction. With respect, the sophistry of Mr. Dunlop is merely to confuse the two applications. The essential question for the Court at present is whether the Hong Kong Action must stop until Singapore has decided on its own jurisdiction and then one could see what the position is going to be. There is simply no scope for even discussing the question of extension of time for the Statement of Claim, which presupposes that the action is to proceed. I do not find Mr. Dunlop's submission helpful. 15. For reasons stated above, I therefore order that this Hong Kong Action be stayed until 14 days after the final determination by the Singapore Court of the question of jurisdiction of the Singapore Court over the two Singapore Actions. DEFENDANT'S APPLICATION FOR STATEMENT OF CLAIM 16. Having decided against the Defendant on the matter of the stay of proceedings, the question of the timing of the Statement of Claim does not arise. As indicated earlier, there is no question of the Court now extending time for the Statement of Claim to a certain period after the final determination of the Singapore jurisdiction dispute. The application of the Defendant compelling the filing of the Statement of Claim is therefore dismissed. VOLUNTARY APPEARANCE, LACK OF SECURITY IN ACTION IN REM AND CONCURRENT FOREIGN PROCEEDINGS 17. Having decided these applications for reasons stated above, it is strictly speaking not necessary for me to say anything further on the matter of voluntary appearance of the Defendant and its refusal to give security for this Admiralty Action in rem. But as what the Defendant is attempting to do in this case goes to the heart of the Admiralty jurisdiction in rem, it seems to me that this Court ought to give consideration to some of the matters raised by Mr. Dunlop in argument. 18. The essence and purpose of Admiralty jurisdiction in rem is the obtaining of security by the Plaintiff. I emphasis the words \"security\" and \"by the Plaintiff\". It is the statutory right of the Plaintiff in action in rem to obtain security and he has the option (and runs the risk) to choose the security he wishes to obtain and the timing of obtaining of such security, so long as it is within the period of the validity of the writ or its extended valid period if the writ is allowed to be renewed. If no vessel comes in at all, he will normally also be granted a renewal of the writ to enable him to obtain security during the extended period of the writ. It is not unknown for a Writ to be renewed many times due to the inability of the Plaintiff to obtain security and therefore serve the Writ in rem. The right to obtain security is that of the Plaintiff not of the Defendant. The Plaintiff's right is to invoke the jurisdiction in rem not a jurisdiction in personam as that gives him no security. While the Defendant might invoke the rules of the court to enable him to enter the voluntary appearance that does not in my view give him the right to demand the action to proceed in the absence of security, which is the foundation of action in rem. Of course if the Defendant gives full security for the action in rem then he can quite legitimately require the action in rem to proceed because the Plaintiff is being given everything that he is entitled to ask in an action in rem, namely security and service. But in a situation such as this which is the first and only instance I know where the extreme position is taken by Mr. Dunlop's client to say, I will not give you security for your action in rem but I demand that this action proceed to full trial, it seems to me that the Admiralty Action in rem is being turned on its head. Faced with this extreme position, disregarding the arrogance of the stand, the Admiralty Court will generally exercise its discretion to protect the Plaintiff and stay the Action until such time as when security can be obtained by the Plaintiff. If the Court does not stop the Action but allows it to proceed, then the Court is in fact forcing an action in personam on a Plaintiff which has only issued an action in rem and is only prepared to proceed with an action in rem, namely by obtaining security. It is to be appreciated that because of time bar, the Plaintiff cannot discontinue the Action in rem when faced with the unreasonable stand of the Defendant. An order of stay subject to the Plaintiff's right to obtain security is his only protection. 19. Admiralty Solicitors practising in this Admiralty Court are generally specialists who know their subject and who appreciate the unique nature of the Admiralty action in rem and its primary and unique purpose being that of obtaining security for the claim in rem. To my knowledge, no one whether in Hong Kong or in other mature jurisdiction has ever taken the extreme position taken by Holman Fenwick & Willan on behalf of the Defendant to challenge the very heart of the concept of Admiralty Action in rem. As I put it to Mr. Dunlop in the course of the argument, if he is right, then no plaintiff who has issued writ in rem is safe, for each action in rem can be compelled to proceed in the absence of security by a defendant who has entered voluntary appearance. As indicated earlier, I do not believe Mr. Dunlop is right. In my view his contention is untenable. 20. The lack of security is however not only relevant to the matter of stay of the action in rem in Hong Kong, it is also relevant to the question of whether a foreign court will grant a stay in favour of Hong Kong Action in rem without security. Different courts of course have their own laws on the matter of stay of proceedings on the ground of forum non conveniens. But if the foreign courts in the stay application on the ground of foreign non conveniens apply the Spiliada principle, then I believe that a lack of security in our court will generally be fatal to an application for stay, even if our court is held to be otherwise the natural forum. Therefore the lack of security in the Hong Kong action in rem will have a double effect which ought to induce the Hong Kong Admiralty Court in most cases to grant a stay of proceeding to the reluctant Plaintiff and to tell the aggressive Defendant that a voluntary appearance without security being put up will gain no favour with the Admiralty Court and in many situations will be more likely to be considered to be an abuse of process of the Court where the sanction orders of costs against solicitors personally are likely to be made. FINAL RESULT 21. The final result of the two applications is that this Action is stayed until 14 days after the final determination by the Singapore Court of the question of jurisdiction of the Singapore Court over the two Singapore Actions. The Defendant's Summons for Statement of Claim is dismissed. The Defendant is to pay the costs of the Plaintiff for both Summons immediately on a full indemnity basis if taxation is ordered, but which in the exercise of my discretion I now order to be assessed by this Court by way of a gross sum assessment under Order 62 Rule 9(4)(b). GROSS SUM ASSESSMENT 22. Having studied the documents relating to costs submitted by the Plaintiff and having considered the submissions made by the parties and in the special circumstances of this case, the Court determines that the Gross Sum Assessment of costs of two Summons for the Plaintiffs is to be in the total sum of $180,000, which sum is to be paid immediately by the Defendant to the Plaintiffs. William Waung Judge of the Court of First Instance, High Court Representation: Mr. James Thomson instructed by Messrs Sinclair Roche & Temperley for the Plaintiffs Mr. Henry Dunlop of Messrs Holman Fenwick & Willan for the Defendants Look up this case on Lawcite Noteup",
  "length": 24884,
  "headers_seen": [
    "APPLICATIONS",
    "HISTORY LEADING TO APPLICATIONS",
    "PLAINTIFFS' APPLICATION FOR TEMPORARY STAY",
    "DEFENDANT'S APPLICATION FOR STATEMENT OF CLAIM",
    "VOLUNTARY APPEARANCE, LACK OF SECURITY IN ACTION IN REM AND CONCURRENT FOREIGN PROCEEDINGS",
    "FINAL RESULT",
    "GROSS SUM ASSESSMENT"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/1999/424",
  "query": "stay of proceedings",
  "ts": "2025-10-14T11:23:16",
  "ok": true
}