{
  "title": "WING BO BUILDING CONSTRUCTION CO LTD V. DISCREET LTD | [2016] HKCFI 485 | HKLII",
  "court": null,
  "year": 2016,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2016] HKCFI 485 WING BO BUILDING CONSTRUCTION CO LTD V. DISCREET LTD Judgment Information Date 17 Mar, 2016 Action No. HCA146/2015 Neutral Cit. [2016] HKCFI 485 Parallel Cit. [2016] 2 HKLRD 779 [2017] 1 HKC 439 Download MS Word Judgment Reading Options Translation Toggle Highlight Appeal History HCA146/2015 HCA146A/2015 WING BO BUILDING CONSTRUCTION CO LTD v. DISCREET LTD HCA 146/2015 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE HIGH COURT ACTION NO 146 OF 2015 ________________________ BETWEEN WING BO BUILDING CONSTRUCTION COMPANY LIMITED Plaintiff and DISCREET LIMITED Defendant ________________________ Before : Deputy High Court Judge Marlene Ng in Chambers Date of Hearing : 14 March 2016 Date of Handing Down Decision : 18 March 2016 __________________ D E C I S I O N __________________ Introduction 1. The plaintiff was a building contractor, and the defendant was the registered owner of certain property in Tsuen Wan, New Territories (“ Property ”). By a Main Contract dated 1 September 2007 (“ Contract ”) made between the defendant as the employer and the plaintiff as the main contractor, the plaintiff agreed to undertake the construction of 13 houses for a lump sum fee in respect of the defendant’s redevelopment project at the Property. The Contract contained an arbitration clause that provided for the submission of any dispute/difference between the employer (ie the defendant) and the main contractor (ie the plaintiff) to arbitration (“ Clause 35 ”). 2. The plaintiff practically completed the works under the Contract, and on 23 April 2013 submitted a “Draft Update Final Account” (“ 23/4/13 Draft Account ”) that showed an outstanding sum of $5,234,329.93 (“ Outstanding Sum ”) due by the defendant. On 13 June 2013, the plaintiff revised the Outstanding Sum payable by the defendant to $4,517,407.55 (“ Revised Sum ”). After considering the 23/4/13 Draft Account, on 25 June 2013 the defendant informed the plaintiff that the assessed contract sum of $77,808,589.27 should be adjusted by 14 deduction items totalling $5,435,630.34 (“ Contra-charges ”). The plaintiff did not agree and insisted that the contract sum was $77,808,589.27. 3. Discussions between the parties led to the engagement of a quantity surveyor Mr Raymond Szeto (“ Szeto ”) pursuant to a written agreement dated 23 January 2014 to prepare/assess new rates for items of final measurement on internal/external finishes, and to consolidate/present an overall final account statement for the whole project incorporating final account values for all items of work (“ Agreement ”). Szeto rendered a report on 28 July 2014 and another report on 5 September 2014 (“ July 2014 and September 2014 Reports ”) whereby he arrived at the sum of $3,689,994.10 (“ Sum ”) based on review/assessment of 4 items of works and adoption of the 23/4/13 Draft Account values for other items without assessment of the Contra-charges. The defendant did not agree with the overall final account statement in the July 2014 and September 2014 Reports, but the plaintiff relied on the same to issue an invoice for the Sum. 4. The plaintiff commenced the present action to claim against the defendant for the Sum. The defendant responded by filing a summons on 23 March 2015 for an order to stay all further proceedings in the present action for arbitration (“ Summons ”). On 7 July 2015, Master Leong dismissed the Summons with costs (“ Leong Order ”). The defendant appealed to this court (“ Appeal ”). After hearing the Appeal on 1 December 2015, I handed down my Decision on 14 January 2016 (“ Reserved Decision ”) by granting an order that all further proceedings be stayed pursuant to section 20 of the Arbitration Ordinance Cap 609 (“ New A O ”) for arbitration with a costs order nisi (“ Order ”). The costs order nisi under the Order has since become absolute. 5. On 28 January 2016, the plaintiff filed a summons for leave to appeal against the Order (“ Leave Summons ”) with a draft Notice of Appeal (“ Draft Notice ”) annexed thereto. The hearing of the Leave Summons came before me on 14 March 2016 (“ Leave Hearing ”). Save for the abbreviations referred to above, I shall for convenience adopt the abbreviations in the Reserved Decision. Issues 6. Mr Houghton SC, counsel for the defendant, submitted that the Leave Summons is not competent as the Order is not subject to appeal under section 20(8) of the New AO. Section 20 of the New AO provides inter alia as follows: “(1) Article 8 of the UNCITRAL Model Law, the text of which is set out below has effect- ‘Article 8. Arbitration agreement and substantive claim before court (1)A court before which an action is brought in a matter which is the subject of an arbitration agreement shall, if a party so requests not later than when submitting his first statement on the substance of the dispute, refer the parties to arbitration unless it finds that the agreement is null and void, inoperative or incapable of being performed. (2) Where an action referred to in paragraph (1) of this article has been brought, arbitral proceedings may nevertheless be commenced or continued, and an award may be made, while the issue is pending before the court.’. …… (8) A decision of the court to refer the parties to arbitration under- (a) article 8 of the UNCITRAL Model Law, given effect to by subsection (1); or (b) subsection (2), is not subject to appeal. (9) The leave of the court making a decision to refuse to refer the parties to arbitration under- (a) article 8 of the UNCITRAL Model Law, given effect to by subsection (1); or (b) subsection (2), is required for any appeal from that decision. ……” 7. Mr Ho, counsel for the plaintiff, supported the application for leave to appeal on 3 broad grounds: (a) the Order was null and void for want of jurisdiction; (b) the provision in section 20(8) of the New AO that eliminates any appeal from the Order is unconstitutional; (c) the proposed grounds of appeal on the substantive issues have reasonable prospect of success. Mr Ho made his written submissions on the above 3 broad grounds in reverse order by way of his 2 nd supplemental, supplemental and original written submissions dated 12 March (Saturday), 11 March and 28 January 2016. Mr Ho’s 2 nd supplemental written submissions reached this court on the morning of the Leave Hearing. However, Mr Houghton SC was prepared to address the new arguments raised by Mr Ho. I should add Mr Ho also applied for leave to amend the Draft Notice to include an additional ground of appeal being (a) above by way of his 2 nd supplemental written submissions. 8. At the Leave Hearing, I expressed concern about hearing the unconstitutionality point without the benefit of submissions from the Secretary for Justice, and asked Mr Ho and Mr Houghton SC whether the hearing should be adjourned for the Secretary for Justice to consider whether to intervene. Mr Houghton SC submitted this case is essentially a monetary dispute between the parties and the Sum involved, whilst respectable, is not substantial, and any escalation of issues/costs will be burdensome on the parties. Both counsel urged this court to hear the matter at the Leave Hearing. In the end, I acceded to counsel’s request to hear the matter without adjournment for the Secretary for Justice to consider whether to intervene upon the undertaking by the plaintiff through Mr Ho that (a) should this court grant leave to appeal against the Order the plaintiff will pursue such appeal to the Court of Appeal (“ CA ”) and (b) the plaintiff will not object or otherwise preclude the defendant from seeking to uphold the constitutionality of section 20(8) of the New AO at such appeal and from contending that such appeal is incompetent. This will allow the CA to revisit the issue of unconstitutionality with (if the CA so directs and if the Secretary for Justice so desires) the benefit of evidence/submissions by the Secretary for Justice. Want of jurisdiction 9. Mr Ho argued that since section 20(9) of the New AO provides that leave is required for any appeal from “the court making a decision to refuse to refer the parties to arbitration”, and the defendant has not sought leave from Master Leong to appeal against the Leong Order to this court, the Appeal before this court is an “improperly constituted” and “incompetent” appeal, and hence the Reserved Decision and Order are null and void for want of jurisdiction. 10. Section 2(1) of the New AO defines the word “Court” as meaning “the Court of First Instance of the High Court”. Mr Ho argued that since such definition does not confine the meaning to a judge as opposed to a master exercising jurisdiction of the Court of First Instance (“ CFI ”), it is competent for Master Leong to hear the Summons, and hence the Leong Order falls within the ambit of “a decision of the court” under section 20(9) of the New AO. Mr Ho further submitted that although Mr Barlow SC (and Mr Ho with him), counsel for the plaintiff at the Appeal Hearing, agreed not to take issue with the procedural defects caused by the defendant’s failure to comply with Practice Direction 6.1, it is trite law that jurisdiction cannot be conferred by consent nor would the doctrine of “estoppel” confer jurisdiction when jurisdiction is otherwise absent. 11. Mr Ho relied on Champion Concord Ltd v Ltd v Lau Koon Foo (No 2) where the consent of the parties was sufficient to ground jurisdiction because section 34B (4)(c) of the High Court Ordinance Cap 4 (“ HCO ”) stipulates that the parties’ consent is to form the basis of the jurisdiction of the CA to hear the appeal by 2 instead of 3 justices of appeal. [1] However, Ribeiro PJ at p 855 said as follows: “54. I of course accept the general proposition that where a Court has no jurisdiction to deal with a particular matter, the parties cannot confer jurisdiction on it by consent, nor generally can the operation of an estoppel confer jurisdiction where none exists. ……” 12. Consequently, since no leave to appeal has been obtained from Master Leong (whether before or after this court rendered the Reserved Decision and Order) as mandated by section 20(9) of the New AO, Mr Ho submitted that the Appeal has been “improperly constituted” and “incompetent” as explained by Cheung JA in Hui Shu Leung v Wah Fung Forest Resources Limited & anor . [2] In that case, the plaintiff failed to seek leave to appeal under section 14AA of the HCO before the service of the notice of appeal from an interlocutory judgment by a judge of the CFI. It was held that the appeal was not properly constituted and was therefore incompetent since it was clear from the wording of section 14AA of the HCO that “no appeal lies to the [CA] …… unless leave to appeal has been granted”. Mr Ho submitted that the Appeal suffers from the same deficiencies since Master Leong has not granted leave to appeal under section 20(9) of the New AO. 13. In my view, the starting point is to consider the jurisdiction of the court in dealing with an application under section 20(1) of the New AO. There is to dispute that the “court” means the CFI. Section 4 of the HCO defines the CFI as follows: “(1) The [CFI] shall consist of – (a) the Chief Judge of the High Court; (b) such judges as the [Chief Executive] may appoint; (ba) such recorders as the [Chief Executive] may appoint; and (c) such deputy judges as the Chief Justice may appoint. (2) A Justice of Appeal may sit in the [CFI] and act as a judge thereof whenever the business of the [CFI] so requires, in which case he shall have all the jurisdiction, powers and privileges of such a judge.” 14. Section 38 of the HCO defines the jurisdiction, powers and duties of the Registrar as follows: “(1) The Registrar shall have and may exercise and perform- (a) the same jurisdiction, powers and duties as the Masters, Registrars and like officers of the Supreme Court of England and Wales; and (b) such other jurisdiction, powers and duties as may be conferred or imposed on him by or under rules of court or any other law . (2) Subject to rules of court, all the jurisdiction, powers and duties conferred or imposed on the Registrar may be had, exercised or performed by a Master.” (my emphasis) 15. Order 32 rule 11 of the Rules of the High Court (“ RHC ”) provides as follows in respect of the jurisdiction of the Registrar and masters: “(1) The Registrar and any master shall have power to transact all such business and exercise all such authority and jurisdiction as under any Ordinance or by these rules may be transacted and exercised by a judge in chambers except in respect of the following matters and proceedings, that is to say – …… (f) any other matter or proceeding which by any of these rules is required to be heard only by a judge . ……” (my emphasis) 16. It is therefore immediately apparent that the jurisdiction of a master is circumscribed by the “rules of the court” and by “any other law”, and the RHC debars a master from hearing any matter that is required by the RHC to be heard only by a judge. 17. Here, there is no dispute that the Summons is an application made under section 20(1) of the New AO. Order 73 of the RHC provides as follows: “1. Applications under Arbitration Ordinance Subject to the following rules of this Order, an application, request or appeal to the Court under the [New AO] must be made by originating summons in Form No.10 in Appendix A to a single judge in court. 2. Applications in pending actions An application, request or appeal to which rule 1 applies must, if an action is pending, be made by summons in the action. …… 6. Applications, requests and appeals to be heard in Construction and Arbitration List (1) An application, request or appeal which is required by rule 1 or 3 to be made to a judge must be entered in the Construction and Arbitration List unless the judge in charge of the list otherwise directs. (2) Nothing in paragraph (1) is to be construed as preventing the powers of the judge in charge of the Construction and Arbitration List from being exercised by any judge of the [CFI].” 18. This is also reflected in Practice Direction 6.1 which provides as follows: “B Construction and Arbitration List …… 3. The classes of action within the List include (but are not limited to) cases concerning the following: …… (4) applications relating to arbitration whether arising under the [New AO], [RHC], Order 73 or otherwise. 4. There shall be a Judge (“the Judge”) in charge of the [Construction and Arbitration List]. Other Judges (“designated Judges”) may also be designated to hear proceedings within the List from time to time. …… 7. The powers of the Judge shall, when necessary be exercisable by another Judge. …… 9. Interlocutory applications shall be returnable only before the Judge. 10. Any application (including application in an action outside the List) relating to an arbitration should normally be listed to be heard by the judge or a designated Judge.” 19. Order 73 of the RHC makes clear that an application under section 20(1) of the New AO to stay proceedings for referral to arbitration should be heard by a single judge of the CFI. In fact, it should be heard by the judge in charge of the Construction and Arbitration List (“ List ”) and/or “designated Judge” as referred to in Practice Direction 6.1, failing which any judge of the CFI can hear such application. In the circumstances, the exception in Order 32 rule 11(1)(f) of the RHC is applicable, and the masters have no jurisdiction “by or under rules of court” pursuant to section 38(1)(b) of the HCO. Further, there is no basis for saying the masters have jurisdiction under the New AO being “any other law” under section 38(1)(b) of the HCO by relying on the general jurisdiction of masters under section 38 of the HCO and Order 32 rule 11 of the RHC. In the circumstances, Master Leong has no jurisdiction to hear the Summons and/or to grant the Leong Order. 20. I pause to note that Mr Ho who appeared for the plaintiff before Master Leong did not raise any objection as to jurisdiction. Consequently, at the Master Hearing, Master Leong granted the Leong Order. The defendant lodged the Appeal which came before me at the Appeal Hearing. I also pause to note that Mr Barlow SC did not raise any objection as to jurisdiction. Even though Mr Ho argued at the Leave Hearing that the plaintiff’s failure to raise any complaint as to jurisdiction does not confer jurisdiction on this court to hear the Appeal, more did happen at the Appeal Hearing. 21. At the Appeal Hearing, I asked Mr Houghton SC and Mr Barlow SC to explain why (a) the Summons was heard before Master Leong and (b) the Appeal was fixed before this court rather than before a judge in the List. I referred counsel to Practice Direction 6.1 and also Rondabosh International Limited v China Ping An Insurance (Hong Kong) Company Limited [3] where Reyes J reminded practitioners that all applications relating to arbitration ought to be listed for hearing before a judge in the List in the first instance and not before the master. 22. Notwithstanding the airing of such concern, both senior counsel urged this court to hear the matter since (a) both sides had committed time and costs in bringing the Appeal before this court, and (b) the arguments adopted by both parties were by then more refined and narrowed. The latter point is significant because at the Appeal Hearing both senior counsel did not refer to the transcript of the Master Hearing in the hearing bundle and refrained from dealing with the factual issues raised in the affidavit evidence. Consequently, the Appeal is essentially a hearing de novo that rests on the revised arguments placed before this court by Mr Houghton SC and Mr Barlow SC rather than on the contentions urged and/or argued at the Master Hearing before Master Leong. Indeed, I have expressly noted in paragraph 35 of the Reserved Decision that I would not revisit the reasons/decision by the learned master. 23. There can be no doubt that this court has jurisdiction to hear an application under section 20(1) of the New AO. By virtue the de novo nature of the Appeal Hearing (ie this court has re-heard the Summons afresh), and in the particular circumstances of this case in which both senior counsel well knew the impropriety of having the Summons heard by Master Leong but nevertheless agreed to start afresh by not revisiting the reasons for decision by the learned master and by raising newly refined arguments before this court, it cannot be said that this court, which has been seized of the hearing of the Summons de novo , is “improperly constituted” or “incompetent” to deal with the matter. This is quite different from the authorities cited by Mr Ho which concern appeals to the CA or the Court of Final Appeal (“ CFA ”), which are not hearings de novo . 24. This leaves a final point of complaint by Mr Ho that it is incumbent upon Master Leong to grant leave to appeal against the Leong Order before this court’s jurisdiction is engaged under section 20(9) of the New AO. In my view, this argument is misconceived. First, the jurisdiction of masters is circumscribed “by or under rules of court”. But in respect of any appeal from a decision of a master, there is no jurisdiction under the RHC for a master to give or refuse leave to appeal. Under Order 58 rule 1 of the RHC, an appeal from a master to a judge in chambers is an appeal as of right (subject to time limits and other procedural requirements), and there is no provision giving jurisdiction to masters to grant or refuse leave to appeal. Secondly, the jurisdiction of masters is also circumscribed by “any other law”. However, as explained above, when section 20(9) of the New AO prescribes the requirement of “leave of the court making a decision to refuse to refer the parties to arbitration” for any appeal, the “court” in question is a judge of the CFI and such provision does not confer any jurisdiction on a master to grant or refuse leave to appeal. 25. The fact that the matter came to this court by way of the Appeal is at best a procedural irregularity which does not nullify the substantive nature of the hearing before this court at the Appeal Hearing, which is a hearing de novo of the Summons. Indeed, in this particular instance, the Appeal Hearing is in fact a true re-hearing since Mr Houghton SC and Mr Barlow SC have agreed to put aside the reasons for decision by the learned master and to raise fresh arguments for the rehearing before this court. In my view, there is no merit to this proposed ground of appeal, and I decline to grant leave for the plaintiff to amend the Draft Notice. Constitutionality 26. Mr Ho drew my attention to Butterworths Hong Kong Alternative Dispute Resolution Handbook where the annotation for section 20(8) of the New AO states as follows: [4] “[20.33] General Note – Paragraph (8) The decision made by the [CFI] in …… s 20(1) about the validity and nullity of an arbitration agreement…… shall be final and binding. This means the unsatisfied party is unable to appeal against the decision unless the court has granted a leave …… [20.34] General Note – Paragraph (9) If a party wishes to appeal against the decision made by the court in …… s 20(1) about the validity and nullity of an arbitration agreement ……, the party has to acquire a leave from the court.” (my emphasis) Given the plain wording of section 20(8) of the New AO which does not contain any proviso for appeal with leave of the court, it is unclear why the learned editors have suggested there is a regime under section 20(8) of the New AO for leave to appeal. In this respect, I note the 2 similar commentaries for sections 20(8) and 20(9) of the New AO both broadly refer to a decision by the CFI “about the validity and nullity of an arbitration agreement” without differentiating between a referral and a refusal to refer to arbitration. In any event, the learned editors have not cited any authority for their view on leave to appeal under section 20(8) of the New AO, which is not supported by the plain words of such provision. 27. It is, however, interesting to note that the volume on “Arbitration and ADR” in Hong Kong Civil Procedure 2016 treated the question of appeal under section 20(8) and section 20(9) of the New AO differently: [5] “Section 20(8) Section 20(8) provides that a decision of the court to stay proceedings and refer the parties to arbitration under art.8 of the UNCITRAL Model Law or s.20(2) of the [New AO] is not subject to appeal. Cf. the ability to appeal a decision refusing to refer parties to arbitration under s.20(9) of the [New AO]. Section 20(9) A court refusal to refer parties to arbitration under art.8 of the UNCITRAL Model Law or s.20(2) of the [New AO] may be appealed with leave of the court. Cf. the absence of an appeal in relation to decisions referring matters to arbitration in s.20(8) of the [New AO].” 28. This is supported by sections 13 and 14 of the HCO which deal with the jurisdiction of the CA: “13(1) The [CA] shall be a superior court of record. (2) The civil jurisdiction of the [CA] shall consist of- (a) appeals from any judgment or order of the [CFI] in any civil cause or matter; …… (c) any other jurisdiction conferred on it by any law. …… 14(1) Subject to subsection (3) and section 14AA, an appeal shall lie as of right to the [CA] and from every judgment or order of the [CFI] in any civil cause or matter. (3) No appeal shall lie- …… (c) from a judgment or order of the [CFI], where it is provided by any Ordinance or by rules of court that the same is to be final; …… (ea) except as provided by the [New AO], from any judgment or order of the [CFI]- …… (ii) under section 20(1) or (2) of that Ordinance refusing to refer the parties to arbitration; ……” The provision that “[a] decision of the court is …… not subject to appeal” in section 20(8) of the New AO is echoed by the provision that “a judgment or order …… is provided …… to be final” in section 14(3)(c) of the HCO, and the provision that “[the] leave of the court …… is required for any appeal ……” in section 20(9) of the New AO is echoed in the provision that “[no] appeal shall lie …… except as provided by the [New AO]” in section 14(3)(ea)(ii) of the HCO. In the circumstances, the wording of the New AO and HCO conspire to make a decision of the court (ie CFI) to refer the parties to arbitration absolute and not subject to appeal. 29. Mr Houghton SC drew my attention to So Wing Keung v Sing Tao & anor [6] which makes clear there is no inherent jurisdiction to hear appeals outside what is prescribed by statute. [7] Ma CJHC (as he then was) stated as follows: “31. In my view, this Court does not have the jurisdiction to hear the present appeal : (1)The jurisdiction of the [CA] to hear …… civil …… appeals is circumscribed by the provisions of s.13 HCO. There is no inherent jurisdiction to hear appeals outside of what is prescribed by statute. This is by no means a startling proposition. In George Tan Soon-gin v His Honour Judge Cameron & Another [1992] 1 HKLR 149 , Silke V-P said at p.177, ‘We are a creature of Statute and we are bound within the confines of the appropriate legislation’. In the same case in the Judicial Committee of the Privy Council, Lord Mustill, delivering the opinion of the Board, said at p.217A-B, ‘The [CA] in Hong Kong has both a civil and a criminal jurisdiction, each defined and limited by s.3 of the Supreme Court Ordinance [now the HCO]’. This reflects the position in England as well…… (2) …… It is necessary, however, to recognize the limits of the inherent jurisdiction when the jurisdiction of the court is defined by statute. Here, there is no room for a court to exercise any jurisdiction to hear a case when its jurisdiction has already been defined by statute. In other words, where a statutory provision delineates the jurisdiction of a court, that court cannot assume a jurisdiction that is outside the statutory scheme…… (3) …… Quite simply, whether or not the [CA] can hear an appeal from a lower court depends on the wording of the statute that defines its jurisdiction. As will presently be seen, it has unfortunate consequences in the present case where the Judge has, in my view, himself acted in excess of jurisdiction. ……” 30. Ma CJ in Mok Charles v Tam Wai Ho [8] also said it was “…… correct to point out that there is no inherent jurisdiction in any particular court to hear appeals; the appellate jurisdiction of any particular court is the creature of statute ……” Mr Houghton SC therefore argued that where the CA does not have the necessary jurisdiction (as in the case under section 20(8) of the New AO), jurisdiction cannot be assumed under the inherent jurisdiction outside the statutory regime. 31. But Mr Ho submitted such interpretation of section 20(8) of the New AO is anomalous. He referred to the commentaries by the learned editors in Butterworths Hong Kong Alternative Dispute Resolution Handbook to which I have expressed my reservations. He also reminded this court that the absolute prohibition against even seeking leave to appeal is not present in article 8 of the UNCITRAL Model Law on International Commercial Arbitration (“ Model Law ”) on which section 20 of the New AO is based, nor in the previous Arbitration Ordinance Cap 341 (“ Old AO ”), [9] and it apparently does not apply to the defendant had the court ruled against it in the first instance. 32. I am not persuaded the absence of a provision equivalent to section 20(8) of the New AO in article 8 of the Model Law will assist. The full text of the Model Law has been reproduced in Schedule 1 of the New AO (“ Schedule 1 ”), but the note in Schedule 1 states as follows: “Note: The full text of the [Model Law] is reproduced in this Schedule for information only. Provisions which are not applicable under [the New AO] are underlined. A note is added after each article to indicate the provision in [the New AO] which makes direct reference to that article. However, substituting provisions and other supplemental provisions to which the [Model Law] are subject have not been shown in this Schedule. Reference has to be made therefore to [the New AO] which determines the extent to which the [Model Law] applies.” Consequently, the full text of the Model Law has been reproduced in Schedule 1 of the New AO for information only, and those Model Law provisions having the force of law have been incorporated into the main body of the New AO with “other supplemental provisions” that also have the force of law as statutory provisions. Indeed, section 3 of the New AO provides that “[the] provisions of the [Model Law] that are expressly stated in [the New AO] as having effect have the force of law in Hong Kong subject to the modifications and supplements as expressly provided for in [the New AO] ” (my emphasis). Plainly, although the Model Law serves as underlying basis for the New AO, it is evident that each jurisdiction adopts the system most suited to itself. 33. Likewise, the absence of a similar provision as section 20(8) of the New AO in the Old AO also does not assist. On 10 November 2010, when the Legislative Council passed the New AO (which came into effect on 1 June 2011), it replaced the previous version that was originally enacted in 1963. The Old AO has been redrawn and a unitary regime with the Model Law governing both domestic and internal arbitrations has been created “to facilitate the fair and speedy resolution of disputes by arbitration without unnecessary expense”. [10] I am not persuaded the absence of a provision similar to section 20(8) of the New AO in the Old AO guides the interpretation of such provision under the New AO. 34. In my view, although section 20(9) of the New AO permits a defendant who is disappointed with the court’s decision to refuse to refer to arbitration to apply for leave to appeal, it does not inform the interpretation of section 20(8) of the New AO, which is obviously differently worded (ie “is not subject to appeal” under section 20(8) and “…… leave …… is required for any appeal ……” under section 20(9) of the New AO), save to demonstrate that section 20(8) of the New AO advocates an approach different to that of section 20(9). 35. In my view, it is plain that section 20(8) of the New AO envisages there will be no appeal from a decision by the CFI to refer the parties to arbitration, and in light of sections 13 and 14 of the HCO it precludes this court from considering an application for leave to appeal. 36. Mr Ho submitted that in such circumstances, section 20(8) of the New AO is unconstitutional as it disproportionately restricts the power of final adjudication conferred upon the CFA by article 82 of the Basic Law (“ Article 82 ”) which provides that: “The power of final adjudication of the Hong Kong Special Administrative Region shall be vested in the [CFA] of the Region, ……” Mr Ho suggested that the remedy is to read down section 20(8) of the New AO so that it does not detract from this court’s power to grant leave to appeal under Order 59 rule 2B(2) of the RHC. Mr Ho submitted that in any event, to avoid unconstitutionality, it is necessary to interpret section 20(8) of the New AO in such a way that will not deprive this court of the power to consider the plaintiff’s application for leave to appeal. 37. Mr Ho drew on the CFA’s guidance in Mok Charles , and the more recent discussion by the CA in the context of the New AO in China International Fund Ltd v Dennis Lau & Ng Chun Man Architects & Engineers (HK) Ltd . [11] Lam VP in China International Fund Ltd summarised the relevant principles as follows: [12] “9. The relevant principles for testing a finality provision were discussed by the [CFA] in Solicitor v Law Society of Hong Kong (2003) 6 HKCFAR 570 and Mok Charles Peter v Tam Wai Ho (2010) 13 HKCFAR 762 . For present purposes, it is sufficient to state the following propositions derived from those cases: (a) Article 82 vests the power of final adjudication in the [CFA] and it is constitutionally entrenched; (b) Since there is no constitutionally entrenched right of appeal to the [CFA], any consideration relating to art.82 should be examined by reference to that Court’s power of final adjudication and function; (c) By its very nature, subject to special statutory provisions, the final appellate power is exercisable upon appeal from an intermediate appellate court. Thus, other than cases where there is statutory provision for direct appeal to the [CFA], restriction of appeal to an intermediate appellate court would also restrict the exercise of the power of final adjudication; (d) The power of final adjudication requires regulation, which may include limitation, having regard to the power; (e) Any restriction on the power of final adjudication must satisfy the proportionality test as follows: (i) The restriction or limitation must pursue a legitimate aim; (ii) The restriction or limitation must also be rationally connected to that legitimate aim; and (iii) The restriction or limitation must also be no more than is necessary to accomplish that legitimate aim. (f) It is the duty of courts in the exercise of their independent judicial power to review any legislation which seeks to impose any limitation on the power of final adjudication by asking whether such limitation satisfies the proportionality test. And that assessment has to be conducted by examining all the circumstances; and (g) Art 82 is a provision that may have relevance to all levels of court or statutory tribunals in terms of the appellate process.” 38. Since section 20(8) of the New AO has the effect of eliminating appeals to the CA, which in turn eliminates appeals to the CFA, Article 82 is engaged and it must be examined against the proportionality test. 39. In my view, the starting point for applying the proportionality test to the restriction/limitation in section 20(8) of the New AO is to ascertain the purpose of such restriction/limitation. In Solicitor v Law Society of Hong Kong , Li CJ said: [13] “33. …… In ascertaining its purpose, matters such as the subject-matter of the dispute, whether it concerns fact or law, whether it relates to the substantive rights and obligations or only procedural matters, what is at stake, the need for speedy resolution and the cost implications of dispute resolution, including any possible appeals, will have to be considered. The legitimacy of any purpose will depend on whether it is consistent with the public interest, which of course has many facets, including the proper administration of justice. Then, in considering whether the limitation is reasonably proportionate to the legitimate purpose, it will be necessary to examine the nature and extent of the limitation. 34. Whether a particular limitation imposed by statute satisfies the proportionality test will depend on an examination of all the circumstances. ……” 40. It is useful to refer to China International Fund Ltd in which the CA held it does not have the power to entertain an appeal against the decision of the CFI in refusing to set aside an arbitration award when the judge refused to grant leave to appeal because section 81(4) of the New AO (which provision is compatible with Article 82) provides that such appeal can only be brought with the leave of the court (ie the CFI). [14] 41. In that case, in considering the proportionality test against the finality provision in section 81(4) of the New AO, it has been conceded that the 1 st 2 limbs of such test have been satisfied. Section 3 of the New AO provides that: “(1) The object of this Ordinance is to facilitate the fair and speedy resolution of disputes by arbitration without unnecessary expense. (2) This Ordinance is based on the principles- (a) that, subject to the observance of the safeguards that are necessary in the public interest, the parties to a dispute should be free to agree on how the dispute should be resolved; and (b) that the court should interfere in the arbitration of a dispute only as expressly provided for in this Ordinance.” Plainly, the legitimate aims include promoting speed, finality and reduction of costs in relation to arbitration, and parties’ autonomy in choosing their own dispute resolution process. In my view, the restriction/limitation in section 20(8) of the New AO is rationally connected to these legitimate aims. Mr Ho in his submissions also has not taken issue with the 1 st 2 limbs of the proportionality test. 42. Therefore, the true question is whether section 20(8) of the New AO is no more than necessary for achieving the aforesaid legitimate aims. Here, the plaintiff complains that the restriction/limitation in section 20(8) of the New AO is a disproportionate measure: (a) the Model Law, on which section 20 of the New AO is based, has no requirement that excludes the role of the CA; (b) the appeal procedure existed under the Old AO to allow intervention by the CA; (c) under section 20(9) of the New AO the court may grant leave to appeal should it refuse to refer the matter to arbitration, so there is no reason why the absolute prohibition against seeking of leave applies only against the plaintiff and not also the defendant. 43. Mr Ho reminded that China International Fund Ltd , a case in which the CA believes that the restriction/limitation in section 81(4) of the New AO is proportionate, is concerned with the question whether it is “a proportionate measure to curtail such further rounds of leave applications having regard to the legitimate aims of the [New AO] as discussed above”, [15] but, according to the defendant in the present case, the effect of section 20(8) of the New AO is to prohibit the plaintiff from even seeking leave to appeal from this court (as opposed to seeking leave from the CA after the CFI refuses leave). Mr Ho suggested that, on the defendant’s interpretation, there can be no “further” rounds of leave applications being sought by the plaintiff because the plaintiff is precluded from even seeking leave to appeal from this court (but on the other hand such right exists for the defendant had this court ruled against it and refused to refer the matter for arbitration). Mr Ho submitted it is reasonably arguable that the proportionality test has not been satisfied, and section 20(8) of the New AO is unconstitutional and should be read down to allow this court to entertain the plaintiff’s leave to appeal application. 44. I have already discussed the 2 points in paragraph 42(a)-(b) above, so I will turn directly to the heart of Mr Ho’s complaint, ie the restriction/limitation in section 20(8) of the New AO does not merely restrict an appeal; it actually eliminates it such that an appeal cannot be launched and is therefore disproportionate. 45. In dealing with this contention, it is necessary to examine the nature of the statutory provision in section 20(8) of the New AO against the legitimate aims that the relevant restriction/limitation seeks to address in light of the public interest. Hence, a balancing exercise may be involved. [16] 46. As seen in section 3 of the New AO, the object of the ordinance is to “facilitate the fair and speedy resolution of disputes by arbitration without unnecessary expense”, and the principles underlying such ordinance are that “subject to the observance of the safeguards that are necessary in the public interest, the parties to a dispute should be free to agree on how the dispute should be resolved” and “that the court should interfere in the arbitration of a dispute only as expressly provided for in [the New AO]”. Hence, the new AO “minimizes the possibility of judicial intervention so as to reduce costs and allow for court resources to be allocated to matters other than arbitration. Meanwhile, the judicial intervention permitted by the [New AO] is predominantly in relation to matters that support the arbitral process, such as enforcement, collection of evidence and lending greater weight to the directions of the arbitral tribunal: see section 13”. [17] 47. Hence, there is force in Mr Houghton SC’s submissions regarding the desirability of a speedy determination of a referral for arbitration. Further, although the nature of the restriction/limitation in section 20(8) of the New AO is absolute, in my view it is not final, and the juxtaposition between the appellate procedure under section 20(9) of the New AO and the absence of such procedure under section 20(8) can be rationalised. 48. Such rationalisation stems from the legal principles in respect of the exercise of the court’s jurisdiction to grant a stay of proceedings for arbitration set out in Part III of the Reserved Decision. As Mr Houghton SC submitted, it is necessary only to establish a prima facie or plainly arguable case that the parties are bound by an arbitration clause, and if the evidence is cogent and arguable and not dubious or fanciful, then the test has been satisfied. Thus, unless the point is clear, the court should not attempt to resolve the issue and the matter should be stayed for arbitration as it is for the arbitral tribunal to rule on its own jurisdiction, including any objections with respect to the existence or validity of the arbitration agreement. 49. If the arbitral tribunal seizes jurisdiction in respect of the dispute, an aggrieved party can apply to the court to challenge the arbitral tribunal’s jurisdiction under section 34 of the New AO and Order 73 of the RHC. The mode of application to the judge in charge of the List under Order 73 rule 6 of the RHC depends on the manner in which the arbitral tribunal’s ruling as to jurisdiction was made and the remedy sought: “(1) Where the tribunal gave a ruling on a preliminary question as to jurisdiction but without making an award, an application is made to the judge, sitting in chambers, by summons: see RHC Order 73 Rules 3 and 4; s 45(2) in respect of interlocutory application under [the New AO] …… (2) Where the tribunal gave its ruling in the form of an award, whether interim or final, application may be made to the judge, sitting in open court (subject to s 16 above; see preamble to RHC Order 73 Rule 5(1)), by originating motion for either of the following remedies: (a) a declaration that the award is not binding on the applicant for want of jurisdiction: See RHC Order 73 Rule 5(2); Practice Direction 6.1: Construction and Arbitration List (2 April 2009); or (b) to set aside the award under Part 9 s 81(2)(a)(i), 81(2)(a)(iii), or 81(2)(b)(i) below: see RHC Order 73 Rule 5(1) and the Practice Direction 6.1: Construction and Arbitration List (2 April 2009).” [18] 50. The above embodies the Komptenz-Komptenz (Competence- Competence) principle invariably found in international commercial arbitrations, which dictates that an arbitral tribunal is deemed to be competent to rule on the matter of its own jurisdiction. 51. However, section 34(4) of the New AO provides that a ruling by the arbitral tribunal that it does not have jurisdiction to decide a dispute is not subject to appeal, and section 34(5) of the New AO provides that notwithstanding section 20 of the New AO, if the arbitral tribunal rules that it does not have jurisdiction to decide a dispute, the court must, if it has jurisdiction, decide that dispute. 52. The statutory provision against an appeal from a negative ruling on jurisdiction stems from the rationale that it is not desirable to depart from the Model Law as there should be finality in arbitration, and it is inappropriate to force an arbitral tribunal to conduct arbitration after a negative jurisdictional ruling. 53. Thus, given that this court has granted the Order to refer the dispute between the parties to arbitration, the plaintiff can seek to persuade the eventual arbitral tribunal that it has no jurisdiction to deal with the matter. Should the arbitral tribunal rule against the plaintiff’s contention and seizes jurisdiction over the matter, the plaintiff can still apply to the court to challenge the arbitral tribunal’s jurisdiction. Should the arbitral tribunal rule otherwise in favour of the plaintiff’s contention, it is the defendant who will be debarred from raising any appeal against such decision, and despite the Order the court will have to decide the dispute. 54. When so analysed, it is plain that whilst the court’s decision to refer the parties to arbitration under “article 8 of the [Model Law], given effect to by subsection (1)” is not subject to appeal, such decision is not final, and there is avenue to challenge such decision (which is made on prima facie premise) before the arbitral tribunal and (in the event of an adverse ruling against the party opposing the stay of proceedings) to return to the court for challenge against the arbitral tribunal’s jurisdiction. 55. Mr Ho alluded to the discussion in China International Fund Ltd on the CA’s residual discretion to supervise the process in the CFI upon refusal of leave to appeal by a judge of the CFI so that the CA will decide whether or not to set aside the original decision to refuse leave, and if it is set aside, the intended appellant can then reapply to the CFI for leave to appeal. However, I am unable to discern the relevance of such residual discretion in the present context when section 20(8) of the New AO bars any appeal against a referral to arbitration instead of limiting appeal with leave of the court (ie the CFI). 56. Proportionality should be considered against the overall scheme of the New AO, and ultimately it is a matter of the implementation of a policy to promote the use of arbitration, to facilitate the fair and speedy resolution of disputes by arbitration without unnecessary expense, and to promote Hong Kong as an arbitration friendly jurisdiction. In my view, the present scheme under the New AO, which includes section 20(8), is within the range of reasonable options which the legislature can adopt to achieve the legitimate aims of the New AO as discussed above, and hence this court should accord the appropriate margin of appreciation to the measure adopted in section 20(8) in the New AO passed by the Legislative Council. I therefore reject the defendant’s challenge against the constitutionality of section 20(8) of the New AO. I also conclude that the Order is not subject to appeal under section 20(8) of the New AO, and hence there is no basis to entertain the Leave Summons for leave to appeal against the Order. Leave Summons 57. This is sufficient to dispose of the Leave Summons. But in deference to Mr Ho’s arguments on the substantive merits of the Leave Summons, I shall consider the same briefly on the assumed premise that (a) there is jurisdiction for the CA to entertain a potential appeal from the Order, and (b) the usual principles for leave to appeal against an interlocutory order as explained in the paragraph below are applicable. 58. Under section 14AA(4) of the HCO, leave to appeal shall not be granted unless the court is satisfied that the appeal has a reasonable prospect of success or there is some other reason in the interests of justice why the appeal should be heard. In SMSE v KL , [19] Le Pichon JA pointed out that such leave to appeal is not lightly granted. Reasonable prospect of success involves the notion that the prospect of succeeding must be “reasonable” and therefore more than “fanciful”, without having to be “probable”. [20] Furthermore, it is pertinent to bear in mind that even if there is a reasonable prospect of success on appeal, the court still retains a discretion whether to grant leave to appeal, although the fact that there is, ex hypothesi , a reasonable prospect of success would heavily influence the court’s exercise of discretion. [21] 59. In the Draft Notice, the plaintiff relied on 6 draft grounds of appeal. For the present purpose, they can be condensed into 3 broad heads, which I summarise as follows: (a) Settlement agreement – the plaintiff claims that I (i) have mis-exercised my discretion as a result of my misunderstanding of its case that does not rest on the Contract (with Clause 35) but on the parties’ separate settlement agreement whereby the parties have varied the Contract so as to record their agreement to compromise their dispute over the final account by jointly appointing Szeto to determine and conclusively state the final account, (ii) have erred in law in failing to uphold the defendant’s admission that the settlement agreement is intended to provide a final and binding result on the assessment of the final account, (iii) have failed to recognise that the arbitration agreement is inoperative by virtue of the separate settlement agreement, and (iv) have failed to recognise that the separate settlement agreement deems Szeto’s final account to be the final and conclusive statement of the parties’ final account so that thereafter there is nothing left to arbitrate; (b) Expert determination – the plaintiff claims that I have erred in law in failing to apply established principles concerning dispute resolution by expert determination being a distinct form of alternative dispute resolution outside the New AO that is final and binding between the parties so long as the determination has been made by the expert in good faith; (c) Summary determination – the plaintiff claims that I have erred in principle in failing to rule that the defendant’s contention that no cause of action arose upon the separate settlement agreement can be summarily determined within the present action either upon a summary judgment application or upon a strike out application. 60. Even though the plaintiff has set out 6 draft grounds of appeal (which for convenience I have condensed to the 3 broad heads in paragraph 59 above), they are all premised on the fundamental proposition set out in paragraphs 61-62 below. [22] 61. The parties are in disagreement over the final account. It is the plaintiff’s case that the parties have entered into a separate settlement agreement with no arbitration clause, and once Szeto by his expert determination has produced the final account by way of the July 2014 and September 2014 Reports pursuant to such separate settlement agreement, such final account has become conclusive and binding on the parties so there is nothing left to arbitrate and the parties can no longer resort to Clause 35 of the Contract which has been superseded by the separate settlement agreement. Consequently, it is said the plaintiff has properly pursued its claim for the Sum under the final and binding final account assessed/ presented by Szeto. 62. Mr Ho submitted that since the plaintiff has framed its case on the premise of the separate settlement agreement without reference to the Contract (and the defendant has not taken out any application to strike out the claim), the court must determine the stay application on the plaintiff’s pleaded case, and it is wrong for this court to gauge whether the stay application should be granted upon the premise that the plaintiff’s cause of action arises from the Contract by holding that a dispute relating to the final account rendered by Szeto is covered by Clause 35. Had the court correctly appreciated the nature of the plaintiff’s claim, it cannot be said Clause 35 has been incorporated in the separate settlement agreement which makes no reference to the Contract or Clause 35. 63. The defendant disagrees and suggests that a commercially purposive reading of the terms of the Agreement shows that the so-called final account by Szeto is not intended to be and is in fact not final and binding between the parties, and hence there is no overall settlement as such. It is said that the Agreement draws a clear distinction between independent expert review/assessment of specific items of works (which is arguably final and binding) and consolidation/presentation of overall final statement by drawing on non-assessed plaintiff’s information (which is not final and binding) with the result that the dispute over the final account under the Contract remains outstanding, and which therefore attracts the operation of Clause 35. 64. On the analysis set out in paragraphs 75-80 of the Reserved Decision (which is there for all to see and which I shall not repeat), I have found the defendant’s contentions to be prima facie arguable on the wording of the Agreement and Clause 35 such that the so-called separate settlement agreement does not render the final account by Szeto to be final and binding at least insofar as the items that have not been independently reviewed and assessed, and the inevitable outcome of such conclusion is that there is prima facie an arbitrable dispute over the final account under the Contract within Clause 35. Given the threshold of prima facie arguability of the existence of an operative arbitration agreement and the rigorous attitude of the courts in the application of the provision requiring mandatory stay other than exceptional circumstances, I am not persuaded there is reasonable prospect of success in the draft grounds of appeal. 65. So even if the CA has jurisdiction to hear the intended appeal (which I have found it does not), still I would have dismissed the Leave Summons. Conclusion 66. In the circumstances, the Leave Summons is dismissed. 67. There is no reason why costs should not follow event. Mr Ho and Mr Houghton SC agreed that if I should dismiss the Leave Summons, costs thereof should be awarded against the plaintiff in favour of the defendant on indemnity basis to be taxed if not agreed, and I so order. 68. Given that I have upheld the constitutionality of section 20(8) of the New AO and also dismissed the Leave Summons, the plaintiff’s undertaking through counsel to pursue any appeal against the Order is spent and is no longer applicable. (Marlene Ng) Deputy High Court Judge Mr Martin Ho, instructed by Dundons, for the plaintiff Mr Anthony Houghton SC, instructed by Huen & Partners, for the defendant [1] (2011) 14 HKCFAR 837 , 848 and 855-856 [2] CACV134/2013 (unreported, 29 January 2014) [3] HCA581/2009, Reyes J (unreported, 29 December 2009) [4] 2 nd ed (2014) at paras [20.33]-[20.34] at p 111 [5] see para U1/20/22-23 at p 39 [6] [2005] 2 HKLRD 11 [7] see Hong Kong Civil Procedure 2016 Vol 2 para E1/13/1 at pp 145-146 [8] (2013) 13 HKCFAR 762 , 782 [9] see New Sound Industries Ltd v Meliga (HK) Ltd [2005] 1 HKC 41 [10] see section 3(1) of the New AO [11] [2015] 4 HKLRD 609 (note that on 18 December 2015 the CA declined to grant leave for the plaintiff to appeal to the CFA) [12] at p 614 [13] [2004] 1 HKLRD 214 , 226-227 [14] see also 廣東長虹電子有限公司 v Inspur Electronics (HK) Limited HCMP434/2015 (unreported, 30 March 2015) in which the CA held that in light of section 84(3) of the New AO which is applicable to a Mainland arbitral award by reason of section 92(1)(b) of the New AO, and reading it together with section 14(3)(ea)(v) of the HCO it was clear there cannot be any appeal from the CFI judge’s decision that refused leave to appeal [15] at p 622 [16] see Charles Mok at p 786 [17] see The Annotated Ordinances of Hong Kong: Arbitration Ordinance ( Cap 609 ) (2014 reissue) pp 5-6 [18] see The Annotated Ordinances of Hong Kong: Arbitration Ordinance ( Cap 609 ) (2014 reissue) p173 [19] [2009] 4 HKLRD 125 [20] at p 129 [21] see Ho Yuen Ki Winnie & Anor v Ho Hung Sun Stanley & anor HCA391/2006, A Cheung J (as he then was) (unreported, 25 May 2009) para 3, and HCMP1009/2009 (unreported, 24 August 2009) para 22 [22] see also paragraphs 65-73 of the Reserved Decision Look up this case on Lawcite Noteup",
  "length": 55704,
  "headers_seen": [
    "Introduction",
    "Issues",
    "Want of jurisdiction",
    "Constitutionality",
    "Leave Summons",
    "Conclusion"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2016/485",
  "query": "kompetenz-kompetenz",
  "ts": "2025-10-16T10:51:31",
  "ok": true
}