{
  "title": "EVER JUDGER HOLDING CO LTD V. KROMAN CELIK SANAYII ANONIM SIRKETI | [2015] HKCFI 602 | HKLII",
  "court": null,
  "year": 2015,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2015] HKCFI 602 EVER JUDGER HOLDING CO LTD V. KROMAN CELIK SANAYII ANONIM SIRKETI Judgment Information Date 16 Apr, 2015 Action No. HCCT6/2015 Neutral Cit. [2015] HKCFI 602 Parallel Cit. [2015] 2 HKLRD 866 [2015] 3 HKC 246 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCCT6/2015 HCCT6/2015 EVER JUDGER HOLDING CO LTD v. KROMAN CELIK SANAYII ANONIM SIRKETI HCCT 6/2015 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO 6 OF 2015 ____________ BETWEEN EVER JUDGER HOLDING COMPANY LIMITED Plaintiff and KROMAN CELIK SANAYII ANONIM SIRKETI Defendant (KROMAN ÇELIK SANAYII ANONIM Ş IRKETI) ____________ Before: Hon G Lam J in Chambers Date of Hearing: 20 March 2015 Date of Judgment: 17 April 2015 ______________ J U D G M E N T ______________ I. INTRODUCTION 1. The plaintiff is a company incorporated in the British Virgin Islands and the registered owner a Panamax bulk carrier named “MV EVER JUDGER” which is registered in Panama. I shall refer to the vessel as “the ship” and to the plaintiff as “the shipowners”. The defendant, which is a company incorporated in Turkey, is one of the largest producers and traders of semi-finished and finished iron and steel products in the Gebze Osmangazi region of Turkey and the buyers of a cargo of steel wire rods which was eventually carried on board the ship from Mainland China to Turkey. I shall refer to the defendant as “the buyers”. A group company of the buyers is the operator of the Turkish port of discharge in this case. 2. A dispute has arisen relating to the condition of the cargo found upon discharge. The buyers have brought proceedings in a court in Turkey whereas the shipowners have, relying on an arbitration clause incorporated into the bills of lading, served a notice of arbitration in Hong Kong. The shipowners now apply to this court for an interim anti-suit injunction to restrain further conduct of the proceedings in Turkey on the basis of the Hong Kong arbitration clause in the contract of carriage. The principal issues are whether the plaintiff has come to court with clean hands and whether there are strong reasons not to grant an injunction notwithstanding the arbitration clause. II. FACTUAL CONTEXT The sale and purchase of goods 3. In September 2014, the Turkish buyers, through an intermediary Swiss trading house called MT Metals and Minerals Trading AG (“MTI”), decided to acquire 30,500MT of prime hot rolled steel wire rods from a Chinese company, Jiangsu Shagang International Trade Co Ltd (“Jiangsu Shagang”), which was China’s largest private steel mill. The buyers had not traded with Jiangsu Shagang before. 4. A sales contract for this transaction was entered into by the buyers with MTI as sellers on 16 September. Under that contract, payment was to be made by the buyers by irrevocable confirmed letter of credit in favour of MTI for 100% of the price against presentation of, inter alia , a full set of “3/3 original clean on board ocean bills of lading”. The contract also stipulated: “B/L with remarks such as ‘atmospherically rusty’ and/or ‘wet before loading’ and/or ‘wet during loading’ and/or ‘stored in open area’ and/or ‘some straps or binding rods broken’ and/or similar acceptable” The contract is governed by Swiss law and stipulates that any disputes which the parties fail to resolve amicably shall be referred to and finally resolved by arbitration in Geneva, Switzerland. At around the same time, MTI entered into a back-to-back contract with Xinsha International Pte Ltd, a regular business partner of Jiangsu Shagang, for the sale and purchase of the steel wire rods for on-sale to the buyers. 5. At around the same time, Yucel Boru ve Profil Endustrisi A.S. rihtim Cd (“Yucel”), another Turkish producer and trader of steel products which was apparently related to the buyers, also sourced a cargo of steel coils from Jiangsu Shagang. The carriage of goods 6. During the negotiations, the buyers were told by Jiangsu Shagang that the cargo would be shipped on board a vessel owned by one of its group companies. On 5 October 2014, upon being provided by Jiangsu Shagang with the particulars of the ship, the buyers confirmed that the ship was of the quality to berth to Kroman Port. 7. By a voyage charterparty dated 6 October 2014, the shipowners chartered the ship to Everest Shipping Pte Ltd for a single voyage to carry a cargo of 15,000MT hot rolled coiled steel and 30,500MT wire rods +/–5% MOLCO [1] from Zhangjiagang Haili Port, People’s Republic of China, to Kroman Port, Tavsancil, Turkey. Clause 18 of the charterparty provides as follows: “This contract shall be governed by English law and constructed [sic] in accordance with English law and any dispute arising out of or in connection with this contract shall be referred to arbitration in Hong Kong in accordance with Hong Kong Arbitration Ordinance .” On the same date, the ship was sub-chartered to Shagang Marine Co Ltd and sub-sub-chartered to Xin Sha International Pte Ltd for the voyage on a back-to-back basis. These charterparties also contain a choice of English law and a Hong Kong arbitration clause. 8. Loading of the cargo commenced at Zhangjiagang Haili Port on 17 October and was completed on 25 October. On the same date, a total of four bills of lading were issued for the carriage of the cargo specified in the charterparties. 9. One of the four bills was for the carriage of 15,145.01MT (being 604 coils) of “prime hot rolled steel coils” from Zhangjiagang Haili Port to Tavsancil Port. The shipper was Jiangsu Shagang, the consignee was to the order of a Swiss bank and the notify party was Yucel. The other three bills were for the carriage of 14,938.20MT (6326 coils), 15,756.419MT (6724 coils) and 189.442MT (83 coils) (totalling 30,884.061MT) “prime hot rolled steel wire rod in coils” from Zhangjiagang Haili Port to Kroman Port. The shipper was the same but the consignee was to the order of Banque de Commerce et de Placements S.A. and the notify party was the buyers (the defendant). In short, the buyers were the notify party in the three bills relating to 30,884.061MT of wire rods and Yucel was the notify party in the one bill relating to 15,145.01MT of steel coils. Where appropriate I shall refer to the buyers and Yucel together as “the receivers”. 10. The bills of lading were prepared in the CONGENBILL (1994 edition) format, being a standard form of bill of lading to be used with charterparties. On the reverse side of the bills, clause 1 of the “Conditions of Carriage” provides: “All terms and conditions, liberties and exceptions of the Charter Party, dated as overleaf, including the law and Arbitration Clause, are herewith incorporated.” On the front side of the bills, it is stated: “Freight payable as per CHARTER-PARTY dated 2014-10-6” 11. The bills of lading relating to the goods sold to the buyers were presented by Jiangsu Shagang or MTI to the bank for payment under the buyers’ letter of credit. On about 18 November, after payment had been cleared by the bank, the three bills of lading were endorsed to the buyers. The discharge of the cargo 12. On 21 November, the ship arrived at Kroman Port, Turkey. The buyers allege that as the cargo was being discharged, the attending surveyor from the survey company SGS noticed that a large proportion of the cargo was either severely rusted, deformed, dented or otherwise damaged, that the cargo in the holds were not properly lashed and that the dunnage boards were not thick enough and the cargo was stacked too high, damaging the coils stowed on the bottom stack. 13. On 26 November, the buyers issued a letter of protest to the Master of the ship stating the surveyor had found “approx. 2,500 pcs WRC cargo have been damaged, deformed and most of the cargo have been rusty, due to improper stowage. Also remaining cargo still on board in same condition.” The Master signed on the letter to state: “Only Rcvd it, Cargo deformed/damaged condition unknown to Master”. 14. Meanwhile, on 24 November, the Master had issued a letter of protest stating that he was told by the receivers’ representative not to stop discharging in case of small rain. On 28 November, the Master issued a further letter of protest against the stevedores’ “rough and improper” discharge operations, using crane wire slantingways to pull the coils resulting in some coils being damaged. There is now no dispute that in fact some damage was done during unloading. In early December, the Master also protested that the receivers had intentionally delayed the discharge operation since 27 November. The arrest of the ship 15. The buyers’ first application for the arrest of the ship was made on 3 December to Gebze 1 st Civil Court of First Instance in Turkey but was refused by that court on 4 December. On 9 December, the renewed application of the buyers was granted by the Gebze 5 th Civil Court of First Instance in Turkey (file no. 2014/88 D.). The ship was arrested on 10 December. 16. On 16 December, the Gebze Execution (Civil) Court in Turkey ordered that the ship post security in the sum of approximately US$3.1 million plus 20% in order for the ship to be released. Eventually the ship was released and sailed from Kroman Port on 19 December upon payment of TRY8.7 million into Gebze 2 nd Bailiff’s Office in accordance with the court order for security. The shipowners applied to the Turkish court with an objection against the arrest but the objection was finally rejected on 5 January 2015. The Turkish action, the arbitration and the present proceedings 17. On 8 January 2015, the buyers filed their Points of Claim with the Gebze 1 st Civil Court (being docket no. 2015/15 E.), alleging that it was detected during unloading that a total of about 16,700MT (i.e. over 50%) of the cargo had been damaged as a result of irregularities during loading or stowage, and claiming damages approximately in the sum of US$3.93 million. 18. On 16 January, the shipowners’ Hong Kong solicitors wrote to their proposed arbitrator, who indicated that he would be willing to be nominated by the shipowners as arbitrator for all disputes arising out of the four bills of lading between the shipowners and the receivers. By a letter dated 30 January (served on 3 February), the shipowners wrote to the receivers, providing notice of commencement of arbitration with respect to the contracts of carriage evidenced by or contained in the four bills of lading. 19. On 5 February, by a letter to the receivers, the shipowners’ solicitors stated that pursuant to the arbitration clause in the contracts of carriage, all disputes should be referred to arbitration in Hong Kong, and that the buyers had wrongfully commenced substantive proceedings in Turkey against the shipowners on 8 January. They demanded that the receivers “immediately withdraw from and vacate all substantive proceedings in Turkey”. The buyers’ Turkish lawyers responded on the same date, stating that according to Turkish law, the holder of the bill of lading had the right to seek an arrest of the vessel to obtain security, and that “in connection with this, the arresting court gains full competency and Turkish law becomes applicable for the dispute itself”. They denied that the Turkish claim had been wrongfully commenced. 20. On 12 February, the shipowners’ solicitors wrote to the receivers, stating that Hong Kong is the proper and agreed-upon forum for the resolution of disputes arising out of the contracts of carriage. The shipowners also offered that, if the Turkish proceedings were withdrawn, they would be willing for the security held by the Turkish court to be transferred to Hong Kong, pending the result of the arbitration. By a letter dated 26 February, the receivers’ solicitors replied, contending that there was no valid arbitration agreement between the shipowners and either the buyers or Yucel, that the shipowners had submitted to the jurisdiction of the Turkish court, and that the notice of arbitration was defective. The notice was said to be defective because: (i) it purported to commence an arbitration for disputes arising out of four contracts of carriage evidenced by four bills of lading; (ii) there was no dispute between the shipowners and Yucel [2] ; and (iii) the parties had not agreed on the number of arbitrators and the shipowners could not stipulate that if the receivers did not appoint their arbitrator within 30 days, the shipowners’ nominee would be appointed as the sole arbitrator. 21. On 27 February, the shipowners caused an originating summons to be issued from the Court of First Instance of Hong Kong against the buyers and applied ex parte , giving less than 3 hours’ notice to the buyers’ solicitors, for, inter alia , an anti-suit injunction against the buyers, in terms which they now seek to continue on an inter partes basis. Mimmie Chan J granted the injunction sought, and directed that the return date for the inter partes application would be 20 March. The judge also granted leave for the originating summons to be issued and served out of the jurisdiction on the buyers pursuant to Order 73 rule 7 (1) of the Rules of the High Court ( Cap. 4A ), on the ground that the arbitration to which the originating summons relates is to be held within the jurisdiction. There is no challenge by the buyers against the issue and service of the originating summons out of the jurisdiction. 22. On 2 March, the shipowners filed their points of defence in the Turkish action together with their objection to jurisdiction. On the same date, they took out an inter partes summons in Hong Kong for the continuation of the ex parte injunction. It is this summons which has come before me for determination. III. JURISDICTION TO GRANT ANTI-SUIT INJUNCTION ON THE BASIS OF AN ARBITRATION CLAUSE 23. The type of injunction sought by the shipowners has been called “anti-suit” injunction, but as Lord Hobhouse said in Turner v. Grovit [2002] 1 WLR 107 at §23, it is a misnomer because the injunction is an order of the Hong Kong court addressed to a party before it, in personam , not an order addressed to or binding upon a foreign court. Its effectiveness depends on the defendant being amenable to the Hong Kong court’s jurisdiction. 24. For the source of the court’s power to grant the injunction sought, Mr Nick Luxton, who appeared on behalf of the shipowners, referred me to s. 45 of the Arbitration Ordinance ( Cap. 609 ), which provides as follows: “(1) Article 17J of the UNCITRAL Model Law does not have effect. (2) On the application of any party, the Court may, in relation to any arbitral proceedings which have been or are to be commenced in or outside Hong Kong, grant an interim measure. (3) The powers conferred by this section may be exercised by the Court irrespective of whether or not similar powers may be exercised by an arbitral tribunal under section 35 in relation to the same dispute. (4) The Court may decline to grant an interim measure under subsection (2) on the ground that— (a) the interim measure sought is currently the subject of arbitral proceedings; and (b) the Court considers it more appropriate for the interim measure sought to be dealt with by the arbitral tribunal. (5) In relation to arbitral proceedings which have been or are to be commenced outside Hong Kong, the Court may grant an interim measure under subsection (2) only if— (a) the arbitral proceedings are capable of giving rise to an arbitral award (whether interim or final) that may be enforced in Hong Kong under this Ordinance or any other Ordinance; and (b) the interim measure sought belongs to a type or description of interim measure that may be granted in Hong Kong in relation to arbitral proceedings by the Court. (6) Subsection (5) applies even if— (a) the subject matter of the arbitral proceedings would not, apart from that subsection, give rise to a cause of action over which the Court would have jurisdiction; or (b) the order sought is not ancillary or incidental to any arbitral proceedings in Hong Kong. (7) In exercising the power under subsection (2) in relation to arbitral proceedings outside Hong Kong, the Court must have regard to the fact that the power is— (a) ancillary to the arbitral proceedings outside Hong Kong; and (b) for the purposes of facilitating the process of a court or arbitral tribunal outside Hong Kong that has primary jurisdiction over the arbitral proceedings. (8) The Court has the same power to make any incidental order or direction for the purposes of ensuring the effectiveness of an interim measure granted in relation to arbitral proceedings outside Hong Kong as if the interim measure were granted in relation to arbitral proceedings in Hong Kong. (9) An interim measure referred to in subsection (2) means an interim measure referred to in article 17(2) of the UNCITRAL Model Law, given effect to by section 35(1), as if— (a) a reference to the arbitral tribunal in that article were the court; and (b) a reference to arbitral proceedings in that article were court proceedings, and is to be construed as including an injunction but not including an order under section 60. (10) A decision, order or direction of the Court under this section is not subject to appeal.” 25. As provided in s. 45(9), interim measure is defined by reference to art. 17(2) of the UNCITRAL Model Law. This is set out in s. 35 (1) of the Arbitration Ordinance , which provides: “(1) Article 17 of the UNCITRAL Model Law, the text of which is set out below, has effect— ‘Article 17. Power of arbitral tribunal to order interim measures (1) Unless otherwise agreed by the parties, the arbitral tribunal may, at the request of a party, grant interim measures. (2) An interim measure is any temporary measure, whether in the form of an award or in another form, by which, at any time prior to the issuance of the award by which the dispute is finally decided, the arbitral tribunal orders a party to: (a) Maintain or restore the status quo pending determination of the dispute; (b) Take action that would prevent, or refrain from taking action that is likely to cause, current or imminent harm or prejudice to the arbitral process itself; (c) Provide a means of preserving assets out of which a subsequent award may be satisfied; or (d) Preserve evidence that may be relevant and material to the resolution of the dispute.’.” 26. The Court of First Instance has, of course, as part of its jurisdiction as a superior court of unlimited jurisdiction administering both law and equity (see ss. 3, 12 and 16 of the High Court Ordinance ( Cap. 4 )), the power to grant equitable relief such as injunction. S. 21L expressly provides: “The Court of First Instance may by order (whether interlocutory or final) grant an injunction or appoint a receiver in all cases in which it appears to the Court of First Instance to be just or convenient to do so.” 27. I therefore raised the question at the hearing whether an injunction such as the one sought here is to be granted pursuant to s. 45(2) or s. 21L. So far as injunctions are concerned, there are at least the following differences between the two sources: (i) The power under s. 21L includes the power to grant both final and interlocutory injunction, whereas there is only power under s. 45(2) to grant an interim injunction – with the word “interim” having the meaning specified in art. 17(2) of the UNCITRAL Model Law. (ii) The power under s. 45(2) is exercisable only where there are actual or contemplated arbitral proceedings (since the power is to grant interim measure in relation to arbitral proceedings which “have been or are to be commenced”), whereas the power under s. 21L is not so limited. (iii) In relation to arbitral proceedings outside Hong Kong, the power under s. 45(2) is circumscribed by the conditions set out in s. 45(5), (6) and (7). No such conditions are laid down expressly in s. 21L. (iv) The grant or refusal of an injunction by the Court of First Instance under s. 45(2) is not subject to appeal (see s. 45(10)), whereas an appeal lies against a decision under s. 21L, in the ordinary way (subject potentially to the requirement of leave to appeal), to the Court of Appeal. 28. Mr Luxton submitted that this court has jurisdiction to grant the injunction sought pursuant to s. 45 (2) of the Arbitration Ordinance ( Cap. 609 ). On the basis that what was sought was an interim injunction, Ms Frances Lok, who appeared for the buyers, was content to accept that there was jurisdiction under s. 45(2). 29. For my part, while I have no doubt the court has jurisdiction to grant an injunction to restrain one party to an arbitration agreement from taking steps to have a dispute covered by that agreement determined by a foreign court, I am not so sure that the jurisdiction is to be found exclusively, or at all, in s. 45(2). The reasons I say this are, briefly, as follows. 30. First, an arbitration agreement has a positive and a negative aspect. Positively, the parties agree that any dispute within the scope of the agreement will be determined by arbitration as prescribed, and, negatively (and often only implicitly), they undertake to each other that they will not bring such dispute to any other forum: AES Ust-Kamenogorsk Hydropower Plant LLP v Ust- Kamenogorsk Hydropower Plant JSC [2013] 1 WLR 1889 at §1; Pena Copper Mines Ltd v Rio Tinto Co Ltd (1911) 105 LT 846 , 850-851. An anti-suit injunction seeks to enforce the negative aspect of the agreement. It is in form and substance a negative injunction, not concerned with the institution or prosecution of arbitral proceedings as such, but with restraint of the pursuit of other proceedings in breach of contract. It is more accurately described as a measure not in relation to any arbitral proceedings , but in relation to the arbitral agreement . It is therefore not evident to me that an anti-suit injunction in this context is an interim measure “in relation to” actual or contemplated arbitral proceedings, as provided in s. 45(2). In AES Ust-Kamenogorsk Hydropower Plant LLP , supra , at §48, the Supreme Court of the United Kingdom held, albeit in the context of somewhat different statutory language, that an injunction to restrain foreign proceedings brought in breach of an arbitration agreement was not “ for the purposes of and in relation to arbitral proceedings” within the meaning of s. 44 of the Arbitration Act 1996, but “for the purposes of and in relation to the negative promise contained in the arbitration agreement not to bring foreign proceedings, which applies and is enforceable regardless of whether or not arbitral proceedings are on foot or proposed.” See also per Colman J in Sokana Industries Inc v Freyre & Co Inc [1994] 2 Lloyd’s Rep 57, 65. 31. The point is illustrated by the wording of the originating summons in this case, which seeks an injunction to restrain the buyers from prosecuting or continuing the existing Turkish proceedings or commencing any further or other proceedings in Turkey against the shipowners with respect to any claims arising under the contracts of carriage contained in or evidenced by the three bills of lading, except for the purposes of or to enforce an arbitral award under such contracts of carriage. The form of the injunction sought is thus independent of any actual or contemplated arbitral proceedings. The ex parte injunction already granted restrains the buyers “until further order or the return date”. The inter partes summons seeks a continuation of that injunction “until further order”. None of these documents refers to the period of time “prior to the issuance of the award by which the dispute is finally decided”, which is the period specified in Art. 17(2) in the definition of interim measure. It is thus not entirely clear, at any rate from the inter partes summons itself, whether the injunction sought now is an interlocutory injunction pending the hearing of the originating summons for final relief under s. 21L, or an interim measure under s. 45(2) pending the issuance of an award in an existing or contemplated arbitration (which seems to be both counsel’s assumption) and, if the latter, what is to happen to the originating summons itself. 32. Likewise it seems to me that the availability in Hong Kong of an anti-suit injunction to enforce the negative aspect of an arbitration clause does not depend on the existence or prospect of any arbitral proceedings. If no arbitration proceedings “have been or are to be commenced”, as s. 44(2) requires, the jurisdiction to grant the anti-suit injunction sought cannot be derived from s. 44(2), but will, as Mr Luxton accepted, have to founded on s. 21L of the High Court Ordinance . A decision under s. 21L is appealable but a decision under s. 45(2) is not. It seems to me anomalous that an appeal should lie against the grant or refusal of an anti-suit injunction if there are no actual or contemplated arbitral proceedings, but that no appeal would lie otherwise. 33. Further, I have some difficulty in understanding how an anti-suit injunction falls within the meaning of “interim measure”, which is defined in s. 45(9) and Art. 17(2) (as applied by s. 35(1)). Mr Luxton suggested that an anti-suit injunction is an order to a party to “refrain from taking action that is likely to cause, current or imminent harm or prejudice to the arbitral process itself” (Art. 17(2)(b)) but it is not entirely clear to me how foreign proceedings will cause harm or prejudice to the arbitral process itself. Moreover, s. 45(9)(b) provides that a reference in Art. 17(2) to arbitral proceedings should be read as a reference to court proceedings. The phrase “arbitral proceedings” does not actually appear in Art. 17(2). If s. 45(9)(b) is intended to apply to the phrase “arbitral process” in Art. 17(2)(b) which is thereby deemed to be a reference to court proceedings, it is still difficult to see how an anti-suit injunction falls within Art. 17(2)(b) as modified. The purpose of an anti-suit injunction, whether based on an arbitration clause or exclusive jurisdiction clause, is not to protect a local process from harm or prejudice but to enforce a contract breached by the pursuit of foreign proceedings. 34. I note that in Lucky Sun Development Ltd v. Gainsmate International Ltd (HCCT 12/2007; 2 October 2007; CACV 341/2007; 15 November 2007), an application for injunctions including an anti-suit injunction was dealt with under s. 2GC of the previous Arbitration Ordinance ( Cap. 341 ), which had similarities to s. 45 of the current Arbitration Ordinance . However, the question of the source of the jurisdiction was, so far as I can see, not discussed there and was probably immaterial since s. 2GC did not contain a provision equivalent to s. 45(10) that precluded appeals. 35. With all that having been said, in the end, since the source of jurisdiction was not argued by counsel in the present case, both of whom proceeded on the basis that s. 45 (2) of the Arbitration Ordinance was the governing provision, the point must be left to another occasion. For present purposes, there is no dispute that the exercise of the jurisdiction, irrespective of its legal foundation, is guided by the same principles, to which I now turn. IV. PRINCIPLES GOVERNING THE EXERCISE OF POWER 36. There is little dispute between counsel on the principles that govern the existence of the discretionary power that the court undoubtedly has to grant an injunction to restrain foreign proceedings brought in breach of an arbitration clause. 37. While the buyers’ solicitors had in their letter dated 26 February alleged that there was no valid arbitration agreement between the shipowners and the buyers, and Mr Luxton had understandably devoted considerable space in his initial comprehensive skeleton argument to the submission that the arbitration clause found in the head charterparty was validly incorporated into the bills of lading [3] , for the purposes of the present application Ms Lok was content to proceed on the footing that there was a validly incorporated arbitration agreement, in the form of clause 18 of the head charterparty (as quoted in paragraph 7 above) with the necessary adjustment of its wording to render it applicable to the disputes between the shipowners and the buyers. 38. It is important to remember that the injunction is sought here not on the general ground that the foreign proceedings are vexatious or oppressive (as to which see e.g. Liaoyang Shunfeng Iron and Steel Co Ltd v. Yeung Tsz Wang (CACV 234/2011; 14 June 2012) at §§83-89), but on the ground that they were brought, and are being continued, in breach of contract. As Lord Hobhouse said in Donohue v. Armco Inc [2002] CLC 440; [2002] 1 All ER 749 at §45 (a case involving an exclusive jurisdiction clause the facts of which I shall describe below): “The position of a party who has an exclusive English jurisdiction clause is very different from one who does not. The former has a contractual right to have the contract enforced. The latter has no such right. The former’s right specifically to enforce his contract can only be displaced by strong reasons being shown by the opposite party why an injunction should not be granted. The latter has to show that justice requires that he should be granted an injunction.” The contractual right is underlined by the fact that it is in principle open to an applicant, where the anti-injunction is refused (and perhaps even where it is granted), to seek damages for breach of contract if he has suffered loss e.g. in being put to greater expense by having to litigate in a different jurisdiction: Donohue v. Armco Inc , supra , at §§36 & 48. 39. The modern starting point of a discussion of the applicable principles to a case of this kind is the seminal decision in Aggeliki Charis Cia Maritime SA v. Pagnan SpA, The Angelic Grace [1995] 1 Lloyd’s Rep 87, 96, where Millett LJ said: “In my judgment, the time has come to lay aside the ritual incantation that this is a jurisdiction which should only be exercised sparingly and with great caution. There have been many statements of great authority warning of the danger of giving an appearance of undue interference with the proceedings of a foreign Court. Such sensitivity to the feelings of a foreign Court has much to commend it where the injunction is sought on the ground of forum non conveniens or on the general ground that the foreign proceedings are vexatious or oppressive but where no breach of contract is involved. In the former case, great care may be needed to avoid casting doubt on the fairness or adequacy of the procedures of the foreign Court. In the latter case, the question whether proceedings are vexatious or oppressive is primarily a matter for the Court before which they are pending. But in my judgment there is no good reason for diffidence in granting an injunction to restrain foreign proceedings on the clear and simple ground that the defendant has promised not to bring them. … In my judgment, where an injunction is sought to restrain a party from proceeding in a foreign Court in breach of an arbitration agreement governed by English law, the English Court need feel no diffidence in granting the injunction, provided that it is sought promptly and before the foreign proceedings are too far advanced. I see no difference in principle between an injunction to restrain proceedings in breach of an arbitration clause and one to restrain proceedings in breach of an exclusive jurisdiction clause as in Continental Bank N.A. v. Aeakos Campania Naviera S.A. , [1994] 1 W.L.R. 588. The justification for the grant of the injunction in either case is that without it the plaintiff will be deprived of its contractual rights in a situation in which damages are manifestly an inadequate remedy. The jurisdiction is, of course, discretionary and is not exercised as a matter of course, but good reason needs to be shown why it should not be exercised in any given case.” 40. In Donohue v. Armco Inc , supra , at §24, Lord Bingham described the approach in a case involving an exclusive jurisdiction clause as follows: “If contracting parties agree to give a particular court exclusive jurisdiction to rule on claims between those parties, and a claim falling within the scope of the agreement is made in proceedings in a forum other than that which the parties have agreed, the English court ordinarily exercises its discretion (whether by granting a stay of proceedings in England, or by restraining the prosecution of proceedings in the non-contractual forum abroad, or by such other procedural order as is appropriate in the circumstances) to secure compliance with the contractual bargain, unless the party suing in the non-contractual forum (the burden being on him) can show strong reasons for suing in that forum. I use the word ‘ordinarily’ to recognise that where an exercise of discretion is called for there can be no absolute or inflexible rule governing that exercise, and also that a party may lose his claim to equitable relief by dilatoriness or other unconscionable conduct. But the general rule is clear: where parties have bound themselves by an exclusive jurisdiction clause effect should ordinarily be given to that obligation in the absence of strong reasons for departing from it. Whether a party can show strong reasons, sufficient to displace the other party’s prima facie entitled to enforce the contractual bargain, will depend on all the facts and circumstances of the particular case.” 41. In the same case, Lord Scott said at §53: “The principles to be applied in order to decide on the one hand whether an exclusive jurisdiction clause should be enforced by an injunction and on the other hand whether the commencement or continuation of foreign proceedings which are not caught by an exclusive jurisdiction clause should be barred by an injunction seem now well settled and have not been the subject of any real disagreement before your Lordships. It is accepted that a contractual exclusive jurisdiction clause ought to be enforced as between the parties to the contract unless there are strong reasons not to do so. Prima facie parties should be held to their contractual bargain: see The Fehmarn [1958] 1 WLR 159 ; The Chaparral [1968] 2 Lloyd’s Rep 158; The El Amria [1981] 2 Lloyd’s Rep 119; The Sennar (No 2) [1985] 1 WLR 490 ; The Angelic Grace [1995] 1 Lloyd’s Rep 87.” While Millett LJ referred to “good reason” and Lord Bingham and Lord Scott used the phrase “strong reasons” I do not think there is a material difference between them. 42. In The Front Comor [2007] 1 Lloyd’s Rep 391, Lord Hoffmann said (at §10) that the English courts have regularly granted injunctions to restrain parties to an arbitration agreement from instituting or continuing proceedings in the courts of other countries , and added (at §21): “The Courts of the United Kingdom have for many years exercised the jurisdiction to restrain foreign court proceedings as Colman J did in this case: see Pena Copper Mines Ltd v Rio Tinto Co Ltd (1911) 105 LT 846 . It is generally regarded as an important and valuable weapon in the hands of a court exercising supervisory jurisdiction over the arbitration. It promotes legal certainty and reduces the possibility of conflict between the arbitration award and the judgment of a national court. As Professor Schlosser also observes, it saves a party to an arbitration agreement from having to keep a watchful eye upon parallel court proceedings in another jurisdiction, trying to steer a course between so much involvement as will amount to a submission to the jurisdiction (which was what eventually happened to the buyers in The Atlantic Emperor : see [1992] 1 Lloyd’s Rep 624) and so little as to lead to a default judgment. That is just the kind of thing that the parties meant to avoid by having an arbitration agreement.” 43. In AES Ust-Kamenogorsk Hydropower Plant LLP , supra , at §§25-28 & 62, while the main point for decision by the House of Lords was whether there was jurisdiction to grant an anti-suit injunction, Lord Mance, in a judgment concurred in by all the other Supreme Court Justices, referred to the above line of authorities with apparent approval, and also upheld the first instance judge’s decision which was based on this approach. 44. More recently, in Compania Sud Americana de Vapores S.A. v. Hin-Pro International Logistics Ltd (CACV 243/2014; 11 March 2015), the Court of Appeal of Hong Kong had the occasion to consider The Angelic Grace . The English High Court had granted anti-suit injunctions at the behest of the plaintiff against the defendant, to restrain the defendant from proceeding with legal actions that it (representing cargo interests) had brought in Mainland China against the plaintiff (as carrier). When the injunctions were ignored by the defendant, the plaintiff obtained from the English court a worldwide freezing order over the defendant’s assets. Based on that order the plaintiff sought under s. 21M of the High Court Ordinance ( Cap. 4 ) a receivership order as well as Mareva injunctions against the defendant in Hong Kong, where it was based, in aid of the English proceedings. The Court of Appeal held that the plaintiff’s applications should be refused, on the ground that the jurisdiction under s. 21M should not be exercised having regard to the conflict between the English courts and the Mainland courts on, inter alia , the effect of the jurisdiction clause in the bills of lading. For present purposes, the following passages in the Court of Appeal’s judgment are significant: “56. Mr Scott further contended that the enforcement of an exclusive jurisdiction clause is not breach of judicial comity, citing The Angelic Grace [1995] 1 Ll Rep 87 in support. See also Deutsche Bank AG v Highland Crusader Partners LP [2010] 1 WLR at para 51 where Toulson LJ observed: ‘An injunction to enforce an exclusive jurisdiction clause governed by English law is not regarded as a breach of comity, because it merely requires a party to honour his contract.’ 57. We accept this proposition as far as an English court enforcing an exclusive jurisdiction clause in favour of the English court goes. The same can be said for a case where Hong Kong court enforces an exclusive jurisdiction clause in favour of the Hong Kong forum. But this is not situation before us. The plaintiff asked the court in Hong Kong to enforce an exclusive jurisdiction clause in favour of English court. In such context, by reason of the indirect interference with proceedings in the PRC courts, we must pay regard to the principle in Airbus Industrie GIE v Patel , supra. 58. In so holding, we do not overlook the rationale for the enforcement of exclusive jurisdiction clause as a matter of contract. As Millett LJ held in The Angelic Grace , supra, at p.96: ‘The justification for the grant of the injunction … is that without it the plaintiff will be deprived of its contractual rights in a situation in which damages are manifestly an inadequate remedy.’ 59. Nor had it escaped our attention that the cause of action of the plaintiff can be described as a right not to be sued abroad. Such right can be derived from contract, as in the case of an exclusive jurisdiction clause. It can equally be derived from other equitable considerations and as illustrated by Masri v Consolidated Contractors (No 3) , supra, those considerations may support a claim for anti-suit injunction on the ground of unconscionable conduct.” 45. It is clear, therefore, as a matter of Hong Kong law that the court in this jurisdiction should ordinarily grant an injunction to restrain the pursuit of foreign proceedings brought in breach of an agreement for Hong Kong arbitration, at any rate where the injunction has been sought without delay and the foreign proceedings are not too far advanced, unless the defendant can demonstrate strong reason to the contrary. In her admirably succinct argument, Ms Lok did not dispute the principle that can be derived from the authorities. She accepted that strong reason has to be shown why the buyers should not be required to adhere to the arbitration clause, and that they have the burden to demonstrate such strong reason. In essence she submitted that the injunction should be refused because the shipowners had not come to court with clean hands, and there was in any event strong reason not to enforce the arbitration clause by injunction, particularly because of the existence of other proceedings in Turkey but also because of the existence of a jurisdictional challenge in Turkey and the delay in the present application. I shall return to the buyers’ contentions for such strong reason after dealing with the discrete, preliminary point of unclean hands. V. UNCLEAN HANDS 46. Like all injunctions, the anti-suit injunction is an equitable remedy and therefore subject to general equitable defences. In opposing the injunction in this case the buyers pray in aid the maxim of equity that “he who comes to equity must come with clean hands”. The defence, however, is not concerned with general depravity on the part of a plaintiff. It has been said that “Equity does not demand that its suitors shall have led blameless lives”: Loughran v. Loughran 292 US 216 , 229 (1934) per Brandeis J. The impropriety or misconduct relied upon “must have an immediate and necessary relation to the equity sued for”: Dering v. Earl of Winchelsea (1787) 1 Cox Eq 318, 319; Moody v. Cox [1917] 2 Ch 71 ; Poon Ka Man Jason v. Cheng Wai Tao (CACV 135/2013; 21 January 2015) at §6.7.2. In other words, the doctrine applies where “the plaintiff seeks to derive advantage from his dishonest conduct in so direct a manner that it is considered to be unjust to grant him relief”: Spry, Principles of Equitable Remedies (9 th ed), p. 254. 47. It is not in dispute that the defence of unclean hands is in principle available against an application for anti-suit injunction. An example of the defence being successfully deployed in that context can be found in Royal Bank of Scotland plc v. Highland Financial Partners LP [2013] 1 CLC 596, on which Ms Lok placed considerable reliance. The facts of that case are complex but for present purposes may be summarised as follows. Highland, a capital management group based in the USA, planned to launch a collateralised debt obligation. Loan notes with an aggregate size of €500 million would be issued, secured by a portfolio of loans. RBS was engaged to finance the acquisition of the loans and to market the notes, and held security over the acquired loans via a debenture. After the collapse of Lehman Brothers in September 2008, RBS terminated the mandate and sought to recover its advances. The acquired loans were auctioned and eventually purchased by RBS itself, who claimed there was a shortfall of €30.5 million and brought proceedings in the UK to recover it. Burton J granted summary judgment to RBS on issues of liability. It subsequently transpired during the trial on quantum that before the auction, RBS had, in breach of its duties as mortgagee, transferred 36 of the loans which were “bullet proof, good at par” from its trading book to its banking book so that they were not available for a competitive auction. This was not confessed by RBS during the trial on quantum, whose principal witness (Mr Griffiths) perjured himself by testifying to the contrary. Nevertheless Burton J held that a proper valuation of the loans still left a shortfall and RBS was entitled to judgment in the sum of €21 million. The Highland parties then brought an action in Texas against RBS and two of its employees alleging fraud in relation to the 36 loans. 48. RBS then brought proceedings in the UK to claim an anti-suit injunction on the basis of an exclusive English jurisdiction clause in the contract. The Highland parties counterclaimed an order to set aside the liability judgment for having been obtained by fraud. In this second action, RBS continued to deny that it had suppressed the transfer of the 36 loans and Mr Griffiths again gave false evidence to that effect. Burton J held that RBS had suppressed the fact regarding the transfer of the 36 loans, but that the concealment had not been the result of dishonesty. He declined to set aside the liability judgment. He held that the fact that RBS had unclean hands was a strong reason why the court should not grant an anti-suit injunction in its favour. On appeal the Court of Appeal reversed Burton J’s decision not to set aside the liability judgment and upheld his refusal of the anti-suit injunction. Aikens LJ, with whom Toulson and Maurice Kay LJJ agreed, stated that the defence of unclean hands was distinct from that of there being “strong reason” not to grant an anti-suit injunction (§158). He held that RBS’s misconduct had an immediate and necessary relation to the equity sued for because: “it relates, at least in part, to the very allegations being made against RBS and SG [i.e. Mr Griffiths] in the Texas proceedings under Count 2 of the Petition. The aim of the anti-suit injunction is to prevent Highland and Scott Law pursuing those allegations in the Texas proceedings because (it is said) they agreed that all such matters would be dealt with exclusively by the English courts or (in Scott Law’s case) were bound by that agreement. The judge has found that RBS, through SG, has lied about central facts on which Highland and Scott Law found the allegations that are made against RBS in the Texas proceedings. RBS, through SG, has relied on this false evidence in the course of the English proceedings whose very object is to stop the Texas action. To my mind the misconduct could not be more immediately related to the equity that is sued for.” 49. The way in which the shipowners in the present case are said to have unclean hands is that the Master had issued clean bills of lading fraudulently, notwithstanding that he must have known, as evidenced by the mate’s receipts, that the goods had been damaged when they were loaded on board the ship. The principal issues raised by this defence as I see it are two-fold: (i) whether the shipowners indeed have unclean hands; and (ii) whether the conduct complained of has an immediate and necessary relation to the equity sued for. 50. There are three mate’s receipts issued in relation to the steel wire rods purchased by the buyers (and two in relation to the steel coils purchased by Yucel). The mate’s receipts relating to the buyers’ cargo contain various remarks such as: “all coils scratched slightly on the surface locally”, “all coils rust stained slightly on the surface locally”, “3560 coils rusty on the surface” and “[5300, 119 and 17] coils each with 5-15 winding twisted slightly locally”. 51. Ms Lok, relying on Brown Jenkinson & Co Ltd v. Percy Dalton (London) Ltd [1957] 2 QB 621 , 629-630, submitted that the bills of lading in this case constituted a representation that the steel wire rods were shipped in apparent good condition, free of defects and damage, and that it was a fraudulent misrepresentation having regard to the remarks inserted in the mate’s receipts. The buyers believe that the shipowners had colluded with Jiangsu Shagang to issue clean bills of lading, notwithstanding the cargo was damaged, in order to ensure that MTI and ultimately Jiangsu Shagang would get paid the price under the letter of credit. The difficulty for the buyers however is that, as Ms Lok accepted, the defence of unclean hands cannot be founded on mere allegations of wrongdoing. The court must be satisfied that a plaintiff indeed has grimy hands before it will examine whether the dirt is such as to disqualify him for equitable relief. 52. For his part Mr Luxton did not dispute that the clean bills of lading contained a representation that the goods were in apparent good order and condition, but he argued that the remarks on the mate’s receipts were consistent with the cargo being in good order and condition. He referred to the evidence of the Master (albeit given indirectly via the shipping managers) that that was why he decided not to clause the bills of lading. Mr Luxton relied on the evidence that in the trade of hot rolled steel wire rods, surface rust and some breakage of straps and binding rods are to be expected. He also pointed out that the authorities cited by Ms Lok were decisions after trial in which there were actual findings of fraud. 53. In addition, Mr Luxton submitted that it would make no commercial sense for the shipowners knowingly to ship damaged goods and deceitfully to issue clean bills of lading, for the ship would inevitably be arrested at the port of discharge. Instead, he suggested the buyers had a motive for rejecting the goods because customs taxes applicable to the import of the cargoes in Turkey significantly increased shortly after the sales contract was entered into and before the bills of lading were issued. For present purposes I place little weight on these considerations which are strongly disputed by the buyers. 54. Ultimately however this defence is, in my judgment, not established. This is an interlocutory application argued on the basis of affidavit evidence. I do not consider it appropriate to come to a finding of fraud on the basis of contested affidavit evidence. Where serious allegations of wrongdoing are involved they must be proved by evidence of commensurate cogency, and fraud or serious misconduct can only be inferred where such inferences are compelling: Nina Kung v. Wang Din Shin (2005) 8 HKCFAR 387 , §§181-187. In my view, for the following reasons it cannot be inferred for present purposes from the material before me that the Master was necessarily fraudulent in deciding to issue and sign the clean bills. (1) First, it was for the Master to form an honest and reasonable, non-expert opinion of the apparent condition of the cargo from his own observations. While it was open to the Master to ask for expert advice it was ultimately a matter of his own judgment: The David Agmashenebeli [2003] 1 Lloyd’s Rep 92, §112; The Saga Explorer [2013] 1 Lloyd’s Rep 401, §32. In The David Agmashenebeli at §112, Colman J said the obligation imposes on a ship’s master “a duty of a relatively low order but capable of objective evaluation”. He said that to suggest that the master need do no more than honestly state his view would be to put it too low, though no doubt in most cases the result would be the same. As a corollary, it seems to me that in many cases there will be a range of tenable opinion on the apparent condition of the cargo that a master can reasonably and honestly reach unless the objective facts are so clear as to admit no divergent views. (2) Secondly, the remarks contained in the three relevant mate’s receipts appear to evidence minor problems. So far as rusting and scratching are concerned, what was stated was limited to the surface of the cargoes. The evidence suggests that such surface conditions are not uncommon with steel cargo and do not in themselves show that the cargoes are not in good order and condition. As Simon J statedin The Saga Explorer , supra , at §24: “Some degree of visible, but superficial, rust is likely to occur on the surfaces of steel cargo, unless specially manufactured or specially treated. At one end of the scale this will be without significance. Oxidation is a normal consequence of the exposure to the atmosphere, and it would cause widespread interference with international trade if such visible rust were to result in the clausing of bills of lading. At the other end of the scale will be cargoes where the rust is deep, difficult to remove and, when removed, may reveal uneven pitting to the surface.” It is also of note that the sales contract between MTI and the buyers also stipulated that bills of lading containing remarks such as “atmospherically rusty” and “some straps or binding rods broken” and similar remarks were acceptable. As I read the evidence, it is not suggested that the Master was aware of this term in the sales contract. What it illustrates, however, is that superficial rusting in this kind of cargo is a common occurrence commercially acceptable to the buyers vis-à-vis the intermediate seller. (3) Thirdly, while Ms Lok submitted that the present case was materially the same as The Saga Explorer , that case was a decision after trial. There a load port survey report stated the cargo was “in apparent good order & condition with the following damage/exception” and then set out in 16 pages what was called “Damage/Exception prior to loading”, including references to the cargo being “partly rust stained”. The report also contained a recommendation that the noted damage/exception be claused in or appended to the mate’s receipt and bills of lading. The mate’s receipts signed by the chief officer duly noted the condition of the cargo to be “as per Survey Report”. The booking note stipulated that the bills of lading were “to be issued as per Mate’s Receipt”, but the bills of lading eventually issued on behalf of the carrier contained no mention of the survey report. When the cargo was found damaged on arrival, the cargo interests brought an action against the vessel owners on the basis that the bills of lading contained a fraudulent misrepresentation of the condition of the goods of shipment. It was found that the problems with the cargo upon discharge were serious (“severely oxidised”, “heavily rusted”), but it was common ground that there was no significant deterioration of the cargo during the voyage. Simon J considered that the cargo should have been (at a minimum) described as “rust spotted” or “partly heavily rusted” upon loading. He also made the important finding, disbelieving the vessel’s manager who had signed the bills of lading and gave evidence as a witness, that everyone considered the bills of lading should have been claused in the form of the mate’s receipts up to the point when the manager decided clean bills should be issued in consideration of the letter of indemnity offered by the shippers (see §§16-21 & 51-54). In the present case, Ms Lok asked me to infer fraud simply on the basis that the remarks in the mate’s receipts were not reproduced in the bills of lading. With respect, the facts here are not at all comparable, at least at this stage, to those in The Saga Explorer . (4) Fourthly, I am not persuaded that fraud is established or can be presumed merely from a discrepancy between the mate’s receipts and the bills of lading as regards the condition of the cargo. While dishonesty can be one of the explanations, it seems to me that there can equally be other, innocent explanations. In Oceanfocus Shipping Ltd v. Hyundai Merchant Marine Co Ltd (The ‘Hawk’) [1999] 1 Lloyd’s Rep 176, the vessel was chartered on the New York Produce Exchange form which provided that the captain should sign bills of lading “in conformity with Mate’s or Tally Clerk’s receipts”. The charterers, having settled certain claims made by cargo interests, claimed against the owners for an indemnity under the inter-club agreement. In defence, the owners complained, inter alia , that the charterers had in some cases signed bills of lading without including notations contained in the mate’s receipts and had, therefore, issued the bills without authority. Although the context is different from the present case, what Judge Diamond QC said in the following passage (at p 186) is a useful reminder that there could be different reasons for discrepancies between mate’s receipts and bills of lading: “… The consequences of not including in the bill notations to be found on mate’s or tally clerk’s receipts are very diverse. In some cases the consequences may be serious and give rise to an action by the bill of lading holder based on an estoppel, for fraud, for breach of a duty of care in tort or under the Misrepresentation Act, 1967. In other cases the discrepancy may be trivial when viewed in the light of the shipment as a whole (for example 100 pipes are shipped and the bill omits a notation that one pipe was slightly rusty on shipment) or the notation on the mate’s receipt may have been erroneous and have been corrected in the bill. In construing [the relevant clauses] it is important in my view to have regard to the factual matrix in which they appear. Having regard to the diverse nature of the representations to be found in mate’s receipts and the wide spectrum of importance of the failure to include in the bills notations appearing in the mate’s receipts, ranging from serious misrepresentations to trivial or justified omissions, I would be reluctant to hold that charterers’ authority to issue bills of lading on behalf of shipowners is delimited by the requirement that the bills must precisely and exactly conform to mate’s or tally clerk’s receipts.” (5) Fifthly, as noted above, in The Saga Explorer the booking note required the bills of lading to be issued “as per Mate’s Receipt”, and in The Hawk the charterparty required the bills to be issued “in conformity with Mate’s … receipts”. In contrast, Ms Lok has not pointed to any contractual requirement whether in the charterparty or the bills of lading or otherwise for the bills to be issued with the same notations contained in the mate’s receipts. It seems to me therefore that the Master must a fortiori exercise his own judgment in deciding whether to sign the clean bills, bearing in mind that he might render his employer liable either by issuing clean bills when he should have claused them (as in The Saga Explorer ), or by insisting on clausing the bills when the goods were substantially in good order and condition (as in The David Agmashenebeli ). (6) Sixthly, the buyers allege that the ship’s own P & I Club has refused to cover the ship for the voyage in question because clean bills of lading were issued. The evidence however is that the P & I Club has only reserved its position, which is consistent with the position being, as it seems to me, equivocal. 55. In these circumstances in the absence of a fuller investigation I cannot condemn the Master unheard and accept for the purposes of this application that there was fraud or some deliberate wrongdoing on his part as alleged by the buyers. In my view the factual basis for Ms Lok’s unclean hands argument is not made out which must therefore fail for that reason. 56. The buyers also alleged that the shipowners had fraudulently suppressed the mate’s receipts in the ex parte on notice application for injunction and had produced instead a letter of protest from the Master in which he stated he was not aware of any damage to the cargo (see paragraph 13 above). As I understand Ms Lok’s submissions this complaint is bound up with the alleged fraud in issuing clean bills of lading which I have dealt with above. In any event, until the buyers raised the allegation of fraud in their affirmations in opposition to the injunction (which were filed on 13 March 2015), the mate’s receipts were not so evidently significant that I should infer fraud on the part of the shipowners or even their legal representatives in the presentation of their case, simply because the mate’s receipts had not been mentioned. As Mr Luxton observed, although the buyers had had the mate’s receipts since November 2014, the Points of Claim they filed in the Turkish proceedings in January 2015 only alleged that the cargo was damaged during loading or the carriage without alleging any fraud in the issuance of the clean bills of lading. Nor was the allegation of fraud raised in any of the pre-action correspondence. In these circumstances it seems to me that, again, there is no basis for an inference of fraudulent suppression of the mate’s receipts at the ex parte hearing. I may add that the application was made ex parte on notice to the buyers, who despite having appeared by legal representatives did not refer the court to the mate’s receipts. 57. On this footing the question whether the misconduct in question has an immediate and necessary relation to the equitable relief sought by the shipowners does not arise. I would however add that if there was in fact fraud as alleged on the part of the shipowners in issuing clean bills of lading, then it seems to me the requisite nexus would be present, because it was on the basis of the bills of lading ( ex hypothesi fraudulently prepared) that payment was made by the buyers for the goods, resulting in their taking delivery eventually and making a claim against the shipowners as carrier and thereby becoming subject to the terms of the bills of lading [4] including the arbitration clause, which the shipowners now seek to enforce by injunction. VI. REASONS AGAINST GRANT OF INJUNCTION 58. Notwithstanding the prima facie right of the shipowners to enforce the arbitration clause against the buyers, Ms Lok submitted that there are three matters that constitute a strong reason not to grant an injunction in this case. What is a “strong reason” has not been further elaborated in the authorities. In his speech in Donohue v Armco Inc , supra , at §24, Lord Bingham referred to “dilatoriness and other unconscionable conduct”, but added that the question will depend on all the facts and circumstances of the particular case. In my view the answer is not to be found by assessing, under the ordinary principles of forum non conveniens , which jurisdiction is the appropriate forum for the trial of the action, for, as Lord Hobhouse said in Turner v. Grovit , supra , at §25: “The applicant does not have to show that the contractual forum is more appropriate than any other; the parties’ contractual agreement does that for him.” Nor in my view can mere complaints of inconvenience suffice. The power is ultimately a discretionary one, to be exercised in the interests of justice, and the factors raised against the injunction must be sufficiently strong to warrant not holding the opposing party to his contract. Existence of other proceedings 59. The first matter relied upon is that there exist related proceedings in Turkey between the buyers and their insurers. According to the buyers, as a result of evidence of pre-voyage damage, their cargo insurers, Zurich Sigorta Anonim Ş irketi, have refused cover. Pursuant to the policy, the buyers have, on 16 March 2015, issued proceedings against the insurers in the Istanbul 17 th Commercial Court of First Instance as the court where the insurers’ headquarters are located. It is said, though no pleadings have yet been produced, that one of the key issues in those proceedings will be whether the cargo was damaged before loading, during the voyage, or during discharge, and the extent of damage at each stage. 60. The insurers are not party to the bills of lading and therefore not bound by the arbitration clause. The insurance litigation will have to be conducted in Turkey. Ms Lok submitted that the issues in that litigation will overlap with the issues in dispute between the shipowners and the buyers, and that the grant of the injunction sought will cause the dispute involving the shipowners, the buyers and the insurers to fragment and reduplicate at vast cost. 61. In a passage in Donohue v Armco Inc , supra , at §27, heavily relied upon by Ms Lok, Lord Bingham stated: “The authorities show that the English court may well decline to grant an injunction or a stay, as the case may be, where the interests of parties other than the parties bound by the exclusive jurisdiction clause are involved or grounds of claim not the subject of the clause are part of the relevant dispute so that there is a risk of parallel proceedings and inconsistent decisions. … In Aratra Potato Co Ltd v Egyptian Navigation Co (The ‘El Amria’) [1981] 2 Lloyd’s Rep 119 the primary dispute was between cargo interests and the owner of the vessel, both parties being bound by a clause in the bill of lading conferring exclusive jurisdiction on the courts of Egypt. But the cargo interests had also issued proceedings against the Mersey Docks and Harbour Co, which was not bound by the clause. The Court of Appeal upheld the judge’s decision refusing a stay. In the course of his leading judgment in the Court of Appeal Brandon LJ said, at p 128: ‘I agree entirely with the learned Judge’s view on that matter, but would go rather further than he did in the passage from his judgment quoted above. By that I mean that I do not regard it merely as convenient that the two actions, in which many of the same issues fall to be determined, should be tried together; rather that I regard it as a potential disaster from a legal point of view if they were not, because of the risk inherent in separate trials, one in Egypt and the other in England, that the same issues might be determined differently in the two countries. See as to this Halifax Overseas Freighters Ltd v Rasno Export (The Pine Hill) [1958] 2 Lloyd’s Rep 146 and Taunton-Collins v Cromie [1964] 1 WLR 633 .’ Citi-March Ltd v Neptune Orient Lines Ltd [1996] 1 WLR 1367 also involved third party interests and raised the possibility of inconsistent decisions. Colman J regarded separate trials in England and Singapore as not only inconvenient but also a potential source of injustice and made an order intended to achieve a composite trial in London despite a Singaporean exclusive jurisdiction clause: see at pp 1375-1376. …” 62. I do not think that Lord Bingham intended to suggest that whenever there is a risk of parallel proceedings and inconsistent decisions an anti-suit injunction will be refused. The exercise of discretion must be based on all relevant circumstances, and the question must therefore depend on the facts of each case. Also, since Ms Lok submitted that the present case is “on all fours” with Donohue v. Armco Inc and the two cases cited by Lord Bingham in the above passage, i.e. The ‘El Amria’ [1981] 2 Lloyd’s Rep 119 and Citi-March Ltd v Neptune Orient Lines Ltd [1996] 1 WLR 1367 , I must examine these decisions in some detail. 63. The facts of Donohue v. Armco Inc are complex. In essence the Armco group, which had owned a group of insurance companies, complained that a secret agreement was made between four senior Armco executives in New York in 1991, pursuant to which the Armco group was defrauded into injecting a substantial sum of money into the insurance companies for them to be sold to their management, namely, two of the four senior executives. Various companies were involved in the transaction and the relevant agreements. In 1997, NAIC, the leading company of the insurance group, went into provisional liquidation. Five companies in the Armco group (namely Armco Inc, AFSC, AFSIL, APL and NNIC) then started proceedings in New York against ten defendants, namely, NAIC, the four senior executives D, A, R and S, and R’s and S’s respective companies, namely, ITRS and IROS, as well as Wingfield, CISHL and NPV, alleging an international fraud of immense proportions. (R, S, ITRS, IROS, Wingfield and CISHL were referred to as potential co-claimants, or “PCCs”, in the speech of Lord Bingham.) 64. A settled the claim against him. All the six PCCs moved to dismiss the New York proceedings against them on various grounds but failed in September 1999. D did not take part in the motion but had instead brought proceedings in the UK in March 1999 seeking an anti-suit injunction on the basis of the exclusive English jurisdiction clauses contained in the contractual documentation, and applied to join the PCCs as claimants. 65. It is important to have in mind the existing and likely future shape of the transatlantic litigation when the House of Lords came to determine whether the anti-suit injunction should be granted. Both the judge and the Court of Appeal had held that service of the UK proceedings on APL and NNIC should be set aside, from which there was no further appeal. The House of Lords had further held that four of the six PCCs (namely, R, S, ITRS and IROS) should not be joined in the UK action as they had no procedural or contractual right to an anti-suit injunction. It was also common ground that not all causes of action being pursued in New York were covered by the exclusive jurisdiction clause. The prospect was therefore that the New York proceedings would in any event continue (i) insofar as they were brought by APL and NNIC against all the US defendants, (ii) insofar as they were brought by all five Armco parties against NAIC and NPV and the four PCCs whose joinder in the UK action was rejected, and (iii) insofar as they were brought by all five Armco parties against all the US defendants for claims not covered by the exclusive jurisdiction clauses (see §§30-33). It was against this background that Lord Bingham said: “34. The Armco companies contend that they were the victims of a fraudulent conspiracy perpetrated by Messrs Donohue, Atkins, Rossi and Stinson. Determination of the truth or falsity of that allegation lies at the heart of the dispute concerning the transfer agreements and the sale and purchase agreement. It will of course be necessary for any court making that determination to consider any contemporary documentation and any undisputed evidence of what was said, done or known. But also, and crucially, it will be necessary for any such court to form a judgment on the honesty and motives of the four alleged conspirators. It would not seem conceivable, on the Armco case, that some of the four were guilty of the nefarious conduct alleged against them and others not. It seems to me plain that in a situation of this kind the interests of justice are best served by the submission of the whole dispute to a single tribunal which is best fitted to make a reliable, comprehensive judgment on all the matters in issue . A procedure which permitted the possibility of different conclusions by different tribunals, perhaps made on different evidence, would in my view run directly counter to the interests of justice. … 36. In my opinion, and subject to an important qualification, the ends of justice would be best served by a single composite trial in the only forum in which a single composite trial can be procured, which is New York , and accordingly I find strong reasons for not giving effect to the exclusive jurisdiction clause in favour of Mr Donohue. …” (emphasis added) 66. In The El Amria , the cargo which was shipped from Alexandria was found to be in a deteriorated condition upon discharge in Liverpool. The cargo interests brought an action in England against the vessel owners notwithstanding a clause in the bill of lading conferring exclusive jurisdiction on the courts of Egypt. The cargo interests also issued proceedings in England against the Mersey Docks and Harbour Co, which was not bound by the clause, because the vessel owners had alleged that the damage to the cargo was caused by the delay in the process of discharge. The vessel owners sought a stay of the English action against itself on the strength of the exclusive jurisdiction clause in favour of Egypt. The English Court of Appeal, affirming Sheen J albeit for different reasons, refused a stay. 67. In Citi-March Ltd v. Neptune Orient Lines Ltd , when three containers with consignments of clothing shipped from Hong Kong to London were eventually delivered to the plaintiffs’ premises in London and opened, 800 cartons of clothing were found to be missing. As a result the plaintiffs sued the ocean carrier (D1), the road carrier (D2) and also the bonded warehouse (D3 and D4). There was an exclusive jurisdiction clause in favour of Singapore in the ocean bill of lading, which was binding on the plaintiff vis-à-vis D1. The plaintiff had however allowed the limitation period under the Hague-Visby Rules to expire without issuing proceedings in the contractual forum, Singapore. On D1’s application to set aside leave to issue the English writ and serve it out of the jurisdiction, Colman J held that separate trials in England and Singapore would be a potential source of injustice and refused the order sought, notwithstanding the exclusive jurisdiction clause. 68. In examining Ms Lok’s submission based on these authorities and in the exercise of the court’s discretion in this context, it seems to me important to assess what the position in Turkey and Hong Kong will be if the anti-injunction is granted and alternatively if it is refused. 69. As Mr Luxton pointed out, the court seised of the Turkish action brought by the buyers against the shipowners is the Gebze 1 st Civil Court, while the action between the buyers and their insurers are pending in the Istanbul 17 th Commercial Court of First Instance. They, on the evidence, are “entirely different courts in different provinces of Turkey”. There is no suggestion that the two cases could be consolidated and tried before a single court. If the injunction is refused, there will accordingly be no “single composite trial” involving the shipowners, the buyers, and the buyers’ insurers in a single tribunal in Turkey. Instead, there will be two separate actions, in two separate courts, presumably presided over by two different judges independent of each other, involving the shipowers and the buyers on the one hand and the buyers and their insurers on the other. There is no suggestion that any issue estoppel will apply, obliging one court to follow the decision of the other, given that the parties are different. 70. The shipowners’ evidence indicated that while “there is a possibility of a degree of cooperation between different courts in Turkey”, there will still be a risk of consistent findings between those two actions. The buyers replied that the Turkish courts “have wide powers to ensure consistency in the findings in the two court actions. For example, the Courts will likely order that documents be shared between them.” But sharing documents is not the same as having a composite trial before the same tribunal. I must assume that the Turkish judges are independent-minded jurists who are entitled to reach their own opinion on the basis of the evidence available to them. The shipowners have pointed out that as a matter of Turkish law, any award in the Hong Kong arbitration can be introduced as evidence for the purposes of the proceedings in the Istanbul 17 th Commercial Court of First Instance. As I understand Mr Luxton’s position, the shipowners are also content for the award and record of evidence in the arbitration to be made available to the Istanbul court. In any event such consent can be made a condition for the anti-suit injunction. 71. In my view the present case significantly differs in this respect from the position in Donohue v. Armco Inc where there was a single action in New York which could deal with all the issues in a “single composite trial” (§36). Likewise in The El Amria one of the reasons for refusing a stay of the English action was that as a result the claims by the cargo interests against the vessel and against the dock could be “tried together” (p. 128, col. 2; p. 129, col. 1). In City-March also there was a single English action to which all four defendants were parties where the plaintiff could have the benefit of a “composite trial” (see p. 1376E). 72. Turning the focus to Hong Kong, even if the injunction is refused, there may well still be arbitral proceedings in Hong Kong. There is, at least at this stage, no cross-application by the buyers to this court or elsewhere for an order to prevent a Hong Kong arbitration from proceeding. A refusal of the anti-suit injunction sought by the shipowners does not, of course, operate in any way to prevent or affect that arbitration. So assuming the injunction is refused, and assuming the Turkish court rejected the shipowners’ jurisdictional challenge, inasmuch as the buyers can then without restraint sue the shipowners in Turkey, it will in principle be open to the shipowners to continue to progress the Hong Kong arbitration against the buyers. 73. This, again, may be contrasted with the situation in Donohue v Armco Inc , where if no injunction was granted, the proceedings in New York would simply continue and there would be no proceedings, at any rate at that stage, in London (see §44 per Lord Hobhouse). Similarly, in The El Amria , there had apparently been no action brought by anyone in Alexandria despite the exclusive jurisdiction clause in favour of Egypt, even by the time of the appeal which was almost two years after the cause of action accrued. This enabled the Court of Appeal to conclude that by refusing a stay of the English action, the risk inherent in separate trials in Egypt and England would be avoided. The point is even clearer in City-March : since the plaintiff there had not started an action in Singapore within the limitation period, it was time-barred to do so. There was no real risk of parallel proceedings in England and Singapore, whether or not the English action was allowed to continue as against D1. 74. I recognise, of course, that the buyers may yet take steps to apply to the arbitrators or the court for orders that have the effect of staying or preventing the arbitration, but the outcome of such steps, if taken, can at this stage only be speculative. I do not think I should determine the present application on the assumption that the arbitration will somehow be put to a premature end. Ms Lok submitted that there could be no inconsistent decisions as between the arbitration and the Turkish action in the Gebze court, because whichever decision is reached first will give rise to an issue estoppel binding upon the parties which are identical. This, with respect, missed the point: there will still be a risk of the outcome of the arbitration being inconsistent with the decision of the Istanbul court, even if the anti-suit injunction is refused, assuming the arbitration is concluded earlier than the Gebze court action. [5] If the anti-suit injunction is refused, and the Turkish proceedings and the arbitration co-exist, there may simply be an “ugly rush” [6] by the parties to get one set of proceedings decided ahead of the other, or a claim of the kind referred to in Tracomin SA v. Sudan Oil Seeds Co Ltd (No. 1) [1983] 1 WLR 1026 , 1036-1037 and by Leggatt LJ in The Angelic Grace , supra , at p 94. 75. For the reasons I have explained, I cannot, with respect, subscribe to Ms Lok’s submission that the position here is “on all fours” with Donohue v Armco Inc , The El Amria or Citi-March . In the respects mentioned above I think the situation here is materially quite different. Refusing the anti-suit injunction sought will not result in a single composite trial involving the parties here and the cargo insurers; even in Turkey there will be two sets of proceedings before two different courts. Nor will it remove the risk of inconsistent decisions between the arbitral process and the insurance litigation. Mere inconvenience to the buyers of having to fight both in Turkey and in Hong Kong is not sufficient. That is a consequence of the differences in the contracts that they have entered into: XL Insurance Ltd v. Owens Corning , supra , at p 543j. It may be noted that the buyers’ contract with MTI provides for Geneva arbitration, though there is nothing to indicate that such arbitration is being contemplated. Jurisdictional challenge in Turkey 76. The second matter relied upon by Ms Lok is that the shipowners had filed a challenge to the jurisdiction of the Turkish court, at the same time when they filed their points of defence on 2 March 2015, after obtaining the anti-suit injunction on an ex parte on notice basis. In circumstances where the shipowners have on their own volition decided to mount that challenge in Turkey, it would, Ms Lok submitted, be inappropriate for the Hong Kong court to “jump the gun” and determine whether the anti-suit injunction should continue. Instead, the Turkish court should be left to decide first whether to decline jurisdiction. 77. For this submission Ms Lok relied principally on the decision of Stone J in The Sumitomo Bank v. Xin Hua Estate Ltd (HCCL 256/1998; 5 February 1999), where his Lordship adjourned the hearing of an application for anti-suit injunction to restrain certain proceedings in the Guangdong Province on the ground that there was pending in the Guangdong court a dispute as to whether that court should decline jurisdiction. It is fair to say that Stone J followed the approach set out by Sopinka J in Amchem Products Inc. v. British Columbia (Workers’ Compensation Board) (1993) 102 DLR (4 th ) 96 at 118-119 as follows: “… the anti-suit injunction is unique in that the applicant does not have to establish that the assumption of jurisdiction by the foreign court will amount to an actionable wrong. Moreover, although the application is heard summarily and based on affidavit evidence, the order results in a permanent injunction which ordinarily is granted only after trial. In order to resort to this special remedy consonant with the principles of comity, it is preferable that the decision of the foreign court not be pre-empted until a proceeding has been launched in that court and the applicant for an injunction in the domestic court has sought from the foreign court a stay or other termination of the foreign proceedings and failed. If the foreign court stays or dismisses the action there, the problem is solved. If not, the domestic court must proceed to entertain the application for an injunction but only if it is alleged to be the most appropriate forum and is potentially an appropriate forum …” (Stone J’s emphasis) 78. Whether or not this is the correct approach in cases where an anti-suit injunction is sought on some other basis such as that the foreign proceedings are vexatious or oppressive, I need not comment upon. [7] The proper approach in an application for an anti-suit injunction on the basis of an arbitration clause has been laid down in The Angelic Grace , supra, where Millett LJ said at p. 96: “We should, it was submitted, be careful not to usurp the function of the Italian Court except as a last resort, by which was meant, presumably, except in the event that the Italian Court mistakenly accepted jurisdiction, and possibly not even then. That submission involves the proposition that the defendant should be allowed, not only to break its contract by bringing proceedings in Italy, but to break it still further by opposing the plaintiff s application to the Italian Court to stay those proceedings, and all on the ground that it can safely be left to the Italian Court to grant the plaintiff’s application. I find that proposition unattractive. It is also somewhat lacking in logic, for if an injunction is granted, it is not granted for fear that the foreign Court may wrongly assume jurisdiction despite the plaintiffs, but on the surer ground that the defendant promised not to put the plaintiff to the expense and trouble of applying to that Court at all. Moreover, if there should be any reluctance to grant an injunction out of sensitivity to the feelings of a foreign Court, far less offence is likely to be caused if an injunction is granted before that Court has assumed jurisdiction than afterwards, while to refrain from granting it at any stage would deprive the plaintiff of its contractual rights altogether.” 79. An anti-suit injunction sought on the present basis does not involve any assertion that the Hong Kong court or arbitral tribunal is a superior or better forum either for the resolution of the dispute in question or generally. It seeks simply to uphold the parties’ contract to resolve any dispute within the scope of the clause by arbitration. Had a court action been brought in Hong Kong in breach of the arbitration clause, it would equally readily have been stayed by the Hong Kong court. The considerations of comity that exercised Stone J’s mind in the Sumitomo Bank case do not, in my view, arise in the same way in this kind of case. As Toulson J (as he then was) said in XL Insurance Ltd v. Owens Corning [2001] 1 All ER (Comm) 530 at 544a: “The grant of an anti-suit injunction involves by definition a degree of interference with foreign court procedures, because that is its object. But if the English court is satisfied that litigation in another country would be a breach of contract to arbitrate the dispute in London, the grant of an injunction involves no disrespect or unfriendliness towards the foreign court, but merely an insistence on the parties respecting their own contractual obligations.” Toulson LJ made a similar statement in Deutsche Bank AG v. Highland Crusader Partners LP [2010] 1 WLR 1023 at 1036F §50 which was quoted with approval by the Court of Appeal in Compania Sud Americana de Vapores S.A. v. Hin-Pro International Logistics Ltd , supra, at §§56-57 (quoted in paragraph 44 above). The Court of Appeal added that the same can be said for a case where a Hong Kong court is asked to enforce an exclusive jurisdiction clause in favour of the Hong Kong forum. 80. In the present case, the shipowners have credibly explained that they put in a jurisdictional challenge because they had to file their points of defence under the Turkish rules of procedure, and had they done so without challenging jurisdiction they could be taken to have submitted to jurisdiction. There has not been any hearing of the jurisdictional challenge or any evidence of any step taken by the Turkish court to determine it. In these circumstances I do not think that the existence of the jurisdictional challenge in Turkey is a strong reason for departing from the general rule. Delay 81. Thirdly, Ms Lok submitted that the shipowners had been guilty of delay in seeking the injunction. I accept the shipowners’ contention that because the arrest proceedings could fairly be regarded as proceedings brought by the buyers to obtain security for their claim rather than to have the substantive dispute determined, they were not a breach of the arbitration clause: Ultisol Transport Contractors Ltd v. Bouygues Offshore SA [1996] 2 Lloyd’s Rep 140, 144-145. [8] The first time there was a breach was when the buyers filed their points of claim in Turkey on 8 January 2015. From then on events had moved fairly swiftly. The shipowners asked the buyers by letter of 5 February to withdraw the Turkish proceedings and applied to the Hong Kong court on 27 February, after receiving the reply the day before. In these circumstances I do not consider that the injunction had been sought with any significant delay, nor had the Turkish proceedings become too far advanced. VII. CONCLUSION 82. As the buyers have not been able to establish the alleged misconduct on the part of the shipowners, the preliminary objection of unclean hands fails. On the established authorities, the shipowners are prima facie entitled to an injunction to restrain the buyers from pursuing legal proceedings in Turkey on the ground that such pursuit constitutes a breach of the implicit negative covenant in the arbitration clause. 83. It is to be recalled that the principle is that parties should generally be held to their contract, and that this is reflected in the requirement that a party must show strong reason before the court will refuse an anti-suit injunction sought against him on the basis of an arbitration clause. The question is not determined simply by a balance of convenience, or by weighing the appropriateness of each forum for the trial of the dispute. For the reasons I have given above neither the existence of proceedings in Turkey between the buyers and their insurers nor the shipowners’ pleaded challenge of the Turkish court’s jurisdiction constitutes a sufficient reason to refuse the injunction. Nor do I think there had been any such delay in the application as to warrant its refusal. 84. I should mention that the shipowners had at the outset offered a transfer of the security from Turkey to Hong Kong if the Turkish action was terminated as a result of the injunction. There was at one stage some concern on the part of the buyers that there would be an unsecured gap during the transfer but the shipowners had apparently been able to devise a proposal to allay such concerns. At the hearing the buyers made no mention of the loss of security as potential prejudice resulting from the grant of the injunction. If necessary the parties should incorporate such mechanism in the draft order for my approval. 85. In addition as mentioned above the issue of the injunction is conditional upon the shipowners’ consent for the record of the evidence given and the award made in the arbitration to be made available to the Istanbul court for the purposes of the proceedings between the buyers and their insurers. 86. Subject to these two matters, there will therefore be an order that the injunction do continue until further order. I also make a costs order nisi that the shipowners have the costs of the summons dated 2 March 2015 and the costs of the ex parte application on 27 February 2015. (Godfrey Lam) Judge of the Court of First Instance High Court Mr Nick Luxton, instructed by Holman Fenwick Willan, for the plaintiff Ms Frances Lok, instructed by Ince & Co, for the defendant [1] “More or less, at charterer’s option” [2] The shipowners have since withdrawn the notice insofar as Yucel is concerned. [3] relying on the line of authorities represented by The Rena K [1979] 1 QB 377 [4] See s. 3 of the (UK) Carriage of Goods by Sea Act 1992; c.f. s. 5 of the (HK) Bills of Lading and Analogous Shipping Documents Ordinance ( Cap. 440 ). [5] If the Gebze court reaches a decision first, there is of course equally the risk of its decision being inconsistent with that of the Istanbul court, which is the point I have already referred to earlier. [6] Per Lord Brandon in The Abidin Daver [1984] 1 AC 398 , 423H-424A [7] See, in that connection, Dicey, Morris & Collins, The Conflict of Laws (15 th ed), §12-090. [8] This point was not affected by the decision on appeal reported in [1998] 2 Lloyd’s Rep 461. Look up this case on Lawcite Noteup",
  "length": 90335,
  "headers_seen": [
    "I. INTRODUCTION",
    "II. FACTUAL CONTEXT",
    "The sale and purchase of goods",
    "The carriage of goods",
    "The discharge of the cargo",
    "The arrest of the ship",
    "The Turkish action, the arbitration and the present proceedings",
    "III. JURISDICTION TO GRANT ANTI-SUIT INJUNCTION ON THE BASIS OF AN ARBITRATION CLAUSE"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2015/602",
  "query": "anti-suit injunction",
  "ts": "2025-10-16T10:47:08",
  "ok": true
}