{
  "title": "AIG INSURANCE HONG KONG LTD V. LYNN MCCULLOUGH AND ANOTHER | [2019] HKCFI 1649 | HKLII",
  "court": null,
  "year": 2019,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2019] HKCFI 1649 AIG INSURANCE HONG KONG LTD V. LYNN MCCULLOUGH AND ANOTHER Judgment Information Date 2 Jul, 2019 Action No. HCMP2216/2018 Neutral Cit. [2019] HKCFI 1649 Parallel Cit. [2019] 3 HKLRD 641 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCMP2216/2018 HCMP2216/2018 AIG INSURANCE HONG KONG LTD v. LYNN MCCULLOUGH AND ANOTHER HCMP 2216/2018 [2019] HKCFI 1649 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE MISCELLANEOUS PROCEEDINGS NO 2216 OF 2018 ________________________ BETWEEN AIG INSURANCE HONG KONG LIMITED Plaintiff and LYNN MCCULLOUGH 1 st Defendant WILLIAM MCCULLOUGH 2 nd Defendant ________________________ Before: Deputy High Court Judge Blair in Chambers Date of Hearing: 23 April 2019 Dates of Further Written Submissions: 24 May, 5 and 10 June 2019 Date of Decision: 3 July 2019 ______________ DECISION ______________ 1. This case was begun by Originating Summons dated 18 December 2018. The underlying issue is how coverage under an insurance policy is to be determined. Is it to be determined by HKIAC (Hong Kong International Arbitration Centre) arbitration in Hong Kong as the policy provides, and as the insurer contends, or is it to be determined in the US Federal Court in Miami, Florida, USA, as the defendantscontend? The defendants are not the insured under the policy, and they argue that their cause of action against the insurer is a freestanding tortious claim, and that as non-parties, they cannot be compelled to arbitrate it. 2. The principal question for decision is whether to continue an ex parte anti-suit injunction granted by DHCJ Simon Leung on 18 December 2018 on the application of the plaintiff, AIG Insurance Hong Kong Ltd (“AIG”). AIG is a Hong Kong company part of the American AIG insurance group. The defendants are Mrs Lynn McCullough and Mr William McCullough (“the McCulloughs”), who are US citizens resident in Texas, USA. 3. The injunction restrains the McCulloughs from pursuing proceedings in the US District Court for the Southern District of Florida, Miami Division (“the Miami court”) against AIG without regard to the insurance policy in question, which provides for arbitration in Hong Kong. They are not parties to the insurance policy, and a central question is whetherthe Miami proceedings amount in substance to a claim to enforce the policyso that, the plaintiff contends, the effect of the case law is that they are bound by the agreement to arbitrate. There are other issues raising matters more broadly of a discretionary nature, including a submission that the injunction is vitiated by procedural impropriety, and a failure to make full and frank disclosure. 4. The applications before the Court are: (1) An application by AIG by summons dated 20 December 2018 for the continuation of the ex parte injunction. This injunction restrained the defendants from taking any action including but not limited to the further conduct of a Third Amended Complaint filed by the defendants against AIG and others in theMiami court on 20 August 2018. This injunction was continued until trial or further order by DHCJ William Wong SC on 28 December 2018. There is a corresponding application by the defendants to set aside the injunction by summons dated 31 December 2018 (this was taken out to avoid any arguments that the continuation issue had already been decided at the 28 December 2018 call-over). (2) An application issued by the defendants by summons dated 15 February 2019 pursuant to Order 12, rule 8 of the Rules of the High Court (Cap 4A) seeking (a) an order to set aside the order of DHCJ Leung granting leave to AIG to serve the Originating Summons and the summons dated 20 December 2018 on the McCulloughs out of the jurisdiction,(b) a declaration that the Court should not exercise any jurisdiction it may have, and (c) an order staying the action in favour of the proceedings in the Miami court. 5. There have been parallel proceedings in Miami by way of a motion filed by AIG on 29 November 2018 to compel arbitration in Hong Kong. At the time of the hearing in this court on 23 April 2019, the Miami court had not given its decision on the motion. It did so on 10 May 2019, refusing the motion. I gave the parties the opportunity to make further submissions in writing in light of this decision, and AIG’s subsequent appeal, which they did on 24 May, 5 June and 10 June 2019. UNDERLYING FACTS 6. The underlying facts relate to a tragic accident which took place in St Lucia, in the Eastern Caribbean. On 15 July 2015, Mr and Mrs McCullough were vacationing on board a ship in the Royal Caribbean Cruise Lines Ltd fleet. That day, they went on an excursion called Rain Forest Sky Rides “Adrena Line” which was as the name suggests a zip line. 7. The evidence is to the effect that the zip line was owned and operated by Rain Forest Adventures (Holdings) Ltd, Harald Joachim von der Goltz, Rain Forest Sky Rides Ltd and Rain Forest Tram Ltd. 8. After completing most of the zip line course, the McCulloughs arrived on a platform from which guests were lowered to the ground by rope and harness. They were never informed of this procedure, and had they been informed that the excursion involved it, they would not have participated in the excursion. 9. Mrs McCullough was hooked up to be dropped through the hatch and belayed to the ground, but when securing her to her harness and facilitating her descent, the platform guides failed to use the back-up safety rope and failed to verbally communicate to each other to ensure her safe descent. 10. Mrs McCullough was dropped through the platform hatch and fell unrestrained and unobstructed approximately 43 feet to the ground,landing on her back. Among other injuries, she was rendered permanently quadriplegic as a result of the fall. 11. AIG had issued a Directors’ and Officers’ (“D&O”) Liability Insurance Policy with a limit of US$5,000,000 plus a US$50,000 Bodily Injury and Property Damage Defence Costs extension to Rain Forest Adventures (Holding) Ltd and covered the policyholder and its directors in respect of the insured risks. Mr von der Goltz was a director of the policyholder and therefore an insured person. 12. AIG has met Mr von der Goltz’s defence costs, but its case is that there is a Bodily Injury and Property Damage exclusion under clause 3.3 of the Policy (such risks, it says, being more commonly insured via a general liability insurance policy rather than a D&O policy intended to protect directors). Hence, it says, the injuries suffered by Mrs McCullough are not covered by the policy. PROCEDURAL HISTORY IN MIAMI 13. The procedural history in Miami, and how AIG comes to be a party, is somewhat complex. In summary, on 15 January 2016,the McCulloughs filed a lawsuit in the Miami court against several defendants, including the Rain Forest companies alleging negligence in the operation of the zip line excursion. They sought damages for the injuries Mrs McCullough sustained, including economic and non-economic damages. 14. Following discovery, a Second Amended Complaint was filed on 14 July 2016 adding in Mr von der Goltz as a defendant, who gave notice to AIG that he was seeking an indemnity under the policy as a director of the policyholder. The claim was rejected by AIG save as to defence costs, on the grounds (among others) that the policy did not insure him against claims from bodily injury. 15. On 24 April 2018, a dispute resolution agreement was entered into by the McCulloughs and the Rain Forest defendants now including Mr von der Goltz. This agreement was approved by the Miami court on 27 April 2018 which referred the matter to arbitration. AIG says that although it knew that the matter had been referred to arbitration, it was not aware that the parties (including Mr von der Goltz) had entered into a pre-arbitration “high-low” agreement, whereby it was agreed that the McCulloughs would receive not less than US$30 million but not more than US$65.5 million in the arbitration. 16. The award was issued on 28 May 2018, and judgment was entered into on 12 July 2018 in favour of the McCulloughs against among others Mr von der Goltz, in the sum of the agreed maximum of US$65.5 million. 17. On 20 August 2018, the McCulloughs filed the Third Amended Complaint adding AIG as a defendant. The Third Amended Complaint contains, to quote the McCulloughs’ written submissions, a “common law tort claim available under Florida law against [AIG] for having failed to act in good faith in handling, litigating, and settling the US Proceedings, resulting in an excess judgment (i.e. judgment in excess of Policy limits) being entered into against the insured, Mr. von der Goltz”. This has been called the “bad faith” claim against AIG. 18. The nature of the allegation is that if AIG had honoured the policy and provided Mr von der Goltz with US$5 million in coverage (ie the policy limit), it would have been possible for him to have settled the McCulloughs’ claim. It is said that this failure by AIG exposed him to a liability of US$65.5 million and as a result, he has a claim against AIG for this amount. The right to claim directly against AIG for the US$65.5 million is said to be based on the McCulloughs being judgment creditors of Mr von der Goltz. 19. By now, AIG had given notice to Mr von der Goltz that it was invoking the disputes procedure in the insurance policy. Clause 8.9 of the policy is set out below. 20. On 29 November 2018, AIG filed a Motion with the Miami Court to compel arbitration in Hong Kong and to dismiss the Third Amended Complaint. 21. The McCulloughs point out that AIG’s motion in Miami to compel arbitration is of similar, if not identical, effect to the anti-suit injunction AIG obtained from DHCJ Leung in Hong Kong on 18 December. 22. On 19 December 2018, the McCulloughs applied in Miami to enjoin AIG from taking further action in Hong Kong (this was called in argument an “anti-anti-suit injunction”). On 20 December 2018, they filed an opposition brief to AIG’s motion to compel arbitration. THE DECISION IN THE MIAMI PROCEEDINGS 23. On 18 January 2019, the Judge of US District Court for the Southern District of Florida, the Honorable Darrin P Gayles, heard the parties on AIG’s motion to compel arbitration. Counsel for AIG made it clear that AIG was arguing that only the question of coverage should be dealt with in the arbitration, not the entire “bad faith” claim. 24. At the time of the hearing in this court on 23 April 2019, JudgeGayles had not given his decision on the motion. He did so on 10 May 2019. 25. The judge held that: (1) the Florida courts limit third party bad faith actions against an insurer to cases where coverage has been determined. A coverage determination is necessary because a bad faith failureto settle a claim is founded on the obligation of the insurer to paywhen all conditions under the policy would require an insurer exercising good faith and fair dealing towards its insured to pay. An injured third party must therefore first obtain “ a resolution ofsome kind in favor of the insured ” on the coverage issue before pursuing his bad faith claim against the insurer. Judge Gayles pointed out that AIG contests coverage under the Policy becauseit excludes payment for bodily injury and there is no underlyingdetermination of coverage—only a Final Judgment against the Rain Forest Defendants on the issue of their liability. He held that because coverage is a threshold issue, the McCulloughs’ bad faith claim is premature. (2) The second issue was whether a signatory to an arbitration agreement (ie AIG) can compel a non-signatory (ie the McCulloughs) to arbitration under the Convention on the Recognition and Enforcement of Foreign Arbitral Awards, 9 USC §§201–08 (“the New York Convention”). The judge held that the Eleventh Circuit has unequivocally determined that non-signatories cannot be bound to arbitration agreements under the New York Convention under theories of estoppel or third party beneficiary. Thus, because there is no agreement signed by both parties, the McCulloughs cannot be compelled to arbitrate. (3) As to whether the action should be stayed or dismissed pendingresolution of the coverage issue, because the McCulloughs’ bad faith claim is premature until coverage under the policy has been established, the judge directed that the case be stayed. 26. On 17 May 2019, theMcCulloughs tookoutamotiontoliftthestayandforleavetofileaFourthAmended Complaint seekinga declaration regardingthe extent towhich thereis coveragefor theMcCulloughs’ establisheddamages. 27. On 29 May 2019, AIG filed Notice of Appeal against this decision. THE DEFENDANTS’ CONTENTIONS 28. The main points argued for the McCulloughs are as follows. 29. In obtaining the injunction, AIG presented the case as being an application for an anti-suit injunction to prevent the McCulloughs from litigating proceedings in the Miami court “in breach of a dispute resolution clause that requires inter alia arbitration in Hong Kong under Hong Kong law”. However, the only issue sought to be determined by AIG in HKIAC Arbitration is the construction of coverage under the relevant clauses in the policy by way of preliminary issue. There is nothing to be “tried” in Hong Kong, as the scope of coverage of the policy is an issue of construction. Parties can save time and effort by submitting expert reports on Hong Konglaw to the Miami court, allowing that court to decide on the issue of standing. 30. AIG has chosen to embark upon a disproportionate course of (i) starting two actions in Hong Kong and the US, seeking similar/identical relief (to stop the US proceedings in favour of arbitration) without electing which forum is preferred; and (ii) claiming it wants to “try” the discrete legalissue of contractual interpretation in Hong Kong dragging Mrs McCullough and other Florida witnesses to litigate a dispute that has no connection to Hong Kong. 31. The fact that AIG is only purporting to litigate in the HKIAC on the preliminary issue of coverage under the policy amounts to material non-disclosure at the ex parte hearing, and even on AIG’s own case, the McCulloughs are not, in substance or otherwise, asserting a contractual liability under the policy, and are not bound by the arbitration clauses in the policy. 32. The deputy judge’s order giving leave to serve out of the jurisdiction on the McCulloughs should be set aside on the grounds that: (1) AIG fails to show to a high degree of probability that the McCulloughs are bound by the dispute resolution clause in thepolicy for getting through the jurisdictional gateway. They are not parties to the policy, they are not asserting a contractual liability in the US proceedings under the policy so as to make themselves bound by the policy, and the provisions of the policy cannot be relied upon by AIG to assert jurisdiction over the McCulloughs in Hong Kong. (2) For the same reasons, there is no serious issue to be tried. (3) AIG fails to show that Hong Kong is distinctly and clearly the most appropriate forum for the resolution of the dispute. There was also serious material non-disclosure at the ex parte hearing in respect of matters relating to service out. 33. If the service out order is discharged, that brings an end to the proceedings because the originating summons cannot be served under the court’s long-arm jurisdiction. 34. Without prejudice to the primary position: (1) The injunction should be immediately discharged without needing to go into the merits as it was obtained by an abuse of process and there is no reason why the wrongfully obtained injunction should be allowed to remain. (2) There is no basis for an anti-suit injunction to be granted as AIG fails to demonstrate a high degree of probability that the defendants are bound by the policy. (3) There are reasons why AIG should not be entitled to the discretionary remedy. 35. Should it be necessary to consider the stay of the Hong Kong proceedings in favour of the US proceedings in the Miami court, a stay oughtto be granted on forum non conveniens grounds as that court is an alternative forum in which the case can be tried more suitably for the interests of the parties and for the ends of justice. 36. For the same reasons, the Hong Kong court should not exercise any jurisdiction over the matter because the Miami court is the more appropriate forum. 37. The decision of the Miami court on 10 May 2019 is determinative of AIG’s present application in the Hong Kong court. The Miami court being a court of competent jurisdiction to which AIG has chosen to subject itself has already determined where the coverage issue should be determined, and the Hong Kong court should be very slow to hand down an inconsistent judgment as a matter of judicial comity. 38. Whilst Judge Gayles did not expressly mention forum conveniens in his judgment, he did positively dismiss AIG’s motion to compel arbitration in Hong Kong. Thus, it can be reasonably understood that the judge has implicitly determined the appropriate forum regarding coverage to be the Miami court. 39. AIG has taken inconsistent stances. Its appeal to the 11 th Circuit shows that it takes the position that it can litigate in Florida at its choosing, notwithstanding its submissions to the Hong Kong court that it is the most appropriate forum to determine the matter. 40. In light of the appeal, an anti-suit injunction in Hong Kong is no longer necessary since AIG is again seeking the same relief in the 11 th Circuit. AIG’S CONTENTIONS 41. The main points argued for AIG are as follows. 42. As regards continuation of the injunction, the Hong Kong courtis not being asked to determine any part of the “bad faith” claim. AIG is not contending that the McCulloughs cannot bring that claim in Miami in due course, but it is currently premature because the liability of AIG to indemnifyMr von der Goltz under the policy has not been established and is in dispute. AIG is entitled to have that dispute determined by way of a Hong Kong arbitration, and has taken steps to do so. 43. At an early stage after the accident, AIG declined cover to Mr von der Goltz under the policy, except in respect of defence costs, because: (1) The policy did not insure him in respect of the type of claims brought against him by the McCulloughs (i.e. bodily injury). (2) He had breached policy conditions entitling AIG to decline cover. (3) The dispute resolution clause requires (after two prior steps) arbitration in Hong Kong of any disputes. AIG has initiated the provisions against Mr von der Goltz. (4) The bad faith claims by the McCulloughs against AIG are premised upon AIG being liable to indemnify Mr von der Goltz in respect of his liability. Without such an obligation to indemnify, AIG cannot have acted in bad faith. (5) AIG is entitled to have that obligation determined under the dispute resolution provisions of the policy in accordance with Hong Kong law in an arbitration seated in Hong Kong, whether the determination is necessary for a claim by Mr von der Goltz under the policy, or for the purposes of a claim by the McCulloughs brought in Miami alleging bad faith by AIG against its insured. (6) AIG is entitled to an anti-suit injunction in Hong Kong as the supervisory jurisdiction of the arbitration to prevent the McCulloughs from proceeding in Miami until the obligation of AIG to indemnify Mr von der Goltz has been determined in its proper forum. 44. As regards the McCulloughs’ contentions: (1) The forum non conveniens points do not arise. (2) The question whether the court ought to have granted the anti-suit injunction is not open to the McCulloughs at this stage since DHCJ William Wong SC continued the injunction until trial or further order. (3) Absent any obligation to indemnify, no bad faith claim gets off the ground. It makes no difference to that proposition if the bad faith claim is a claim in tort. (4) The McCulloughs’ case in Miami does not include an allegation that AIG owed any independent duty to the McCulloughs. (5) AIG’s entitlement to arbitration in Hong Kong should be enforced notwithstanding that the McCulloughs are not party to the arbitration clause. (6) AIG is entitled to have its obligation to indemnify determined in accordance with the arbitration clause even as regards a third party who seeks to rely upon that obligation. 45. The injunction should not be set aside on the procedural grounds: (1) The ex parte on notice application was appropriate. (2) There was no material non-disclosure, it having been made clear that it was only the question of coverage that would be referred to arbitration. (3) The risk of inconsistent findings is always a concern in an anti-suit injunction. (4) There is no material delay. (5) AIG is not being selective in its approach, and has not failed to deal appropriately with the Allocation Clause in the policy. 46. Aside from its application to set aside the default judgment, AIG’s only application in the Miami proceedings has been its Motion to Compel Arbitration which is to resist jurisdiction and is not a submission to the jurisdiction. 47. Its appeal in Miami, insofar as it has been held that the McCulloughs could agree in writing to accede to the rights of AIG’s insured to recover under its policy without also agreeing to arbitrate in Hong Kong is part and parcel of AIG’s application to resist jurisdiction. There is no inconsistency in its stance. 48. The injunction remains necessary to prevent a breach of the disputes clause by the McCulloughs bringing new proceedings for a declaration in relation to the coverage issues. Judge Gayles’ decision makes the issuance of the injunction even more important, because the court has held that, under Florida law, it cannot enforce the terms of the disputes clause. The Hong Kong court must, therefore, protect the rights of AIG as the party to a Hong Kong policy, and a Hong Kong arbitration clause. THE DISPUTE RESOLUTION AND GOVERNING LAW CLAUSES 49. The starting point in considering the parties’ contentions is Clause 8.9 of the insurance policy which provides for dispute resolution in Hong Kong as follows: “ Disputes Except as otherwise specifically provided, any dispute regarding any aspect of this policy or any matter relating to cover thereunder which cannot be resolved by agreement within six (6) months, shall first be referred to mediation at Hong Kong International Arbitration Centre (HKIAC) and in accordance with its Mediation Rules. If the mediation is abandoned by the mediator or is otherwise concluded without the dispute or difference being resolved, then such dispute of difference shall be referred to and determined by arbitration at HKIAC and in accordance with its Domestic Arbitration Rules. The language to be used in the arbitral proceedings shall be English. The Insurer and the Insured shall each be responsible for their own costs and expenses incurred in the arbitration.” 50. Clause 8.12 of the insurance policy provides for Hong Kong law as the governing law as follows: “ Governing Law Any interpretation of this policy or issue relating to its construction, validity or operation shall be determined by the laws of the Government of the Hong Kong Special Administrative Region.” THE CHARACTERISATION ISSUE The case law on the effect of the arbitration clause in the insurance policy 51. It is not in dispute that at common law, the court’s approach in cases between parties to an arbitration agreement is that an anti‑suit injunction will ordinarily be granted to restrain a party from suing in a non‑contractual forum unless there are strong reasons to the contrary. As it was recently put in Dickson Valora Group (Holdings) Co Ltd v Fan Ji Qian [2019] HKCFI 482 at §18 (Godfrey Lam J), the fountainhead of the principles underlying that approach is the decision of the English Court of Appeal in The Angelic Grace [1995] 1 Lloyd’s Rep 87, which has been applied in Hong Kong in Ever Judger Holding Co Ltd v Kroman Celik Sanayii Anonim Sirketi [2015] 2 HKLRD 866 and Sea Powerful II Special Maritime Enterprises (ENE) v Bank of China Ltd [2016] 1 HKLRD 1032; [2016] 3 HKLRD 352 (CA); see also Compania Sud Americana de Vapores SA v Hin-Pro International Logistics Ltd (2016) 19 HKCFAR 586 at §57. This approach holds the parties to their contractual choice of arbitration, the anti-suit injunction being granted by the court as the court of the seat of the arbitration. 52. However, the McCulloughs are not parties to the insurance policy with its arbitration clause. As explained above, their claim in the Miami court is not brought under the policy. It is a “bad faith” claim, which is a common law tort claim available against an insurer for having failed to act in good faith in dealing with proceedings against an insured, resulting in the insured being held liable in excess of the policy limits. 53. Accordingly, the McCulloughs contend that the anti-suit injunction cases have no application in the present case. They cannot be injuncted from suing in breach of the arbitration agreement, because they are not party to the agreement. Further, permission should not have been given to serve the injunction proceedings on them out of the jurisdiction, because the gateway relied upon was the contractual gateway which does not apply. 54. AIG’s response is that in substance the McCulloughs are seeking to enforce obligations under the insurance policy, and must take those obligations consistently with how the insurer offered them. An essential element of the bad faith claim is the liability of the insurer, and under the policy in case of dispute that liability is to be established in arbitration in Hong Kong. 55. Though they take opposite positions as to the outcome, both sides are in agreement, therefore, that a central issue is the characterisation of the McCulloughs’ claim in the Miami proceedings. Is it an independent claim in tort, or is it in substance a claim to enforce the policy? They are also in agreement that characterisation is governed by the lex fori , here the law of Hong Kong ( Macmillan Inc v Bishopsgate Investment Trust plc (No 3 ) [1996] 1 WLR 387, 407B–C). 56. In the Dickson Valora case, ibid , at §§28 – 47, Godfrey Lam J reviewed the authorities. The principle that a party to an arbitration agreement will be held to the agreement by the grant of an anti-suit injunctionwas later applied to insurers seeking to exercise rights by way of subrogation. Applying The Jay Bola , it was held that the duty to refer a claim to arbitration is an inseparable component of the subject matter transferred to the subrogated insurers ( Schiffahrtsgesellschaft Detlev von Appen GmbH v Wiener Allianz Versicherungs AG and Voest Alpine Intertrading GmbH (The Jay Bola) [1997] CLC 993; West Tankers Inc v RAS Riunione Adriatica di Sicurta SpA (The Front Comor) [2005] 2 Lloyd’s Rep 257 at §33). 57. Subsequent cases apply the same principle to statutes which give persons the right to sue an insurer directly. It was held by the English Court of Appeal that the question is whether the right which the plaintiff seeks to enforce is in substance contractual in nature or an independent right created by the legislation ( Shipowners’ Mutual Protection and Indemnity Association (Luxembourg) v Containerships Denizcilik Nakliyat ve Ticaret AS (The Yusuf Cepnioglu) [2016] 1 CLC 687 not following Through Transport Mutual Insurance Association (Eurasia) Ltd v New India Assurance Association Co Ltd (The Hari Bhum) [2004] EWCA Civ 1598). 58. At §55 in The Yusuf Cepnioglu , Moore-Bick LJ further defined the principle in terms that can apply to any “remote party” (that is, a person who has become entitled to enforce an obligation but is not a party to a contract of any kind with the defendant—§49), saying that: “ … The Jay Bola proceeds on the basis that the right to have the claim against it determined by arbitration is an incident of the obligation which the claimant is seeking to enforce and does not depend on the existence of a contract between the claimant and the defendant. If that is right, there is no distinction of principle between the position of a claimant who is an original party to a contract containing an arbitration clause and one who is a remote party …. The grounds upon which equity will intervene, as explained in The Jay Bola , are the same in each case, namely, to protect the defendant’s right to have the claim determined in arbitration.” 59. In Qingdao Huiquan Shipping Company v Shanghai Dong He Xin Industry Group Co Ltd [2018] EWHC 3009 (Comm), the principle was applied in a case where, notwithstanding an alleged subsequent contract, the substance of the claim had its foundation in a settlement agreement, binding the defendant to an arbitration clause though the defendant was not a party to the agreement. As it was put, the defendant “… is not entitled to found a claim on rights arising out of a contract without also being bound by the forum provisions of that contract” (Bryan J at §31). 60. Clearly, difficult questions may arise as to how any particular claim brought by a “remote party” is to be characterised for these purposes. In The London Steamship Owners’ Mutual Insurance Association Ltd v The Kingdom of Spain (The Prestige) [2015] 2 Lloyd’s Rep 33, which again concerned a statutory right enabling an injured party to bring a direct claim against an insurer, the English Court of Appeal cited Macmillan v Bishopsgate Investment Trust ( ibid ), in which it was said that, “In order to ascertain the applicable law under English conflict of laws, it is not sufficient to characterise the nature of the claim : it is necessary to identify the question at issue .” 61. One of the questions in that case was whether the insurer was entitled to raise a defence available under the policy. In considering how that affected characterisation, Moore-Bick LJ said at §§25 – 26 that: “ …the critical question is what, in substance, was the nature of the right that the legislation was seeking to confer on the third party. Where a wrongdoer is insured against liability of some kind it will be possible to identify an insurer who may be held liable in his place, but, unless the legislation is intended to work in an arbitrary fashion, it will be necessary to establish that the contract covers the liability in question. That in turn means ascertaining the limitsof the insurer’s obligation, which also means that he should be able to raise any defences that would be available to him in an action brought by the insured. If the legislation conferring a direct right of action against the insurer recognises that in substance that is the case, it is difficult to resist the conclusion that its intention and effect is to enable the third party to enforce against the insurer the same obligations as those that could have been enforced by the insured himself. If, on the other hand, the legislation prevents theinsurer from relying in defence of a claim on important provisions which define the scope of his liability, one may be driven to the conclusion that the legislation has created a new right which is not intended to mirror in substance the insurer’s liability under the contract. In some cases it may not be easy to decide on which side of the line the case falls, but the court must ultimately determine whether the right conferred on the claimant is in substance one to enforce the obligation created by the contract of insurance or one to enforce a liability which is independent of the contract. In the former case the nature and scope of the obligation will be governed by the law under which it was created, in a case of this kind the proper law of the contract. In the latter it will be governedby the law of the country whose legislation created it. One usefulindication may be the extent to which the law creating the right of direct action seeks to modify the scope of the obligation to which the contract would otherwise give rise.” It was held that the pursuit by the Kingdom of Spain of claims that were subject to arbitration amounted to an adoption of the arbitration agreements. 62. In the Dickson Valora case itself, these authorities were applied where the defendant brought proceedings in the Shenzhen Qianhai Cooperation Zone People’s Court in the Mainland to recover a success fee payable to him in a contract to which he was not a party. In granting an anti-suit injunction, Godfrey Lam J said at §46: “ Even if Fan is not an assignee of the DHE’s rights under the contract, it is plain that his rights to the success fee, if any, are derived from the promise made by the Companies to DHE, ofwhich the arbitration clause forms an inseparable part. The promise of the success fee was subject to the enforcement mechanism chosen by the parties to the contract, namely, arbitration in Hong Kong. Insofar as he has any direct right, Fan’s claim is clearly one ‘arising out of or relating to’ the contract and is justiciable only in accordance with that contractual mechanism. It is no less unconscionable of Fan to make a claim under the contract in a different forum than it would be for DHE to do so, even though there would be a breach of contract only in the latter case: see The Jay Bola at p.1001D–F. In pursuing court proceedings in the Mainland against the Companies, Fan is seeking to claim a benefit under the contract without recognising the condition to which it is plainly subject. Such conduct in my view falls within the principles expounded in The Angelic Grace , The Jay Bola and The Yusuf Cepnioglu . The Companies have the right to prevent a claim against them based on their contractual obligations being pursued otherwise than by the contractually agreed mode, viz arbitration in Hong Kong. Unless an injunction is granted such right will be rendered wholly ineffective and valueless.” The case law applied to the present facts 63. On behalf of the McCulloughs, it is submitted that AIG bears the burden of proving to a high degree of probability that the McCulloughs are bound by the policy and hence its disputes clause and governing law clause. It falls far short of doing so, because the claim of “bad faith” under Florida common law is a tortious claim, whereas AIG’s liability depends on whether it had acted properly or promptly in handling, litigating, and settling the US proceedings. It is completely independent of whether AIG has breached the policy vis-à-vis the insureds: (1) The McCulloughs are not signatories to the policy and are bringing their claim in their own right and not on behalf of or as an assignee of the contract rights of the insured, Mr von der Goltz. (2) The McCulloughs’ claim in the Miami proceedings is a common law tort claim, allowing a third party to sue an insurer where the insurer has failed to act in good faith in handling a claim brought by the third party against an insured, resulting in an excess judgment being entered into against the insured. (3) This common law tort claim is entirely separate from any contractual breach claim under an insurance policy, and the scope is wider than a contractual claim. Under Florida law, the McCulloughs’ locus to launch the Third Amended Complaint is based on the status afforded to them as persons who possess an independent right to pursue the insurer. See MacOla v Government Employees Ins Co , 953 So 2d 451 (2006). (4) AIG’s argument that the McCulloughs “are attempting selective enforcement of the D&O Policy to cover their $66.5 million judgment, without being bound by the D&O Policy terms, including the Disputes Clause” is wrong, because the bad faith common law action under Florida law is independent from the contract and specifically allows the McCulloughs to claim sums that are over the policy limits (since it is unrelated to any contractual claim under the policy). (5) Whilst the insured (Mr von de Goltz) has a right to sue an insurer under (i) a “bad faith” claim and (ii) a breach of policy claim, in which case the insured may be bound by the arbitration clause in the policy, it cannot logically follow that,by virtue of a third party bringing forth a “bad faith” claim, he is bound by the arbitration agreement. (6) AIG’s argument that the McCulloughs must demonstrate that there is coverage under the policy before they can have standing to litigate the claim in Florida only goes to whether they can bring the claim in Florida, and has little, if anything, to do with the characterisation of the McCulloughs’ claim under Hong Kong law. 64. On behalf of AIG it is submitted that: (1) Based upon a proper classification of the issues in the Miami proceedings, the first issue to be determined is whether AIG had any obligation to indemnify Mr von der Goltz. Absent any obligation to indemnify, no bad faith claim gets off the ground. It makes no difference to that proposition if the bad faith claim is a claim in tort, or whether it can result in damages greater than the policy excess. (2) The McCulloughs’ case in Miami is that AIG owed a duty not to abandon Mr von der Goltz in the proceedings and did so with the result that he was exposed to a higher figure for damages than he would otherwise have been. As his judgment creditors,they claim to have an independent right to bring the claim directly against AIG. But there is no allegation that AIG owed any independent duty to the McCulloughs. (3) AIG’s entitlement to arbitration in Hong Kong should be enforced notwithstanding that the McCulloughs are not party to the arbitration clause. Their claim is premised upon disputed coverage, the resolution of which is to be achieved in the forum that AIG has contracted for. Once the obligation to indemnify is determined, the McCulloughs will be free to bring their claim in Miami. (4) The real issue to be determined is the proper classification of theissues in the bad faith claim. As the McCulloughs are seeking toenforce the obligations under the contract, they must take those obligations consistently with how the obligor offered them. 65. As a matter of comment, AIG analyses the McCulloughs’ claim in the Miami proceeding as a claim to be entitled to recover against AIG as judgment creditors of the insured, Mr von der Goltz. Paragraph 39 of the Third Amended Complaint reads, “The McCulloughs, as judgment creditors of the insured Rain Forest Defendants, have the independent right to pursue AIG for its failure to settle their claims against the insured Rain Forest Defendants and various other related breaches of duties”. 66. Insofar as there is any inconsistency with the analysis put forward on behalf of the McCulloughs, the onus of proof being on AIG, I consider that the right course is to follow the analysis of the McCulloughs as set out above. It is consistent with the decision of Judge Gayles on 10 May 2019, who cites Progressive Express Ins Co v Scoma , 975 So 2d 461, 465 (Fla 2d DCA 2007) for the proposition that, “In Florida, a bad faith action against an insurance company may be brought not only by the insured to whom the duty of good faith was owed or his or her formal assignee, but also by a third party whose claim against the insurance policy was the subject of alleged bad faith.” I approach the matter therefore on the basis that the claim in the Miami proceedings is a common law tort claim, allowing a thirdparty an independent right to sue an insurer there the insurer has failed to actin good faith in handling a claim brought by the third party against an insured. 67. No case has been cited by the parties in which the characterisation question has arisen in such a factual context before, so to that extent the question for decision here is novel. Applying the principles as set out in the case law, the question is whether these are in substance proceedings to enforce the obligation created by the contract of insurance, or proceedings to enforce a liability which is independent of the contract. If the former, AIG is (subject to the other contentions against it) entitled to maintain the anti-suit injunction because the claim is properly categorised as contractual and AIG has the right to prevent a claim against it based on its contractual obligations being pursued otherwise than by the contractually agreed mode, viz arbitration in Hong Kong (see the Dickson Valora case, ibid , at §46), and if the latter, the McCulloughs are entitled to have the injunction discharged. 68. The fundamental proposition contended for on behalf of the McCulloughs is that their claim in the Miami proceedings is an independent tort claim brought against the insurers, and cannot therefore be classified as a contractual claim. 69. In The Prestige , ibid , however, the court noted that the proper approach is to look beyond the formulation of the claim and identify according to the lex fori the true issue thrown up by the claim. The fact that the claim may be classified as tortious in the jurisdiction in which it is brought does not settle the question: see §29. At §30, it is said that the court is concerned with the characterisation of issues rather than claims. This point was emphasised by AIG in its argument. 70. In his decision of 10 May 2019, Judge Gayles pointed out that the first issue the McCulloughs claim presents is whether a third party can bring a bad faith claim against an insurer before coverage has been determined. In this court, it was unclear from the McCulloughs’ written submissions whether they accept that this is indeed a pre-condition to bringing of a bad faith claim. Their counsel answered that affirmatively in oral argument, and her concession was properly made. 71. Judge Gayles made the position clear: “ Florida courts limit third party bad faith actions against an insurerto cases where coverage has been determined. Blanchard v. State Farm , 575 So. 2d 1289, 1291 (Fla. 1991) (holding that an insurer cannot be held liable for bad faith conduct unless it is first established that the insured was entitled to benefits under the policy). A coverage determination is necessary because a bad faith failure to settle claim is ‘founded upon the obligation of the insurer to pay when all conditions under the policy would require an insurer exercising good faith and fair dealing towards its insured to pay.’ See Vest v. Travelers Ins. Co. , 753 So. 2d 1270, 1275 (Fla. 2000). An injured third party must therefore first obtain ‘“a resolution of some kind in favor of the insured” on the coverage issue’ before pursuing his bad faith claim against the insurer. E.g., Levesque v. Gov’t Emps. Ins. Co. , No. 15-14005-CIV, 2015 WL 6155897, at *4 (S.D. Fla. Oct. 20, 2015) (citing Brookinsv. Goodson , 640 So. 2d 110, 113 (Fla. 4th DCA 1994), disapprovedof in part on other grounds, State Farm Mut.Auto. Ins.Co.v.Laforet , 658 So. 2d 55, 62 (Fla. 1995); Quadomain Condo. Ass’n, Inc. v. QBE Ins.Corp. , No. 07-60003-CIV, 2007 WL 1424596, at *5 (S.D. Fla. May 14, 2007) (noting that claims for statutory bad faith ‘cannot proceed until the underlying coverage dispute has been resolved’) (citing Blanchard , 575 So. 2d at 1291). Where coverage is undetermined, a claim for bad faith is premature. Blanchard , 575 So. 2d at 1291.” 72. The key point is that under Florida law, “An injured third party must … first obtain ‘ “a resolution of some kind in favor of the insured” on the coverage issue’ before pursuing his bad faith claim against the insure r ”.As explained above, since AIG contests the coverage issue because the policyexcludes payment for bodily injury, Judge Gayles held that the McCulloughs’bad faith claim is premature, and stayed the proceedings. 73. AIG’s position is that the required resolution is to be determinedin accordance with the contractual procedure, namely by arbitration in Hong Kong—it accepts that no other aspect of the dispute is to be determined in Hong Kong. In my opinion, and in agreement with AIG, the relevant issue for the purposes of the anti-suit relief, and the issue that has to be classified for the purpose of the applicable test, is the coverage issue. Such issue is clearly contractual, since it determines the liability of the insurer to the insured under the terms of the policy. I disagree with the submission on behalf of the McCulloughs that the coverage issue does not inform the court as to the characterisation of the claim. 74. It further follows that so far as they relate to determination of the coverage issue—‌the necessary pre-condition for bringing the claim—the Miami proceedings are in substance proceedings to enforce the obligation created by the contract of insurance. The claim may be framed in tort, but the issue is a contractual one. It is of particular relevance in this regard that on 17 May 2019, the McCulloughs took out a motion to lift the stay and for leavetofileaFourthAmended Complaint seekinga declaration regardingthe extent towhich thereis coveragefor theMcCulloughs’ establisheddamages. This leaves no room for doubt. As noted above, a party “… is not entitled to found a claim on rights arising out of a contract without also being bound by the forum provisions of that contract” ( Qingdao Huiquan Shipping Company , ibid ). 75. So far as this ground is concerned, therefore, I reject the contention on behalf of the McCulloughs that the court was wrong to grant an anti-suit injunction on 18 December 2018. I also reject the contention that the court was wrong to grant leave to serve the injunction proceedings out of the jurisdiction under the contractual gateway (Order 11,rule 1(1)(d)(iii), Rules of the High Court) since AIG has shown that there is a “high degree of probability” that the McCulloughs are bound by the contractual dispute resolution provisions in that regard (Transfield Shipping v Chiping Xinfa [2009] EWHC 3629 (QB)). Nor does any question of material non-disclosure arise in this regard—the issue was fairly presented to the judge on the ex parte application so far as it was clear at that stage. FURTHER ISSUES FOR DECISION The effect of the order of 28 December 2018 76. AIG contends that the question whether the court ought to have granted the anti-suit injunction is not open to the McCulloughs at this stage since DHCJ William Wong SC continued the injunction until trial or further order. There has been no change of circumstances, and this court ought not re-open the matter. 77. However, as was pointed out on behalf of the McCulloughs, it cannot realistically be contended that this order foreclosed the present dispute. In any case, the matter came back before Au Yeung J on 4 January 2019, and she gave directions for the dispute to be heard on a date to be fixed,and that is now before the court. Procedural impropriety in making the application for the injunction ex parte 78. AIG had been aware of the Third Amended Complaint brought against it in Miami since the end of October, and it filed its Motion to Compel Arbitration on 29 November 2018. The response on behalf of the McCulloughs was due on 13 December 2018, but there was an agreed extension until 20 December 2018. AIG says that it wanted to see the response prior to determining its proper course of action, and that it was this delay which prompted the application to the Hong Kong court on 18 December 2018. 79. The facts are that email notice of the application was given to the McCulloughs’ attorneys on the record in the Miami proceedings on the evening of 17 December 2018, which with the time difference would have been received in Miami very early in the morning of the same day. AIG argues that this would have given the Miami lawyers a day to find lawyers in Hong Kong, and that since the hearing on 18 December 2018 did not begin until 17:45 hours Hong Kong time, there was time to arrange adequate representation of the McCulloughs at the hearing. 80. The authorities are to the effect that save where the rules allow, ex parte applications are exceptional and have to be justified on grounds of extreme urgency, or where the purpose of the injunction may be frustrated by notice, or where the defendant cannot be found: Brand, Farrar Buxbaum LLP v Samuel-Rozenbaum Diamond Ltd HCA 5191/1998 (unreported, 8 May 2002), Ma J (as he then was), §24, cited in Slik Hong Kong Co Ltd v Evans HCA 1424/2005 (unreported, 25 July 2005) at §3. 81. If it is sought to justify proceeding by way of short notice, the notice given “must be meaningful and not illusory” so as to give the respondent a “proper opportunity to attend the hearing”: Grande Cache Coal LP v Marubeni Corporation HCA 2136/2015 (unreported, 23 September 2015), Anderson Chow J at §34(2). The facts of that case do show however that such notice may be very attenuated. 82. The McCulloughs contend that none of the situations justifying ex parte relief existed here, and that the notice given to their lawyers in Miami gave far too little time for representation to be arranged in Hong Kong. In any case, no notification was sent on behalf of AIG of the details of the hearing, precise time, courtroom, etc. 83. AIG does not seek to argue that the application for the injunction had the extreme urgency, or the need for secrecy, that would justify an ex parte application. It submits however that there is nothing unusual about anti-suit injunctions being made on limited notice. It points out that the McCulloughs’ response to the injunction was to immediately issue an application in Miami for an anti-anti-suit injunction. 84. I sympathise with the criticisms made on behalf of the McCulloughs as to the brevity of the notice, bearing in mind that their lawyers were based in Miami. But I do not consider that the deputy judge was misled in this respect. The question is whether, as they submit, the court should discharge the injunction on grounds of procedural impropriety because it was made ex parte and the notice was illusory. Applying the authorities, I do not think that this would be the correct course. I prefer AIG’s contentions in this respect. A party faced with proceedings in breach of a dispute resolution clause often faces difficult decisions about how to protect its position. The timing of the application may suggest a concern about the impending Christmas break, but that aside, overall, time was genuinely pressing in my view, and on balance, I am satisfied that there wassufficient reason for AIG to move as it did to protect its rights as it saw them. I would add that even if I was minded to discharge the injunction, on these facts I would re-grant it. Nothing would be gained by such a course. Delay 85. It is submitted on behalf of the McCulloughs that the injunction should be discharged because AIG delayed in making the application. It knew about the Third Amended Complaint in the Miami proceedings at latest on 31 October, but the application for the injunction was not made until 18 December 2018. 86. It is not in dispute that delay can be a ground for refusing to grant anti-suit relief. This is a particular issue if the plaintiff has allowed theforeign proceedings to materially progress without taking action, which also raises issues of comity ( Sea Powerful II Special Maritime Enterprises (ENE)v Bank of China [2017] 1 HKC 153 at §21 per Kwan JA (as she then was)). 87. The position in the present case is that the Third Amended Complaint had been served directly on AIG in Hong Kong without notice to its counsel, and was missed, with the consequence that a Clerk’s Default (a step towards a default judgment) was entered against it in Miami. AIG was served with a motion for default final judgment on 31 October 2018. It filed a motion to dismiss on 7 November 2018. (Judge Gayles set aside the Clerk’s Default on 18 January 2019.) 88. On 29 November 2018, as noted above, AIG filed a motion with the Miami court to compel arbitration in Hong Kong, which again as noted above was decided against it on 10 May 2019, the court ordering the case to be stayed until the question of coverage under the insurance policy was determined. 89. It is certainly correct that the onus is on a party moving for anti-suit relief to do so without delay, but I reject the delay complaint on the facts. The procedural history is set out above. Upon becoming aware of the Third Amended Complaint at the end of October 2018, AIG took steps to vacate the Clerk’s Default, and issued the motion to compel arbitration. There has been no substantial delay in seeking anti-suit relief in Hong Kong on 18 December 2018 (see by analogy the two month period in the Dickson Valora case at §§57 and 58, where a delay complaint was also rejected). Importantly, at the time of the application the Miami proceedings had not materially progressed, and are currently stayed. Forum non conveniens 90. Objection is taken on behalf of the McCulloughs that no attempt was made at the ex parte hearing to address the question whether Hong Kong is the convenient forum. This, it is contended, amounted to a material non-disclosure. 91. However, it is established that forum non conveniens issues do not arise in this context. Where the relevant right is founded upon a contract, the “applicant [for the anti-suit injunction] does not have to show that the contractual forum is more appropriate than any other; the parties’ contractual agreement does that for him” ( Ever Judger Holding Co , ibid ,at §58, Qingdao Huiquan Shipping , ibid , at §35). The same principle applies where a remote party is, in effect, seeking to enforce the contract without regard to the dispute resolution provision (see Dickson Valora , ibid, at §76). 92. The contentions advanced on behalf of the McCulloughs under the heading of forum non conveniens —the lack of impediment to AIG litigating in Miami, the fact that the McCulloughs have no connection to Hong Kong and would find it difficult to travel here, and the risk of inconsistent judgments—do not apply. An argument that a claim is more appropriately tried in a foreign court is an argument against an anti-suit injunction on the merits ( Dickson Valora , ibid , at §76), and similarly whetheran anti-suit injunction will be refused due to the risk of parallel proceedings and inconsistent decisions depends on the facts ( Ever Judger Holding Co , ibid ,at p 868). The question is whether strong reasons exist for not granting the injunction, and the correct approach does not fall within the forum conveniens principles which would be applicable in the absence of a provision as to dispute resolution. Submission to the jurisdiction in Miami and parallel proceedings 93. In a note to the court of 5 June 2019 following AIG’s appeal from Judge Gayles’ decision, it is contended on behalf of the McCulloughs that AIG has taken inconsistent stances, both objecting to the Miami proceedings and availing itself of the jurisdiction of the Miami court. By that appeal, it has voluntarily taken further steps in the Miami court, having already vacated the Clerk’s Default and filed a motion to compel arbitration in Hong Kong, and must be taken to have submitted to the jurisdiction of that court. In light of its appeal, an anti-suit injunction in Hong Kong is no longer necessary since AIG is (again) seeking the same relief in Miami, and there is no longer any reason for the Hong Kong Court to re-grant or continue an anti-suit injunction. 94. AIG’s response by note of 10 June 2019 is that it has maintained at all times that the coverage issues must be resolved in arbitration in Hong Kong, pursuant to Hong Kong law, in accordance with the disputes clause and has at all times acted consistently with that position. Aside from its application to set aside the default judgment, its only application in the Miami proceedings has been its Motion to Compel Arbitration which is a motion to resist not to submit to the jurisdiction. Similarly, appealing Judge Gayles’ decision so far as it held that the McCulloughs could accede to the rights of AIG’s insured to recover under its policy without also agreeing to arbitrate in Hong Kong is merely part and parcel of its application to resist jurisdiction. The Motion to Compel Arbitration seeks to compel compliance with the disputes clause, whilst the anti-suit injunction seeks to prevent the McCulloughs from commencing or continuing any proceedings that are not in accordance with the disputes clause. Without the injunction, the McCulloughs will seek to reopen the Miami proceedings via the Fourth Amended Complaint to attempt to resolve the coverage issues in the United States. 95. I accept AIG’s submissions in this respect. It is not unusual for a plaintiff in these circumstances to apply to stay or strike out claims brought against it in a foreign jurisdiction contrary to an arbitration clause. This does not of itself constitute an election to forego a right it would otherwise have to seek an anti-suit injunction from the court of the seat of the arbitration. Of course, if in effect the plaintiff has chosen to pursue a remedy in the foreign court in circumstances which make it inequitable for aconcurrent remedy to be pursued in the court of the seat, this may constitutestrong reasons for not granting an anti-suit injunction, in accordance with theprinciples laid down in the authorities set out above. This is not the position in the present case, and I do not consider that AIG can be said to have acted disproportionately. The same considerations apply to the contention on behalf of the McCulloughs that the court should refuse to grant relief on the basis that these are parallel proceedings. Whether the court was misled as to the scope of the anti-suit injunction 96. It is contended on behalf of the McCulloughs that the case presented to DHCJ Leung was to the effect that the injunction was intended to cover the entirety of the proceedings in Miami, whereas AIG’s case as put(for example in the Miami proceedings on 18 January 2019) is that it extends only to the element of the Miami proceedings that concerns the coverage issue. 97. I do not accept this contention. It is not correct that AIG has changed its entire case. The position was made sufficiently clear to the judge. In any event, insofar as it was not clear at the time that the case was presented to DHCJ Leung, the fact that the analysis has been refined, and that it has been recognised by AIG that the permissible relief is limited, is not necessarily a matter of criticism. The more substantial point, in my view, that it is clear now that the only injunctive relief that can properly be granted extends to the determination of the coverage issue. So far as the order of 18 December 2018 goes any further than this, it requires to be appropriately limited now. However, that is not a ground for discharging it altogether. The allocation clause 98. Clause 6.5 of the policy deals with the situation in which a claim involves both covered and uncovered matters or persons. If the insurer and the insured cannot agree on allocation, the clause provides for determination by a Senior Counsel whose decision is to be final and binding. It is contended on behalf of the McCulloughs that if the dispute resolution clause is binding, the allocation clause is equally binding. 99. However, allocation does not arise in the present case. AIG’s case is not that some matters or persons are covered, and others are not, but that coverage is excluded altogether by the “bodily injury” exclusion, save as to defence costs. The correctness or otherwise of that assertion is the coverage issue which requires determination. The fact that the “good faith”claim includes a claim for sums in excess of the policy limit does not alter the analysis. I also reject the contention put in oral argument that AIG’s counsel was under an obligation to draw attention to the allocation clause at the ex parte hearing, even if the clause was inapplicable. CONCLUSION 100. As set out above, under the law of Hong Kong, a party is not entitled to found a claim on rights arising out of an insurance policy withoutalso being bound by the dispute resolution provisions in the policy: the case law is to the effect that an anti‑suit injunction will ordinarily be granted to restrain the claimant from pursuing proceedings in a non‑contractual forumunless there are strong reasons to the contrary, whether the claimant is a party to the policy or not. The underlying rationale is that the dispute resolution provision is seen as an essential part of the contractual basis upon which coverage arises under the policy, and that a party seeking to enforce the policy cannot do so free of the contractual dispute resolution mechanism. This is seen as commercially important to the conduct of international insurance business. In the present case, as the Miami court has held, the establishment of coverage is a precondition to the “bad faith” claim against the insurer, and as a matter of Hong Kong law, the governing law of the policy, the insurer is entitled to have it determined in accordance with the contractual procedure. 101. Such an injunction is granted purely on in personam basis, and does not, and does not purport to, trespass upon the jurisdiction of the Miami court. At the same time, judicial comity is an essential principle in a world in which the same dispute may fall for decision in two or more jurisdictions—in such a case comity should inform the courts’ approach (see generally Ecobank Transnational Incorporated v Tanoh [2015] EWCA Civ 1309 particularly at §132 cited in Sea Powerful II , Kwan JA, and see at §21 and §§22, 23). Inconsistent judgments are to be avoided if possible (as was rightly pointed out by counsel for the McCulloughs). 102. In the present case, the Miami court has held that under Florida law, the McCulloughs must obtain “ a resolution [of the coverage issue] of some kind in favor of the insured ”. The court declined to compel the McCulloughs to arbitrate in accordance with the provisions in the policy,but stayed the proceedings until determination of coverage. I do not accept that it can be reasonably understood that the judge has implicitly determined the appropriate forum regarding coverage to be the Miami court. His decision does not seem to be inconsistent with a decision of this court barring the McCulloughs from seeking to determine the coverage issue otherwise than in accordance with provisions in the policy. 103. As indicated above, that is the limit of this court’s exercise of its discretion, and the wording of the existing order of 18 December 2018 appears to go beyond that. The parties should agree appropriately limited wording, updated if necessary to include the Fourth Amended Complaint, and submit it to the court for approval. 104. Finally, as the case law cited above makes clear, the court grants an anti-suit injunction exercising its equitable jurisdiction. In that regard, since AIG insists on the contractual means of determining coverage,it is up to AIG to facilitate such determination. I would expect AIG to take a proactive position in that regard, particularly in view of the disparity of resources between the parties. 105. I am grateful to the parties’ legal representatives for their submissions, and will decide any consequential matters arising. On a nisi basis, AIG is entitled to its costs of these applications. (Sir William Blair) Deputy High Court Judge Mr Charles Manzoni SC, leading Mr Toby Brown, instructed by Kennedys, for the plaintiff Ms Elizabeth Cheung and Ms Jennifer Fan, instructed by Luk & Partners in association with Morgan, Lewis & Bockius, for the 1 st and 2 nd defendants Look up this case on Lawcite Noteup",
  "length": 63738,
  "headers_seen": [
    "UNDERLYING FACTS",
    "PROCEDURAL HISTORY IN MIAMI",
    "THE DECISION IN THE MIAMI PROCEEDINGS",
    "THE DEFENDANTS’ CONTENTIONS",
    "AIG’S CONTENTIONS",
    "THE DISPUTE RESOLUTION AND GOVERNING LAW CLAUSES",
    "THE CHARACTERISATION ISSUE",
    "The case law on the effect of the arbitration clause in the insurance policy"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2019/1649",
  "query": "anti-suit injunction",
  "ts": "2025-10-16T10:47:14",
  "ok": true
}