{
  "title": "HKSAR V. CHENG KA KEUNG DENDY AND OTHERS | [2000] HKCFI 1177 | HKLII",
  "court": null,
  "year": 2000,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2000] HKCFI 1177 HKSAR V. CHENG KA KEUNG DENDY AND OTHERS Judgment Information Date 5 Apr, 2000 Action No. HCMA1177/1998 Neutral Cit. [2000] HKCFI 1177 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCMA1177/1998 HCMA001177/1998 HKSAR v. CHENG KA KEUNG DENDY AND OTHERS HCMA001177/1998 HCMA1177/1998 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE (Appellate Jurisdiction) MAGISTRACY APPEAL NO.1177 OF 1998 (ON APPEAL FROM TWCC 2229/1998) ---------------------- BETWEEN HKSAR Respondent AND CHENG KA KEUNG DENDY 1st Appellant LI KIN ON 2nd Appellant MA CHI WAI 3rd Appellant LAU HON CHEUNG 4th Appellant NG KIT KEUNG 5th Appellant ----------------------- Coram: Hon Gall J in Court Date of Hearing: 30 March 2000 Date of Judgment: 6 April 2000 ------------------------- J U D G M E N T ------------------------- 1. On 13 November 1998, all the five appellants, were convicted of a charge of false imprisonment and in addition, the 5th appellant was convicted of a charge of assault occasioning actual bodily harm. In the court below there were six accused. The 5th accused being also convicted of false imprisonment and assault occasioning actual bodily harm, but that accused, having appealed, abandoned the appeal and the appeal was dismissed upon receipt of the Notice of Abandonment. The 1st and 5th appellants were sentenced to three months' imprisonment in respect of the false imprisonment charge, and each of the other three appellants were sentenced to two months' imprisonment on that charge. In addition, the 5th appellant was sentenced to two months' imprisonment in respect of the assault occasioning actual bodily harm of which he was convicted the sentence to run concurrently with that imposed for the false imprisonment. Against these sentences, the five appellants now appeal. 2. The 5th accused in the court below who has abandoned her appeal was also convicted of false imprisonment and of assault occasioning actual bodily harm in the same incident. She was sentenced in respect of the false imprisonment to two months' imprisonment, suspended for 12 months, in respect of the assault occasioning actual bodily harm of which she was convicted one month's imprisonment, suspended for 12 months. The sentences to run concurrently. 3. The grounds of appeal put forward by the appellants are twofold. Firstly, that the sentences as passed in respect of each of them were manifestly excessive and secondly, that the learned magistrate erred in creating an unjustifiable disparity between the sentence passed on the 5th accused, Tang Yuk Fan, namely, a suspended sentence when her involvement in the criminality of the offence was as great if not greater than some of the other appellants. 4. The facts as found by the magistrate were that the victim in this matter was a director of a company which had been established to run a karaoke lounge, nightclub and hair salon. In the beginning of 1998, he negotiated with the 1st appellant to do extensive decoration works in the premises. Certain payments had been made. But at the time of the offence, large amount of money was left outstanding and the 1st appellant had been pressing the victim for payment of those monies. The company owned by the victim fell into difficulties and there was insufficient money available to satisfy the legitimate claims made by the 1st appellant. 5. On 23 June 1998, the victim was inside the Horse and Groom, a public house in Wanchai, with a friend when five men approached. They were the 1st appellant whom he knew, and also three others. He subsequently identified two as being the 2nd and 3rd appellants. Demands were made that the victim pay the 1st appellant the monies owed and the victim made telephone call for assistance. The victim was later taken by taxi to a room in the Music Pub Karaoke in Tsuen Wan where he was eventually discovered by the police some three hours later. 6. The accusation was that the victim was unlawfully detained at the Music Pub Karaoke having been forcibly abducted from the Horse and Groom public house and taken to that place in Tsuen Wan by taxi. He alleged being assaulted at each stage but most severely when inside the premises in Tsuen Wan. It was clear that the 1st appellant was the leader of the matter and that he was pressing very hard for payment for the money due to him. The other appellants were employed by him in his business and had equally an interest in the recovery of the money. 7. There was no suggestion that the 1st appellant at any time assaulted the victim but he did procure the assault upon him by the 5th accused in the trial, his girlfriend Tang Yuk Fan who has abandoned her appeal. The 1st appellant was present at both premises where the victim was detained. 8. The 2nd appellant had associated himself with the demands at all times and was present both in the premises of Wanchai and Tsuen Wan. He joined in insisting that the debt be repaid and has accompanied the victim in the taxi from Wanchai to Tsuen Wan. He was in the premises of Tsuen Wan until the police arrived, and at those premises he had punched the victim several times. 9. The 3rd appellant was present during the period the victim was detained at the Horse and Groom and was further at the Music Pub Karaoke in Tsuen Wan until the police arrived. He had punched the victim several times at the premises in Tsuen Wan. 10. The 4th appellant, assisted in the detention of the victim at the premises in Wanchai, had pressed the demand against him. He accompanied the victim in the taxi from Wanchai to Tsuen Wan and remained in the premises with him until the police arrived. In the premises at Tsuen Wan, the 4th appellant had kicked the victim. 11. The 5th appellant who was with the victim in the premises in Wanchai and participated in the pressure upon him to repay. He accompanied the victim in the taxi to Tsuen Wan and holding the victim by the neck. He was with the victim at the premises in Tsuen Wan until the police arrived and there had removed the victim's spectacles and elbowed the victim several times while others punched him and kicked him. 12. I have considered the analysis of the actions of each of the appellants by the magistrate, particularly in respect of the level of sentences which he imposed upon each of these appellants. Given the nature of the offences and the manner which they were committed, the level of the violence used, the length of time the victim was detained and the legitimacy of the claim for money, I consider the sentences imposed upon each of these appellants to be appropriate and none can be said to be manifestly excess. The first ground of appeal must fail. 13. The second ground of appeal relates to the disparity in sentence between the 5th defendant at trial and the five appellants. I am referred to the case of R. v. Chan Wai Chiu & Others , Court of Appeal, Cri. App. No.144/1992 where the issue of disparity of sentences was considered. There, Power JA (as he then was) referred to the case of Stroud [1977] 65 Cri. App. Rep. 150 in a passage which reads : \"The Lord Chief Justice went on: 'This in our experience is a somewhat novel argument. The practice of the Court to give effect to what is popularly called 'the disparity argument' is itself a relatively new feature in the practice of this Court. It arises only when the would be appellant has received a sentence which the Court thinks proper in itself but which is so disparate when compared with other sentences passed at the same time' - I would venture to italicise those four words 'at the same time' - 'that a real sense of grievance may thereby be engendered in the person upon whom it is passed.\" The Lord Chief Justice went on to say further : \"'It was never intended that a sentence should be reduced on the basis of disparity unless there was such a glaring difference between the treatment of one man as compared with another that a real sense of grievance would be engendered in the case of a man suffering the more serious penalty .' (Emphasis supplied) Power J.A went on to say: We are quite satisfied that Stroud only has application where an offender has suffered a more serious penalty than a more culpable co-defendant. In such circumstances he is entitled to urge that he has a sense of grievance of which the court is required to take cognizance, i.e. a legitimate sense of grievance. That was not the circumstance here. The applicants received proper sentences. Indeed they were, if anything, lenient. We agree that the 4th defendant received a sentence much more lenient than he deserved but it was a sentence in excess of that imposed upon the applicants and they are not, we are satisfied, entitled to hold any legitimate sense of grievance. An offender who has received a proper sentence is entitled to consideration when he urges that a more culpable co-defendant, who was sentenced at the same time as he was, has received a lesser sentence than that which was imposed upon him. ...\" 14. If the appeal before me is to succeed, it must be argued that the sentence passed upon the 5th accused in the court below was passed upon a more culpable co-accused than the appellants and she received a lesser sentence than that imposed upon the appellants. The case in respect of the 5th accused in the court below was that she was present at the Horse and Groom in Wanchai as the girlfriend of the 1st appellant. There, at the instance of the 1st appellant, she brushed the back of the left hand of the victim several times with a lighted cigarette and jabbed his thigh with a key. This was done to intimidate the victim and to suborn him giving in to the demands of the 1st appellant. She did not accompany the victim to Tsuen Wan in the taxi but arrived there later. In the premises at Tsuen Wan, again, at the instigation of the 1st appellant, she struck the victim with a book. Having convicted her, the trial magistrate sentenced her to two months' imprisonment in respect of the false imprisonment, suspend for 12 months and to one month's imprisonment in respect of the assault occasioning actual bodily harm, suspended for 12 months the sentences to be served concurrently. 15. The first matter I must consider is whether her role in the incident was more culpable than that of the appellants. That is the first part of the test laid down in Stroud and by the Court of Appeal in R. v. Chan Wai Chiu & Others to which I have referred. It is clear that the 5th accused in the court below was acting on the instructions of the 1st appellant in this court, and not acting on her own account. She was not an employee who had an interest in obtaining the money and acted on the instructions of the 1st appellant, and was therefore to a lesser degree a principal in this matter. 16. The passing of a cigarette above the hand of the victim causing pain but no burn, the jabbing of his thigh with a key causing a bruise and the blow with a book are clearly amount to an assault occasioning actual bodily harm. But these are not a greater role than that played by the 1st appellant who was the instigator of this incident, nor by the other appellants who, each of them, struck blows or kicks to the victim. The best argument that can possibly be mounted is that the culpability of 5th accused in the court below approached that, or was the same as that of the appellants. However the test is, as I have set out above, the culpability of the co-accused in respect of whom the appellants feel aggrieved must be greater than their culpability. The role played by the 5th accused in the court below fails that test. 17. I must further consider whether the disparity of sentence being a suspension of the term of immediate imprisonment is of such a nature as to be so different from the sentence passed on the appellant, that a sense of grievance is legitimate. A suspended sentence of this kind is still a custodial sentence although not an immediate custodial sentence. The court has accepted that a sentence of imprisonment is appropriate, but has then for circumstances peculiar to that particular defendant, seen fit to suspend the sentence. 18. In all the circumstances, even if I had found that the culpability of the 5th accused in the court below was greater than that of the appellants now before me, I would not have been satisfied that the disparity in sentence was so great in all the circumstances of the 5th accused and the appellants to justify a legitimate grievance on the basis of disparity. 19. The appeals against the sentence are dismissed. (T.M. Gall) Judge of the Court of First Instance, High Court Representation: Mr P.K. Madigan, SGC of Department of Justice, for the Respondent Mr David McKenzie Ross, instructed by Messrs Wong, Packwood & Co., for the 1st Appellant Mr Osmond Lam, instructed by Messrs Ho & Partners, for the 2nd - 5th Appellants Look up this case on Lawcite Noteup",
  "length": 12997,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2000/1177",
  "query": "assault occasioning actual bodily harm",
  "ts": "2025-10-17T10:41:24",
  "ok": true
}