{
  "title": "DP WORLD DJIBOUTI FZCO AND OTHERS V. CHINA MERCHANTS PORT HOLDINGS CO LTD | [2019] HKCFI 3104 | HKLII",
  "court": null,
  "year": 2019,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2019] HKCFI 3104 DP WORLD DJIBOUTI FZCO AND OTHERS V. CHINA MERCHANTS PORT HOLDINGS CO LTD Judgment Information Date 19 Dec, 2019 Action No. HCA1951/2018 Neutral Cit. [2019] HKCFI 3104 Parallel Cit. [2020] 1 HKC 224 Download MS Word Judgment Reading Options Translation Toggle Highlight Appeal History HCA1951/2018 HCA1951/2018 DP WORLD DJIBOUTI FZCO AND OTHERS v. CHINA MERCHANTS PORT HOLDINGS CO LTD HCA 1951/2018 [2019] HKCFI 3104 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE ACTION NO 1951 of 2018 ________ BETWEEN DP WORLD DJIBOUTI FZCO 1 st Plaintiff DUBAI (INTERNATIONAL) 2 nd Plaintiff DJIBOUTI FZE DORALEH CONTAINER TERMINAL SA 3 rd Plaintiff and CHINA MERCHANTS PORT HOLDINGS COMPANY LIMITED Defendant ____________ Before: Hon Mimmie Chan J in Chambers (open to public) Dates of Hearing: 15 & 16 October 2019 Date of Decision: 20 December 2019 _____________ D E C I S I O N _____________ Background 1. These proceedings are commenced by the 3 Plaintiffs against the Defendant, whereby claims are made in respect of the Defendant’s alleged interference with the performance of the Plaintiffs’ contract for the operation of a container terminal at Doraleh, and the Defendant’s acts of allegedly inducing and/or procuring the breach of various contracts and unfair competition under the Djibouti Civil Code. 2. The 1 st Plaintiff (“ DPWD ”) and the 2 nd Plaintiff (“ DID ”) are wholly owned subsidiaries of DP World Limited (“ DP World ”). DP World is one of the largest port operators in the world, and is listed on the NASDAQ Dubai Stock Exchange. DPWD, DID and DP World are all incorporated and based in the United Arab Emirates. 3. The Defendant (“ China Merchants ”) is incorporated in Hong Kong, and listed on the Hong Kong Stock Exchange. It is a global public port developer and investor, and can fairly be said to be a competitor of DP World. 4. There have been different court and arbitration proceedings, between the DP World group of companies including DPWD and DID on the one part, and the Republic of Djibouti (“ Republic ”) and the Djibouti port entities on the other part, in London and Djibouti, relating to the dispute between the DP World group and the Djibouti Republic and authorities over the rights to the operation and development of the ports and container terminals in the Djibouti free trade zone. 5. This application is to determine the proper and appropriate forum for the trial of the dispute between the Plaintiffs and the Defendant in these proceedings. 6. The underlying facts and the background of the dispute are not in issue, and are summarized in the agreed chronology of key events, attached as Appendix to this Decision. The various agreements 7. I refer to the judgment of Hon Faux J (as he then was) in proceedings in the English Commercial Court, between the Republic of Djibouti and Mr Boreh ([2016] EWHC405 (Comm)), only for its helpful summary on the development of the new port and free zone complex built at Doraleh, to the south of Djibouti City, in the last 15 years, and its transformation into a successful and the leading port in the region, with one of the largest container terminals. Mr Boreh was instrumental, if not the key character, in bringing together the President of the Republic and DP World in the development and management of the port of Djibouti (“ Port ”) since 1999. Through Mr Boreh’s negotiations, various agreements were signed between the Republic and DP World. 8. In brief, a Management Agreement was signed in May 2000, whereby Dubai Ports International FZE took over the management of the Old Port of Djibouti. In February 2004, a Concession Agreement was made between the Republic and the 2 nd Plaintiff (“ 2004 Concession ”), whereby the Republic granted to the 2 nd Plaintiff the full and exclusive right to establish, develop and operate a new port and container terminal at the Doraleh site. The 2004 Concession agreement was to remain effective for 30 years, renewable for an additional two 10 year periods. The Republic agreed not to grant another concession for any other port or free zone facilities within the Republic for the duration of the term of the 2004 Concession agreement, without the prior written consent of the 2 nd Plaintiff. 9. DP World was able to obtain funding from a consortium of banks to build a new international container terminal at Doraleh (“ Terminal ”), on the condition that DP World was to manage and operate the Terminal. By a law enacted by the Djibouti Parliament on 21 June 2006, the 3 rd Plaintiff was set up as a joint venture company between the Djibouti Government and DP World, for the purpose of building, developing and operating the Terminal. The 1 st Plaintiff held the minority 33.34% share interest in the 3 rd Plaintiff but had corporate control thereof. The majority 66.66% of the shares of the 3 rd Plaintiff was held by Port Autonome International de Djibouti (“ PAID ”, now known as “ PDSA ”), the public entity which has jurisdiction over the operation of ports in Djibouti, for the Djibouti Government. 10. On 30 October 2006, a further concession agreement (“ 2006 Concession ”) was made between the Republic, the 3 rd Plaintiff and the 2 nd Plaintiff, whereby the Republic granted to the 3 rd Plaintiff the sole and exclusive right to develop the Terminal, and to undertake the activities relating to the operation, maintenance and repair of the Terminal, for 30 years. The Republic agreed not to cause PAID to operate or commission any facilities within Djibouti for handling containers, without the 3 rd Plaintiff’s prior written consent (Article 3.6.2). The Republic further agreed, under Article 3.6.3 of the 2006 Concession, to first offer the 3 rd Plaintiff the right to develop such additional container handling facilities as the relevant Djibouti authority should decide to develop; and in the event that any other port or container facility is developed in Djibouti by the Republic or other third party, and more favorable treatment or privileges than those offered to the Terminal and/or the 3 rd Plaintiff should be received, equivalent favorable treatment or privileges shall be offered or extended to the Terminal and/or the 3 rd Plaintiff (Article 3.6.4). 11. A Joint Venture Agreement (“ JVA ”) was made between the 1 st Plaintiff and PAID on 22 May 2007 in relation to the corporate affairs of the 3 rd Plaintiff. The shareholders of the 3 rd Plaintiff agreed under the JVA to cause the 3 rd Plaintiff to enter into and fulfill its obligations under its Management Services Agreement with the 1 st Plaintiff as Manager. The Djibouti Government as shareholder of the 3 rd Plaintiff covenant under the JVA that the Republic would comply with Article 3.6 of the 2006 Concession. 12. A Management Services Agreement dated 6 December 2007 was then entered into between the 1 st Plaintiff and the 3 rd Plaintiff. Under this agreement, the 1 st Plaintiff was appointed as the Manager of the Terminal. 13. The Terminal became operational in December 2008, and gradually became the leading port in the region. The Defendant’s involvement 14. On its part, the Defendant began to play a role in Djibouti from 2012. The full extent of the Defendant’s involvement is hotly disputed, but the Defendant does not dispute the following. 15. On 29 December 2012, the Defendant signed a Strategic Partnership Agreement with the Djibouti Ports and Free Zones Authority (the statutory authority of the Republic in charge of ports and free zones) (“ Port Authority ”), pursuant to which the Doraleh Multipurpose Port (“ Multipurpose Port ”) was developed. Under a Share Purchase Agreement dated 29 December 2012 (“ SPA ”), the Defendant acquired 23.5% of the shares in PAID, thereby becoming an indirect shareholder of the 3 rd Plaintiff. 16. On 5 February 2013, the Defendant and its subsidiary entered into a Shareholders Agreement with the Port Authority and the Government of the Republic (“ Shareholders Agreement ”). Following the Defendant’s involvement in Djibouti, the Port Authority then entered into an investment agreement with a consortium of Mainland investors in November 2016, for the development of the Djibouti International Free Trade Zone (“ Free Trade Zone ”). The dispute with the Djibouti Government 17. The Plaintiffs claim that the Republic’s transactions with the Defendant were entered into without any prior consultation with the Plaintiffs, and without their consent. They claim that the Republic had acted in breach of the provisions in the 2004 and 2006 Concession Agreements, and in breach of the JVA. In particular, they claim that the Republic was in breach of Clause 5.02 of the 2004 Concession agreement, and/or Clauses 3.6.2 and 3.6.3 of the 2006 Concession Agreement, by granting concessions and entering into agreements with the Defendant for the construction, development and/or operation of new ports and free trade zones within Djibouti, without the Plaintiffs’ prior written agreement, and without offering the 2 nd Plaintiff and the 3 rd Plaintiff the right of first refusal of these rights. As PAID had participated in and co-funded the construction and development of the Multipurpose Port with the Defendant, the Plaintiffs further claim that there was breach of Article 3.6 of the 2006 Concession Agreement and Clause 17.1 of the JVA. 18. The relationship between the Djibouti Government and the DP World group turned sour. According to the Plaintiffs, the Republic had sought to renegotiate its contracts and terms of dealings with the Plaintiffs as early as 2012, evidenced by the Republic’s letter of 7 August 2012. In October 2012, the Republic commenced proceedings in the United Kingdom against Mr Boreh, alleging that he had taken bribes from the 1 st Plaintiff in return for negotiating “soft terms” between the 3 rd Plaintiff, the 1 st Plaintiff and the Republic (“ Boreh Proceedings ”). In July 2012, the Republic (together with PAID and the Port Authority) initiated arbitration proceedings against the Plaintiffs in the London Court of Arbitration, alleging that the Republic was entitled to rescind the 2006 Concession Agreement (“ Rescission Arbitration ”) as it was tainted by the 1 st Plaintiff’s alleged bribery of Mr Boreh. 19. It is not disputed, that the claims made by the Republic against Mr Boreh, and against the Plaintiffs in the Rescission Arbitration, were all dismissed. 20. In his judgment in the Boreh Proceedings (“ Boreh Judgment ”), Faux J held that the overall deal negotiated by Mr Boreh was advantageous to the Republic, and that the most likely explanation for the conduct of the Republic against Mr Boreh was that it was all politically motivated and designed to ruin Mr Boreh. The English Court of Appeal dismissed the Republic’s application for leave to appeal. 21. The Republic’s claims of rescission and/or termination of the 2006 Concession agreement, as made in the Rescission Arbitration, were likewise dismissed in the Award dated 20 February 2017 (“ Rescission Award ”). The tribunal held that the President of the Republic, his advisers and the Council of Ministers all knew of and approved the terms of the Concession Agreement, and that none of the impugned transactions constituted a bribe, and they were all legitimate. 22. The Plaintiffs’ complaint is that notwithstanding the unsuccessful attempts to rescind the 2006 Concession agreement by way of legal proceedings and the Rescission Arbitration, the Republic continued its efforts to terminate the 2006 Concession through legislative acts. The Law No 202/AN/17/7 th L on Strategic Infrastructure Contracts (“ Law 202 ”) was propagated on 8 November 2017. This allowed the Government of the Republic to renegotiate and (if necessary) to terminate all contracts relating to strategic infrastructures which are deemed to be contrary to the fundamental interests of the Republic. Pursuant to Law 202, the Government of the Republic demanded renegotiation of the 2006 Concession with the 3 rd Plaintiff from December 2012. The Plaintiffs did not consider that it was in the best interests of the 3 rd Plaintiff to renegotiate the 2006 Concession, and on 20 February 2018, the 1 st Plaintiff and the 3 rd Plaintiff initiated a second arbitration at the London Court of International Arbitration (“ Termination Arbitration ”) on the validity of the 2006 Concession Agreement. In the Termination Arbitration, the Plaintiffs sought a declaration that the 2006 Concession remained in full force and effect. 23. Two days after the commencement of the Termination Arbitration, the Government of the Republic issued a series of Presidential Decrees (“ Decrees ”), which declared the 2004 and 2006 Concessions to terminate with immediate effect. Public officials took physical control of the Terminal and the oil jetty, and transferred the 3 rd Plaintiff’s assets, operations and personnel to a state-owned company (“ SGTD ”) which was appointed to be the operator of the Terminal in place of the 3 rd Plaintiff, as well as the manager in place of the 1 st Plaintiff. 24. The Government of the Republic did not take part in the Termination Arbitration, and on 31 July 2018, the tribunal handed down its award, finding that the 2006 Concession remained valid and binding notwithstanding Law 202 and the Decrees (“ Termination Award ”). 25. On 28 July 2018, PDSA notified the 1 st Plaintiff that it had decided to terminate the JVA. The reasons given were that the 3 rd Plaintiff, which was controlled by the 1 st Plaintiff, had failed to renegotiate the 2006 Concession with the Government of the Republic, notwithstanding Law 202, and the 1 st Plaintiff had instead used its controlling powers over the 3 rd Plaintiff to commence the Termination Arbitration. As this had prompted the Republic to enact the Decrees, which had the effect of terminating the 2006 Concession agreement and transferring the 3 rd Plaintiff’s assets to SGTD, PDSA claimed that the 1 st Plaintiff had failed to act in the best interests of the 3 rd Plaintiff, as required under the JVA. 26. PDSA called for an extraordinary general meeting of the 3 rd Plaintiff’s shareholders on 9 September 2018, to replace the 1 st Plaintiff’s nominated directors with PDSA’s own nominees. The 1 st Plaintiff then applied for and obtained from the English Court on 31 August 2018 an injunction to prevent PDSA from passing a resolution to remove the 1 st Plaintiff’s nominated directors (“ English Injunction ”). The 1 st Plaintiff commenced a further arbitration against PDSA in the London Court of International Arbitration (“ Articles Arbitration ”), claiming that PDSA was acting in breach of the JVA and the Articles of the 3 rd Plaintiff. 27. Notwithstanding the English Injunction, the Republic issued a Presidential Ordinance on 9 September 2018 (“ 9/9 Ordinance ”), which sought to transfer PDSA’s shareholding in the 3 rd Plaintiff to the Government of the Republic. 28. The English Injunction was continued on 14 September 2018, to restrain PDSA from (inter alia) taking any steps to effect a transfer of its shares in the 3 rd Plaintiff to any transferee who is not already a party to the agreement contained in the Articles. The English Injunction was also extended to any “Affiliates” of PDSA, as defined in the JVA, which will include any person which is directly or indirectly in control of or in common control with PDSA, as well as any person to which shares in the joint venture company, the 3 rd Plaintiff, are issued or transferred in accordance with the JVA. 29. On 28 October 2018, the Republic promulgated another law, stating that the 9/9 Ordinance purporting to nationalize PDSA’s shares had been ratified by the Parliament of the Republic, and that PDSA would be compensated by shares in SGTD, which had taken over the operation of the Terminal. A further Decree (No 29/AN/18/8eme) was issued by the Government of the Republic on 5 May 2019, purporting to transfer to PDSA 66.66% of SGTD’s shareholding, free of charge, as compensation. 30. The Republic also commenced proceedings before the Djibouti Court on 20 September 2018, to invalidate the 3 rd Plaintiff’s Articles (“ Djibouti Invalidity Proceedings ”) and its board resolution passed on 18 February 2018, which authorized the commencement of the Articles Arbitration and these proceedings (which were commenced by the Plaintiffs against the Defendant in Hong Kong on 3 September 2018). The basis of the Djibouti Invalidity Proceedings is that the relevant Articles and resolution were contrary to Djibouti public policy. 31. The 3 rd Plaintiff challenged the jurisdiction of the Djibouti Court, on the basis that the Articles of the 3 rd Plaintiff and the JVA both contain arbitration clauses. This jurisdictional challenge was dismissed by the Djibouti Court on 29 January 2019, which decision was the subject of an appeal by the 3 rd Plaintiff. 32. On 26 September 2018, after the English Injunction had been extended and continued to restrain PDSA from causing the 3 rd Plaintiff to act in breach of the Articles, the Republic applied to the Djibouti Court to appoint an Administrator over the 3 rd Plaintiff, in place of the board, which appointment was made on 27 September 2018. Neither the 1 st nor the 3 rd Plaintiff were notified of the hearing of the application. The board of the 3 rd Plaintiff launched a challenge to the Djibouti Court with regard to the appointment of the Administrator, which the Plaintiffs maintain was contrary to the express provisions of the English Injunction, and was a matter which required the 1 st Plaintiff’s consent under the JVA. The Plaintiffs’ challenge was dismissed by the Djibouti Court on 15 November 2018. The board appealed against such dismissal, but the appeal was also dismissed by the Court of Appeal on 3 January 2019. The board appealed to the Supreme Court of Djibouti, but the Supreme Court dismissed the board’s challenge, on the ground that the pleadings were filed out of time - which is denied by the board. The board is seeking a review of the Supreme Court decision. The claims made in these proceedings, and the stay sought 33. It is against such factual background that the present proceedings, and the stay sought, have to be reviewed. 34. This action was brought by the Plaintiffs against the Defendant in Hong Kong on 20 August 2018. In essence, they contend that the steps taken by the Government of the Republic in its negotiations and dealings with the Defendant for the development of the Terminal and the Port/Free Trade Zone, and the agreements made between the Republic and the Defendant for such purposes, amounted to wrongful breaches of the 2004 and 2006 Concession agreements and of the JVA. The Plaintiffs claim that the Defendant had knowledge of the terms of the Concession Agreements and the JVA, and had intended to, and did, induce or procure the breaches of the Djibouti Government. In addition, the Plaintiffs claim in their pleadings that under Djibouti law, the Defendant would be liable for breach of Article 1391 of the Djibouti New Civil Code (“ New Code ”), and alternatively, for unfair competition. 35. The Defendant’s intended defence to the claims made is that, first, there was no breach of the Concession Agreements, which were invalid. On the Defendant’s case, the 2004 Concession agreement was not passed through the necessary legislative procedure at the time of its execution, and its terms were harmful to the public or national interest of Djibouti. 36. The 2006 Concession agreement and the JVA are also claimed to be invalid, in that they were procured by the Plaintiffs through Mr Boreh’s bribery. 37. The Defendant denies that it had knowledge of the Boreh Proceedings and the Rescission Arbitration, but claims that it was not a party to either of these proceedings, and is not bound by their outcome. 38. Further, the Defendant denies that the development of the Multipurpose Port constitutes breach of Clause 3.6.3 of the 2006 Concession agreement, and that in any event, the Plaintiffs had waived any breach. It also denies that it was engaged in the development of the Terminal or other ports as alleged by the Plaintiffs, and further denies that it had any intention to induce or procure any breach by the Djibouti Government. The Defendant claims that the Djibouti Government’s conduct towards the 3 rd Plaintiff could not have been what the Defendant intended, as it also had a stake in the 3rd Plaintiff through PDSA. According to the Defendant, some of the Decrees had potential ramification on its interests in the Republic, as illustrated by various complaints that the Defendant had raised with the Djibouti Government. 39. Finally, the Defendant denies that any breach of the Concession Agreements and the JVA was caused by any alleged procurement on its part. It claims that the Republic would have breached or terminated the Concession Agreements and the JVA in any event, since the relationship between the Republic and the 1st Plaintiff had deteriorated by virtue of many complicated political and commercial reasons. 40. In addition, the Defendant claims that it is entitled to rely on an indemnity from the Port Authority dated 28 August 2017 (“ Indemnity ”), whereby the Port Authority had warranted that the development of the Free Trade Zone was not in breach of the 2004 Concession Agreement, and that it would indemnify the Defendant for any claim made by the 2 nd Plaintiff. The proceedings to enforce the Indemnity would, according to the Defendant, be commenced in the Republic. 41. On 13 December 2018, the Defendant applied for these proceedings to be stayed in favor of the Civil Chamber of the Court of 1 st Instance in the Republic (“ Djibouti Court ”). It claims that the dispute has no real connection with Hong Kong, and should not be tried before the Hong Kong courts. Applicable legal principles 42. The legal principles applicable to determination of the Defendant’s application for stay are not in dispute. The burden is on the Defendant, as the applicant, to show that the alternative forum is clearly or distinctly more appropriate than Hong Kong for the trial of the action. The Defendant claims that the Djibouti Court is the more appropriate forum. 43. In SPH v SA (2014) 17 HKCFAR 364 , at para 51, the Court of Final Appeal restated the applicable legal principles, applying Spiliada [1987] AC 460 at 477: “1. The single question to be decided is whether there is some other available forum, having competent jurisdiction, which is the appropriate forum for the trial of an action ie in which the action may be tried more suitably for the interests of all the parties and the ends of justice? 2. In order to answer this question, the applicant for the stay has to establish that first, Hong Kong is not the natural or appropriate forum (‘appropriate’ in this context means the forum has the most real and substantial connection with the action) and second, there is another available forum which is clearly or distinctly more appropriate than Hong Kong. Failure by the applicant to establish these 2 matters at this stage is fatal. 3. If the applicant is able to establish both of these two matters, then the plaintiff in the Hong Kong proceedings has to show that he will be deprived of a legitimate personal or juridical advantage if the action is tried in a forum other than Hong Kong. 4. If the plaintiff is able to establish this, the court will have to balance the advantages of the alternative forum with the disadvantages that the plaintiff may suffer. Deprivation of one or more personal advantages will not necessarily be fatal to the applicant for the stay if substantial justice will be done in the available appropriate forum.” 44. As the Court held in Rambas Marketing Co LLC v Chow Kam Fai David [2001] 3 HKC 250 : “Mere convenience is not enough nor is it enough simply to point to factors which connect a case or the parties to any particular jurisdiction. The approach in foreign non conveniens applications is not just an exercise in building up factors which point to any particular jurisdiction. The court is required to focus on appropriateness of a forum from the point of view of the trial of action.” 45. The Plaintiffs placed emphasis on the fact that they had served the Writ on the Defendant as of right. The Defendant is incorporated in Hong Kong, and is listed on the Exchange here. I accept the Defendant’s submissions, that in placing the burden of showing that the alternative forum is clearly or distinctly more appropriate, the service of the proceedings on the defendant “as of right” has already been taken into consideration. This was explained by DHCJ Poon (as he then was) in New Link Consultants Ltd v Air China [2005] 2 HKC 260 , at paras 64-66: “While proper regard must be paid to the fact that jurisdiction is founded as a right, it is the connecting factors that determine if the Hong Kong court or the other forum is clearly more appropriate. Thus, if the connecting factors clearly point to the latter as the more appropriate forum for the trial the “as of right” point, however weighty that may be, will not tilt the balance back in favor of the Hong Kong court. It is therefore essential to look at the connecting factors in the present case to see in which direction they point to.” 46. Where a party claims that the alternative forum is not available or appropriate due to problems with the quality of justice in the jurisdiction, the test is whether there is a risk, that substantial justice would not be obtained in the foreign forum ( Altimo Holdings v Kyrgyz Mobil Tel Ltd [2012] WLR 1804). The parties have referred to Cherney v Deripaska [2009] 1 All ER (Comm) 333, where at paragraph 237 of the judgment, Clarke J observed: “An English court will approach with considerable circumspection any contention that the potential claimant cannot obtain justice or a fair hearing in a foreign court and will require “positive and cogent” evidence to persuade it to the contrary: The Abidan Daver [1984] AC 398 , 411c. Assertions to that effect are relatively easily made by generalized statements and may be difficult comprehensively to refute.” 47. The court pointed out in Cherney v Deripaska that its task is to identify the forum in which the case can suitably be tried for the interests of all the parties and the ends of justice, explaining thus: “Even if England is not the natural forum, the claimant may establish - the second stage - that substantial justice will or may not be done in the natural forum so that justice requires that the case be tried in England. If he does so then the case cannot be tried there more suitably in the interests of the parties and for the ends of justice, and England will be the proper place.” (Emphasis added) The connecting factors 48. The Defendant claims that the events, parties and witnesses are all connected with Djibouti, and not Hong Kong. The subject matter of the Concession Agreements and the JVA, namely the Terminal, the Port and the other infrastructure projects, are all situated in Djibouti. The relevant contracts claimed to have been breached were made with the Government of the Republic, and the breaches complained of relate to the development of projects in Djibouti. The Defendant claims that local circumstances are relevant, as are the alleged acts of inducement, namely negotiation of the shareholders’ agreement between the Port Authority, the Republic, the Defendant and its subsidiary in relation to their shareholding in PDSA, all of which took place in Djibouti. The loss suffered by the Plaintiffs, which the Defendant claims is the lost opportunity to develop the new ports and the free zones, and the lost profits from the Terminal, were likewise suffered in Djibouti. 49. The Defendant claims that its witnesses to be called at trial are substantially residents of Djibouti who speak French, and that a trial in Djibouti can be conducted without the need of translators. 50. The Defendant also claims that the Government officials and representatives of the Republic are reluctant to testify in Hong Kong, and only the Djibouti Court can subpoena them. 51. Apart from the location of the parties and witnesses, and the connection of the events with Djibouti, the Defendant placed heavy reliance on the materiality of Djibouti as the governing law of the central issues. Location of the parties 52. So far as the parties are concerned, the 1 st and 2 nd Plaintiffs and DP World are all incorporated in Dubai, and are managed and operated from there. The 3 rd Plaintiff is incorporated in Djibouti, but the Plaintiffs emphasize that as its corporate affairs were at all material times managed and controlled by the 1 st Plaintiff as its Manager (at least before the appointment of the Administrator), the 3 rd Plaintiff is truly located in Dubai. The majority of the 3 rd Plaintiff’s board and its executive team are all based outside Djibouti. 53. The Defendant is incorporated and listed in Hong Kong. On its case, it has 2 management centres: one in Shenzhen and one in Hong Kong. It claims that matters concerning the Share Purchase Agreement and the Shareholders Agreement relating to the shares in PAID were “primarily dealt with” in Shenzhen. Place of commission of the tort 54. On behalf of the Defendant, it was submitted that the place where a tort is committed is highly relevant and should be the starting point when the Court looks for the most procedurally efficient forum. The Plaintiffs complain of the Defendant’s inducement of the Republic’s breaches of its contracts, and in relation to acts of alleged unfair competition and breach of the Djibouti New Code. According to the Defendant, all the relevant events and conduct complained of took place in Djibouti, and relying on VTB Capital plc v Nutritek International Corpn [2013] 2 AC 337 , the Defendant contends that the appropriate forum to resolve a tortious dispute is that of the place where the tort occurred. 55. In VTB Capital, Lord Mance cautioned that it is likely to be “over-simplistic” to purely consider the place of commission of the tort in isolation. At para 51 of his judgment, he pointed out: “The place of commission is a relevant starting point when considering the appropriate forum for a tort claim. References to a presumption are in my view unhelpful. The preferable analysis is that, viewed by itself and in isolation, the place of commission will normally establish a prima facie basis for treating that place as the appropriate jurisdiction . But, especially in the context of an international transaction like the present, it is likely to be over-simplistic to view the place of commission in isolation or by itself, when considering where the appropriate forum for the resolution of any dispute is. The significance attaching to the place of commission may be dwarfed by other countervailing factors .” (Emphases added) 56. The place of commission of the tort is, at most, a starting point. In Base Metal Trading Ltd v Shamurin [2005] 1 WLR 1157 , the court noted: “In our case, the wrongful acts, being the decisions to speculate and give instructions accordingly, all took place in Russia . The place where the loss occurs is not determinative. When damage has occurred which makes the tort complete the right approach is to look back over the series of events constituting it and ask where in substance the cause of action arose : Distillers Co (Biochemicals) Ltd v Thompson [1971] AC 458 , 468.” (Emphases added) 57. The consideration of the appropriateness of a forum is from the point of view of the trial of the action, and in the present case, an important issue to be decided at trial is whether the Defendant had knowledge of the relevant contractual obligations between the Plaintiffs and the Republic, and had knowingly procured the breaches of such contracts. As the Plaintiffs pointed out, this involves the Court looking at the decisions made, and instructions given, by the individuals forming the Defendant’s management. Such individuals are based either in Hong Kong or in Shenzhen. I accept the Plaintiffs’ submissions, that although the implementation of the management decisions of the Defendant - in the operation of the ports and the Free Trade Zone in Djibouti, the negotiation and signing of the relevant agreements, and the operation of the day to day affairs of the subsidiary of the Defendant which held the shareholding interests in PAID, may have occurred in Djibouti, the fact and occurrence of these matters are not controversial. The material issue is the state of knowledge and the decision making in respect of the wrongful acts as alleged by the Plaintiffs, and these largely if not entirely took place in Hong Kong and/or Shenzhen. Shenzhen is not asserted by the Defendant as the alternative forum. 58. Further, the Plaintiffs have in their evidence claimed that the Defendant’s acts of interference in the Plaintiffs’ contracts with the Republic were part of its strategy of seeking investments in port infrastructure, in order to strengthen its strategic positioning in East Africa as part of the “One Belt One Road Initiative” (“ BRI ”), and that the Republic’s decision to renegotiate the 2006 Concession, on the purported ground that it was detrimental to the Republic’s sovereignty and best interests, was due to its intention to take over the 1 st Plaintiff’s interests in the Terminal, in order to give them to the Defendant, “to reduce the mounting debt owed by the Republic to Chinese institutions”. These assertions are denied by the Defendant, but the claims have to be considered in the context of where the Defendant’s alleged torts were committed (outside Djibouti as the Plaintiffs allege). Further, if these claims of political decisions and/or influences are pursued at trial, the witnesses of the Defendant who will have to be cross-examined will be those who were dealing with matters of overall strategy, policies and decision making of the Defendant, rather than the individual employees who were involved in the day to day operation in Djibouti. On the Defendant’s evidence, its management centres are in Shenzhen and Hong Kong and it can be envisaged that the key personnel are here and in Shenzhen. 59. In the context of the witnesses of the Plaintiffs to be called, Counsel for the Defendant also contended that on the question of causation between the alleged procurement by the Defendant and the alleged breach of the relevant contracts, the 1 st Plaintiff is effectively an arm of the Dubai Government, and that it was a vehicle utilized by the Dubai Government to reduce competition for its own ports and free zone. The Defendant’s case is that in order to protect Dubai’s strategic interest from regional competition, the 1 st Plaintiff had made efforts to suppress the development of ports under its control, including the Terminal in Djibouti, and that this had led to the deterioration of the relationship between the Republic and the Plaintiffs. In this regard, it is envisaged that the witnesses to be examined at trial would include the key officers and decision makers of the 1 st Plaintiff, who are based in Dubai. 60. The Defendant argued that the Djibouti Court is in a better position to consider the question of the alleged deterioration of the relationship between the Republic and the DP World group, by reason of its understanding of the local culture and sentiment towards the conduct of the DP World group. I do not accept this contention, as it is all a matter of evidence as to the alleged sentiments, and any alleged resentment by the Djibouti Government, which the Hong Kong Court can receive from the witnesses (as in any case not involving the Republic) and decide. 61. The damage suffered by the Plaintiffs, as a result of the tortious acts complained of, was in Dubai - where DP World, the 1 st Plaintiff and the 2 nd Plaintiff are located. 62. In all these respects, Djibouti cannot be seen to be clearly or distinctly more appropriate than Hong Kong as the forum for trial. Availability of witnesses and documents 63. The physical location of the witnesses and the documentary evidence are not significant considerations in this modern, global marketplace, particularly in the context of the cross-border transactions and cooperation, the size of the ventures and the significant amounts of the investments involved in the present case. As the Court observed in PT Krakatau Steel (Persero) v Mount Kerinci LLC [2009] 1 HKLRD 264 at para 80: “ … if and in so far as there is going to be a trial of this claim in Hong Kong (which for my part I should have thought it was unlikely), the fact that these gentlemen may have to travel to Hong Kong is relatively unimportant in the litigation scheme of things, given the emergence of what nowadays is referred to as the “global marketplace”; accordingly, when weighed in the scales this is no more than a very minor consideration.” 64. This point is illustrated by the fact that 4 out of the 11 named witnesses for the Defendant had traveled to London from Djibouti to give evidence in the Boreh Proceedings and the Rescission Arbitration, and had traveled to Hong Kong and other parts of China for different reasons. 65. As the Plaintiffs have also highlighted, the persons in Djibouti who have been named as potential witnesses for the Defendant are said to be giving evidence on the development, operation and management affairs of the Djibouti Mixed Port, when such factual part of the background dispute is not in issue, and the relevance and materiality of such evidence for trial is questionable. The Defendant has suggested that the Djibouti government officials who will be called are residents of Djibouti, that they can speak French but not Cantonese or English, and that they are “reluctant” to testify in Hong Kong (without further elaboration as to the reason for their alleged reluctance), should the trial be here. 66. I cannot foresee any difficulties for any witness to give evidence in French, or Putonghua, for a trial in Hong Kong, nor for translation to be arranged for documents in French. As for their alleged reluctance to give evidence, the Court in Botanic Ltd v China National United Oil Corp , unreported, HCA 1852/2005, 25 August 2008 drew a distinction in this regard between a party’s own witnesses, and third-party witnesses. In his judgment, DHCJ To stated: “By third party witnesses, I mean witnesses who are truly unrelated to the party intending to call them. Their cooperation to testify for the party is gratuitous in nature. In assessing the issue of availability of witnesses in the present context, the will of the third party witnesses must carry more weight than that of the parties’ own witnesses. The subjective belief of third party witnesses cannot be measured against any objective standard or reasonableness. Whether the belief is founded or not is irrelevant, because the party is at the mercy of his witnesses.” 67. Without further explanation, I see no credible reason why the Defendant would have difficulty in calling their own employees and witnesses from their collaborates in the Djibouti government, with whom the Defendant has ongoing and a close commercial relationship, to give evidence in Hong Kong. 68. On the other hand, the Plaintiffs claim that contrasting with any inconvenience of the type alluded to by the Defendant in relation to their own employees and witnesses from the Djibouti Government and authorities, the Plaintiffs themselves would be prejudiced by a trial in Djibouti, as it is unlikely that any of their witnesses would be able to travel to Djibouti to give evidence in court there. The Government of the Republic had cancelled the work permits of all the personnel of the Plaintiffs, who were expelled from the Republic on 22 February 2018. Even if the Plaintiffs’ personnel were able to travel to Djibouti, they fear for their safety and security in Djibouti in view of the Government’s belligerence against the Plaintiffs. Pursuant to the issue of the Decrees in February 2018, the Terminal and the operations, assets and personnel of the 3 rd Plaintiff had all been taken over by the Government, upon threat of criminal prosecution for non-compliance with the Decrees. The Plaintiffs’ local employees had been threatened with arrest and criminal sanctions. 69. In particular, Mr Boreh who is one of the Plaintiffs’ key witnesses, and a “third party witness” within the meaning of Botanic Ltd v China National United Oil Corp , unreported, HCA 1852/2005, 25 August 2008, is unwilling to travel to Djibouti to give evidence, as his personal safety will be at risk there. 70. One of the defences relied upon by the Defendant is that the 2006 Concession agreement and the JVA were invalid, as they were procured by the Plaintiffs through their bribery of Mr Boreh, who was at that time acting as the Republic’s representative. Leading Counsel has highlighted, in his submissions made on behalf of the Defendant, that the Boreh Judgment, the Rescission Award and the findings therein that there was no bribery on the part of Mr Boreh, are not binding on the Defendant and are inadmissible as evidence of the facts found. The Plaintiffs will therefore have to call Mr Boreh to give evidence at the trial of this action, as to his negotiations on the Concession Agreements. 71. Mr Boreh’s evidence on the bribery allegation is of significance to the Plaintiffs at trial, at least on the important issues of the validity of the 2006 Concession agreement and JVA, and whether there was breach thereof. These issues are also relevant to the challenges made of the Concession Agreements as being contrary to public policy or the interests of the Republic. Mr Boreh would be one of the witnesses who can give evidence for the Plaintiffs on the local conditions, policies prevailing at the material time and any relevant economic or social condition. 72. Mr Boreh was convicted of terrorism by the Djibouti Court in his absence. He has been living in exile since 2012, and has indicated that he will not be traveling to Djibouti for any reason, since he believes that he will be jailed by the Government if he should enter Djibouti. 73. Mr Boreh’s reluctance to travel to Djibouti, and his fears for his personal safety, are legitimate considerations in the assessment of forum non conveniens ( Cherney v Deripaska, Ho Yuen Ki v Ho Hung Sun [2007] 4 HKLRD 257 ). The Plaintiffs’ inability to call Mr Boreh as a witness at the trial is also relevant to the question of a legitimate advantage of which the Plaintiffs would be deprived, if the trial should take place in Djibouti. 74. To answer the Plaintiffs’ concern, the Defendant suggests that eithera judge of the Djibouti Court may move to any place the witness is to hear the evidence, or the witness may testify through video link. The Defendant also claims that it is possible for foreign witnesses to testify on a certificate of declaration before a public officer, if the witness cannot travel to Djibouti. The Plaintiffs have pointed out that these options have only been suggested as possibilities, and that it is unclear, on the Defendant’s evidence, whether any application for Mr Boreh’s evidence to be given by video link would be favourably accepted by the Djibouti Court, and whether the Plaintiffs’ witnesses may give evidence in this way as of right, as opposed to relying on the discretion of the Djibouti Court. 75. In any event, even if these options can be explored, compared with the ability to procure Mr Boreh’s evidence to be given directly in the Hong Kong court, it is clear that the Djibouti Court is not distinctly or plainly the more appropriate forum for the trial. 76. As for the location of the documentary evidence, even if they were out of Hong Kong, I cannot see the difficulties that may exist in making them available here. Any documents relating to the decision-making process of the Defendant, in Hong Kong or Shenzhen, should be available for a trial here. Documents relating to the damage suffered by the Plaintiffs would be located in Dubai. Governing law 77. The more controversial aspect is the application of foreign law in the determination of the issues at trial, and whether the Hong Kong Court, or the Djibouti Court, is the more appropriate forum to deal with this. 78. The Defendant highlights the fact that, apart from Djibouti being the place of commission of the tort alleged by the Plaintiffs (to make the law of Djibouti the governing law), even on the Plaintiffs’ own pleading, they claim that the Defendant’s conduct of procuring or inducing the breach of the Concession Agreements and the JVA is actionable under the law of Djibouti, as a tort as well as constituting unfair competition. On behalf of the Defendant, it was argued that trying the case in Hong Kong not only involves the expense of investigating and proving foreign law, but also the risk of the Hong Kong Court arriving at wrong conclusions on foreign law. If it is to be contended that Djibouti law was applied incorrectly, there will be no opportunity to take the case to the appellate court in Djibouti. 79. The Defendant also argued that there has not been any decision by the Djibouti Courts on the liability of a party under Article 1391 for procuring or inducing breach of contract. It is said to be a novel point under Djibouti law, and although the genesis of Article 1391 lies in article 1382 of the French Civil Code, French jurisprudence is not binding on the Djibouti Court which is free to develop its own law. The Defendant argued that the Hong Kong Court should not be developing Djibouti law, nor is it the appropriate court to determine questions of public policy of the Republic. 80. From the expert evidence adduced, there does not seem to be serious dispute that for the tort complained of under the Djibouti Civil Code, the relevant issues for determination at trial are whether there were breaches of the Concession Agreements (if valid); whether there was an act of interference by the Defendant with the performance of the Concession Agreements, with knowledge of the underlying obligations; whether there was damage sustained by the Plaintiffs; and whether there was a causal link between the fault of the Defendant and the damage sustained. In relation to the claim of unfair competition under the Civil Code, the issues for determination are whether there was conduct amounting to unfair competition; loss incurred; and a causal link between the unfair act and the loss. 81. Although the Defendant claims that no case has been decided by the Djibouti Court on the liability of procuring or inducing breach of contract, and that this is a novel point, it is not disputed between the experts that the Djibouti Civil Code is the same as the French Civil Code. The Djibouti Civil Code was promulgated only in April 2018, but the Plaintiffs’ experts point out that there is ample French case law on procuring and inducing breach of contract, and lawyers in Djibouti make regular reference to French case law before the Djibouti Court. 82. The Defendant maintains however that French jurisprudence is not binding, that the Djibouti Court is at liberty to formulate its own legal reasoning and principles, and Djibouti law is not bound by or equated with French law. The Defendant argued that there is little guidance to the Hong Kong Court as to how the relevant Article 1391 of the Djibouti Civil Code should be applied, and that the rules have to be, and should be, determined by the Djibouti Court. The Defendant’s expert states that: “… in principle-based legal systems like the French and the Djiboutian ones – whose style seems to contrast from the pluralistic, fact driven approach of the common law of torts general principles are only guiding principles. These guiding principles ‘do not supply the judge or attorney with rules capable of application’. Such rules have to be determined and implanted by the courts. And they are ‘invisible on the face of the Code itself”. 83. In Rambas Marketing Co LLC v Chow Kam Fai David [2001] 3 HKC 250 , the Hong Kong Court held: “ In cases where substantial and difficult issues of foreign law are involved, the court may well be compelled to stay the proceedings where there is an appreciable risk that justice will not be done . This risk may in certain circumstances be attributable to factors such as expense, but in the usual case would arise where the court was somehow concerned with the possibility that it might reach the wrong conclusion on an important aspect of foreign law. … The courts in Hong Kong (particularly the Commercial Court and the Admiralty Court), given the international identity and nature of the type of commercial litigation and litigants here, are often accustomed to dealing with aspects of foreign law. It does not therefore follow at all that once it is shown that issues of foreign law arise, that this will necessarily be a powerful, much less a decisive factor in favour of a stay. On the other hand, however, it is unrealistic not to acknowledge the fact that complicated issues of foreign law may arise with which the Hong Kong courts will not feel itself competent to deal; it is all a question of degree. ” (Emphases added) 84. Notwithstanding the evidence of the Defendant’s expert, I fail to see the alleged difficulty of ascertaining the guiding principles, under Djibouti law, relevant to procuring or inducing breach of contract. If the trial is to take place in Hong Kong, the trial judge will be hearing the evidence from experts on French law, and Djibouti law if different, to explain the relevant guiding principles applicable to the French Civil Code, and how they should be applied differently under the Djibouti Civil Code. The Defendant’s expert does not dispute that case law in the respective jurisdictions must be considered. 85. As Leading Counsel for the Plaintiffs pointed out, it is incumbent on the Defendant as the applicant for stay to identify and articulate what the disputed issue of foreign law is, why there is an issue, so that the court can decide whether the issue is indeed as substantial or difficult as Defendant contends, to compel a stay of the action on the basis that there is an appreciable risk that justice will not be done, as the Court might reach a wrong conclusion on an aspect of foreign law. There is no dispute that the issues are breach/unfair competition, knowledge, damage and causation. It is common ground that the relevant provision is the same under French law and Djibouti law. The Defendant accepts that there is no precedent on the point in Djibouti law, and that the parties have to resort to French law and precedents under French law. It has not been explained how, under French or Djibouti law, the issues of breach, knowledge, etc may substantially differ from the Hong Kong Court’s perception and understanding of the relevant principles, for example because these issues have been the subject of divergent judicial decisions or academic controversy, such that the Djibouti judges are more suited to arrive at the right decision, and Djibouti is clearly or distinctly more appropriate than Hong Kong as a forum. 86. It is also pertinent to bear in mind that English law is the expressed governing law of the Concession Agreements and other relevant agreements such as the Management Agreement and the SPA made by the Defendant. The JVA and the SPA did not provide for any express governing law, but did contain jurisdiction clauses which did not involve the Djibouti Court. English law is clearly relevant to the determination at trial of important issues relating to the Concession Agreements and alleged breach thereof. When the Hong Kong Court is more familiar with English law than the Djibouti Court, I cannot see that the Djibouti Court will clearly be more appropriate as a forum than Hong Kong to decide issues relating to the alleged breaches of the Concession Agreements. As Leading Counsel argued for the Plaintiffs, these governing law clauses in the relevant agreements also demonstrate the parties’ expectations to avoid litigation in Djibouti and Djibouti law, in relation to disputes which arise out of their contractual relationships and dealings. 87. On behalf of the Defendant, Counsel argued that in determining third party liability for procuring or inducing breach of contract, and the issue of whether there was unfair competition, the Court would have to consider the rationale behind third-party liability under French/Djibouti law, and the public policy or interest of the forum. It was contended that standards of fairness vary, depending on the state of development of a particular jurisdiction. France, being an advanced capitalist country, needs to enforce contracts and discourage unfair competitive behavior, but according to the Defendant’s expert, “less developed countries may adopt a less robust approach” to establishing third-party liability, to avoid being “too intrusive upon freedom of trade and competition”. It is suggested that the Djibouti Court may, with such considerations, decline to follow French case law. 88. The Defendant’s expert also claims that under French law, the approach to third-party liability requires consideration of all relevant elements, including public interests and national sovereignty, which had led the Republic to enact Law 202 and the Decrees. The Defendant further highlights that in the consideration of public interests and national sovereignty, the Port installations are strategic infrastructures and triggers public law issues. The expert states: “The consideration of [public interests and national sovereignty] is all the more necessary since under French law, strategic infrastructures such as Port installations fall within the maritime public domain, therefore triggering public law regime. Also, it should be noted that the construction and development of the Port constitutes under French law a public service mission, and that, therefore, contracts entered into in this regard by a public entity are administrative by nature. Yet, French law provides for the right for public entities to unilaterally terminate a contract on grounds of public interest, even where there is no provision for doing so set forth within the contract. Moreover, this option should apply to all contracts entered into by the Administration, which pursues objectives of public interest, regardless of whether contracts are submitted to public or private law.” 89. Accordingly, the Defendant contends that any issue of public policy of a particular forum should be decided by that forum, referring to CGU International Insurance plc v Szabo [2002] 1 All ER (Comm) 83; EL du Pont de Nemours & Co v Agnew [1987] 2 Lloyd’s Rep 585; and New Link Consultants Ltd v Air China [2005] 2 HKC 260 , and that the Djibouti Court should be the appropriate forum. 90. It has to be borne in mind that the Defendant bears the burden of showing the Djibouti Court to be clearly or distinctly more appropriate as the forum for trial. Whilst claiming, generally, that developing countries have “a mounting concern that the third party’s liability may have become too intrusive upon freedom of trade and competition”, I accept the submissions made on behalf of the Plaintiffs, that the Defendant and its expert have failed to clearly identify the particular socio-economic conditions in Djibouti which may create or call for a difference in the decision of the Court, in finding the existence of breach of contract, or of unfair competition, or damage, or causation, on the facts of this case, to justify departure from French law. The Defendant’s expert has not in fact stated that the Djibouti Court will, applying Djibouti law, apply different standards of fairness. Having stated the proposition that the Djibouti Court is at liberty not to follow French law, he only asked the rhetorical question as to how one could consider with certainty that the Djibouti Court would blindly adopt French case law and brush aside the potential benefits of a less demanding doctrine in the interests of the economy of Djibouti (paragraph 25 of Professor Fage’s report). 91. The need to consider public policy and public interests is one of the factors which the Court will include in its assessment of the relative appropriateness of the Hong Kong Court and the Djibouti Court. However, the existence of public policy considerations does not by itself mean that the Hong Kong Court would inevitably decline jurisdiction in favour of the foreign forum. Much will depend on the uniqueness of the policy consideration or the objective identified, and the complexities and circumstances of the case. The Defendant has had the opportunity to adduce elaborate expert evidence on the relevant issues. If such expert advocates any particular principle of Djibouti public policy, or the objective of any particular Djibouti statute/Code, the expert may identify this clearly in the report, and it is open to the Court to apply such public policy principle or objective to the facts and on the evidence available at trial. The principles so far outlined in the defendant’s expert evidence do not appear to be so unique, or too difficult to be correctly appreciated and applied by any competent court. Having said that, this Court would in its overall balancing exercise give due consideration to the relevance of public policy principles, and the fact that the Djibouti Court may be more familiar with the application of these policies. Authority to sue 92. The Defendant has raised a further issue concerning its dispute over the authority of the 3 rd Plaintiff to sue in these proceedings, relying on the appointment made by the Djibouti Court, on application made by the Republic, of a provisional administrator for the 3 rd Plaintiff (“ Administrator ”), without notice to the 1 st and 3 rd Plaintiffs. Such order was made on 27 September 2018, and the appointment is said to have replaced the board of the 3 rd Plaintiff until the dispute between the shareholders of the 3 rd Plaintiff is resolved. The appointment was made on application by the Republic, under the Code of Civil Procedure and article 52 of the Articles of Association of the 3 rd Plaintiff, on the basis that there was a dispute and conflict between the shareholders of the 3 rd Plaintiff which may hinder the effective operation of the 3 rd Plaintiff. According to the Defendant, upon the appointment of the Administrator, the board ceased to have authority to act on behalf of the 3 rd Plaintiff and there is no evidence that the Administrator has authorized the 3 rd Plaintiff to commence and take part in these proceedings. 93. The appointment of the Administrator is challenged by the 3 rd Plaintiff, which claims that the Djibouti Court had no basis or power under Djibouti law to appoint an administrator over the 3 rd Plaintiff on the ground of alleged “tension” between the shareholders as the Republic claims, since the appointment of an administrator was a “reserved matter” which required the 1 st Plaintiff’s consent under the JVA, and disputes between shareholders are subject to an arbitration clause in the JVA and under the Articles of the 3 rd Plaintiff. Further, the appointment was made without notice to and in the absence of the 1 st and 3 rd Plaintiffs, and is said to be in breach of natural justice. 94. The Djibouti Court dismissed the 3 rd Plaintiff’s challenge of the appointment of the Administrator, and its appeal against such decision was likewise dismissed by the appellate court. 95. On behalf of the Defendant, it was argued that the Djibouti Court is the natural forum for determination of the issue of whether the Administrator has authority to act on behalf of the 3 rd Plaintiff, which is a matter of internal management of the 3 rd Plaintiff, incorporated in Djibouti ( Ceskoslovenska Obchodni Banka AS v Nomura International Plc [2003] ILPr 20). The Defendant claims that the authority issue is a material and significant part of the dispute, and should be resolved in Djibouti. This is particularly so when some of the issues in the authority challenge are subject matter of the Djibouti Invalidity Proceedings which are already underway in Djibouti. 96. The appointment of the Administrator took effect from the date of the order of 27 September 2018. Commencement of these proceedings was authorized by resolution of the board of the 3 rd Plaintiff dated 18 February 2018, before the appointment. The order for appointment of the Administrator states that it was enforceable immediately (on 27 September 2018), but does not on its face invalidate decisions made and acts taken by the board of the 3 rd Plaintiff before the appointment. There is apparently dispute between the experts as to whether the appointment has any retrospective effect. There is no evidence that the Administrator has taken any action yet to challenge the 3 rd Plaintiff’s commencement and continuation of these proceedings. The Administrator in fact failed to intervene in the Rescission Arbitration. 97. The Plaintiffs argued that the courts have made it clear that authority to sue is not to be raised as a defence at trial, but should be dealt with at the outset as the preliminary issue, or at such other stage when the issue comes to the attention of the Court ( Kammy Town Ltd v Super Glory Corp Ltd , unreported, HCA 3524/2003, 14 January 2005, and Airways Ltd v Bowen [1985] BCLC 355). Hence, Leading Counsel for the Plaintiffs argued that any dispute over the 3 rd Plaintiff’s authority to sue does not fall within the forum non conveniens analysis as to the most appropriate forum for the trial of the action, which is the aim of the analysis, as emphasized in the judgment of the Court in Rambas Marketing . Should the authority of the 3 rd Plaintiff be raised, it should properly be raised before trial, and the Plaintiffs argued that if and when it is raised, the Court can deal with it on evidence of Djibouti law, as and if relevant. 98. In my judgment, the statement made by the Chief Justice in Rambas Marketing was to illustrate that the analysis of the connecting factors should not be made in abstract, or in the vacuum, or with considerations of, for example, discovery or preparation of the case for trial in mind, but with the focus on the trial - when the issues in dispute are to be substantively determined. When the question of a claimant’s authority to sue is raised, the courts have emphasized in Rambas and Airways Ltd that that issue must also be substantively decided by the court, at the outset, and should not be left to be determined at trial, together with the substantive issues between the parties. At paragraphs 13 and 14 of the judgment in Kammy Town , the court observed that the subject application to strike out for want of authority: “ requires a definitive determination by the court seised of the application on the point. In other words, either the action was authorized by the company or it was not. There is no halfway house. The point is to be decided according to the burden and standard of proof - the burden lies with those suing in the name of the plaintiff to prove authorisation. … For those reasons, it is not appropriate for a court, seised of the application, to simply say on the affidavit evidence before it that it is not a ‘plain and obvious’ case of a lack of authority, and therefore the application should be dismissed and the action allowed to proceed to trial. Rather, at the substantive hearing, the court has to see whether the objection raised by the defendant can be summarily disposed of on the affidavit evidence that has been placed before the court for the purpose, and if not, how the objection can be determined and give directions accordingly.” 99. I do not consider that the nature of the exercise as envisaged in Rambas , by itself, means that the existence of an issue as to the claimant’s authority to sue is irrelevant to the consideration of the factors pointing to the most appropriate forum. The necessity of the Court’s substantive determination of the issue of the claimant’s authority is, in my view, one factor which should be considered when the Court analyzes the question of which is the most appropriate forum for the determination of the claims in the action. 100. In this case, whilst the appointment of the Administrator may not affect the substance or ownership of the 3 rd Plaintiff’s rights to the relief sought, unlike the case in Ceskoslovenska and in Airways Ltd , whether there was any basis for the Djibouti Court to make the appointment under the Code of Civil Procedure and the Articles of Association of the 3 rd Plaintiff, and whether the board of the 3 rd Plaintiff had the right to continue these proceedings, is disputed. 101. In the present case, the appointment of the Administrator, and the validity thereof, would appear to depend on issues such as whether there was a dispute and conflict between the shareholders of the 3 rd Plaintiff which may hinder the effective operation of the 3 rd Plaintiff, whether the Djibouti Court could interfere in the management of the 3 rd Plaintiff in the event of “paralysis” of the corporate bodies concerned and the presence of an “imminent danger” for the 3 rd Plaintiff, assessed in the light of the interests of the company, and whether the appointment was necessary when the conflicts between the shareholders threaten the sustainability of the company and to protect the corporate interests of the company. 102. In Konamaneni v Rolls Royce [2002] 1 WLR 1269 , the court considered the right of the claimants to bring a derivative action on behalf of an Indian company. It held that the courts of the place of incorporation of a foreign company would “almost invariably” be the most appropriate forum for the resolution of issues relating to the existence of the right of shareholders to bring such action on behalf of a foreign company. Lawrence Collins J (as he then was) further held that in respect of issues relating to the exercise of discretionary powers of management, considerable weight should be attached to the role of the court of the place of incorporation, in deciding what was the most appropriate forum for the determination of such a claim (paragraph 66 of the judgment). For matters of internal management, they are governed by the law of the place of incorporation, and the courts of that place are best suited to give decisions on the control and extent of the powers of the management (paragraph 55 of the judgment). 103. On the issue of the 3 rd Plaintiff’s authority to sue, although the related matters in dispute could be decided by the Hong Kong Court as questions of fact on expert evidence, I would agree on balance that they may be more appropriately decided by the Djibouti courts, as to whether the Djibouti Court has jurisdiction under the Code of Civil Procedure to make the order, and whether the appointment was lawful. The issue of the 3 rd Plaintiff’s authority to sue and the validity and effect of the appointment of the Administrator points to Djibouti as arguably the more appropriate forum. However, in the balancing exercise, I have borne in mind that even excluding the 3 rd Plaintiff from these proceedings, the 1 st and 2 nd Plaintiffs have legitimate causes of action to pursue to trial. Conclusion on the connecting factors 104. Overall, in the “qualitative exercise” of the consideration of all the factors relevant to the determination of the issues for trial of this action, I am not persuaded that Hong Kong is not the natural forum with the most real and substantial connection with the action. Far from the Defendant’s suggestion, that all the connecting factors point to Djibouti, the only factors which do have any connection with the Djibouti Court is the relevance of public policy and the objectives of the New Civil Code, and the fact that one of the issues to be decided may be the validity of the appointment of the Administrator and the consequential authority of the 3 rd Plaintiff to continue these proceedings. All the other factors point to Hong Kong as the forum which has the most real and substantial connection with the action. As Leading Counsel for the Plaintiffs have emphasized, the burden is on the Defendant to discharge the burden of showing that the Djibouti Court is clearly and distinctly the more appropriate forum, and if the factors pointing to the Hong Kong Court and the Djibouti Court as the appropriate forum are equal, the Defendant has not discharged its burden of proof. 105. The starting point is that the Hong Kong Court already has jurisdiction over these proceedings which were properly served on the Defendant in Hong Kong, as of right. The issue is why this Court should not exercise that jurisdiction, and whether there is a forum which is more appropriate. Even after giving due consideration to the relevance of public policies and the relevance of the law of Djibouti, and balancing these against the other relevant factors, I am inclined to agree with the Plaintiffs that the Defendant has failed to discharge its burden to show that the Djibouti Court is clearly or distinctly more appropriate than Hong Kong as the forum for trial of the action. 106. However, even if I am wrong, and the Djibouti Court has been shown to be distinctly and clearly more appropriate than Hong Kong as the forum, I accept the submissions made on behalf of the Plaintiffs, that they will be deprived of a legitimate personal or juridical advantage if the action is tried in Djibouti. The following are my reasons. Lack of substantial injustice from the Djibouti Court and juridical disadvantage 107. It is acutely recognized, that a court will be extremely cautious, and “will approach with considerable circumspection” (in the words of Clarke J in Cherney v Deripaska [2009] 1 All ER (Comm) 333, at paragraph 37) before coming to a conclusion that justice or a fair hearing cannot be obtained in a foreign court. The cases show that it has to be established, by objective and cogent evidence, that there is a real risk that justice will not be obtained in the foreign jurisdiction. Comity and judicial restraint require such extreme caution. The Defendant relies on The Abidin Daver [1984] 1 AC 398 , Altimo Holdings v Kyrgyz Mobil Tel Ltd (PC) [2012] 1 WLR 1804 , Cherney v Derpaska (No 2) [2010] 2 All ER (Comm) 456, Pacific International Sports Club Ltd v Soccer Marketing International Ltd & Ors [2009] EWHC 1839 (Ch), and these principles are undisputed. 108. The Defendant’s case is that there is no cogent and positive evidence to support the Plaintiffs’ bare assertions of governmental or judicial impropriety, lack of judicial independence or corruption in Djibouti. It referred to the reminder in the judgment of Christopher Clarke J in Cherney v Derpaska [2009] 1 All ER (Comm) 333, that assertions to the effect that a potential claimant cannot obtain justice or a fair hearing in a foreign court are easily made by generalized statements, and repeated the warning against “an echo chamber effect”, “where one commentator states an impression which is swapped with the impression of another commentator, each citing the other as authorities supporting their own thesis without any systematic study of data”. 109. According to the expert opinion evidence adduced by the Plaintiffs, the Djibouti courts are not independent nor impartial, and Djibouti has structural problems of corruption. The Plaintiffs claim that they had not been able to find lawyers of their choice or preference to represent them in proceedings in Djibouti, and that they had faced violations of procedure and of due process in proceedings instituted there. The Plaintiffs referred to the fact that Djibouti scored only 31 on a 1-100 scale on Transparency International’s 2018 corruption perception Index (“ Index ”), which is below the average score of 43. The Plaintiffs also rely on the 2017 Human Rights Report of the US Department of State, that despite provisions in the Constitution and Djibouti law, the Djibouti judiciary lacked independence, was inefficient, that there were reports of judicial corruption, and that the Djibouti authorities often did not respect constitutional provisions for a fair trial. 110. The Plaintiffs’ expert also referred to the 2019 Index of Economic Freedom, and an analysis made by Agence Française pour le Developpement (“ AFD ”), with references to the lack of a sound judicial framework, and the need for improvement in commercial justice and criminal procedure in Djibouti. Their evidence is that by virtue of the politically sensitive nature of their case against the Republic, they had only been able to find two inexperienced lawyers who were able and prepared to represent them in legal proceedings against the Republic in Djibouti. 111. The Defendant’s expert criticized the Plaintiffs’ evidence on the Djibouti judicial system as biased, subjective, and lacking in verifiable and cited instances. According to the Defendant’s expert, independence of the judiciary is provided for under the Djibouti Constitution. In response to the analysis of AFD, that there is room for improvement in terms of civil justice system, procedure and business regulatory environment, the Defendant’s expert claims that there have been significant reforms and improvement in Djibouti in the past years. He accepts that the Djibouti legal system and practice require time to evolve and mature, but explained that there have been reforms leading to improvements in the enforcement of contracts, and increase in investors’ confidence. The expert refers to the fact that there are numerous other countries in Africa and other continents which have similar rankings as Djibouti in the Index, but which have “significant economic weight”. Emphasis was made of the fact that the Index deals with the public sector in general, and not the judicial body specifically. The expert summarized that whilst the legal system in Djibouti requires improvements, there is no basis for, and no objective and cogent evidence to support, the Plaintiffs’ broad statement that the Djibouti court system lacks independence or is subject to corruption concerns. 112. The question to the determined by the Court is whether there is objective, and sufficiently cogent, evidence to support the Plaintiffs’ claim, that there is a real risk on the particular facts and circumstances of this case that substantial justice cannot be obtained by the Plaintiffs, if this action is to be tried in Djibouti, and that Hong Kong is the forum where it is in the interests of justice for the case to be tried. 113. The need for cogent evidence is explained in Cherney v Deripaska on this basis: “In the absence of cogent evidence to the contrary the Court will start with the working assumption, for which comity calls, that courts in other judicial systems will seek to do justice in accordance with applicable laws, and will be free from improper interference or restriction. As this case indicates, where there is evidence to the contrary it may be hotly in dispute and difficult to evaluate. Such evidence is likely, in so far as it derives from reports and articles, to consist of “broad and conclusory allegations, founded on multiple levels of hearsay” and, if so, to be unacceptable as an indictment of the legal system or part of it. … But the Court is not blind to the fact that unfairness or partiality may arise from that which occurs behind the scenes rather than centre stage.” 114. In the Court of Appeal, Waller LJ further explained this requirement, in paragraph 29 of the judgment of Cherney v Deripaska [2010] 2 All ER (Comm) 456: “It does not follow that there is a requirement for ‘cogent evidence’ or any particular kind of evidence to establish all of the factors which may lead the court to be persuaded that, despite somewhere else being the natural forum, England is the forum where it is in the interests of all parties and the ends of justice for the case to be tried. The requirement is that the plaintiff, or now the claimant, should ‘clearly establish’ that England is the appropriate forum in that sense. This may be a distinction without much difference but it must not be forgotten that the judge is deciding whether a discretion should be exercised, and some points may seem more powerful on the evidence that he has and some less, but it is for the judge to evaluate the same and reach his conclusion. I should make clear again … that the judge is not conducting a trial. It is not a situation in which he has to be satisfied on the balance of probabilities that the facts have been established. He is in many cases seeking to assess risks of what might occur in the future. In so doing he must have evidence that the risk exists, but it is not and cannot be a requirement that he should find on the balance of probabilities that the risks will eventuate , eg as in this case that assassination will occur. He has only statements and experts, reports on which he is not going to hear cross-examination. He is able, of course, to take a view as to the cogency of the evidence at that stage. But then he has to make an evaluation taking account of all factors as to whether the claimant (despite Russia being the ‘natural forum’) has discharged the burden of showing that England is ‘clearly the proper forum’.” 115. The standard of proof, to be satisfied by the party which asserts that justice will not be done in the foreign jurisdiction, was clearly held in Altimo Holdings v Kyrgyz Mobil Tel Ltd [2012] 1 WLR 1804 to be requirement for evidence of the risk . The judgment of the Board also referred to OJSC Oil Co Yugraneft v Abramovich [2008] EWHC 2613 (Comm), and to the statement by Christopher Clark J that “the risk of judicial impropriety could be inferred from such matters as departure from normal judicial practice, or irrational conclusions”. 116. In The Abidin Daver [1984] 1 AC 39 , the Court referred to some examples of risks of justice not being obtainable: “The possibility cannot be excluded that there are still some countries in whose courts there is a risk that justice will not be obtained by a foreign litigant in particular kinds of suits whether for ideological or political reasons, or because of inexperience or inefficiency of the judiciary or excessive delay in the conduct of the business of the courts, or the unavailability of appropriate remedies.” 117. In the present case, we are not considering the alleged inefficiency of the Djibouti judiciary, or excessive delay in the conduct of the business of the courts there. What the Plaintiffs seek to establish is that the nature of their dispute and litigation with the Republic is political and sensitive. The Republic has sought, since 2012, to renegotiate or renege on the 2006 Concession with the Plaintiffs. It attempted to rescind the 2006 Concession by initiating the Rescission Arbitration in July 2014, and by commencing proceedings against Mr Boreh to impugn the 2006 Concession by alleging bribery. When these proved to be unsuccessful, as evidenced by the Rescission Award and the Boreh Judgment which dismissed all of the Republic’s claims, the Republic chose to ignore the Rescission Award and the Boreh Judgment, and used legislative acts and the passing of the Law 202 in order to empower the renegotiation of the relevant infrastructure contracts. When the Plaintiffs commenced the Termination Arbitration to seek a declaration that the 2006 Concession remained in full force and effect, the Republic issued the Decrees to declare the 2006 Concession to be terminated with immediate effect, and proceeded to take physical control of the Terminal, and to transfer the 3 rd Plaintiff’s assets and operations to its own entities. 118. As the Plaintiffs have emphasized, the Republic has publicly claimed and declared by its acts that the 2006 Concession is considered by it to be not only invalid, but against national interests and policies. The Plaintiffs are seeking orders and remedies which go against these declared interests, and the Defendant seeks these claims to be tried by the Djibouti Court, rather than the Hong Kong Court. Objectively, the Plaintiffs have cause to be concerned whether the Djibouti Court will be able to fairly and independently try the Plaintiffs’ claims, against the Republic’s declared intentions or interests. 119. The Plaintiffs’ complaint that there is a real risk they may not obtain justice from the Djibouti Court may be demonstrated by at least 2 instances. 120. In September 2018, the Republic commenced the Djibouti Invalidity Proceedings before the Djibouti Court of 1 st Instance, to invalidate the Articles of the 3 rd Plaintiff (which provide for the shareholders’ division of the positions on the board, voting commitments and the conditions for the dismissal of directors), and the board resolution of the 3 rd Plaintiff authorizing the commencement of the Articles Arbitration and these proceedings. The jurisdiction of the Djibouti Court was challenged by the 3 rd Plaintiff (“ Jurisdiction Challenge ”), on the basis that the JVA made between the 1 st Plaintiff and PAID for the Republic, as well as the Articles of the 3 rd Plaintiff, contain arbitration clauses which govern “all disputes…either between the Shareholders themselves regarding the Company affairs, or between the Shareholders and the Company”, and there was already the Articles Arbitration which had been commenced. 121. The Plaintiffs highlighted that in dismissing the Jurisdiction Challenge, the Djibouti Court ignored the provisions of the Djibouti Code of Civil Procedure, which require the Djibouti Court (in accordance with the well-known Kompetenz-Kompetenz principle) to decline jurisdiction, where the dispute before it has been referred to arbitration pursuant to an arbitration agreement, unless the arbitration agreement is manifestly void or manifestly not applicable. The reasoning of the Djibouti Court, in finding the arbitration agreement to be manifestly inapplicable, was that the relevant provision in the Articles refers to a dispute between “the company and shareholders”, whereas the dispute in the Djibouti Invalidity Proceedings commenced by the Republic was only a dispute between “the company and a shareholder”. With due respect, this appears to be an unduly restrictive interpretation of an arbitration clause. The decision of the Djibouti Court has to be viewed in the light of the fact that the Djibouti Invalidity Proceedings concern firstly, the power of the shareholders under the Articles to appoint and dismiss directors and the management of the 3 rd Plaintiff, and secondly, the validity of the resolution of the board of the 3 rd Plaintiff to initiate the Termination Arbitration and these proceedings, both of which relate to and are disputes between shareholders of the 3 rd Plaintiff. The interpretation and reasoning of the Djibouti Court, that the Djibouti Invalidity Proceedings do not concern a dispute between the shareholders themselves, and only covers a dispute between the 3 rd Plaintiff and “a shareholder”, fall in my view within the description of “departure from normal judicial practice, or irrational conclusions” referred to by the Court in OJSC Oil Co Yugraneft v Abramovich, from which an inference of the risk of judicial impropriety or partiality may be made, and it is questionable whether the decision was “intelligible and explicable” to be “within the margin of appreciation for judicial decisions” ( Erste Group Bank AG v JSC (VMZ Red October) [2013] EWHC 2926 (Comm)). 122. As the Plaintiffs have highlighted, the Republic has sought, by the Law 202, the Decrees and the 9/9 Ordinance to rescind and terminate concluded agreements with the Plaintiffs, and to take over the shares and control over the 3 rd Plaintiff. In addition, the Republic has sought by the Djibouti Invalidity Proceedings to reopen issues decided in judgments and awards handed down by competent tribunals and courts in accordance with jurisdiction and dispute resolution clauses agreed to by the Republic and its entities executing the relevant contracts, namely the Boreh Judgment, the Rescission Award and the Termination Award. Before the Djibouti Court, the Republic failed to acknowledge and accept the findings made in any of these decisions which clearly confirmed the validity of the 2006 Concession and the relevant contracts, and dismissed all the claims of invalidity, bribery and alleged illegality made by the Republic. 123. In particular, the appointment of the Administrator was applied for and granted by the Djibouti Court, despite and clearly against the English Injunction made by the court on 31 August 2018, and subsequently extended, which restrained PDSA and its associates from causing the 3 rd Plaintiff to act on any of the Reserved Matters provided for in the JVA (which include the appointment of administrators) without the 3 rd Plaintiff’s consent. In dismissing the challenge to the appointment of the Administrator, the Djibouti Court made no reference to the English Injunction against PDSA and its associates, and did not explain whether and how the English Injunction may affect the appointment. 124. The Plaintiffs claim that an appointment of administrator could only be made in the event of paralysis of the corporate bodies and presence of an imminent danger for the company, as contrasted with the Djibouti Court’s stated basis of the order for appointment, that “there was a dispute and conflict between the shareholders (of the 3 rd Plaintiff) which may hinder the effective operation of (the 3 rd Plaintiff)”. Their appeal to the Supreme Court against the Djibouti Court of Appeal’s dismissal of the 3 rd Plaintiff’s appeal on the appointment of the Administrator was dismissed by the Supreme Court. This was on the basis that its Statement of Demand was not filed within the time limit prescribed under the relevant Code of Civil Procedure. Although this is disputed by the Plaintiffs, how the relevant rules prescribing time for the filing of pleadings are to be construed is a matter of interpretation more appropriate for the Djibouti Courts to determine. However, the Plaintiffs’ complaints, that they were not notified of the hearing of the appointment of the Administrator in the first place, that the appeal was dismissed by the Supreme Court on its own motion on a purported technicality, without the Plaintiffs being given the opportunity to make submissions on the alleged failure to act within time, and to seek an extension of time if required, all demonstrate in the whole context of the Djibouti proceedings that the Djibouti Court may not give adequate consideration to the Plaintiffs’ legal rights, and that the Plaintiffs lack a fair opportunity to prosecute their claims and assert and protect their rights in Djibouti. 125. The Plaintiffs have further adduced evidence to support their claim that they had encountered difficulties in finding experienced lawyers who were able and prepared to represent them in their claims against the Republic. Despite the fact, as the Defendant sought to emphasize, of the existence of a shortlist of reputable Djibouti law firms in the guide published by Chambers & Partners, the Plaintiffs have only been able to find three lawyers who were prepared to act for them in Djibouti. The Plaintiffs considered that one of these three had a conflict of interests. The other two informed the Plaintiffs’ representatives that they were taking risks by accepting the case, which was very sensitive and widely covered by the local media. Inability to locate and identify lawyers in the alternative forum, in whom the litigant can have confidence, is an important factor in considering whether the alternative forum was available ( Mohammed v Bank of Kuwait and the Middle East KSC [1996] 1 WLR 1483 , 1494H-1495G). 126. I do not find convincing the arguments made on behalf of the Defendant, that the difficulties encountered by the Plaintiffs may have been due to the fact of the terms offered to the local counsel, or the fact that it was the first time the Plaintiffs’ representative was seeking assistance from local counsel and local lawyers preferred to deal with foreign lawyers with whom they had worked before or have a long-standing business relationship. 127. The fact that (as elaborated in paragraphs 69 to 73 above) the Plaintiff’s important witness, Mr Boreh, will not be able to go to Djibouti to give evidence on the important matters of his role in the negotiation and conclusion of the relevant Concession Agreements between the Plaintiffs and the Republic, which are now alleged by the Republic to have been procured by bribery and are void as illegal or being against public policy and the Republic’s national interests, is a weighty factor in the determination of the appropriate forum, and also the juridical advantage of which the Plaintiffs will be deprived if the action is to be tried in Djibouti, rather than Hong Kong. Mr Boreh’s evidence is relevant and material to refute the Republic’s claim of bribery, and to the Plaintiffs case that the 2006 Concession agreement and the other relevant contracts made between the Plaintiffs and the Republic were validly and lawfully concluded, and whether these contracts were in any way against the public policy and national interests of the Republic. Without his evidence, the Plaintiffs will suffer prejudice and will be deprived of a juridical advantage in the pursuit of their claims against the Defendant, to the extent that substantial justice may not be done. These outweigh any advantage that may be served by having Djibouti law and principles of public policy determined by the Djibouti Court, rather than by the Hong Kong Court on expert evidence. 128. The Defendant has sought reliance on the fact that it has a claim of indemnity to pursue against the Port Authority in Djibouti (“ Indemnity ”), in the event that it is held liable to the Plaintiffs in these proceedings. The Port Authority had warranted in writing to the Defendant that the development of the Free Trade Zone would not be in breach of the 2004 Concession, and that the Port Authority would indemnify the Defendant for any claim that may be made against it by the 2 nd Plaintiff. The Defendant claims that the enforcement of the Indemnity is likely to be governed by Djibouti law, and that it intends to prepare its claim under the Indemnity. 129. I have balanced this against the juridical disadvantage which the Plaintiffs may suffer if the matter is to be tried in Djibouti. Hong Kong procedural rules permit indemnity proceedings to be brought even after findings are made against the Defendant, and if the Defendant decides to pursue the Indemnity by third-party proceedings in this action, it is able to issue such proceedings and to serve such proceedings out of Hong Kong pursuant to Order 16 rule 1 (1) and Order 11 rule 11 (1), RHC. The Defendant therefore will not suffer any prejudice or be deprived of a juridical advantage to pursue the Port Authority under the Indemnity, if these proceedings continue and are tried in Hong Kong. Conclusion and orders 130. For all the above reasons, I dismiss the Defendant’s application to stay these proceedings for determination by the Djibouti Court as the appropriate forum. The costs of the application are to be paid by the Defendant to the Plaintiffs, with Certificate for 2 Counsel. (Mimmie Chan) Judge of the Court of First Instance High Court Mr Paul Shieh SC, Ms Sara Tong and Ms Natalie So, instructed by Deacons, for the 1st to 3rd plaintiffs Mr Rimsky Yuen, SC, Mr Law Man Chung and Mr Danny Tang (absent on 16 October 2019) instructed by Baker & McKenzie, for the defendant Appendix Look up this case on Lawcite Noteup",
  "length": 92127,
  "headers_seen": [
    "Background",
    "The various agreements",
    "The Defendant’s involvement",
    "The dispute with the Djibouti Government",
    "The claims made in these proceedings, and the stay sought",
    "Applicable legal principles",
    "The connecting factors",
    "Location of the parties"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2019/3104",
  "query": "kompetenz-kompetenz",
  "ts": "2025-10-16T10:51:35",
  "ok": true
}