{
  "title": "BANK OF CHINA (HONG KONG) LTD V. SZE WANG AND ANOTHER | [2004] HKCFI 55 | HKLII",
  "court": null,
  "year": 2004,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2004] HKCFI 55 BANK OF CHINA (HONG KONG) LTD V. SZE WANG AND ANOTHER Judgment Information Date 29 Jan, 2004 Action No. HCMP2825/2001 Neutral Cit. [2004] HKCFI 55 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCMP2825/2001 HCMP002825/2001 BANK OF CHINA (HONG KONG) LTD v. SZE WANG AND ANOTHER HCMP002825/2001 HCMP 2825/2001 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE MISCELLANEOUS PROCEEDINGS NO. 2825 OF 2001 _________________________ IN THE MATTER of the property known as Flat H, 19th Floor, Block 8, Nan Fung Sun Chuen, No. 23 Greig Crescent, Hong Kong being 692/2,004,900th part or shares of and in The Remaining Portion of Section A of Island Lot No. 8397. AND IN THE MATTER of Order 88, Rule 1 of the Rules of High Court _________________________ BETWEEN BANK OF CHINA (HONG KONG) LIMITED (Formerly known as The China and South Sea Bank Limited Plaintiff AND SZE WANG (施宏) 1st Defendant CHAN SHUK CHING (陳淑淸) 2nd Defendant __________________________ (Pursuant to the Orders of The Honourable Mr. Justice Suffiad to carry on dated 5 and 8 October 2001) Coram: Before Master Thomas So in Court Date of Hearing: 23 December 2003 Date of Handing Down Judgment: 30 January 2004 __________________________ ASSESSMENT OF DAMAGES __________________________ 1. In this case the Plaintiff claims against the 2nd Defendant for mesne profits in respect of the property at Flat H, 19th Floor, Block 8, Nan Fung Sun Chuen, 23 Greig Crescent, Hong Kong (\"the Property\"). Background 2. The 1st Defendant was at all material times the registered owner of the Property. By a mortgage dated 4th August 1995, the 1st Defendant mortgaged the Property to the Plaintiff as security to secure certain banking facilities that the Plaintiff granted to the 1st Defendant. 3. In or around August 2000, the 1st Defendant began to fall in arrears with his mortgage payment to the Plaintiff. Under clause 7.1 of the Mortgage, failure to pay mortgage payment is an event of default the occurrence of which would entitle the Plaintiff to enforce the Mortgage. Under clause 8 and 10 of the Mortgage, one of the powers that the Plaintiff has in enforcing the Mortgage is to 'take possession of, collect and get in the Property and to take rents and profits thereof.' 4. By a letter dated 9th August 2000 the Plaintiff informed the 1st Defendant that should he fail to repay the Plaintiff all sums owed the Plaintiff would exercise its right to take possession of the Property. 5. On or about 30th September 2000, without obtaining consent from the Plaintiff the 1st Defendant let the Property to the 2nd Defendant. This was evidenced by way of a written tenancy agreement in Chinese signed between the 1st and 2nd Defendants on 30th September 2000. The term of the tenancy was from 1st October 2000 to 30th September 2002 and the rent payable was HK$8,000 per month. 6. On 16th March 2001, the Plaintiff wrote to the 2nd Defendant notifying the 2nd Defendant of the Plaintiff's position as the mortgagee and requiring the 2nd Defendant to deliver vacant possession of the Property to the Plaintiff together with payment of any rental in arrears. 7. On 3rd April 2001, the Plaintiff wrote to the 2nd Defendant again requiring the 2nd Defendant to deliver vacant possession of the Property to the Plaintiff within 7 days. 8. On 23rd May 2001, the Plaintiff took out the present proceedings against both the 1st and 2nd Defendants claiming for, inter alia, money judgment against the 1st Defendant for money owed, vacant possession of the Property against both 1st and 2nd Defendants and for payment by the 2nd Defendant to the Plaintiff for damages and mesne profits for trespass. 9. Between the period of 28th June 2001 to 16th September 2002 the 2nd Defendant was legally represented by Messrs Cheng & Lo in this action. 10. On 9th April 2002, judgment was given by Master J. Wong (\"Master J. Wong's Order\") ordering money judgment in favour of the Plaintiff against the 1st Defendant and that the 1st and/or 2nd Defendant do within 28 days after service of the Order deliver vacant possession of the Property to the Plaintiff. 11. On 30th June 2002, the 2nd Defendant vacated the Property. She said in her evidence that she returned the keys of the Property to the 1st Defendant. 12. The Plaintiff took out a Writ of Possession and Writ of Fifa Combined on 18th July 2002 and on 10th September 2002 the bailiff in execution of the said Writ obtained possession of the Property for the Plaintiff. 13. The Plaintiff now claims for mesne profits on the Property to be paid by the 2nd Defendant for the period of 16th March 2001 to 10th September 2002 together with interest. 14. At the hearing of the assessment the Plaintiff was represented by Counsel Ms. Lo and the 2nd Defendant appeared in person. The 2nd Defendant however requested that she be represented by her brother, Mr. Chan who had her full authority to make submissions on her behalf. Ms. Lo, on behalf of the Plaintiff, did not object to that. Mesne Profits since when? 15. The 2nd Defendant says that under the terms of Master J. Wong's Order the Plaintiff did not get possession of the Property until 28 days after service of the Order on the 2nd Defendant. Hence the Plaintiff should not be entitled to claim mesne profits from 16th March 2001 onwards. The 2nd Defendant says that at most the Plaintiff should only be entitled to mesne profits from the day starting from 28 days from service of Master J. Wong's Order on the 2nd Defendant. And that by 30th June 2002 the 2nd Defendant had already vacated the Property. It is therefore also the 2nd Defendant's case that the Plaintiff should not be entitled to claim mense profits up till 10th September 2002. 16. The point made by Mr. Chan was that the Plaintiff only had \"possession\" of the Property after it obtained Judgment pursuant to Master J. Wong's Order. Under the terms of Master J. Wong's Order vacant possession of the Property should only be given after 28 days from the date of service of the Order. Hence the Plaintiff could only claim for mesne profits from that day onwards but not from as early as 16th March 2001. 17. Mr. Chan also tried to establish that there were certain negotiations between him and the Plaintiff's representative, Mr. Yuen at the material time during which the 2nd Defendant indicated her interest to purchase the Property from the Plaintiff. Mr. Chan tried to establish that during such negotiations the Plaintiff had somehow agreed that it did not have possession of the Property at that time. However, nothing much turned on that because the terms discussed could not be agreed upon between the parties and at the end the 2nd Defendant did not purchase the Property from the Plaintiff. 18. I think Mr. Chan is confusing the concepts of 'actual physical possession' and 'legal possession'. In the former concept it is right that the Plaintiff did not have actual physical possession of the Property on 16th March 2001. However in the latter concept it is clear that a mortgagee's right to claim mesne profits from a trespasser started from the day when the mortgagee notified the trespasser of its claim to possession of the Property. This principle was confirmed in the case of Yeung Lam v. Lam Po Chong (2000) 1 HK LRD 223. 19. Hence, irrespective of when the Plaintiff obtained actual physical possession of the Property there is no dispute that on 16th March 2001 the Plaintiff wrote to the 2nd Defendant demanding vacant possession of the Property. The 2nd Defendant in her evidence confirmed that she has received such letter. She took no action in response to that letter because she said she believed that she had nothing to do with the Plaintiff. Relying on the above legal principle, the Plaintiff is entitled to claim mesne profits from the 2nd Defendant from 16th March 2001 onwards. Until when? 20. Mr. Chan said that as the 2nd Defendant had already vacated the Property on 30th June 2002 the Plaintiff could not have any claim against the 2nd Defendant for mesne profits beyond that date. On this, however, the 2nd Defendant confirmed that although she vacated the Property by surrendering the keys to the 1st Defendant she had taken no steps to notify the Plaintiff of the same. This is notwithstanding that she was all along aware of the Plaintiff's interest in the Property and the Plaintiff's action taken so far to try and repossess the Property. The explanation given by the 2nd Defendant again is that she believed that she had nothing to do with the Plaintiff hence she took no steps to notify the Plaintiff of her vacating the Property. I note that at that time the 2nd Defendant was legally represented and there should not be any excuse for her to say that she did not understand her legal position. 21. Secondly, the 2nd Defendant gave evidence that she had already paid rental direct to the 1st Defendant up till April 2002. She produced two receipts evidencing that fact. The first receipt was in Chinese writing dated 23rd October 2001 purportedly signed by the 1st Defendant acknowledging receipt of rental payment totaling HK$48,000 for rental payment for the month of July, August, September, October, November and December of 2001. The 2nd receipt again was in Chinese writing dated 31st December 2001 purportedly signed by the 1st Defendant acknowledging receipt of rental payment for the month of January, February, March and April 2002 totaling HK$32,000. Despite the term of the tenancy agreement (clause 3) specifying payment of rental was to be made on the first day of each month the 2nd Defendant said in her evidence that she paid the 1st Defendant on the day of each of those receipts, and each time she paid the 1st Defendant in cash. Mr. Chan said that since the 2nd Defendant had already paid rental to the 1st Defendant she should not be ordered to pay to the Plaintiff again as to do so would amount to double payment. 22. The law is clear (see Yeung Lam v. Lam Po Chong referred to in paragraph 18 above) that upon notification of the mortgagee's claim to possession a tenant thereby became liable to pay mesne profits to the mortgagee for his or her continued occupation of the property. At the same time the tenant became absorbed from his or her obligation to pay rent to her landlord. Accordingly when the 2nd Defendant received the letter from the Plaintiff on 21st March 2001 she became liable to pay mesne profit to the Plaintiff and she became absorbed from her obligation to pay rent to the 1st Defendant. 23. I also wish to say that I find the 2nd Defendant's evidence insofar as it concerns payment of rental made to the 1st Defendant highly unusual. I find it strange that the 2nd Defendant would have paid the 1st Defendant in such a manner instead of following the terms of the tenancy agreement. I also find it unusual that the 2nd Defendant would pay such a large amount of money in cash to the 1st Defendant in the manner as described by the 2nd Defendant. And at the same time the 2nd Defendant could not produce any record of payment of rental made to the 1st Defendant prior to July 2001. I therefore have reservation over the 2nd Defendant's evidence in this regard. 24. Even accepting the 2nd Defendant's evidence that she had paid rent to the 1st Defendant the fact that at that time she was fully aware of the mortgagee's interest in the Property such should not excuse her from her payment obligation owed towards the Plaintiff. See the case authorities referred to in paragraph 18 and 22 above. Once the 2nd Defendant received notification of the Plaintiff's claim for possession of the Property she thereby became liable to pay mesne profits to the Plaintiff, but not to the 1st Defendant. The fact that she turned a blind eye to that and chose to pay to the 1st Defendant is her own mistake. She is still liable to pay mesne profits to the Plaintiff up till the date when the Plaintiff obtains vacant possession. 25. As the 2nd Defendant chose not to deal with the Plaintiff at the time the Plaintiff was left with no alternative but to continue with the enforcement proceedings by issuing Writ of Possession to obtain possession of the Property. Had the 2nd Defendant notified the Plaintiff of her vacating the Property on or about 30th June 2002 and arranged for a voluntary surrender of the Property to the Plaintiff it would not have been necessary for the Plaintiff to continue with the execution proceedings. In my judgment it is only right that the Plaintiff should be awarded mesne profits up till 10th September 2002 when actual possession of the Property was finally obtained. Amount of mesne profits 26. On the amount of mesne profits, Mr. Chan did not really dispute that. The law is that the amount of mesne profits claimable is to be calculated on the basis of the rental value of the property at the time based on the best available evidence. In this case it should be calculated as at 16th March 2001 as that was the day when the Plaintiff demanded possession of the Property from the 2nd Defendant. According to the tenancy agreement entered into between the 2nd Defendant and the 1st Defendant the monthly rental of the Property as at that date was HK$8,000. I would therefore adopt this for the purpose of calculating mesne profits payable by the 2nd Defendant to the Plaintiff in this case. 27. Based on the above, I award a total sum of HK$142,933.33 to the Plaintiff representing the amount of mesne profits payable by the 2nd Defendant to the Plaintiff for the period of 16th March 2001 to 10th September 2002. Particulars HK$8,000 x (17 + 26/30) months = HK$142,933.33 Interest 28. The Plaintiff also claims for pre-judgment interest under S.48 of High Court Ordinance . 29. It is trite that where a party claims for pre-judgment interest such claim needs to be specifically pleaded (see HKCP 2004 Vol.2 P.333 para. F.148/1). I fail to see any such claim pleaded in the Originating Summons. Because of that I refused to award any pre-judgment interest to the Plaintiff. Costs 30. Finally, I also make an Order Nisi that the Plaintiff be paid by the 2nd Defendant the costs of and occasioned by this assessment (including any costs previously reserved) to be taxed if not agreed with certificate for Counsel. (Thomas So) Temporary Deputy Registrar Representation: Ms. Jane Curzon Lo instructed by Messrs. K.W. Ng & Co. for the Plaintiff. The 2nd Defendant appearing in person. Look up this case on Lawcite Noteup",
  "length": 14568,
  "headers_seen": [
    "Background",
    "Mesne Profits since when?",
    "Until when?",
    "Amount of mesne profits",
    "Interest",
    "Costs"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2004/55",
  "query": "mesne profits",
  "ts": "2025-10-16T12:11:19",
  "ok": true
}