{
  "title": "A FIRM V. MG | [2022] HKCFI 841 | HKLII",
  "court": null,
  "year": 2022,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2022] HKCFI 841 A FIRM V. MG Judgment Information Date 22 Mar, 2022 Action No. HCCT26/2021 Neutral Cit. [2022] HKCFI 841 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCCT26/2021 HCCT26A/2021 A FIRM v. MG HCCT 26/2021 [2022] HKCFI 841 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO 26 OF 2021 (Transferred from HCA 1768/2020 pursuant to the Order of the Honourable Madam Justice Mimmie Chan dated 18 th March 2021) ____________________ IN THE MATTER OF an Arbitration Award dated 21 st July 2020 made by the Hong Kong International Arbitration Centre and IN THE MATTER OF Article 34 of the UNCITRAL Model Law on International Commercial Arbitration and IN THE MATTER OF Section 81 and Section 4 of Schedule 2 of the Arbitration Ordinance ( Cap 609 ) ____________________ BETWEEN A FIRM Plaintiff and MG Defendant ____________________ Before: Hon Mimmie Chan J in Chambers Date of Written Submissions: 3 March 2022 Date of Decision: 23 March 2022 _____________ D E C I S I O N _____________ 1. On 16 February 2022, this Court handed down a decision (“ Decision ”) dismissing the Plaintiff’s application to set aside an arbitral award of 21 July 2020. The nomenclature used in the Decision is adopted herein and below. 2. On 3 March 2022, the Plaintiff issued its summons seeking leave to appeal against the Decision. 3. Under the Award, the arbitrator dismissed the Plaintiff’s claims in the arbitration on the ground that it had not been established that the Plaintiff in the arbitration was the contracting party to the Agreement, to be entitled to commence the arbitration for fees due to the Plaintiff under the Agreement. 4. In support of its application for leave to appeal, the Plaintiff claims that the Court “erred in failing to avoid the conflict of interest” between the Plaintiff and the third party (“ 3 rd Party ”) alleged to have assisted the Defendant in the arbitration leading to the Award, and had further assumed erroneously that a party performing services for another party does not have to be paid or reimbursed. The Plaintiff also claims that the Court had ignored the fact that the Plaintiff’s application for setting aside the Award had never been opposed by the Defendant, and had erroneously ignored the further fact that the Plaintiff had complained to the arbitrator about the unauthorized assistance from the 3 rd Party. 5. It must be emphasized that an applicant seeking to set aside an arbitral award is required under Order 73 rule 1 RHC to state in its application the precise grounds of the application, and to file at the time of the issue of the application the affidavit intended to be used for its evidence in support of the application. This has been pointed out at paragraph 4 of the Decision. 6. The Court had been prepared, in this case, by virtue of the transfer of the proceedings to the Construction and Arbitration List, to consider the grounds set out in DB’s affidavit filed after the transfer of proceedings. The only ground set out in DB’s affidavit, which was pursued by the Plaintiff for its application to set aside, was that the arbitrator had failed to conduct the arbitral proceedings in accordance with the procedure agreed by the parties, in permitting the 3 rd Party to participate in the proceedings without the consent or knowledge of the Plaintiff. There was never any stated ground, of the Award being contrary to public policy (if that is the reason why the conflict of interest is sought to be raised in the intended appeal). The Plaintiff is bound by the grounds set out in the application for setting aside the Award, and cannot, for the purpose of seeking leave to appeal, assert or seek to rely on any new ground. This is trite. 7. Any question of possible conflict of interest was only relevant in the context of whether the Plaintiff had grounds to complain of and object to the assistance rendered by the 3 rd Party to the Defendant in the arbitration, and to apply to the arbitrator for an order compelling the Defendant to disclose the name of the person assisting him and to require proof of the authority granted by the Defendant to the 3 rd Party. The complaint of the Plaintiff was that the arbitrator had failed to do this, and that such a failure was a breach of the agreement concerning the manner of conduct of the arbitral proceedings. 8. This matter was dealt with in the Decision from paragraph 23 of the Decision. The Court found that there was no evidence that the Plaintiff had made any application to the tribunal, in the course of the arbitration, for an order to compel the Defendant’s disclosure of the identity of the 3 rd Party, or for any other relevant order which might have dealt with the Plaintiff’s complaint as to any breach, be it the wrongful disclosure of the Plaintiff’s confidential information, or the conflict of interest of the alleged 3 rd Party, or of any prejudice to the Plaintiff. Counsel for the Plaintiff accepted, at the hearing before the Court on 25 January 2022, that there was no application made to the tribunal. 9. The Plaintiff’s repeated references to the complaints it had made, by the letter it had sent on 4 July 2019, and by its Statement of Sur-Rejoinder dated 26 February 2020, did not constitute nor result in any application made to the arbitrator, for any remedy to rectify the alleged irregularity or non-compliance with any procedure complained of by the Plaintiff. This matter was explained at paragraphs 25 to 29 of the Decision. The 4/7 Letter was addressed to the HKIAC Secretariat, and not the tribunal, and the letter was sent before the appointment of the arbitrator. It cannot constitute or replace an application made to the arbitrator for any remedy in respect of the complaints made by the Plaintiff. 10. The Plaintiff’s ground of appeal, that the Court had ignored the evidence of its complaints, is groundless. 11. In reaching her decision that the Plaintiff was not the party to the Agreement, nor authorized to commence the arbitration, the arbitrator had considered the evidence adduced, as to the authority of DB and the authority of 安与恩(广州)咨询有限公司, but was not satisfied by such evidence. In applying to set aside the Award, the Plaintiff is not entitled to ask the Court to review the correctness of the arbitrator’s findings on the evidence and on the law. There is no ground to reargue this on appeal, simply on the basis that the Plaintiff should be entitled to seek reimbursement and payment of its fees and disbursements, or to pursue the Plaintiff’s claim as to which party was its designated agent. All that had been argued before and presented to the arbitrator in the arbitration. 12. Neither the arbitrator nor the Court ruled, or assumed, that a party performing services and making expenditure does not have to be paid. The essential question is whether a party commencing proceedings to sue for fees can prove to the satisfaction of the tribunal that it is the party entitled to payment under the relevant agreement and to make the claim for payment. 13. Finally, whether or not the Plaintiff’s application to set aside the Award is opposed by the Defendant, and whether or not the Defendant had filed evidence to oppose the Plaintiff’s claims in the application, the Plaintiff must prove its case, that it is entitled as a matter of law to set aside the Award under section 81 of the Ordinance. Section 81 applies Article 34 of the Model Law, and Article 34(2) states that an arbitral award may be set aside by the Court only if the party making the application furnishes proof of the matters set out in Article 34(2)(a). There is no basis whatsoever to claim that the Court had erred in ignoring the fact that there was no evidence from the Defendant to oppose the Plaintiff’s evidence in the application, and no ground to seek leave to appeal against the Decision on that basis. No court would simply rubber stamp any application made by any applicant. 14. There are no prospects of success at all in the intended appeal. The application for leave is dismissed, with costs on indemnity basis. (Mimmie Chan) Judge of the Court of First Instance High Court The Plaintiff was represented by Chin & Associates The defendant was not represented and never took part in these proceedings Look up this case on Lawcite Noteup",
  "length": 8452,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2022/841",
  "query": "Model Law",
  "ts": "2025-10-16T10:53:29",
  "ok": true
}