{
  "title": "CNG V. G, G AND SIL | [2025] HKCFI 3598 | HKLII",
  "court": null,
  "year": 2025,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2025] HKCFI 3598 CNG V. G, G AND SIL HCCT148/2024 CNG V. G, G HCCT149/2024 Collapse Titles Judgment Information Date 12 Aug, 2025 Action No. HCCT148/2024 HCCT149/2024 Neutral Cit. [2025] HKCFI 3598 Download MS Word Judgment Corrigendum Reading Options Translation Toggle Highlight Case History HCCT148/2024 HCCT149/2024 HCCT 148/2024 HCCT 149/2024 (heard together) [2025] HKCFI 3598 HCCT 148/2024 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO 148 OF 2024 ________________________ IN THE MATTER of an arbitration administered by the Hong Kong International Arbitration Centre under Case No HKIAC/A20258 (A24085) and IN THE MATTER of Sections 25 and 26 of the Arbitration Ordinance (Cap 609) and Articles 12 and 13 of the UNCITRAL Model Law on International Commercial Arbitration ________________________ BETWEEN CNG Applicant and G 1 st Respondent G 2 nd Respondent SIL 3 rd Respondent ________________________ AND HCCT 149/2024 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO 149 OF 2024 ________________________ IN THE MATTER of the Fourth Partial Final Award dated 30 August 2024 in an arbitration administered by the Hong Kong International Arbitration Centre under Case No HKIAC/A20258 (A24085) and IN THE MATTER of section 81 of the Arbitration Ordinance (Cap 609) and Article 34 of the UNCITRAL Model Law on International Commercial Arbitration ________________________ BETWEEN CNG Applicant and G 1 st Respondent G 2 nd Respondent ________________________ Before: Hon Mimmie Chan J in Chambers Date of Hearing: 7 May 2025 Date of Decision: 13 August 2025 ________________________ C O R R I G E N D U M ________________________ On page 25 (paragraph 61) of the Decision, at line 9, the words “leave for enforcement of” should be inserted after the words “setting aside”. Dated the 20 th day of August 2025. (Joanne Ma) Clerk to Hon Mimmie Chan J html PUBLIC \"-//W3C//DTD XHTML 1.0 Transitional//EN\" \"http://www.w3.org/TR/html4/loose.dtd\" HCCT148/2024 CNG v. G, G AND SIL HCCT 148/2024 HCCT 149/2024 (heard together) [2025] HKCFI 3598 HCCT 148/2024 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO 148 OF 2024 ____________________ IN THE MATTER of an arbitration administered by the Hong Kong International Arbitration Centre under Case No HKIAC/A20258 (A24085) and IN THE MATTER of Sections 25 and 26 of the Arbitration Ordinance ( Cap 609 ) and Articles 12 and 13 of the UNCITRAL Model Law on International Commercial Arbitration ____________________ BETWEEN CNG Applicant and G 1st Respondent G 2nd Respondent SIL 3rd Respondent ____________________ AND HCCT 149/2024 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO 149 OF 2024 ____________________ IN THE MATTER of the Fourth Partial Final Award dated 30 August 2024 in an arbitration administered by the Hong Kong International Arbitration Centre under Case No HKIAC/A20258 (A24085) and IN THE MATTER of section 81 of the Arbitration Ordinance ( Cap 609 ) and Article 34 of the UNCITRAL Model Law on International Commercial Arbitration ____________________ BETWEEN CNG Applicant and G 1st Respondent G 2nd Respondent ____________________ Before: Hon Mimmie Chan J in Chambers Date of Hearing: 7 May 2025 Date of Decision: 13 August 2025 _____________ D E C I S I O N _____________ Background 1. Hostilities appear to permeate this unfortunate arbitration. More than four years have elapsed from its commencement, four partial awards have been issued by the Tribunal, proceedings have been issued in more than one jurisdiction to challenge and resist enforcement of the awards and orders made by the Tribunal, court orders have been handed down in various jurisdictions, yet the matter does not appear to be nearing conclusion as the arbitration is still continuing and the parties remain bitterly embroiled in what appears to be never-ending dispute. It is even more unfortunate than the dispute now extends to the Tribunal, with the respondent (namely, the Applicant in these proceeding) seeking to remove the Presiding Arbitrator on the ground of doubts as to his impartiality. 2. Part of the background facts has been set out in the Reasons for Decision of this Court handed down on 27 February 2024 (“ Decision ”). The definitions of the parties and the other abbreviations used in the Decision are adopted below. 3. In brief, the HKIAC arbitration commenced by the G Parties against CNG in November 2020 (“ Arbitration ”) concerns a dispute between shareholders of SIL, the joint venture company, which is the 90% shareholder of a company which owns and operates an exploration and mining Project. In the 1 st partial Award dated 9 February 2023 (“ PFA 1 ”), the Tribunal held on the Share Transfer Claim in the Arbitration that the 1 st Respondent in these proceedings (one of the G Parties) had validly exercised its right of first refusal under the SHA, and CNG was ordered to transfer its 65% shareholding in SIL to the 1 st Respondent. CNG applied to the Hong Kong supervisory court on 27 April 2023 to set aside PFA1, which application was dismissed. 4. Further developments took place after the date of the Decision, and various orders and awards have since been made by the Tribunal in the Arbitration. The following is extracted from the Agreed Chronology, and from the summary of the proceedings outlined in the skeleton submissions filed by Counsel for the G Parties. The chronology and events are not disputed. Counsel for CNG in fact candidly accepted that CNG has not complied with two awards made by the Tribunal, and has unsuccessfully applied to set aside those awards. 5. On 26 June 2023, the Tribunal issued the 2 nd Partial Final Award (“ PFA 2 ”) on the Extensive Exploration Claim in the Arbitration, and found that CNG had failed to implement extensive exploration in accordance with good industry practice. Quantum was reserved for a further award which, at the date of the hearing before this Court on 7 May 2025, was still pending. CNG applied to the Hong Kong Court on 25 September 2023 to set aside PFA 2. On 8 March 2024, the Court dismissed the application, but remitted one issue back to the Tribunal for consideration. The remission resulted in the Tribunal’s issue on 25 May 2024 of an Addendum to PFA 2, resolving the question remitted in favor of the G Parties. 6. As a result of CNG’s failure to comply with PFA 1, the G Parties requested the Tribunal to make further orders in relation to PFA 1. On 21 November 2023, the Tribunal issued a Specific Performance Partial Award (“ PFA 3 ”), by which the Tribunal ordered specific performance of the Share Transfer. On 23 February 2024, CNG applied to set aside PFA 3. That application was subsequently withdrawn, on 6 May 2024. 7. In the interim, the G Parties obtained leave in April 2023 to enforce PFA 1 in the BVI. They also obtained leave in December 2023 to enforce PFA 3 in the BVI. On 15 April 2024, the BVI Court dismissed CNG’s application to set aside the enforcement orders for PFA 1 and PFA 3. 8. On 30 August 2024, the Tribunal issued its 4 th Partial Final Award (“ PFA 4 ”), whereby it dismissed the G Parties’ SXEW Plant Claim, but found that CNG was in breach of the SHA to develop Phase II of the Project. 9. Before that, on 28 March 2024, the BVI Court had granted an ex parte freezing order, and a mandatory injunction requiring CNG and SIL to repatriate sums which had been paid from SIL’s bank accounts to the Mainland (“ BVI Mandatory Orders ”). The G Parties had to apply to the BVI Court in May 2024, to seek contempt orders against ( inter alia ) CNG, SIL and their directors, for their failure to comply with the BVI Mandatory Orders. On its part, CNG applied for the discharge of these BVI Mandatory Orders. 10. As CNG continued its refusal to transfer its 65% shareholding in SIL to the 1 st Respondent in accordance with PFA 1 and PFA 3, the 1 st Respondent applied to the BVI Court for an order to rectify SIL’s share register, to record the 1 st Respondent as the owner of the shares in SIL (“ BVI Rectification Application ”). CNG’s answer for its non-compliance with PFA 1 and PFA 3 is that such compliance would amount to a loss of PRC State assets at a perceived undervalue, and that the Share Transfer should only be made by order of the BVI Court, rather than by the Tribunal or any other court. Notwithstanding such stance adopted, CNG nevertheless resisted the BVI Rectification Application. 11. The Tribunal continued to conduct hearings in the Arbitration throughout 2024. These include hearings on quantum for PFA 2, which took place on 6-8 March 2024 and 22 April 2024 to 3 May 2024, and a hearing on the G Parties’ application for interim measures including security and interim payment of costs, which took place on 9-10 April 2024, and 24-25 June 2024. 12. On 5 April 2024, CNG filed a Notice of Arbitration in a separate arbitration against the 1 st Respondent and SIL (“ 2 nd Arbitration ”), seeking a declaration of dividends from SIL, and alternatively remedies for unjust enrichment (“ Dividend/UE Claims ”). This followed a demand which CNG had made to SIL on 29 February 2024, claiming that a dividend should be declared for the shares CNG was still holding in SIL - notwithstanding that the Tribunal had ordered in February 2023 (by PFA 1) that the shares should be transferred to the G Parties. This caused the G Parties to apply to, and obtained from, the BVI Court an injunction on 29 February 2024, to prevent the payment by SIL of any dividends to CNG (“ Dividends Injunction ”). The Dividends Injunction was continued by the BVI Court on 14 March 2024. 13. On 9 April 2024, the G Parties sought a further partial final award from the Tribunal, to prohibit CNG from procuring any dividends, and to declare that CNG is liable to the G Parties for damages in respect of the losses caused by the delay in the transfer of SIL’s shares to it (“ No Dividends and Delay Claims ”). 14. The Dividend/UE Claims made in the 2 nd Arbitration have since been consolidated with the Arbitration, and is now also pending before the Tribunal. 15. The No Dividends and Delay Claims and the G Parties’ application for interim measures (including security and interim costs) were heard by the Tribunal on 24 and 25 June 2024 (“ June Hearing ”). At the end of the hearing, the Tribunal ordered that CNG was to make payment of US$100 million as security for the Extensive Exploration Claim made in the Arbitration (“ Security Order ”), and further, produce a costs schedule within 6 weeks. 16. It is the G Parties’ case that in the interim of the ongoing Arbitration, CNG has been systematically stripping the assets of SIL, in order to frustrate enforcement and to render PFA 1 and PFA 3 devoid of value. The G Parties claim that in September 2023, immediately after the Court dismissed CNG’s application to set aside PFA 1, CNG procured US$122 million to be paid from SIL’s bank accounts to the account of XXXXXX (“ SSA ”) on the Mainland. They claim that CNG had obfuscated the whereabouts of SIL’s cash to both the Tribunal and the BVI Court, and had misled them into believing that no cash had been moved. This ultimately led to the BVI Mandatory Orders made on 28 March 2024, whereby the BVI Court ordered CNG, SIL and SSA to repatriate the sum. The G Parties highlighted the fact that CNG had defied the BVI Mandatory Orders by procuring SSA to obtain injunctions from the Court in ROC, preventing itself to repatriate SIL’s funds, and preventing the disclosure of information concerning the Project. The G Parties pointed out that contempt proceedings are presently underway in the BVI against CNG. 17. As a result of CNG’s failure to comply with interim measures orders made by the Tribunal in February 2022 (for production) and in August 2024 (for security), proceedings were initiated before the BVI Court. On 17 September 2024, a receiver was appointed over CNG’s 65% shareholding in SIL (“ Receivership Order ”). CNG has applied to discharge the Receivership Order, and has not cooperated with the receivers. There is ongoing struggle for control over the SSA board and shareholders meetings via SIL’s shareholding. 18. On 4 October 2024, CNG initiated a third arbitration, to seek rescission of the SHA and SPA, and damages for alleged misrepresentations as to the amount of metal ore in the Project. These new claims have also been consolidated with the Arbitration, by direction given on 27 February 2025. 19. In the interim, CNG applied to this Court on 8 April 2025 for a stay of execution of the orders granting leave to enforce PFA 1 and PFA 3, pending ( inter alia ) resolution of the BVI Rectification Application. (That application for stay has since been dismissed on 28 July 2025.) 20. As of May 2025, the Tribunal was still deliberating over the quantum award for the Extensive Exploration Claim, and a partial award of costs. The Challenge 21. The present application to this Court is CNG’s request made under Article 13(3) of the Model Law (given effect by section 26 of the Ordinance) for this Court to decide on CNG’s challenge to the Presiding Arbitrator (“ Challenge ”). The Challenge was first made to the HKIAC under Article 12 of the Model Law on 10 July 2024, requesting that the Presiding Arbitrator (“ PA ”) should resign, or alternatively, that the HKIAC decide the Challenge by removing the PA and appoint a replacement to conclude the Arbitration. 22. Article 12 of the Model Law has effect by virtue of section 25 of the Ordinance, and it provides as follows: “ Article 12. Grounds for challenge (1) When a person is approached in connection with his possible appointment as an arbitrator, he shall disclose any circumstances likely to give rise to justifiable doubts as to his impartiality or independence. An arbitrator, from the time of his appointment and throughout the arbitral proceedings, shall without delay disclose any such circumstances to the parties unless they have already been informed of them by him. (2) An arbitrator may be challenged only if circumstances exist that give rise to justifiable doubts as to his impartiality or independence , or if he does not possess qualifications agreed to by the parties. A party may challenge an arbitrator appointed by him, or in whose appointment he has participated, only for reasons of which he becomes aware after the appointment has been made.” (Emphasis added) 23. Article 13(3) states: “If a challenge under any procedure agreed upon by the parties or under the procedure of paragraph (2) of this article is not successful, the challenging party may request, within thirty days after having received notice of the decision rejecting the challenge, the court or other authority specified in article 6 to decide on the challenge, which decision shall be subject to no appeal; while such a request is pending, the arbitral tribunal, including the challenged arbitrator, may continue the arbitral proceedings and make an award.” 24. The Challenge was made pursuant to the HKIAC Administered Arbitration Rules (“ Rules ”) governing the parties’ agreed procedure for the Arbitration. On 2 October 2024, the Challenge was dismissed on the recommendation of a Panel made pursuant to Article 11.9 of the Rules. 25. According to the Notice of Challenge dated 10 July 2024 (“ NOC ”), the Challenge was advanced on the ground that at the June Hearing, the PA demonstrated conduct which a fair-minded and informed observer would conclude gave rise to “ justifiable doubts as to the objectivity and impartiality of the PA ”. 26. The grounds stated in the NOC are that (in gist): (1) the PA made unbalanced and unfair comments regarding CNG; (2) the PA had predetermined CNG’s Dividend/UE Claims in favor of the G Parties; (3) the PA showed a disregard for CNG’s due process rights; (4) there was a pattern of conduct, and the events of the June Hearing were not isolated; and (5) the PA had fallen asleep for significant periods on numerous hearing days and this alone created a perception of a lack of apparent justice and fairness. 27. On the basis of the submissions made to the Panel formed under the HKIAC Rules to decide on the Challenge, the details of the Challenge as relied upon by CNG and as summarized by the Panel are that: (1) the PA’s views of the parties had been unfairly tainted by legitimate steps taken by CNG to challenge and/or resist enforcement of the Tribunal’s earlier partial awards, and CNG would not be given a fair hearing going forward and would be denied an opportunity to present their case before a fair and impartial tribunal; (2) the PA had in the June Hearing made “deeply prejudicial remarks about the case advanced by CNG, effectively pre-judging the outcome of its new claims”; and (3) the PA’s engagement with CNG’s counsel during hearings had been “openly hostile”, the proceedings were “transparently unfair with every procedural position stacked against (CNG) and demonstrating open inequality between the parties”. 28. Without going into the details of the Panel’s decision to dismiss the Challenge at this stage, it was not satisfied that the grounds for challenge under section 25 of the Ordinance and Article 12(2) had been made out. The Panel further held that any challenge concerning the PA’s conduct before 25 June 2024 had been waived under Article 32.1 of the Rules, as such conduct fell outside the 15 days specified in Article 11.7 of the Rules, within which any party aware of the relevant circumstances should serve notice of its challenge. 29. The relevant Articles of the Rules state as follows: “11.6 Any arbitrator may be challenged if circumstances exist that give rise to justifiable doubts as to the arbitrator's impartiality or independence, or if the arbitrator does not possess qualifications agreed by the parties, or if the arbitrator becomes de jure or de facto unable to perform his or her functions or for other reasons fails to act without undue delay. A party may challenge the arbitrator designated by it or in whose appointment it has participated only for reasons of which it becomes aware after the designation has been made. 11.7 A party that intends to challenge an arbitrator shall send notice of its challenge within 15 days after the confirmation or appointment of that arbitrator has been communicated to the challenging party or within 15 days after that party became aware of the circumstances mentioned in Article 11.6 . 11.9 Unless the arbitrator being challenged resigns or the non-challenging party agrees to the challenge within 15 days from receiving the notice of challenge, HKIAC shall decide on the challenge. Pending the determination of the challenge, the arbitral tribunal (including the challenged arbitrator) may continue the arbitration. 32.1 A party that knows, or ought reasonably to know, that any provision of, or requirement arising under, these Rules (including the arbitration agreement) has not been complied with and yet proceeds with the arbitration without promptly stating its objection to such non-compliance, shall be deemed to have waived its right to object .” 30. It is not disputed that under Article 13(3) of the Model Law, upon the Panel’s dismissal of the Challenge, the Court decides on the Challenge de novo ( P v D [2024] HKCFI 1132 ). Counsel for the G Parties submit that the Court may nevertheless accord weight to the views of the Panel. As observed by Burrell J in Pacific China Holdings Ltd v Grand Pacific Holdings Ltd [2007] 3 HKLRD 741 , when he gave regard to the ICC’s rejection of the challenge made in that case, the process whereby the ICC had considered the challenge was conducted in accordance with the agreed ICC procedure, by experienced ICC members, and as such “can be accorded some weight”. As Counsel for the G Parties submit in this case, the recommendation and decision of the Panel was based on their considerable experience of best arbitration practice, and are “a good proxy for an objective minded and informed observer”. Legal principles applicable to a challenge on the ground of lack of impartiality 31. Counsel for CNG highlighted the fact that under Articles 11.1, 13.1 and 13.5 of the Rules, and under section 46 of the Ordinance, an arbitrator has the duty to act fairly and impartially between the parties. That is indisputable. 32. Article 11.6 of the Rules provides that any arbitrator may be challenged “if circumstances exist that give rise to justifiable doubts as to the arbitrator’s impartiality or independence”. 33. As set out at paragraph 22 above, Article 12 of the Model Law states that an arbitrator may be challenged “only if” circumstances exist that give rise to justifiable doubts as to his impartiality or independence. (The other condition for challenge set out in Article 12 does not apply to the present case.) 34. There is no dispute between the parties, that the test for apparent bias (as stated in Jung Science Information Technology Co Ltd v ZTE Corporation [2008] 4 HKLRD 776 , paras 50-52) is applicable to a challenge made under section 25 of the Ordinance (which applies Article 12 of the Model Law). This is whether “an objective fair-minded and informed observer, having considered the relevant facts, would conclude that there was a real possibility that the tribunal was biased”. This was the test considered and applied in Porter v Magill [2002] 2 AC 357 , and in Deacons v White & Case Limited Liability Others (unrep, HCA 2433/2002). 35. The courts have since been given further guidance on the nature and attributes of this “fair-minded and informed observer”. Lord Hope explained in Helow v Secretary of State for the Home Department [2008] 1 WLR 2416 (paras 1-3) that “fair-minded” means that the observer does not reach a judgment on any point before acquiring a full understanding of both sides of the argument. The conclusions which the observer reaches must be justified objectively and the “real possibility” test ensures the exercise of a detached judgment. His Lordship went on to highlight the following (at para 3): “Then there is the attribute that the observer is ‘informed’ . It makes the point that, before she takes a balanced approach to any information she is given, she would take the trouble to inform herself on all matters that are relevant. She is the sort of person who takes the trouble to read the text of an article as well as the headlines. She is able to put whatever she has read or seen into its overall social, political or geographic context. She is fair-minded, so she will appreciate that the context forms an important part of the material which she must consider before passing judgment .” 36. In Johnson v Johnson (2000) 201 CLR 488 , para 53, the Court pointed out that the fair-minded and informed observer is “neither complacent nor unduly sensitive or suspicious”, which description was approved by the House of Lords in Helow . Kirby J’s full description of the fair-minded and informed observer in Johnson v Johnson is as follows: “ The attributes of the fictitious bystander to whom courts defer have therefore been variously stated. Such a person is not a lawyer. Yet neither is he or she a person wholly uninformed and uninstructed about the law in general or the issue to be decided. Being reasonable and fair-minded, the bystander, before making a decision important to the parties and the community, would ordinarily be taken to have sought to be informed on at least the most basic considerations relevant to arriving at a conclusion founded on a fair understanding of all the relevant circumstances. The bystander would be taken to know commonplace things, such as the fact that adjudicators sometimes say, or do, things that they might later wish they had not, without necessarily disqualifying themselves from continuing to exercise their powers. The bystander must also now be taken to have, at least in a very general way, some knowledge of the fact that an adjudicator may properly adopt reasonable efforts to confine proceedings within appropriate limits and to ensure that time is not wasted. The fictitious bystander will also be aware of the strong professional pressures on adjudicators (reinforced by the facilities of appeal and review) to uphold traditions of integrity and impartiality. Acting reasonably, the fictitious bystander would not reach a hasty conclusion based on the appearance evoked by an isolated episode of temper or remarks to the parties or their representatives, which was taken out of context. Finally, a reasonable member of the public is neither complacent nor unduly sensitive or suspicious.” 37. Kirby J’s description of the attributes of the fictitious bystander are apt and have important bearings on the viewpoint of the fair-minded and informed observer whose conclusion is the guage of whether there is a real possibility of bias. This bystander has many attributes, which should not be brushed aside in a zealous attempt to find lack of impartiality or independence. He or she can no longer be described simply as any man or woman on the Clapham omnibus/Shaukeiwan tram. As Lord Hope described it, he/she is “a relative newcomer among the selective group of personalities who inhabit our legal village” and has attributes which many of us might struggle to attain to. Nevertheless, he/she remains the person whose judgment we call upon to answer the question now before the Court. 38. It is also useful to bear in mind the pointed observations and reminders set out in the judgment of Lord Hodge DPSC in Halliburton Co v Chubb Bermuda Insurance Ltd [2021] AC 1083 (at para 68 of his judgment): “On other hand, the objective observer is alive to the possibility of opportunistic or tactical challenges. Parties engage in arbitration to win. Their legal advisers present their cases to the best of their ability, and this pursuit can include making tactical objections or challenges in the hope of having their dispute determined by a tribunal which might, without any question of bias, be more predisposed towards their view or simply to delay an arbitral determination. The courts are alive to similar tactical objections in litigation. In Locabail (UK) Ltd v Bayfield Properties Ltd [2000] QB 451 , the Court of Appeal (Lord Bingham of Cornhill CJ, Lord Woolf MR and Sir Richard Scott V-C) addressed the circumstances in which judicial office holders may be required to disqualify themselves from hearing a case. The court stated (para 25) that it would be dangerous and futile to attempt to define or list the factors which may or may not give rise to what we now describe as a real possibility of bias; “Everything will depend on the facts, which may include the nature of the issue to be decided”. The court stated (para 21): “If objection is then made, it will be the duty of the judge to consider the objection and exercise his judgment upon it. He would be as wrong to yield to a tenuous or frivolous objection as he would to ignore an objection of substance.” The court went on (para 22) to cite with approval dicta of Mason J in the High Court of Australia in In re JRL , Ex p CJL (1986) 161 CLR 342 , 352: “Although it is important that justice must be seen to be done, it is equally important that judicial officers discharge their duty to sit and do not, by acceding too readily to suggestions of appearance of bias, encourage parties to believe that by seeking the disqualification of a judge, they will have their case tried by someone thought to be more likely to decide the case in their favour.” An arbitrator when deciding to accept a reference is not under the same obligation as a judge to hear a case but, having taken up the reference, the arbitrator may reasonably feel under an obligation to carry out the remit unless there are substantial grounds for self-disqualification. Similarly, a court, when asked to remove an arbitrator, needs to be astute to see whether the ground of real possibility of bias is made out.” 39. Lord Hodge further pointed out (at paragraph 54 of his judgment) that the test of the appearance of bias “requires objectivity and detachment”, and that in applying the test to arbitrators, the differences in nature and circumstances between judicial determination of disputes and arbitral determination may have to be considered. In the arbitration context, His Lordship explained (at paragraph 67) that the professional reputation and experience of an individual arbitrator is a relevant consideration for the objective observer when assessing whether there is apparent bias, as an established reputation for integrity and wide experience in arbitration may make any doubts harder to justify. 40. In Bubbles & Wine Limited v Reshat Lusha [2018] EWCA Civ 468 , the Court made further and useful observations (at paragraph 17 of the judgment of Lord Justice Leggatt): “The legal test for apparent bias is very well established. Mr Faure reminded us of the famous statements of Lord Hewart CJ in R v Sussex Justices ex parte McCarthy [1924] 1 KB 256 at 259 that “it is not merely of some importance but is of fundamental importance that justice should not only be done, but should manifestly and undoubtedly be seen to be done” and that “[n]othing is to be done which creates even a suspicion that there has been an improper interference with the course of justice.” These principles remain as salutary and important as ever, but the way in which they are to be applied has been made more precise by the modern authorities. These establish that the test for apparent bias involves a two stage process. The court must first ascertain all the circumstances which have a bearing on the suggestion that the judge was biased. It must then ask whether those circumstances would lead a fair-minded and informed observer to conclude that there was a real possibility that the judge was biased : see Porter v Magill [2001] UKHL 67 ; [2002] 2 AC 357 , paras 102-103. Bias means a prejudice against one party or its case for reasons unconnected with the legal or factual merits of the case : see Flaherty v National Greyhound Racing Club Ltd [2005] EWCA Civ 1117 , para 28; Secretary of State for the Home Department v AF (No2) [2008] EWCA Civ 117 ; [2008] 1 WLR 2528 , para 53.” 41. His Lordship went on at paragraph 19 to note: “In Helow v Secretary of State for the Home Department Lord Hope observed that the fair-minded and informed observer is not to be confused with the person raising the complaint of apparent bias and that the test ensures that there is this measure of detachment: [2008] UKHL 62 ; [2008] 1 WLR 2416 , para 2; and see also Almazeedi v Penner [2018] UKPC 3 , para 20. In the Resolution Chemicals case Sir Terence Etherton also pointed out that, if the legal test is not satisfied, then the objection to the judge must fail, even if that leaves the applicant dissatisfied and bearing a sense that justice will not or may not be done: [2013] EWCA Civ 1515 ; [2014] 1 WLR 1943 , para 40.” 42. The attention drawn to the above observations made by the courts is not intended to reduce in any way the importance of any judge or arbitrator acting impartial, or being seen to be impartial ( Song Lihua v Lee Chee Hon (No 2) [2023] 5 HKLRD 488 , para 49). There cannot be any appearance of unfairness, as this will impair due process and constitute a miscarriage of justice to undermine public confidence in the judicial system. Waiver 43. The first issue arising for determination in this case is whether CNG is entitled to rely on any matter which occurred prior to 25 June 2024 , outside the 15-day period stipulated under Article 11.7 of the Rules, when the NOC was served and the Challenge was raised on 10 July 2024 . 44. On behalf of CNG, Counsel argued that waiver and estoppel have no application to bar CNG’s right to an impartial and independent tribunal under section 46 of the Ordinance, since this is mandatory and the right cannot be waived. It was contended that no waiver to such fundamental can be implied. 45. In support, Counsel for CNG pointed out that apart from section 46 of the Ordinance, Article 10 of the Bill of Rights Ordinance provides that “everyone shall be entitled to a fair and public hearing by a competent, independent and impartial tribunal established by law”. 46. I cannot accept these submissions made for CNG in light of the clear guidance given by the Court of Final Appeal in Hebei Import & Export Corporation v Polytek Engineering Co Ltd [2008] 5 HKLRD 488 , and by the Court of Appeal in Gao Haiyan v Keeneye Holdings Ltd [2012] 1 HKLRD 627 . 47. Hebei concerned an application to set aside an order made by the Hong Kong court granting leave to enforce an arbitral award, on the ground that the party had been deprived of an opportunity to present its case, when the tribunal had received evidence from one party in the absence of the other. The setting aside was refused, and on appeal, it was raised for the first time that the tribunal’s receipt of communications from one side in the absence of the other party amounted to apparent bias, and that it had been deprived of a fair trial before an impartial tribunal, such that it would be contrary to public policy to enforce the award in Hong Kong. The Court of Appeal set aside the leave granted for enforcement, but the Court of Final Appeal allowed the appeal. The Court was unanimous in finding that by failing to raise any complaint regarding the unilateral communications with the tribunal, and by continuing to take part in the hearing, the respondent should not be permitted to rely on the ground of public policy. 48. At page 137F of the reported judgment, Sir Anthony Mason NPJ observed: “Instead of raising the question on receipt of the letter, the respondent continued to participate in the arbitration. By pursuing this course, the respondent precluded an ascertainment in the arbitration of the extent of the chief arbitrator’s participation in the inspection and of the nature of any communications made to him by the technicians. Moreover, had the question been raised, it is possible that action may have been taken by the tribunal to remedy the situation, assuming that such action was necessary or desirable. Also precluded was an investigation of what happened at the inspection and the part that it played in the report and the tribunal’s decision. The respondent’s failure to raise the objection in the Beijing court and before Findlay J, though not directly relevant to the question now under consideration, had a similar effect. The respondent’s conduct amounted to a breach of the principle that a party to an arbitration who wishes to rely on a non-compliance with the rules governing an arbitration shall do so promptly and shall not proceed with the arbitration as if there had been compliance, keeping the point up its sleeve for later use (see China Nanhai Oil Joint Service Corp Shenzhen Branch v Gee Tai Holdings Co Ltd [1995] 2 HKLR 215 , [1994] 3 HKC 375 at p 387).” 49. His Lordship went on to explain at page 138F as follows: “Whether one describes the respondent's conduct as giving rise to an estoppel, a breach of the bona fide principle or simply as a breach of the principle that a matter of non-compliance with the governing rules shall be raised promptly in the arbitration is beside the point in this case. On any one of these bases, the respondent's conduct in failing to raise in the arbitration its objection arising from the communications to the chief arbitrator was such as to justify the court of enforcement in enforcing the Award.” 50. Gao Hai Yan likewise concerned a challenge to enforcement of an award in Hong Kong on the ground of public policy, and apparent bias on the part of the tribunal. The matter complained of was a private meeting which had taken place and was attended by one arbitrator and the representative of one party, but in the absence of another party/the respondent, and indications made/messages given by the tribunal member to the respondent after the meeting. After finding out about the meeting, no objection was raised by any party with the tribunal (for fear of antagonizing it). The Court of Appeal in Hong Kong held that the respondent seeking to resist enforcement of the award had clearly waived any irregularity, by keeping the complaint up its sleeve for later use. Tang JA (as His Lordship then was) referred to Hebei Import , highlighting the fact that the mischief of the party keeping silent was that it precluded an ascertainment by the tribunal of the relevant facts and to decide whether those facts established a case of actual or apparent bias, and if necessary, to remedy the situation. In Tang JA’s judgment, a clear case of waiver had been made out by the respondent not having raised any complaint of apparent bias to the tribunal. The substance of the complaint was based on the respondent’s right to a fair hearing by an impartial tribunal. 51. An objection on the basis of bias and the right to an impartial tribunal can therefore be waived by a party. As this Court held in S Co v B Co [2014] 6 HKC 421 , a party to an arbitration should act promptly if it alleges that there had been any breach of the rules of natural justice, and failure to do so can mean that it is estopped from relying on such matter as an objection later, when an award is unfavorable against it (see para 76 of the judgment). This is what the Court expects from the parties to the arbitration, if they should seek any recourse from the Court. 52. The approach of the Hong Kong Court is in line with the approach of the court in Stathooles v Mount Isa Mines Limited [1997] 2 Qd R 106 . In that case, Macrossan CJ referred to the judgment of the High Court in Vakauta v Kelly (1989) 167 CLR 568 at 572, where the court dealt with the conduct of the trial judge said to give rise to a perception of bias, and had the following observations: “ a party who has legal representation is not entitled to stand by until the contents of the final judgment are known and then , if those contents prove unpalatable, attack the judgment on the ground that , by reason of those earlier comments, there has been a failure to observe the requirement of the appearance of impartial judgment . By standing by, such a party has waived the right subsequently to object . The reason why that is so is obvious. In such a case, if clear objection had been taken to the comments at the time when they were made or the judge had then been asked to refrain from further hearing the matter, the judge may have been able to correct the wrong impression of bias which had been given or alternatively may have refrained from further hearing. It would be unfair and wrong if failure to object until the contents of the final judgment were known were to give the party in default the advantage of an effective choice between acceptance and rejection of the judgment and to subject the other party to a situation in which it was likely that the judgment would be allowed to stand only if it proved to be unfavourable to him or her.” (Emphases added) 53. It was next contended by CNG that the right to an impartial tribunal can only be waived where such waiver is “voluntary, informed and unequivocal”, and “the party waiving should be aware of all the material facts, of the consequences of the choice open to them, and given a fair opportunity to reach an unprecedented decision”, citing ZN v Secretary for Justice [2015] HKCFI 2078 , paras 55- 56. 54. On the facts of the present case and on the materials presented by CNG itself, I cannot see how it can be said either that when CNG continued with the Arbitration in June 2024, it was not or had not been informed of the very matters of which it and its team of lawyers are now complaining, or that their continued participation in the Arbitration was not in any way voluntary. The incidents of which CNG complain, of the PA’s sleeping and hostile remarks and attitudes, had on CNG’s own case persisted throughout the Arbitration, including at least the hearings in April and May 2024. They continued to participate in the hearings of the Arbitration, including taking steps to obtain recording of the hearings in March, April, and May 2024, and it was only on 9 July 2024 that those acting for CNG wrote to the HKIAC to object to the continued appointment of the PA and to challenge the impartiality of the PA. On the facts and evidence, there had been voluntary, informed and unequivocal waiver of the incidents said to comprise the PA’s lack of impartiality or bias before 25 June 2024. It was only in July 2024 that the complaint and the Challenge were made. There had clearly been informed and unequivocal waiver of any alleged bias in respect of the incidents before and not covered by the Challenge. 55. It was argued by CNG that it was only at the hearings on 24 and 25 June 2024 of the interim measures and dividend claims, that it became apparent to CNG, after the long history of the PA’s alleged hostility and sleeping incidents, that the PA might be biased and had shut his mind to CNG’s case. This is hardly credible when, according to CNG, the PA had been unfairly treating them and their counsel with hostility since the earliest hearings which had led to its first application to set aside PFA 1. This Court dismissed that complaint, but CNG had been making the assertions of their perception of hostility as early as April 2023. As the Panel pointed out in its Recommendation, even if it were appropriate to cumulatively assess the conduct of the PA for the purposes of the Challenge, CNG has not shown why the events of the hearings in June 2024 were “a cumulative tipping point”, to explain its inactivity before July 2024, or to justify its late Challenge. On the evidence presented to this Court, I agree with the Panel. 56. As my finding is that CNG had waived its right to complain of facts and alleged defects and irregularities occurring before 25 June 2024, the only matters to be considered for the Challenge are the events of the hearing on 25 June 2024. 57. The matters complained of in the Challenge regarding the 25 June hearing are that the PA lacks impartiality for two reasons (paragraphs 2.1 and 2.2 of Counsel’s Skeleton Submissions): (1) the PA had slept or was inattentive at the hearing; and (2) the PA had treated CNG and its legal representatives with overt hostility and had prejudged matters relevant to CNG’s position. The PA’s sleeping 58. It must be borne in mind that the present application is one made under section 26 of the Ordinance and Article 13 of the Model Law, for the Court to decide on the Challenge made by CNG under Article 12(2) of the Model Law, that circumstances exist which give rise to justifiable doubts as to the PA’s impartiality or independence. This is not an application to set aside an award made by the Tribunal, on the ground of public policy, or that CNG was unable to present its case. The question is whether by virtue of the matters complained of, the PA should be removed as arbitrator on the specific ground that he lacks impartiality. 59. It is also important to bear in mind the provisions of section 3(2)(b) of the Ordinance, that the Court should interfere in the arbitration of the dispute only as expressly provided for in the Ordinance. 60. Under Article 13 of the Model Law, the Court is now tasked to consider the Challenge, on CNG’s claim that by reason of the matters complained of and the circumstances alleged, there are justifiable doubts as to PA’s impartiality. This is the expressed (and only) basis for the Court’s intervention. The permissible challenge under Article 12 does not extend to the Court interfering on the ground of public policy, or substantial injustice, or that it would be just or fair to intervene. 61. CNG placed much reliance on this Court’s decision in Song Lihua v Lee Chee Hon (No 2), where I referred to various cases in which incidents had occurred of members of the tribunal or judges sleeping at hearings, and observed that there is “no apparent justice and fairness, when a member of the decision-making tribunal was not hearing and focused on hearing the parties in the course of the trial”. My conclusion in the case of Song Lihua , where the arbitrator was seen not to be focused on hearing the parties’ submissions but was wandering and traveling, was that enforcement of the award made in those circumstances would violate the most basic notions of justice in Hong Kong for requirements of a proper and fair trial, and should be refused. It was a case for setting aside an award on the ground of public policy, where the Court is given the discretion under section 95 of the Ordinance to refuse enforcement when the ground of public policy is established. There was justification and good reason for the Court to interfere, under the express provisions of the Ordinance. 62. R v Cesan [2009] 1 LRC 416 is a case where the Chief Justice of the High Court of Australia considered in some detail a complaint of a trial judge who was asleep for significant parts of a trial by jury. French CJ referred to and analyzed a line of authorities on material irregularities and whether and how they would constitute a miscarriage of justice. 63. The consideration in R v Cesan is whether there was miscarriage of justice in the criminal trial in question for the proviso in the statutory provision (on whether substantial miscarriage of justice has occurred) to apply. Miscarriage of justice was considered to include a situation in which there is a lack of fair process (paragraphs 64 to 71 of the judgment). Paragraphs 71 and 72 of French CJ’s judgment are set out below: “71. There are elements of the judicial process which can be said, at least in a metaphorical way, to play a part in maintaining public confidence in the courts irrespective of their relationship to the actual outcome of the process. The appearance of impartiality is one such. In North Australian Aboriginal Legal Aid Service Inc v Bradley [2004] HCA 31 , (2004) 218 CLR 146 at 162 the joint judgment quoted with approval the observation by Gaudron J in Ebner v Official Trustee in Bankruptcy [2000] HCA 63 , [2001] 2 LRC 369 at [81]: ‘Impartiality and the appearance of impartiality are necessary for the maintenance of public confidence in the judicial system.’ The somewhat elusive criterion of ‘public confidence’ is in some cases, such as the appearance of bias, subsumed in what a fair and reasonable observer would think. The courts nevertheless depend in a real sense upon public confidence in the judicial system to maintain their authority. The maintenance of that authority depends, inter alia, upon that element of the judicial process which requires that parties before the court be given and be seen to be given a fair hearing. It is necessary to a fair hearing that the court be attentive to the evidence presented by the parties and to the submissions which they make. The appearance of unfairness in a trial can constitute a ‘miscarriage of justice’ within the ordinary meaning of that term (see R v Hertrich (1982) 1367 DLR (3d) 400 at 430 and R v Duke (1985) 22 CCC (3d) 217 at 223). 72. The appearance of a court not attending to the evidence and arguments of the parties and control of the conduct of the proceedings is an appearance which would ordinarily suggest to a fair and reasonable observer that the judicial process is not being followed. That is not to say that every minor distraction, inattention, sign of fatigue or even momentary sleepiness constitutes a failure of the judicial function. The courts are human institutions operated by human beings and there must be a margin of appreciation for human limitations. Otherwise the judicial system would be rendered unworkable by the imposition of unachievable standards. Nevertheless, it would be an unnecessarily narrow view of the judicial duty to say that appeal courts are to judge such lapses solely by reference to their effects upon the outcome of the case….” 64. On the pertinent question of whether sleep or inattention by a trial judge can constitute a miscarriage of justice in a trial by jury, French CJ had this to say: “90 It is perhaps a reflection of the human condition and the demanding nature and expectations of the judicial function that the phenomenon of the sleeping or apparently sleeping judge has a long history dating back to Plato’s reference to ‘dozing judges’. (See Pannick Judges (1987), pp 77-78 and Foss A Biographical Dictionary of the Judges of England (1870) referring (p 223) to Judge Doderidge. See also William Hogarth’s 1758 painting The Bench .) 91 Appellate courts in common law jurisdictions have deprecated judicial sleepiness where it has occurred. Nevertheless in reported cases in the United Kingdom, the United States and Canada there has been a tendency to focus on the practical effects of the judge’s conduct on the trial process. In many of the cases this may be attributed, at least in part, to the brevity or inconsequential character of the incidents. In some cases failure by counsel to raise concerns at trial about the judge’s condition has been a significant factor weighing against appellate intervention…. 92 The general principle that a fair trial requires a judge to be attentive to the evidence and submissions of the parties was supported by the judgment of the Court of Appeal of England and Wales in Stansbury v Datapulse plc [2003] EWCA Civ 1951 , [2004] ICR 523 at [28]. Peter Gibson LJ (Latham LJ and Sir Martin Nourse agreeing) said: ‘A member of a tribunal who does not appear to be alert to what is being said in the course of the hearing may cause that hearing to be held to be unfair, because the hearing should be by a tribunal each member of which is concentrating on the case before him or her. That is the position, as I see it, under English law, quite apart from the European Convention on Human Rights.’ Peter Gibson LJ saw the proposition as reinforced by art 6(1) of that Convention: Kraska v Switzerland (1993) 18 EHRR 188 at 200-201. Successful appeals based on the appearance of sleep were R v Weston-super-Mare Justices ; ex p Taylor [1981] Crim LR 179 and Kudrath v Ministry of Defence (26 April 1999, unreported), UK EAT; cf R v Langham [1972] Crim LR 457. 93 If, by reason of sleep episodes or serious inattention, the reality or the appearance exists that a trial judge has substantially failed to discharge his or her duty of supervision and control of the trial process in a trial by jury, then enough has been made out to establish a miscarriage of justice. The question whether there has been the reality or appearance of a substantial failure by the judge to perform his or her duty will require assessment of a number of factors including : 1. Whether the conduct of the judge can be said to have affected the outcome of the trial. 2. Whether the conduct of the judge has created a risk that the outcome of the trial may have been affected. 3. Whether counsel raised the question of the trial judge’s conduct at the trial. 4. Whether the jury appeared to have noticed or to have been distracted or otherwise affected by the judge’s conduct. None of these factors, taken by itself, is determinative. There is an overall assessment to be made in deciding whether a failure or apparent failure by the judge for whatever reason to attend to the duty of supervising and controlling the trial process amounts to a miscarriage of justice . In so saying it should be emphasised that the duty of counsel in a case of non-trivial inattention or sleep episodes is to draw these issues to the attention of the judge in the absence of the jury. The failure of counsel to do so may support an inference that the judge’s conduct did not amount to a substantial failure in the judicial process at trial. However, it will not always be determinative.” (Emphases added) 65. In the case of Stathooles v Mount Isa Mines Limited [1997] 2 Qd R 106 , Chief Justice Macrossan made similar observations (at p 112 of the reported judgment): “It would have to be said that although momentary or more substantial inattention on the part of the judge to some part of the evidence or submissions may occur in a particular case, it would not necessarily mean that the trial has miscarried. The point in the evidence or submissions at which that had taken place and its significance in terms of the matters calling for decision and actually decided would need to be considered before it could be said that there had been a miscarriage of justice.” 66. On the broad question of whether there is miscarriage of justice and due process, the authorities thus suggest that where a judge or arbitrator is sleeping during the hearing, there should be an assessment of ( inter alia ) whether the conduct of the judge or arbitrator can be said to have affected the outcome or at least created a risk that the outcome of the trial have been affected. In relation to the Challenge made in this case, the relevant assessment is whether such conduct of the arbitrator creates a real risk that his decision would be biased, or creates justifiable doubts as to the arbitrator’s impartiality, to warrant his removal. 67. As Lord Hope reminded us in Helow ,“the assumptions that the complainer makes are not to be attributed to the observer unless they can be justified objectively.” The test is how things may appear objectively to the fair-minded and informed observer, after he has acquired a full understanding of both sides of the argument (para 52, Lord Hodge’s judgment in Halliburton ). 68. Applying the test to the facts and circumstances of this case, the context which the fair-minded and informed observer will take into consideration is that the Arbitration had been conducted by the PA as part of the Tribunal since May 2021, and that there had been hearings in January and May 2022 (on interim measures and on liability), with PFA 1 first issued in February 2023. There had been more hearings (on specific performance) in June 2023, leading to PFA 2. Further hearings took place from July 2023, in March 2024 (for quantum related issues) and April and May 2024 (on expert evidence with submissions on quantum and interim measures), before the hearings in June 2024. These involved numerous hours of hearing, which led to 3 partial final awards, and a further 4 th partial final award issued in August 2024 (“ PFA 4 ”). 69. Against this context, the complaint related to the PA’s sleeping at the 25June hearing for intervals lasting 10 to 15 minutes in total. The sleeping or episodes of inattention took place during the two-day hearing for the interim measures/costs application, at a time (according to the transcript) when counsel for the G Parties were making submissions on their costs entitlement and costs breakdown. 70. The G Parties do not accept that the PA was in fact asleep on 25 June 2024 and deny that the video produced by CNG shows this. Counsel for the G Parties further highlighted the fact that the NOC did not even raise the PA’s alleged sleeping on 25 June 2024 specifically as its ground of challenge. The NOC referred only to 4 occasions of sleeping between 7 March 2024 and 1 May 2024. The Challenge states (at section C.5) that the PA had fallen asleep “for significant periods on numerous hearing days”, which created a perception of a lack of apparent justice and fairness. The particulars of the periods during which the PA was claimed to be asleep included hearings on 7 March 2024, 30 April 2024 and 1 May 2024 - but not 25 June 2024. It was only in CNG’s Reply that it referred to the PA's alleged sleeping on 25 June 2024. 71. On behalf of the G Parties, Counsel argued that CNG should not be permitted to expand the scope of its challenge. The HKIAC Practice Note on Challenges to Arbitrators, being part of the rules governing the Arbitration, state at clause 2.2(a) that the Notice of Challenge shall state the reasons for the challenge, and that the grounds of a challenge shall be limited to those set out in the Notice. Counsel for the G Parties emphasized the fact that CNG, as the challenging party, never sought to amend the grounds of challenge set out in the Notice of Challenge. 72. A further relevant and important point is that CNG did not at the hearing on 25 June 2024 raise any complaint regarding the PA’s sleeping. 73. The facts and circumstances of the hearings in June 2024, and the hearings before 25 June 2024 should they be relevant, are distinguishable from the facts of Song Lihua . 74. Contrary to what was suggested in the Skeleton Submissions filed on behalf of CNG (at para 20.5), there was no finding by this Court in Song Lihua that it does not matter if the party had made no complaint at the hearing about the inattentiveness of the tribunal member. In my judgment at para 46, I only recited the facts and what was found in Stansbury v Datapulse plc and anor [2003] EWCA Civ 1951 . 75. In Song Lihua , the errant arbitrator attended the hearing remotely by video-link, and I considered that the legal representatives present and making submissions at the hearing might not reasonably have noticed the arbitrator’s behavior. In this case, CNG and its representatives present at the hearing were aware of the fact that the PA had fallen asleep, or at least had been alerted to the PA sleeping episodes. Yet, they did not raise any immediate objection during the 25 June hearing, nor at any other hearing before that in respect of the PA’s other sleeping episodes. As Counsel for the G Parties submitted, their silence could only mean that they did not consider that the PA’s sleeping spells had any effect on the conduct of the hearing, or otherwise, they were improperly keeping the matter up their sleeves and storing up a challenge, without giving the Tribunal the opportunity to deal with the alleged irregularity or defect (a matter which the Hong Kong courts do not condone). 76. Even if the complaint regarding the sleeping episode on 25 June 2024 should be taken into consideration (notwithstanding the fact that the NOC did not rely on this), and even accepting CNG’s claim that the PA was asleep to be true (notwithstanding the G Parties’ denial), I do not consider that the fair-minded and informed observer would infer from the fact that the PA had fallen asleep, for intermittent periods of 15 minutes in total during the 2-day hearing, that there was a real possibility of bias on the part of the PA. 77. The reason for my conclusion is that firstly, the sleeping episodes took place at a time when the G Parties’ counsel was making submissions on the breakdown and components of the G Parties’ costs being sought, which was a part of their submissions on their claim for interim costs as security. This does not appear to be a critical or complex part of the case or of the hearing which the Tribunal or the PA would not be able to understand. As the Panel put it, and I would agree, the sleeping incidents on 25 June 2024 do not give rise to “any meaningful period of lack of attention by the PA” which would lead an objective observer to conclude that there was a real possibility that the PA was biased. 78. Secondly, as pointed out above, CNG’s team of lawyers present at the hearing did not raise immediate objection to the PA’s sleeping, and this suggests that they did not regard the PA’s inattention at the stage of the hearing to have any material impact on the possible outcome of the application. Even the instances referred to in CNG’s Reply filed for the Challenge, on which CNG sought to rely as examples of CNG’s lawyers having made complaint before 25 June 2024, did not include or refer to the PA’s sleeping episodes. 79. Thirdly, the PA is experienced in arbitration and had been designated jointly by the arbitrators who had been respectively nominated by the G Parties and CNG on the basis of his experience and training in adjudication. The fair-minded and objective observer would give relevant consideration to this when assessing whether there is apparent bias on the part of the PA and whether he would be able to apply an impartial mind in coming to an eventual award fairly and independently of either parties, in accordance with the statutory duties imposed on him as an arbitrator, notwithstanding any earlier remarks or conduct which may have some effect in casting aspersions on his ability to give full attention to the parties’ costs submissions. I accept that it can only be assumed that a professional judge or arbitrator would by training and experience practise impartiality. As Lord Walker of Gestingthorpe and Lord Mance both candidly accepted in their judgments in Helow , the fair-minded and informed observer “may be tending towards complacency” if he/she should treat that as a “guarantee”. However, it is certainly one factor which the fair-minded and informed observer would have in mind when forming his or her objective judgment as to bias. 80. In P v D [2024] HKCFI 1132 , the Court also referred to the relevance of the qualification of the decision maker (at paragraph 5.15 of the judgment). There, Deputy High Court Judge Jonathan Wong cited from the judgment of Aikenhead J in Ellis Building Contractors Limited v Vincent Goldstein [2011] EWHC 269 (TCC), which was a case concerning the improper deployment of without prejudice material in adjudication. In that context, Aikenhead J pointed out that a judge, being legally qualified and experienced, can usually put out of his or her mind any without prejudice communications which may surface in the proceedings. 81. The experience and training of the professional adjudicator is accordingly one factor which the fair-minded and objective observer would take into consideration, when deciding whether there is a real possibility of pre-judgment or bias on the part of the adjudicator, that such adjudicator would reach a final decision before being made aware of all relevant evidence and arguments, and that the adjudicator would approach the matter at hand with a closed mind. 82. Fourthly, the fact that the PA was asleep cannot by itself mean that he was partial, and had shut his mind to CNG’s case. It could mean that the PA was simply tired, or was lax, or even indolent. On the particular facts of the case and according to the time when the sleeping occurred, if it should be perceived as the PA’s lack of interest in the case presented, then it could just as easily be perceived as his lack of interest in the G Parties’ case rather than CNG’s. The fair-minded and objective observer would not be unduly suspicious, to conclude or infer from the PA’s sleeping episode that he slept because he had made up his mind against CNG in particular, for reasons unconnected with the legal or factual merits of the case. 83. On the facts and evidence of this case, I am simply not satisfied that the ground of justifiable doubts as to the PA’s impartially has been made out. This however is not to be taken as the court’s condoning or acceptance of any sleeping episode in the course of a hearing before the court or any tribunal. Hostility towards CNG 84. On behalf of CNG, it was emphasized that all factors that give rise to the possibility of apparent bias on the part of the PA must be considered cumulatively, and not merely individually ( Cofely Ltd v Bingham [2016] EWHC 240 (Comm). In contending that hostility towards counsel of a party can give rise to an appearance of bias, CNG relies on the observations made by Ribeiro PJ in Falcon Private Bank Ltd v Borry Bernard Edouard Charles Ltd (2014) 17 HKCFAR 281 , that: “even if criticisms are or may be justified, if they are couched in terms or made in the context which raises doubts as to whether the judge can continue to adjudicate with the detachment and impartiality essential to the judicial process, his recusal may be properly required”. 85. At the Court of Appeal level in Falcon Private Bank , Kwan JA had referred to IOOF Australia Trustees Ltd v SEAS Sapfor Forests Pty Ltd (1999) 78 SASR 151 , in which Doyle CJ had held: “What is important is that the judge be willing to consider the case presented by that counsel fairly. It is when the hostility between the judge and the Council is such that the fair-minded observer might reasonably apprehend that the judge will not consider the case being presented for the client that disqualifying bias is present.” 86. It was contended for CNG that preconceived views which show that the judge is not willing to listen fairly to contrary arguments will establish apparent bias. Reliance was placed on the observations made by the court in Chui v Cheng [2023] 3 HKLRD 950 (at para 51): “Where apparent bias is based on an alleged predetermination of issue (s) by a judge, the question is ‘whether a reasonable, objective and informed person would on the correct facts reasonably apprehend that the judge has not brought or will not bring an impartial mind to bear on the adjudication of the case, that is, a mind open to persuasion by the evidence and the submissions of counsel .” 87. I can find no fault in the passages cited above. 88. Consideration should also be given to the observations made by the Court in Helow v Secretary of State for the Home Department [2008] 1 WLR 2416 at paras 123, that the fair-minded and informed observer knows that “judges must be seen to be unbiased”. Lord Hope’s comment was: “She knows that fairness requires that a judge must be, and must be seen to be, unbiased. She knows that judges, like anybody else, have their weaknesses. She will not shrink from the conclusion, if it can be justified objectively, that things that they have said or done or associations that they have formed may make it difficult for them to judge the case before them impartially.” 89. The complaints made by CNG are that the series of comments made by the PA in relation to CNG’s Dividend/UE Claims and CNG’s defence to the “extensively explore” claim (“ Zomb Issue ”) show that he had prejudged the merits of the arguments and had adopted a closed mind against CNG. 90. Having read the transcript of the hearing on 25 June 2024 and considered the comments made by the PA, I do not accept that they can give rise to any reasonable perception by any fair-minded and informed observer that there is a real risk or real possibility that the PA was biased, or had prejudged the issues against CNG. 91. First, there is nothing wrong in a judge or arbitrator expressing his views on the case to counsel and the parties. In Bubbles & Wine v Lusha , Lord Justice Leggatt made the following observations in the context of his consideration of whether there was apparent bias on the part of a trial judge: “… it was perfectly proper for the judge to express preliminary views about the strength or weakness of each party’s case during the proceedings and no criticism could reasonably have been made of him if his comments had been made in open court. There is nothing wrong with the judge indicating provisional views , and advocates are generally grateful for such indications as it gives them an opportunity to correct any misconception which the judge may have and to concentrate in their submissions on those points which appear to be influencing the judge’s thinking. The expression of such views could only be thought to indicate bias if they are stated in terms which suggest that the judge has already reached a final decision before hearing all the evidence and arguments .” 92. The central question is whether the PA’s criticisms of CNG’s counsel and of CNG were such as to raise a question of apparent bias. Would the fair-minded and informed observer conclude that the conduct of the PA was not just misguided, or far from ideal, but disclosed a real possibility that the PA was biased in favour of the G Parties or against CNG? 93. As summarized in the Skeleton Submissions filed for CNG, the complaints at the heart of CNG’s case of the PA’s hostility and bias against them include the following. (1) During the June hearing, the PA stated that the Tribunal had already “accepted” evidence about the available volume of copper, when the effect of the Zomb Issue was to contradict that evidence. (2) The PA stated specifically: “In the light of the evidence that we accepted about the volume of material that was to be recovered it would seem unlikely that there would be no financial award in favor of the Arbitration Claimants on that part of their claim.” (3) The PA made a series of comments regarding the Dividend/UE Claims which, taken together, illustrate that he had prejudged the merits of the arguments and adopted a closed mind on the merits. (4) The PA pressed CNG on the merits of its case on the Dividend/UE Claims and the lack of supporting evidence provided, despite the fact that CNG had by then only filed a Notice of Arbitration (in the 2 nd Arbitration) and the claims had not yet been consolidated with the existing Arbitration, let alone fully briefed or particularized. (5) Despite not having received any detailed pleadings on the Dividend/UE Claims, the PA indicated that he was “not entirely on board about the payment of a dividend” and that he believed the claim was “a little optimistic”. (6) The PA expressed doubts, in pejorative terms, regarding the new UE Claim, and asked: “Where is the enrichment? At best, it could only be a potential enrichment.” He further asked: “How have the claimants been unjust, been enriched, let alone unjustly enriched? This may be a new chapter in Goff & Jones.” “What is unjust about that?” (7) The PA described CNG’s Dividend/UE Claims (in the 2 nd Arbitration) as “tit-for-tat” and refused to retract that characterization despite CNG’s protestation. Specifically, the PA’s remark was: “And if the view is that they are not going to proceed with that arbitration, the sooner we know about that and can get this arbitration finalized the better. But as it was simply a tit-for-tat notice of arbitration, it should not be a difficult decision for your clients to make.” (8) Upon learning that the Dividend/UE Claims would be consolidated into the Arbitration, the PA suggested to CNG on his own initiative that the claims be withdrawn. 94. It was argued that because the PA had made the above statements, the fair-minded and informed observer would conclude that he had already formed a definitive view to reject the Dividend/UE Claims and the defence on the Zomb Issue, and had shut his mind to CNG’s case. 95. It was emphasized that the matter should be considered cumulatively with the hostility hitherto displayed by the PA in the hearings in April and May in relation to the Dividend and UE Claims, at a time when those claims were not even pending before the Tribunal. 96. CNG pointed out that during the hearings in April and May, the PA had made constant interruptions and had adopted a generally adversarial attitude towards CNG when the G Parties applied for security, and that there were “transparent attempts” to assist the G Parties. It was argued that even before hearing submissions from CNG, the PA had declared that CNG had “behaved utterly disgracefully, dishonestly and disgracefully and I have to say that in 57 years of law practice I have never, ever come across a case in which a party has behaved as badly”. 97. Further, CNG claims that the PA had at the hearings allowed the terms of the security to be discussed before CNG had been heard on whether an order should be made, had required CNG to show that it was not dissipating its assets (thus reversing the burden of proof), and had postulated scenarios of dissipation which had not been advanced by the G Parties. 98. These incidents in April and May 2024 occurred before the hearing on 25 June 2024, outside the time for any challenge to be made. Since I have held that CNG had by its conduct waived any irregularity or defect prior to 25 June 2024, I agree with Counsel for the G Parties that CNG should not be allowed to refer to and rely on these matters of alleged hostility. At most, bearing in mind that the PA’s conduct should be considered cumulatively, in considering the effect of the PA’s remarks and conduct on 25 June 2024, I will take heed of the fact that it was not the first time that any alleged “hostility” occurred. 99. The other “prejudicial comments” claimed to have been made by the PA during the 25 June 2024 hearing included the following: (1) The PA stated to Counsel for CNG that “no one thought that your clients would behave as badly as they have done”, adding that he would “like to, in the circumstances of this case, tip bad behavior on top of other bad behavior on top of other bad behavior”. (2) The PA stated that CNG had not made any contribution towards the costs of the arbitration, when it was an error which the PA had made repeatedly during earlier hearings and had been corrected by CNG. Despite multiple corrections, the PA continued to level “inaccurate allegations” at CNG. (3) The PA accused CNG of not having satisfied any damages awarded in the previous awards, when no “monetary awards” had in fact been rendered at the time. (4) The PA refused to acknowledge that CNG had complied with its undertakings regarding the nonpayment of dividends. (5) The PA blamed CNG for deficiencies of the G Parties’ application for costs. (6) The PA blamed CNG for delay in the Arbitration, when the Tribunal had taken almost 2 years to render PFA 4. (7) The PA accepted the G Parties’ criticisms of CNG wholesale. (8) There were hostile interruptions of CNG’s counsel, and dismissive remarks made by the PA contrasted with his making suggestions to assist the G Parties, allegedly proposing a reversal of the burden of proof in favor of the G Parties. (9) The PA indicated that he would be minded to grant security for costs to the G Parties, despite this not having been sought and without giving CNG an appropriate opportunity to respond. The PA stated: “I am not really stuck or hung up on formality in this, because I have to say the tribunal does not take very kindly to this constant delaying tactic by your clients. If there is evidence upon which a security for costs order could be made, then it would be perfectly easy for us to order the Arbitration Claimants to make a pro forma application for security for costs and proceed on that basis set out in paragraph 31. So do not let us worry ourselves about matters that are really of no concern.” 100. According to CNG, these instances, when taken together, would be perceived by a fair-minded and informed observer as evidence that the PA was adopting a closed mind to CNG’s submissions in the Arbitration. 101. I have considered the exchanges and statements complained of by CNG. In most cases, they only show that the PA was expressing preliminary views on CNG’s case. Some of the views were robust, and many of them justified, when one takes into consideration the entire context of the history of the Arbitration, the evolution of the claims made and the demonstrated conduct of CNG. It is true, as CNG sought to emphasize, that they were entitled to exhaust all their remedies and pursue all the claims to which they were entitled in law, but it is also legitimate for the PA to observe that the Tribunal is likewise entitled to take into consideration the steps CNG had taken, and in particular, their failure to comply with the relevant Awards even after all the steps had been taken and the remedies had been exhausted. I would add that even if CNG had the right to take the steps it chose to take, it must also live with and bear the consequences of its decision to pursue the steps taken. 102. In Falcon Private Bank Ltd v Borry Bernard Edouard Charles Ltd , Ribeiro PJ had referred to the judgment of the Court of Appeal, where Kwan JA cited the judgment of Doyle CJ in IOOF Australia Trustees Ltd . That was a case involving friction between the Bench and the Bar, and Doyle CJ had observed: “… Disqualifying bias is not established merely by pointing to circumstances indicating tension, or even some hostility, between the judge and counsel. The relevant principles are directed towards ensuring the appearance and the reality of a fair hearing. That is, one in which the case on each side is fairly considered….” 103. As the Court in The “Sur” [2019] 1 Lloyd’s Rep 57 aptly pointed out, it is important not to lose sight of reality, and one must take into account “the cut and thrust of the arbitral process”. In the process of resolution of disputes, whether before the court or before an arbitral tribunal, it is common and very normal for the judge or arbitrator to comment on the apparent merits of the case, or the credibility of a proposition advanced, in an attempt to persuade the parties to focus on whether it would be costs-effective to pursue a line of argument or an aspect of the claim, and not on the real and more important issues in dispute. It also helps the party to clarify its case and to correct any misunderstanding which the judge or arbitrator may have. Having heard the evidence and submissions of the parties, it is also reasonable for the judge or arbitrator to express his/her preliminary views, and whether he/she finds the evidence heard to be credible and persuasive, or questionable. The views may be robust, or expressed more emphatically, but the experienced and trained judge and arbitrator would not have his/her mind entirely shut to any contrary view or opposing arguments when finally deciding the matter. The fair-minded, informed and not overly suspicious or sensitive observer would recognize this, take this into consideration and not jump to any serious conclusion that, because of these comments or interjection made, the judge or arbitrator was or would be biased, and would not, at the end of the day,decide the case fairly on the evidence presented and only on the legal and factual merits of the case. 104. In Jackson v Thompson Solicitors [2015] EWHC 218 (QB), Simon J made pertinent observations on actual bias and apparent bias (at para 15 of the judgment): “It is a human characteristic that people have predilections, beliefs and sympathies, and judges and tribunals are no exception. The fact that a Judge or Tribunal may hold certain pre-conceived views does not by itself constitute actual bias unless it is such as to render them immune to contrary argument. The crucial distinction is between a predisposition towards a particular outcome and a predetermination of the outcome . The former is consistent with a preparedness to consider and weigh factors in reaching the final decision; the latter involved a mind that is closed to the consideration and weighing of relevant factors ; see National Assembly for Wales v Condron [2006] EWCA Civ 1573 , Richards LJ at [43], (with whom Ward and Wall LJJ agreed) and De Smith’s Judicial Review , 7 th Ed (2013). §10-058.” (Emphasis added) 105. From the transcript of the 25 June hearing, if the PA had interjected in the submissions made by CNG’s counsel, it was only to test and ask questions as to CNG’s opposition to the application for interim payment of costs. His observations and comments on CNG’s conduct of the proceedings and its failure to comply with the awards made against it were all justified. CNG complains that the PA had been prepared to entertain an application for security without any formal application having been made by the G Parties, but when this point was made by Counsel for CNG with objection to the lack of proper procedure, the hearing did continue as an application for interim measures and payment, and the PA did not press further. 106. I do not consider that the PA’s statement on the “extensive exploration” breach to be open to criticism as biased. What the PA said was: “THE PRESIDENT: Mr McClure, the extensive exploration breach that we found to have occurred. In the light of the evidence that we accepted about the volume of material that was there to be recovered, it would seem unlikely that there would be no financial award in favour of the claimants on that part of their claim. It is difficult to envisage that, isn’t it?” 107. First, in deciding on the application for interim measure, the circumstances which the Tribunal was required to take into consideration include whether there is a reasonable possibility that the requesting party will succeed on the merits of the claim. Hence it was perfectly legitimate for the PA to consider the merits of the claims made against CNG, and to explore this with Counsel. 108. Moreover, even Mr McClure accepted at the hearing that so far as liability is concerned, it was correct that the G Parties had already succeeded in establishing a breach of the intensive exploration obligation (the only remaining dispute being whether such breach would result in any, or any substantial, award of damages). Against such context, the PA’s comment as to what the Tribunal had accepted or found on the evidence cannot be accepted as either uncalled for, or as prejudgment (for matters or issues already determined), or (in respect of any issues still to be resolved) predisposition with a closed mind. 109. I have read the entire transcript of the 25 June hearing. Even paying due heed to the reminder by the Court of Final Appeal that it is not sufficient (for dispelling any possible bias) that the criticisms made by the judge or arbitrator are justified by the facts, if the hostility is not, I cannot conclude that the evidence of the 25 June hearing can show that the PA had, by his conduct and remarks, crossed the line where he could be said to have lost his detachment, and would be likely to close his mind entirely to persuasion. Knowing the relevant context of how the Arbitration had progressed, the awards made, the issues considered and argued at the 25 June hearing, and the duty of the PA to do what he can to control and marshal the parties in the manner in which the claims are pursued, a fair-minded and informed observer would not conclude that the PA had formed a final decision to decide the case against CNG or in favor of the G Parties, irrespective of the evidence and the merits of the claims. In coming to such conclusion, I have considered the complaints of sleeping and hostility cumulatively. Disposition on the Challenge 110. In the judgment of this Court, the Challenge made against the PA under Article 12, that the circumstances complained of by CNG give rise to justifiable doubts as to the PA’s impartiality, is not established. The application is accordingly dismissed, with costs to be paid by CNG with certificate for 2 counsel. The application to set aside PFA 4 111. At the same time as the making of the application to the Court under Article 13(3) to decide the Challenge which had been dismissed by the Panel, CNG issued a separate application to the Court to set aside PFA 4 which was issued after the June Hearing and in the interim of the Challenge made by CNG. The application to set aside PFA 4 is on the ground, as stated in the Originating Summons, that CNG was unable to present its case, that the composition of the Tribunal was not in accordance with the parties’ agreement, and that the award is in conflict with the public policy of Hong Kong. It was claimed that PFA 4 was issued in circumstances when there were justifiable doubts as to the PA’s independence and impartiality. 112. None of the April, May and June hearings relied upon for the Challenge related to PFA 4. The hearings for PFA 4 took place in 2022. 113. According to the Skeleton Submissions served for CNG, it was contended that “if CNG is successful with its challenge to the PA, then PFA 4 must be set aside”. This was on the basis that if circumstances existed in June 2024 which gave rise to justifiable doubts as to the PA’s impartiality, “the only safe course of action” would be to set aside PFA 4 which was issued on 30 August 2024 - simply because the Tribunal was deliberating on and finalizing PFA 4 at a time when the PA’s impartiality was challenged and allegedly tainted. CNG argued that it cannot tell whether the findings of liability made against it in PFA 4 were due to the rejection of its arguments after a fair consideration, or because the PA had closed his mind to those arguments, preventing CNG from presenting its case. If the PA was biased, CNG argued that PFA 4 was issued by a tribunal the constitution of which contravened Article 34(2)(a)(iv) of the Model Law. 114. The entire basis of the setting aside application for PFA 4 was, in truth, focused on the Challenge and the alleged doubts as to the PA’s impartiality. At the hearing on 7 May 2025, for the Court’s consideration of the Challenge under Article 13(3), and of the setting aside application of PFA 4, Mr Chapman for CNG in fact accepted that the setting aside application was “parasitic to the Challenge”, and that if the Challenge fails, the setting aside application likewise falls away. 115. On behalf of the G Parties, Mr Dawes pointed out that even if there were any doubts as to the PA’s impartiality, it must be shown that there was a causal connection between the conduct giving rise to the alleged bias, and the decision (ie PFA 4) itself, and that CNG has demonstrably failed to establish this. 116. On the basis of my finding that the doubts as to the objectivity and impartiality of the PA have not been made out, the application to set aside PFA 4 must be dismissed, with costs on indemnity basis with certificate for 2 counsel. (Mimmie Chan) Judge of the Court of First Instance High Court Mr Simon Chapman KC (Solicitor Advocate), of Herbert Smith Freehills (name changed to Herbert Smith Freehills Kramer since 2 June 2025), for the applicant (in both HCCT 148/2024 & HCCT 149/2024) Mr Victor Dawes SC, Mr Peter de Verneuil Smith KC and Mr William Wong, instructed by Gibson, Dunn & Crutcher, for the 1 st & 2 nd respondents (in both HCCT 148/2024 & HCCT 149/2024) The 3 rd respondent in HCCT 148/2024 was represented by Kwok Yih & Chan (present on 7 May 2025 on watching brief) Look up this case on Lawcite Noteup",
  "length": 86473,
  "headers_seen": [
    "Background",
    "The Challenge",
    "Legal principles applicable to a challenge on the ground of lack of impartiality",
    "Waiver",
    "The PA’s sleeping",
    "Hostility towards CNG",
    "Disposition on the Challenge",
    "The application to set aside PFA 4"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2025/3598",
  "query": "Model Law",
  "ts": "2025-10-16T10:53:32",
  "ok": true
}