{
  "title": "NG HON LAM EDGAR V. THE HONG KONG HOUSING AUTHORITY | [2020] HKCFI 2719 | HKLII",
  "court": null,
  "year": 2020,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2020] HKCFI 2719 NG HON LAM EDGAR V. THE HONG KONG HOUSING AUTHORITY Judgment Information Date 21 Oct, 2020 Action No. HCAL2875/2019 Neutral Cit. [2020] HKCFI 2719 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCAL2875/2019 HCAL2875/2019 NG HON LAM EDGAR v. THE HONG KONG HOUSING AUTHORITY HCAL 2875/2019 [2020] HKCFI 2719 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTITUTIONAL AND ADMINISTRATIVE LAW LIST NO 2875 OF 2019 ________________________ BETWEEN NG HON LAM EDGAR Applicant and THE HONG KONG HOUSING AUTHORITY Respondent ________________________ Before: Hon Chow J in Chambers (Open to Public) Date of Hearing: 22 October 2020 Date of Decision: 22 October 2020 ___________________ D E C I S I O N ___________________ 1. In this application for judicial review, the Applicant seeks to challenge the Hong Kong Housing Authority (“ HA ”)’s policy (“ the Policy ”) to exclude same-sex spouses of owners and/or residents of Home Ownership Scheme (“ HOS ”) flats from the definition of “family members” and “spouses” eligible (i) for addition as authorized occupants, and (ii) to be considered by HA for its consent in the exercise of its discretion to receive a transfer of ownership of HOS fats without payment of premium pursuant the Housing Ordinance , Cap 283 , on ( inter alia ) the ground that the Policy constitutes unlawful discrimination based on sexual orientation. 2. The Form 86 was filed on 30 September 2019. 3. On 21 October 2019, the court, with the consent of the parties, made an order staying the proceedings herein pending the handing down of the court’s judgment in Infinger, Nick v The Hong Kong Housing Authority [2020] 1 HKLRD 1188 . 4. On 4 March 2020, the court handed down its judgment in Infinger , allowing the application for judicial review in that case. 5. On 6 May 2020, HA filed and served a notice of appeal dated 31 March 2020 against the court’s judgment in Infinger (CACV 81/2020, “the Appeal”). I am informed that the Appeal has been fixed to be heard on 29 July 2021. 6. On 4 August 2020, the Applicant’s solicitors wrote to the court inviting the court to consider the application for leave to apply for judicial review in the present case on paper. 7. On 5 August 2020, the court granted leave to apply for judicial review. 8. On 14 August 2020, the Applicant filed the Originating Summons herein pursuant to the leave to apply for judicial review granted on 5 August 2020. The Form 86, the Originating Summons and other papers were served on HA’s solicitors on 18 August 2020. 9. Under the timetable laid down in Order 53 of the Rules of the High Court , Cap 4A , HA was supposed to file and serve its evidence within 56 days after service of the relevant documents on 18 August 2020, ie by 13 October 2020. 10. On 25 September 2020, HA was advised by counsel in conference to take out an application for stay of proceedings pending the determination of the Appeal. On 30 September 2020, HA’s solicitors wrote to the Applicant’s solicitors seeking his consent to the proposed stay of proceedings. The consent sought was refused on 7 October 2020. 11. On 14 October 2020, HA filed the present summons seeking a stay of the proceedings pending the determination of the Appeal by the Court of Appeal. As stated in the supporting affirmation of Leung Tak Yan, at §20, the stay application is mounted essentially on two grounds, namely, that the results of the Appeal will likely (i) determine the scope and content of HA’s evidence to be adduced in these proceedings, and (ii) have a very substantial impact on the determination of this application. 12. I do not accept that the results of the Appeal are likely to have a substantial impact on the determination of the present application. Infinger concerns the distribution or allocation of a highly scarce public resources, namely, public rental housing, which counsel for HA emphasized and which the court accepted was relevant when considering the questions of, inter alia , (i) rational connection, and (ii) standard of review. The other matters raised by HA in Infinger , are, I consider, fully covered by the judgments of the Court of Final Appeal in QT and Leung Chun Kwong . The present case is different. Granted that HOS flats may also be regarded as a scare public resources, the fact of the matter is that the Applicant has already acquired a HOS flat in the secondary market, and the question is whether his same-sex spouse is entitled to lawfully occupy the flat as a family member of the Applicant, and whether he can transfer it to his same-sex spouse without payment of a premium like any other heterosexual couples in Hong Kong. The consideration of distribution or allocation of a highly scarce public resources is much less direct or relevant in the present case. For this reason, the cases relied upon by Mr Chan, SC, namely, MK v Government of the HKSAR [2019] HKCFI 55 , and Rankothpedi Durayalage Kamalawathi v Director of Immigration [2018] HKCFI 579 , cannot assist HA. It may be that the present application ought not to have been stayed previously to await the outcome of the court’s judgment in Infinger , but that is now water under the bridge. 13. I also have some difficulty with the notion that the results of the Appeal will likely determine the scope and content of HA’s evidence to be filed. The scope and content of the evidence depends on the issues raised in the Form 86, and HA ought to disclose all relevant facts and matters pertaining to the Policy in discharge of its duty of candour to enable the court to properly determine whether it can be justified. I repeat my observations made in a previous application in the Infinger case by HA seeking a stay of those proceedings pending the determination of the final appeal in Leung Chung Kwong , and the application for judicial review in MK ( [2019] HKCFI 557 , at §13). This was what I said: “I do not accept Mr Ma’s submission that the results or reasons in those cases should affect the scope or contents of the evidence (if any) which may be filed by HKHA in the present application. HKHA is under a duty of candour and ought to put forward all relevant facts and matters pertaining to its decision and policy under challenge to enable the court to properly discharge its supervisory jurisdiction in this matter. Mr Ma argues that the Applicant will suffer no prejudice should the court grant the stay of proceedings sought because HKHA is prepared to give an undertaking to the Applicant that ‘ should he succeed in the present application and the Court hold that he is eligible to apply for [public rental housing] as an ordinary family with his same-sex partner, [HKHA] will restore his [public rental housing application] back to the date when it was first submitted, ie 9.3.2018, so that there will not be any loss of the waiting time because of any stay of the present proceedings as currently applied for’ . Even if, for the sake of argument, the Applicant will suffer no personal prejudice as a result of the stay, it cannot be disputed that the present application raises issues of some general or public importance which are likely to, or may, affect other same-sex couples in a similar situation. Those issues will have to be determined in any event, and there is no good reason to delay their determination.” 14. In any event, even if the judgment of the Court of Appeal in the Appeal may have some bearing on the scope and content of the relevant evidence to be filed by HA in the present application, it cannot be suggested that the time and costs to be incurred by HA to prepare the evidence will be so substantial or disproportionate that a stay should be granted on this ground alone. 15. On the other hand, an application for judicial review should generally be disposed of expeditiously. The application here raises issues of fundamental rights, in particular unlawful discrimination based on sexual orientation, which is a very serious matter. If the application is well founded, the discrimination ought to be corrected as soon as possible. The outcome of the application is relevant not only to the Applicant now before the court, but to other persons in a similar situation. The application has already been delayed for over a year due to the proceedings in Infinger , and strong justification is required to further delay its resolution pending the outcome of the Appeal. If the stay sought by HA is granted, taking into account the hearing date of the Appeal and the time which the Court of Appeal may take to give a judgment, it may be more than a year from now before HA’s evidence will be filed in this case. On any view of the matter, there will be a very substantial delay in the disposition of the present application even at first instance. In the meantime, the position of the Applicant and his same-sex spouse will be in limbo , and I am told that they have suffered harassment by neighbours who consider that they are occupying their flat unlawfully. 16. Mr Chan has put forward other points such as the fact that both parties are litigating on public funds, and the limited judicial resources which may be saved by a stay of proceedings. These are relevant considerations, but do not, in my view, outweigh the importance of an early resolution of the issues in the present case. 17. In passing, I should mention that shortly before the hearing today, on 20 October 2020, the parties put in a Consent Summons seeking to adjourn today’s hearing to another date to be fixed for a 2-hour hearing, together with directions for the filing of evidence. I refused the consent application, because it would only serve to further delay the present proceedings. A stay application of this nature ought to be determined expeditiously. Otherwise, there would effectively be a stay of proceedings by default. 18. Overall, I am not prepared to grant a stay of the proceedings. In the circumstances, there is little alternative but to grant the Respondent an extension of time to file evidence. I shall now hear the parties on the timetable for the filing of evidence, and the issue of costs. (Anderson Chow) Judge of the Court of First Instance High Court Mr Azan Marwah, instructed by Daly & Associates, for the Applicant (Assigned by DLA) Mr Abraham Chan, SC and Ms Karen Tsang, instructed by Woo, Kwan, Lee & Lo, for the Respondent Look up this case on Lawcite Noteup",
  "length": 10508,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2020/2719",
  "query": "stay of proceedings",
  "ts": "2025-10-14T11:23:20",
  "ok": true
}