{
  "title": "HKSAR V. LAM YUET PO | [2009] HKDC 1429 | HKLII",
  "court": null,
  "year": 2009,
  "date": null,
  "content": "HKLII Databases District Court [2009] HKDC 1429 HKSAR V. LAM YUET PO Judgment Information Date 4 Jun, 2009 Action No. DCCC131/2009 Neutral Cit. [2009] HKDC 1429 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History DCCC131/2009 DCCC000131/2009 HKSAR v. LAM YUET PO DCCC131/2009 IN THE DISTRICT COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION CRIMINAL CASE NO. 131 OF 2009 ---------------------- HKSAR v. Lam Yuet Po ---------------------- Before: HH Judge Browne Date: 5 June 2009 at 2.49 pm Present: Mr A A Souyave, Counsel on fiat, for the Department of Justice, for HKSAR Mr Hoosen, Abdul Aziz, instructed by Messrs Leung Kin & Co, assigned by the Director of Legal Aid, for the defendant Offence: Assault occasioning actual bodily harm (襲擊他人致造成身體傷害) ---------------------- Reasons for Sentence ---------------------- 1. I convicted the Defendant after trial of an offence of assault occasioning actual bodily harm. The particulars of the offence were that on 8 January 2009 outside Fountain Head Pub, on Yung Shue Wan Main Street, Yung Shue Wan in Hong Kong, he assaulted Lee Wing-wai, thereby occasioning actual bodily harm. 2. The facts which I found proved against the Defendant showed that the victim in this case and the Defendant were known to each other for several years. Both of them were residents of Lamma Island. 3. On the evening of 7 January 2009, the victim was drinking with some friends at the Fountain Head Pub in Yung Shue Wan Main Street. The Defendant was also drinking at the same Pub. 4. Later in the evening, the Defendant left the pub and returned with a knife and he subsequently brandished the knife, dashed out of the pub towards the victim. He chopped the victim with the knife to his left side of his face and there was an injury to the right forearm of the victim. The Defendant then ran off to a Karaoke restaurant where he was later arrested by a police officer. 5. Fortunately the injury sustained by the victim in this case were not serious. No stitches were required and medical evidence disclosed that there was a 3 cm superficial linear abrasion of the right forearm of the victim. 6. The Defendant attended the trial until the close of the prosecution case, he failed thereafter to answer bail and I convicted him in his absence. I am told that he has a number of previous convictions. In respect to matters relating to violence, he had three convictions for assault occasioning actual bodily harm. His last conviction being on 21 September 2004 when for an assault occasioning actual bodily harm he was sentenced to 4 months’ imprisonment. 7. In this case, the injuries sustained by the victim were not serious. That is extremely fortunate in the circumstances. 8. There is no doubt in my mind that the Defendant, when he returned to the public house with the knife which has been described as a Kukri knife over 12 inches in length was clearly intent on violence and, it is very fortunate, as I said, that the injuries were not more serious. 9. Having taken into account all the circumstances of the offence, in my view a sentence of 9 months’ imprisonment is appropriate and I sentence him to 9 months’ imprisonment. I also issue a warrant for the arrest of the defendant. Browne District Judge Look up this case on Lawcite Noteup",
  "length": 3311,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkdc/2009/1429",
  "query": "assault occasioning actual bodily harm",
  "ts": "2025-10-17T10:41:22",
  "ok": true
}