{
  "title": "CHAN KIN MAN V. CHEUK SIU TONG | [2012] HKDC 706 | HKLII",
  "court": null,
  "year": 2012,
  "date": null,
  "content": "HKLII Databases District Court [2012] HKDC 706 CHAN KIN MAN V. CHEUK SIU TONG Judgment Information Date 28 May, 2012 Action No. DCMP1629/2011 Neutral Cit. [2012] HKDC 706 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History DCMP1629/2011 DCMP1629/2011 CHAN KIN MAN v. CHEUK SIU TONG DCMP 1629/2011 IN THE DISTRICT COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION MISCELLANEOUS PROCEEDINGS NO. 1629 OF 2011 _________________________ BETWEEN CHAN KIN MAN Plaintiff and CHEUK SIU TONG Defendant _________________________ Coram: H H Judge Chow in Court (Open to public) Date of Hearing: 29 May 2012 Date of Judgment: 29 May 2012 _______________ J U D G M E N T ________________ 1. This is the originating summons instituted by the plaintiff for an order that: 1. The defendant, Cheuk Siu-tong, be committed to prison for his contempt of court for: (i) disobeying the order for examination for a judgment debtor with penal notice endorsed thereon dated 6 July 2010 (the first order) by failing and refusing to attend the court before Master S Lo on 31 August 2010; (ii) disobeying an order with penal notice endorsed thereon dated 31 August 2010 (the second order) by failing and refusing to provide documents and attend the court before Master K K Pang to be examined on 11 November 2010; and (iii) wilfully resisting/obstructing the execution of warrant of arrest by this honourable court under Personal Injuries case No. DCPI1970/2008. 2. The plaintiff’s solicitor, Mr Lo Kam-ting, leave me that he wished to withdraw items (ii) and (iii). I granted him leave to withdraw these two items. Under item (ii), clearly the notice endorsed on the order in question was not a penal notice and under (iii), the warrant of arrest was directed to the bailiffs to execute an order of this court but that order was directed to the bailiffs, namely, to be obeyed or carried out by the bailiffs. The order was not to be complied with by the defendant; so under item (iii) there cannot be any issue of contempt of court, and under item (ii), because of the notice in question not being a proper penal notice there cannot be any contempt of court, so the withdrawal of these two items are rightly made and I grant the plaintiff leave to withdraw these two items. 3. Now I have to deal with item (i), namely, disobeying the order for examination for a judgment debtor with penal notice endorsed thereon dated 6 July 2010. The evidence comes from an affirmation of Lo Kam-ting. In his affirmation filed on 12 January 2012 he stated that on 16 November 2009 judgment was entered for the plaintiff against the defendant for the sum of HK$101,581 together with interest and costs in the Personal Injuries action DCPI1970/2008 (the said judgment). The costs of the said DCPI1970/2008 was allowed in the sum of HK$404,658.50. The said judgment has not been satisfied. 4. In order to enforce the said judgment the plaintiff’s solicitors applied to the court for an order of examination of the defendant. On 6 July 2010 Master J. Chow made an order for examination of the defendant. The defendant was to attend before Master S Lo on 31 August 2010. The order for examination of the defendant with penal notice endorsed thereon was served personally on the defendant on 26 July 2010. 5. According to the affirmation of Lam Sze-wai Xavier, dated 26 August 2010 (he was then a legal clerk to the plaintiff’s solicitors, Messrs Fongs), on 26 July 2010 he attended the usual and last known address of the defendant at Room 314, Hiu Sing House, Hiu Lai Court, 21 Hiu Kwong Street, Sau Mau Ping, Kowloon, in order to serve the defendant a sealed copy of order for examination of judgment debtor filed on 14 July 2010 (the documents). 6. At around 1730 hours he arrived at the entrance of the above address and pressed the doorbell. A man answered the door and he said he was Cheuk Siu-tong and Mr Lam Sze-wai Xavier identified him as Cheuk Siu-tong. He served the document on Cheuk Siu-tong and Cheuk Siu-tong accepted the service accordingly. The document so served as aforesaid was endorsed thereon an English penal notice in the following form, “If you, the above named Cheuk Siu Tong, neglect to obey this Order to attend the hearing by the time stated, you may be held to be in contempt of Court and liable to imprisonment.” 7. Mr Lam did testify in court. His evidence was not challenged. 8. The defendant failed to attend the hearing fixed before Master Lo on 31 August 2010 and in his absence Master Lo made an order requiring the defendant to provide documents and attend an adjourned hearing on 11 November 2010. The order was drafted in Chinese with a warning notice endorsed thereon but it was not a penal notice in terms of contempt of court. 9. The defendant failed to attend the hearing fixed on 11 November 2010 nor provide any documents he was ordered to provide, and then the court subsequently granted an order and issued a warrant of arrest dated 10 February 2011. 10. The bailiffs attempted to execute the warrant of arrest against the defendant at his residential address at Room 314, Hiu Sing House, Hiu Lai Court, 21 Hiu Kwong Street, Sau Mau Ping on 9 March 2011 but the bailiffs were refused admittance after they had revealed their identities, explained the purpose of the visit and even with the aid of police at the scene. 11. I have to decide whether the defendant did disobey the order for examination for a judgment debtor with penal notice endorsed thereon dated 6 July 2010 by failing and refusing to attend the court before Master S Lo on 31 August 2010. 12. The order for examination for the defendant with penal notice endorsed thereon was personally served on the defendant on 26 July 2010. Mr Xavier Lam testified to that effect. I have no doubt whatsoever that the defendant, after receiving the sealed copy of order for examination of judgment debtor, knew that he had to attend the hearing fixed before Master Lo on 31 August 2010 and he knew that if he neglected to obey the order to attend the hearing by the time stated on the order he might be held to be liable in contempt of court and he might be liable to be imprisoned for this contempt, yet he failed to attend the hearing. There is no explanation whatsoever offered to this court about his absence in the hearing. He did not attend the hearing in this case. I have no doubt that he was intentionally disobeying the order for examination for judgment debtor with penal notice endorsed thereon dated 6 July 2010 by failing and refusing to attend the court before Master Lo on 31 August 2010. I therefore adjudge that his conduct constitutes contempt of court. 13. Mr Lo, the plaintiff’s solicitor, submitted a number of authorities to show the sentences imposed in court cases of contempt but there is not a single one with threat similar to this case; so I have to decide the sentence of imprisonment to be imposed for item (i). Because items (ii) and (iii) are withdrawn and I granted leave to the plaintiff to withdraw these two items, no sentence will be passed in respect of items (ii) and (iii). 14. I will have to consider the sum involved in the DCPI1970/2008 case. The judgment sum was HK$101,581; the costs of this case was allowed at HK$404,658.50. The purpose of the order for examination is to enable the plaintiff to enforce the said judgment because during the examination of the defendant the assets or financial resources of the defendant will be exposed so that the plaintiff can enforce the judgment. 15. The total sum involved was roughly about half a million, namely the judgment sum plus the costs. It is not a very substantial amount of money but, on the other hand, the sum is not small. There is no case to help me to adhere to past sentences. In the case of Brilliant Gain International Limited v Fu Kee and Another , HCMP2572/2009, substantial amount of moneys were involved. These amounts totalling near or more than 1 million, the court considered various sentences imposed before. Under paragraph 27 the court said, “In Chan Hung Kau , the respondent failed to comply with an order of the court to pay a sum of HK$3.9 million into court and also misled the court on his financial capability. He was sentenced to prison for 21 days.” And then in the instant case he sentenced each of the 1st and 2nd defendants to a prison as may be designated by the Commissioner of Correctional Services and he sentenced each of them to imprisonment for 21 days. 16. In the case of Winsome Paints Company Limited v Wong Yin Sun and Another , HCMP3185/2002, under paragraph 9, the court stated, “I view this as a very serious matter. The Respondent has not made any effort to tell this Court what if any difficulties or reasons that he may be having or may have had in relation to compliance with the relevant parts in my order. There is no mitigating factor so far as I can see from the material that is placed before me. Certainly, the Respondent has not sought to put in any mitigating material. 10. Taking everything into account, in my judgment, a short term of imprisonment is the appropriate sentence in the present case. In those circumstances, I make an order that the Respondent be committed to prison for a period of 21 days.” 17. The order concerned is stated under paragraph 1 of the judgment. The order relating to the contempt of court in that case is in respect of the defendant’s failure or refusal to comply with paragraphs 2, 3 and 4 of an order made by that court in HCA809/2002 on 10 May 2002. Those paragraphs related to the delivery up to the applicant’s solicitors for safe keeping products that infringed the registered trademark of the applicant, the making and filing of an affirmation and the service thereon on the applicant’s solicitors in that action verifying that he has complied with the delivery-up order, and the making and filing of an affirmation and the service thereon on the applicant’s solicitors disclosing information relating to his obtaining supply of the infringing products as well as the orders that he has received relating to the products in question. The purpose of the order was, on the face of it, to find out the amount of profits to be made because of the infringing products made by the defendant. 18. In this case, it is not as serious as the Winsome Paints Company Limited . There was no underlying profit to be made or already made but not disclosed to the court under Winsome Paints Company Limited ; so the present case is not so serious as that case. 19. Having regard to the judgment sum and the costs, I would think that a term of imprisonment of 10 days would be sufficient to reflect the gravity of the defendant’s conduct of contempt of court order. I therefore sentence the defendant to a period of imprisonment for 10 days. (Discussion re costs) 20. I order that the defendant do pay the costs of these proceedings relating to item (i) of the originating summons to the plaintiff on an indemnity basis, but no order for costs in respect of items (ii) and (iii). (Chow) District Judge Mr Lo Kam-ting, of Fongs, for the plaintiff The defendant was not represented and did not appear Look up this case on Lawcite Noteup",
  "length": 11200,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkdc/2012/706",
  "query": "contempt of court",
  "ts": "2025-10-16T12:11:30",
  "ok": true
}