{
  "title": "TECHTERYX LTD V. LEGACY TRUST COMPANY LTD AND OTHERS | [2025] HKCFI 787 | HKLII",
  "court": null,
  "year": 2025,
  "date": "2025-10-20",
  "content": "HKLII Databases Court of First Instance [2025] HKCFI 787 TECHTERYX LTD V. LEGACY TRUST COMPANY LTD AND OTHERS Judgment Information Date 24 Feb, 2025 Action No. HCA1906/2023 Neutral Cit. [2025] HKCFI 787 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCA1906/2023 html PUBLIC \"-//W3C//DTD XHTML 1.0 Transitional//EN\" \"http://www.w3.org/TR/html4/loose.dtd\" HCA1906B/2023 TECHTERYX LTD v. LEGACY TRUST COMPANY LTD AND OTHERS HCA 1906/2023 [2025] HKCFI 787 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE ACTION NO 1906 OF 2023 _____________ BETWEEN TECHTERYX LTD (suing on behalf of itself and the 1 st Defendant) Plaintiff and LEGACY TRUST COMPANY LIMITED 1st Defendant CROSSBRIDGE CAPITAL ASIA PTE LTD 2nd Defendant ARIA COMMODITY FINANCE FUND 3rd Defendant TRUECOIN LLC 4th Defendant CHRISTIAN ALEXANDER BOEHNKE DE LORRAINE-ELBEUF (also known as ALEX DE LORRAINE) 5th Defendant _____________ Before: Hon Mimmie Chan J in Chambers (Open to Public) Date of Hearing: 17 January 2025 Date of Decision: 17 January 2025 Date of Reasons for Decision: 24 February 2025 ________________________ REASONS FOR DECISION ________________________ Background 1. The parties do not dispute the legal principles which relate to the determination of the issues now before the Court. 2. Under section 20 of the Arbitration Ordinance (“ Ordinance ”), the Court shall, ie it is bound to, stay an action before it and refer the parties to arbitration, if the matter in the action is the subject of an arbitration agreement – unless the court finds that the arbitration agreement is null and void, inoperative or incapable of being performed. The questions for the Court are as summarized in Polytec Overseas Ltd v Grand Dragon International Holdings Co Ltd [2017] 3 HKLRD 258 . Of the four questions identified in Polytec , those which are in dispute in this case are: (i) Is there an arbitration agreement between the parties? and (iv) Is the dispute or difference between the parties within the ambit of the arbitration agreement? 3. Although the 5 th Defendant which is applying for the stay under section 20 (“ Section 20 Stay ”) relies also on the further or alternative ground to set aside the order for leave to serve the Writ out of the jurisdiction (as granted by the Master on 29 February 2024 (“ Service Out Order ”)), on the ground of material non-disclosure and/or the ground that none of the Order 11 rule 1(1) gateways apply, or that Hong Kong is not the appropriate forum for the resolution of the Plaintiff’s claim against the 5 th Defendant, it is only if I find that the Section 20 Stay should not be granted that these further grounds fall for consideration. The parties and their agreements 4. The Plaintiff is a company incorporated under the laws of the BVI. 5. The 4 th Defendant is a Delaware company, which is in the business of developing various digital currency products including “stablecoins”, a type of digital currency developed to be fully redeemable one-to-one in applicable fiat and fiat currency equivalents. One such stablecoin is marketed as the “TrueUSD (“ TUSD ”) tokens” (“ Tokens ”). 6. The 4 th Defendant created and maintained a website through which the Tokens were marketed. A person interested in subscribing for the Tokens would create an account on and via the TUSD website. The person would then place an order for a quantity of Tokens via the account and send the equivalent amount in US dollar fiat currency to an account stated to be with an independent licensed bank, deposit-taking institution or a licensed trust company (“ Reserves ”). The 4 th Defendant would then cause Tokens to be “minted” and sent to the person placing the order. A holder of the Tokens could trade or lend the Tokens, or use them to pay any third party who would accept the Tokens. A holder could also redeem the Tokens via the 4 th Defendant’s TUSD website, whereupon an equivalent amount in US dollar fiat currency would be sent to the holder. 7. As the Plaintiff highlighted, the central tenet of the 4 th Defendant’s business, and as marketed by it, is that it had sufficient Reserves in cash and cash equivalent assets to back one-to-one all of the outstanding Tokens. It was held out that there were sufficient Reserves maintained by independent licensed banks, deposit-taking institutions or trust companies, in cash or equivalent liquid and principal-protected assets, so that holders can be assured that the Tokens they hold would not be irredeemable, or become worthless. 8. The 5 th Defendant was at the material times an officer, director, and the Director of Finance and Head of Finance and Business Operations of the 4 th Defendant. 9. On 2 December 2020, the Plaintiff and the 4 th Defendant entered into the Strategic Alliance Agreement (“ SAA ”) and the Master Services Agreement (“ MSA ”), whereby the Plaintiff purchased from the 4 th Defendant various assets relating to the TUSD Token business carried on by the 4 th Defendant (“ Business ”). This purchase is referred to as the “ Acquisition ”. The Acquisition under the SAA included the rights, title and interest in the Reserves, and all of the 4 th Defendant’s claims and causes of action against third parties relating to such assets. The purchase price was US $28 million, with the right to receive additional incentive and revenue payments. 10. Under the MSA, the 4 th Defendant agreed to provide various service to the Plaintiff in order to facilitate the carrying on of the Business. Such services included banking relationship services, customer onboarding and support services, product management services and other transition services, for which the Plaintiff was required to pay fees within 30 days of receipt of the relevant invoice from the 4 th Defendant. It was highlighted that such services were of significant value to the Plaintiff, which was merely a shell company without real employees and thus required third parties such as the 4 th Defendant to help in the operation of the Business, and to liaise with the relevant third-party service providers. 11. Each of the SAA and the MSA contained arbitration agreements in broad terms, providing that: “Any dispute, controversy or claim arising out of, relating to, or having any connection with (the agreement) … shall be finally settled by binding arbitration in Singapore through the Singapore International Arbitration Centre …” 12. It is not disputed by the parties that the arbitration agreements are governed by Delaware law. 13. In the course of the 4 th Defendant’s operation of the Business, it had entered into an Escrow Services Agreement (“ Escrow Agreement ”) with the 1 st Defendant, which is a public company incorporated in Hong Kong and engaged in business as a trustee company. Under the Escrow Agreement, the 1 st Defendant was engaged to hold Reserves of US dollars, or their equivalents, for the benefit of holders of the Tokens, and against which the Tokens were to be redeemed. 14. As escrow agent, the 1 st Defendant in March 2020 had entered into an Account Investment Management Mandate (“ Mandate ”) with the 2 nd Defendant, which is a Singaporean company engaged in the business of investment and advisory services, and duly licensed by the Monetary Authority of Singapore to conduct a discretionary fund management business. Under the Mandate, the 2 nd Defendant was appointed as the investment manager to manage assets in a custody account held by the 1 st Defendant. 15. At the same time as the Acquisition, the Reserves which were under the management of the 1 st Defendant were transferred by the 1 st Defendant to its affiliate (“ FDT ”) pursuant to an Escrow and Properties Transfer Agreement. FDT is a public company incorporated in Hong Kong which is engaged in business as a trustee company. Following such transfer, the Plaintiff agreed to appoint FDT to hold the Reserves, and a Singapore company Finaport Pte Limited (“ Finaport ”) to provide investment management services in respect of the Reserves. 16. The Plaintiff also agreed to appoint the 5 th Defendant as its “authorized person”, to give instructions and directions to the operation team of the 4 th Defendant, and on the Plaintiff’s behalf to communicate with the investment and fiduciary partners of the Business. By resolutions dated 8 March 2021 (“ March Resolutions ”), the 5 th Defendant was appointed as an authorized person of the Plaintiff, to give instructions on the Plaintiff’s behalf to FDT in respect of the Reserves held by FDT, and in respect of the investment of such Reserves held. 17. On the Plaintiff’s case, it transpired that Reserves which were to be held by the 1 st Defendant under the Escrow Agreement were invested in the 3 rd Defendant, purportedly pursuant to investment advice obtained from FDT and Finaport. According to the Plaintiff, the 3 rd Defendant is a speculative and risky offshore commodity fund investing in trade finance and other related financing ventures. A sum of US $456 million (“ Transfer ”) was remitted to a bank account held by a company in Dubai, managed and controlled by the CEO of the 3 rd Defendant. According to the Plaintiff, the Transfer was authorized and ratified by the 5 th Defendant in his capacity as the authorized representative of the Plaintiff, without the knowledge, approval or authorization of the Plaintiff, and was pursuant to subscription forms completed by the 5 th Defendant acting purportedly on behalf of the Plaintiff. The Transfer was made by 6 remittances, between June 2021 and March 2022 (“ Remittances ”). 18. Disputes arose when the 3 rd Defendant defaulted on the Plaintiff’s redemptions of investment sums and the Plaintiff discovered the loss of the Reserves purportedly invested in the 3 rd Defendant. The 4 th Defendant claims on its part that the Plaintiff failed to perform its payment obligations owed to the 4 th Defendant under the SAA and the MSA, and on 17 November 2023, the 4 th Defendant commenced arbitration against the Plaintiff for the outstanding payments under the SAA and the MSA. There were two concurrent SIAC arbitrations brought pursuant to the arbitration agreements (“ Arbitrations ”). 19. On 24 November 2023, two days after the 4 th Defendant wrote to seek the Plaintiff’s agreement to the consolidation of the Arbitrations and on the appointment of a sole arbitrator, the Plaintiff commenced these proceedings in Hong Kong (“ HCA 1906 ”), initially against the 1 st Defendant only. The 2 nd and 3 rd Defendants were then joined in HCA 1906 on 2 January 2024, and by order of the Court made on 1 February 2024, the 4 th and 5 th Defendants were also joined as defendants. A re-amended Writ and an Amended Statement of Claim were filed on 6 February 2024. 20. On 11 April 2024, the SIAC granted the consolidation of the Arbitrations, and on 17 April 2024, a sole arbitrator was appointed. The 4 th Defendant submitted its Statement of Claim in the Arbitrations on 18 October 2024. On 24 December 2024, the Plaintiff applied to stay the Arbitrations and to challenge the jurisdiction of the Tribunal. 21. It was on 23 February 2024 that the Plaintiff applied for leave of the Court to serve HCA 1906 on the 2 nd to the 5 th Defendants out of the jurisdiction of Hong Kong. Leave was granted on 29 February 2024. 22. On 17 April 2024, the 4 th Defendant made an application to the Singapore Court for an anti-suit injunction to restrain the Plaintiff from continuing to pursue its claims in HCA 1906 in Hong Kong. It also applied to the Hong Kong Court on 14 May 2024 to stay these proceedings in favor of arbitration in Singapore (“ 4 th Defendant’s Stay Application ”). 23. On 14 August 2024, the Singapore Court granted an injunction, to permanently restrain the Plaintiff from pursuing or continuing HCA 1906 against the 4 th Defendant (“ Singapore ASI Order ”), on the basis of the arbitration agreements contained in the SAA and the MSA. The Plaintiff filed notice of appeal against the Singapore ASI Order on 11 September 2024, which appeal is yet to be heard. 24. Notwithstanding the Singapore ASI Order, the Plaintiff did not take steps to discontinue HCA 1906, but sought instead to adjourn the 4 th Defendant’s Stay Application. In view of the Singapore ASI Order, this Court dismissed the Plaintiff’s application for adjournment on 16 December 2024. The Plaintiff and the 4 th Defendant finally consented on 17 December 2024 to stay HCA 1906 against the 4 th Defendant. 25. On 11 September 2024, the 5 th Defendant was provided with documents in support of the Plaintiff’s ex parte application for leave to join the 5 th Defendant in HCA 1906 and for service out of the proceedings on the 5 th Defendant. The 5 th Defendant issued his summons on 30 September 2024 to stay HCA 1906 against him (“ 5 th Defendant’s Stay Application ”). The Section 20 Stay 26. The relevant issues for determination of the 5 th Defendant’s Stay Application are set out in paragraph 2 above. The merits of the parties’ claims in the Arbitration are not relevant to the Court’s consideration. The pertinent question in dispute is whether the matter in HCA 1906 is the subject of an arbitration agreement. In this context, the Plaintiff pointed out that it is wrong for the 5 th Defendant to contend that the Plaintiff’s claims made against him arise from his role and capacity as agent of the 4 th Defendant, in assisting the 4 th Defendant to enter into the SAA and the MSA with the Plaintiff. The Plaintiff highlights the fact firstly, that its causes of action against the 5 th Defendant in HCA 1906 are in respect of the 5 th Defendant’s breach of fiduciary duty and gross negligence as the authorized representative of the Plaintiff , and his fraudulent and alternatively innocent misrepresentation, personally as well as being joint tortfeasor of the 4 th Defendant; and secondly, that the 5 th Defendant is not a party to the arbitration agreements contained in the SAA and the MSA in respect of disputes arising thereunder. 27. The parties do not however dispute that the arbitration agreements are governed by Delaware law. The parties’ experts are in agreement that the language of the relevant arbitration agreements is broad in scope and that hence, the court will defer to arbitration on issues which may touch on contractual rights or contractual performance (the case Parfi Holding AB v Mirror Image Internet, Inc 817 A2d 149, 155 being cited as authority). Pertinently, the experts agree that under Delaware law, the courts may allow non-signatories to invoke arbitration clauses in situations of agency and estoppel. They further agree that a contract clause which bars third-party beneficiaries does not prevent non-parties from invoking agency or estoppel to take advantage of an arbitration clause. 28. As summarized by Counsel for the 5 th Defendant, the US law experts in this case agree on the following principles with regard to the doctrine of agency under Delaware law: (1) As explained in the case of E I DuPont de Nemours & Co v Rhone Poulnec Fiber & Resin Intermediaries, SAS , 269 F3d 187, 199 (3d Cir 2010), “courts have bound a signatory to arbitrate with a non-signatory because of the close relationship between the entities involved, as well as the relationship of the alleged wrongs to the non-signatory’s obligations and duties in the contract and the fact that claims were intimately founded and intertwined with the underlying contractual obligations”. (2) The question turns on whether the claim(s) against the non-signatory “would be assertable had there been no contract”, viz whether such claims “implicate any of the rights and obligations provided for in the contract” and/or “depend on the existence of the contract”: see Parfi Case at 155-157. If so, such claims would be “independent of the agreement containing the arbitration provision”, in that they “could [have been] brought had the parties not signed [the contract containing the arbitration clause]”. 29. The Delaware law experts also agree that the doctrine of equitable estoppel applies to allow a non-signatory to compel arbitration where a signatory to a contract containing an arbitration clause “raises allegations of substantially interdependent and concerted misconduct by both the non-signatory and one or more of the signatories to the contract”; or where the signatory’s claims “arise out of and relate directly to the written agreement”. 30. The Plaintiff places emphasis on the fact that its claims were made against the 5 th Defendant on the basis of his breach of the duties owed to the Plaintiff as a result or by virtue of his being the Plaintiff’s authorized person as appointed by the March Resolutions, which resolutions were signed and dated much later than the SAA and the MSA. The Plaintiff maintains that its claims are independent of, and did not arise from the SAA and MSA between the Plaintiff and the 4 th Defendant. On that basis, the Plaintiff argued that its claims against the 5 th Defendant could have been brought even if the Plaintiff and the 4 th Defendant had not signed the SAA and MSA containing the arbitration clauses (the Plaintiff’s expert referring to and relying on Feeley v NHAOCG, LLC 62 A3d 649,656). 31. Having considered in detail the claims made by the Plaintiff against the 5 th Defendant in these proceedings, my judgment is that they are intertwined with the 4 th Defendant’s obligations and duties arising from the MSA, and that the claims against the 5 th Defendant are inextricably related to and connected with the Plaintiff’s claims made against the 4 th Defendant. This is so even if the 5 th Defendant himself may also owe duties to the Plaintiff by virtue of his appointment under the March Resolutions. The fact that he is the Plaintiff’s authorized person does not alter the fact that the execution of his duties is also and at the same time related to and connected with the services and duties which the 4 th Defendant is bound under the MSA to carry out, through the 5 th Defendant, for the Plaintiff. 32. Under the MSA, the 4 th Defendant was to provide a wide range of services to the Plaintiff for continuing and carrying on the Business acquired. These services include what was described in the MSA as “banking relationship services”, which specifically referred to services provided by the 4 th Defendant “in order to satisfactorily manage and maintain (the 4 th Defendant’s) banking relationships with financial institutions that provide services to the TUSD product”. The 4 th Defendant was required under Exhibit A-1 to the MSA to “manage and maintain relationships with trustee(s) of TUSD fiat deposits”, and “to manage and maintain the banking relationships with financial institutions that maintain or service any US dollar balances held in escrow accounts or otherwise maintained for the benefit of TUSD holders”. These obviously form an essential aspect of the carrying on of the Business, and some individual has to be appointed to carry out the designated services to be performed by the 4 th Defendant on the Plaintiff’s behalf: in giving instructions and liaising with third parties such as bankers, financial institutions, trustees and other service providers, particularly when the Plaintiff itself had no employees. 33. It was to facilitate such giving of instructions, as part of the services required to be performed by the 4 th Defendant to the Plaintiff under the MSA, that the 5 th Defendant was individually appointed under the March Resolutions to act for the Plaintiff. The March Resolutions referred to the agreements between the Plaintiff and FDT (which held the Reserves), under which FDT (the trustee company) was to provide escrow and investment services to the Plaintiff, and to make investments for the Plaintiff. The 5 th Defendant was appointed under the March Resolutions, as the Authorized Person to give instructions to FDT on behalf of the Plaintiff, including instructions in respect of the investments (paragraph 3.1 of the March Resolutions). It was further resolved under the March Resolutions that any prior actions and instructions given by the 5 th Defendant on behalf of the Plaintiff to FDT in connection with the investments should be ratified and confirmed. 34. I accept the submissions made for the 5 th Defendant, that the March Resolutions cannot be viewed in a vacuum, and that their genesis and purpose should be properly considered. On the facts of this case, I reject the contention that the March Resolutions and the authority conferred on the 5 th Defendant thereunder are totally independent of and entirely separate to the MSA and the SAA. 35. On the 5 th Defendant’s evidence, his appointment under the March Resolutions was solely for the purpose of enabling him (as the Primary Relationship Manager of the 4 th Defendant vis-à-vis the Plaintiff) to give instructions to FDT in order to facilitate the 4 th Defendant’s performance of its duties under the MSA, to represent the Plaintiff as agreed, and for providing the banking relationship services defined in the MSA with the Plaintiff. According to the 5 th Defendant, there was no other purpose for the Plaintiff to appoint him as its Authorized Person, other than to discharge the 4 th Defendant’s obligations and services under the MSA, and to facilitate the orderly running of the Business. 36. As Counsel for the 5 th Defendant pointed out, this is consistent with the Plaintiff’s own pleading of its claims against the 5 th Defendant, as set out in the Amended Statement of Claim. At paragraph 44R, the pleading reads: “In addition to the matters pleaded in paragraph 44B above, prior to the Closing Date, the 4 th Defendant and 5 th Defendant proposed , for purposes of business continuity, that the 5 th Defendant be appointed as an \"authorised person\" of the Plaintiff to facilitate the orderly running of the Business , to give instructions and directions to the operations team of the 4 th Defendant and to communicate with the investment and fiduciary partners of the Business for all relevant purposes of the MSA (such partners including the 1 st Defendant and the 2 nd Defendant). In light of the experience of the 5 th Defendant, the Plaintiff agreed to this request and the 5 th Defendant was appointed as authorised representative of the Plaintiff; and all such actions were approved and ratified pursuant to a resolution of the Plaintiff dated as of 8 th March 2021 but prepared some 8 months after such date by FDT, the 4 th Defendant and the 5 th Defendant and presented to the Plaintiff for signing in or around November 2021.” (emphases added) 37. The 5 th Defendant highlighted the fact that he was not appointed as the director or officer of the Plaintiff, nor was he conferred with any other authority from the Plaintiff, other than to communicate and pass on instructions and information from the Plaintiff to FDT, as part and parcel of the services provided by the 4 th Defendant under the MSA. The 5 th Defendant also referred to the email dated 22 November 2021 from FDT to the Plaintiff, in which it was stated: “Our team have reached out to (the Plaintiff) with the aim of trying to receive direct instructions related to (the Plaintiff) Custody Account, however they have replied by requesting that all instructions to FDT to come through your firm. While previously Mr Can Sun and (the 5 th Defendant) were the previous points of contact for giving FDT’s accounts team the respective instruction, we would respectfully request your team’s assistance in liaising with (the Plaintiff) regarding delegating additional individuals the proper authorization to instruct FDT regarding their funds, investments and overall handling of the account. We have prepared a draft resolution for your review confirming the instructions.” (emphasis added) 38. The above email shows the purpose for which the March Resolutions were required, namely, to enable designated individuals (such as the 5 th Defendant) to have proper authorization to instruct FDT regarding the Plaintiff’s investments and overall handling of its account with FDT. This was the purpose for which the 4 th Defendant was appointed under the MSA, and precisely the obligation it assumed and was expected to carry out thereunder: to provide services in order to manage and maintain the 4 th Defendant’s relationships with trustees and financial institutions which maintain or service balances held in escrow accounts, or otherwise maintained for the benefit of the TUSD holders - all so as to continue, and for the purpose of, the Business acquired by the Plaintiff under the SAA. 39. I am therefore satisfied that there is clearly a prima facie case, which is all that Hong Kong law requires, that under Delaware law, the Plaintiff’s claims made against the 5 th Defendant in HCA 1906 are “intimately founded and intertwined with” the 4 th Defendant’s underlying contractual obligations of the MSA, and that there is a close relationship between the 5 th Defendant (the non-signatory), and the 4 th Defendant and the Plaintiff as parties under the MSA, such that the Plaintiff is bound to arbitrate its claims against the 5 th Defendant. 40. Applying the Parfi case, had the MSA and SAA not been made between the Plaintiff and the 4 th Defendant, the 5 th Defendant would not have been appointed as the Plaintiff’s Authorized Person, to carry out the services of instructing FDT regarding the Plaintiff’s investments, and the Plaintiff would have had no claims against the 5 th Defendant for either his alleged breach of duties, or alleged gross negligence, in carrying out such duties. 41. On the evidence, and on the pleadings, the allegations made against the 5 th Defendant arise out of and relate directly to the MSA and SSA, such there is a prima facie case that equitable estoppel applies under Delaware law to allow the 5 th Defendant to enforce the arbitration agreement, despite not being a signatory to the MSA and SSA. As the 5 th Defendant highlighted, the Delaware Court does not allow a valid arbitration clause to be defeated by “artful pleading” which seeks to avoid the effect of a mandatory arbitration agreement. I would add that this is also the general approach of the Hong Kong Court (see for example Linde GMBH and Another v Ruschemalliance LLC [2023] HKCFI 2409 , paragraphs 75-77). 42. With regard to the claims of misrepresentation which are made against the 5 th Defendant in HCA 1906, I agree with Counsel for the 5 th Defendant that the claims cannot be asserted in the absence of the SAA and MSA. The Sufficiency Representation pleaded at paragraph 7 of the Amended Statement of Claim is contained as an express representation and term under section 3.15 of the SAA. Again applying the test in Parfi , the Plaintiff’s claims of misrepresentation and the 5 th Defendant’s alleged for sole and/or joint liability with the 4 th Defendant for such misrepresentation cannot be said to be independent of the SAA and MSA. If the SAA and MSA had not been made between the Plaintiff and the 4 th Defendant, no claim of misrepresentation allegedly inducing the SAA and MSA, or as an express representation or warranty thereunder, could have been asserted by the Plaintiff against the 5 th Defendant. The allegations against the 4 th and 5 th Defendants are at least substantially interdependent, and there is a prima facie case that the doctrine of equitable estoppel applies to allow the 5 th Defendant to rely upon the arbitration clause in the SAA and MSA. 43. In conclusion, I am satisfied that the Plaintiff’s claims against the 5 th Defendant as asserted in the Amended Statement of Claim in HCA 1906 arise out of, relate to or have connection with the SAA and MSA, to fall within the ambit of the arbitration clause of the agreements. There is no evidence to suggest that the arbitration agreements are invalid, inoperative or incapable of being performed. Under section 20 of the Ordinance, the Court is bound to stay the action to arbitration, and I so ordered at the conclusion of the hearing on 17 January 2025. 44. By virtue of my finding, it is not necessary to deal with the questions of whether the Service Out Order should be set aside, for any of the reasons claimed by the 5 th Defendant. Any breach of confidentiality? 45. At the hearing, the Plaintiff claimed that in applying for the stay in these proceedings, the 5 th Defendant had relied on confidential matters and documents arising from/in the Arbitrations between the Plaintiff and the 4 th Defendant, and that the Court should disregard such matters and exhibits which constitute confidential communications, orders and steps taken in the Arbitrations. 46. In response, the 5 th Defendant pointed out that the Plaintiff had never raised any objection when the 5 th Defendant’s evidence was first filed and served, and that the Plaintiff never applied for the allegedly confidential information to be expunged from the evidence. 47. First and foremost, the 5 th Defendant claims that he is not a party to the Arbitrations, and is not bound by any obligation of confidentiality, but emphasized that even if he were, he is entitled under the relevant SIAC Rules to be exempted from the prohibition against a party’s disclosure of matters relating to the Arbitrations, for pursuing and enforcing his legal right to seek a stay of these proceedings and to set aside the Service Out Order - an exemption expressly provided for under paragraph 39.2 of the SIAC Rules. 48. The 5 th Defendant further claims that much of the matters relating to the steps taken in the Arbitrations have been made open to the public when the judgment of the Singapore Court in the Singapore ASI Order was published, and any confidentiality has been lost. 49. I accept the submissions made for the 5 th Defendant in relation to the permissible disclosure of confidential matters relating to the SIAC Arbitrations to pursue or enforce a legal right or claim, but in my judgment, when this Court considers the issues for determination in the present application, there is simply no need to refer to any confidential details of the Arbitrations, apart from the fact that they exist, and are continuing. No use of or reference has been made by this Court to any of the allegedly confidential matters claimed by the Plaintiff. The issue of any alleged breach by the 5 th Defendant of confidentiality is academic. 50. No order is made on the 5 th Defendant’s Summons of 10 January 2025, as the evidence is not necessary. Disposition 51. The application for the Section 20 Stay was granted on 17 January 2025 for the above reasons, and the costs of the application are to be paid by the Plaintiff to the 5 th Defendant, on indemnity basis, with Certificate for 2 counsel. (Mimmie Chan) Judge of the Court of First Instance High Court Mr Laurence Li SC and Mr Sebastian Hughes, instructed by Loeb & Loeb LLP, for the plaintiff Ms Sara Tong SC and Ms Natalie So, instructed by Reynolds Porter Chamberlain, for the 5 th defendant Look up this case on Lawcite Noteup",
  "length": 31138,
  "headers_seen": [
    "Background",
    "The parties and their agreements",
    "The Section 20 Stay",
    "Any breach of confidentiality?",
    "Disposition"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2025/787",
  "query": "compel arbitration",
  "ts": "2025-10-11T21:05:10",
  "ok": true
}