{
  "title": "R. V. KWAN WAI MAN, ALEXANDER | [1995] HKCA 335 | HKLII",
  "court": null,
  "year": 1995,
  "date": null,
  "content": "HKLII Databases Court of Appeal [1995] HKCA 335 R. V. KWAN WAI MAN, ALEXANDER Judgment Information Date 15 Mar, 1995 Action No. CACC483/1994 Neutral Cit. [1995] HKCA 335 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History CACC483/1994 CACC000483/1994 R. v. KWAN WAI MAN, ALEXANDER CACC000483/1994 IN THE COURT OF APPEAL 1994, No. 483 (Criminal) _____________ BETWEEN THE QUEEN and KWAN WAI MAN, ALEXANDER _____________ Coram: Hon Macdougall, V.-P., Penlington and Bokhary, JJ.A. Date of hearing: 16 March 1995 Date of judgment: 16 March 1995 _____________________________________ J U D G M E N T O F T H E C O U R T _____________________________________ Macdougall, V.-P.: 1. The applicant, who is aged 35, pleaded guilty before Wong J. to two counts of assault occasioning actual bodily harm. On account of the applicant's mental condition the judge ordered that he be detained in Siu Lam Psychiatric Centre for an unspecified period of time. The applicant now applies for leave to appeal against that order. 2. The agreed facts were that, on 19 January 1994, a nine-year old boy entered a public toilet to clean his spectacles. As he was about to leave, the applicant touched the boy's shoulder and rubbed his eyes. After the boy had left the toilet he was again accosted by the applicant. The boy attempted to escape but was grasped by the applicant and dragged through some firedoors and onto a staircase. There the applicant throttled the boy until he lost consciousness. A subsequent medical examination of the boy revealed that he had sustained multiple red spots around the eyes and ears and subconjunctional haemorrhage to both eyes. 3. The second offence occurred on 21 January 1994 when another nine-year old boy entered a public toilet. The applicant gestured to the boy to approach him but the boy attempted to leave. The applicant seized hold of him and throttled him into consciousness. Medical examination of the boy revealed a bruised nose, a blood clot on his nostrils and a four centimetre wound on the right side of his chin. An X-ray of the boy's nasal bones suggested the presence of a hairline fracture. Both boys suffered urinal and faecal incontinence as a result of the applicant's actions. 4. The applicant was subsequently arrested. At an identity parade held on 31 January 1994 he was positively identified by both boys as their attacker. He has a very bad history of violence. In February 1975 he was convicted of assault occasioning actual bodily harm and was ordered to be detained in Castle Peak Hospital for four months. In March 1987 he was convicted of false imprisonment and was bound over for 18 months. In September that year he was convicted of indecent assault on a girl and of assault occasioning actual bodily harm. For these offences he was sentenced to 18 months' imprisonment. In January 1989 he was convicted of common assault and was given a suspended sentence. In June 1990 he was again convicted of assault occasioning actual bodily harm and was sentenced to three years' imprisonment for that offence and to a further six months for breach of the terms of his suspended sentence. Then, in August 1992, he was again convicted of assault occasioning actual bodily harm and was sentenced to two years' imprisonment. The judge remanded the applicant so that an up-to-date psychiatric report could be compiled. When this application came before this court for hearing on a previous occasion we made an order that a further report be furnished as to the applicant's progress, if any. It is clear from all the reports that the applicant is an abnormally aggressive and seriously irresponsible person with borderline subnormal intelligence, that all attempts to resolve his personality problems had failed and that the long term prognosis was poor. Further psychiatric and psychological treatment is recommended in order to prevent further deterioration in the applicant's condition. In the light of the applicant's psychopathic personality, the high risk of his re-offending and the uncertain prognosis, it was recommended, and the judge accepted, that this was a proper case for the court to make, under section 45 the Mental Health Ordinance ( Cap. 136 ), a hospital order for an unspecified period. Since that recommendation, there has been no noticeable progress in the applicant's condition. The applicant told us that he committed the crimes on impulse and that he had been unable to control himself. However, he expressed remorse and the hope that leniency would be extended to him by amending the order to one of detention in a mental hospital for a finite period. 5. The nature of the offences which the applicant committed on the young boys, his long history of violence and the information contained in the psychiatric reports lead only to the conclusion that he is a danger to society and that the only proper course for the protection of society and for the good of the applicant himself was that taken by the judge. The application for leave to appeal against the order is therefore refused. (Neil Macdougall) (R.G. Penlington) (K. Bokhary) Vice President Justice of Appeal Justice of Appeal Representation: Mr Macleod for Crown Prosecutor Mr Michael Poll assigned by DLA for applicant Look up this case on Lawcite Noteup",
  "length": 5311,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkca/1995/335",
  "query": "assault occasioning actual bodily harm",
  "ts": "2025-10-17T10:41:19",
  "ok": true
}