{
  "title": "MONG HON MING V. SECRETARY FOR JUSTICE | [2004] HKCFI 80 | HKLII",
  "court": null,
  "year": 2004,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2004] HKCFI 80 MONG HON MING V. SECRETARY FOR JUSTICE Judgment Information Date 7 Mar, 2004 Action No. HCAL104/2003 Neutral Cit. [2004] HKCFI 80 Parallel Cit. [2004] 2 HKC 219 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCAL104/2003 HCAL000104/2003 MONG HON MING v. SECRETARY FOR JUSTICE HCAL000104/2003 HCAL 104/2003 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTITUTIONAL AND ADMINISTRATIVE LAW LIST NO.104 OF 2003 --------------------- BETWEEN MONG HON MING Applicant AND SECRETARY FOR JUSTICE Respondent ---------------------- Coram: Hon Hartmann J in Court Date of Hearing: 8 March 2004 Date of Judgment: 8 March 2004 Date of Handing Down Reasons for Judgment: 15 March 2004 ------------------------------------------ REASONS FOR JUDGMENT ------------------------------------------ Introduction 1. In April 2003, the applicant in this matter was charged with the offence of publishing an obscene article contrary to s.21 (1)(a) of the Control of Obscene and Indecent Articles Ordinance , Cap.390 ('the Ordinance'). On 25 August 2003, he sought a date from a magistrate so that an application could be made for a permanent stay of the prosecution. The applicant wished his application to be heard before the determination of any essential element of the offence of which he was charged. The magistrate agreed to set a date for the hearing of the application for a stay but declined to set it down for hearing before the matter had been referred to the Obscene Articles Tribunal ('the Tribunal') for the determination of the issue of whether the article allegedly published by the applicant was or was not obscene. On 18 September 2003, the applicant requested the magistrate to review this decision. The magistrate declined to do so. 2. In the result, in October 2003 the applicant issued judicial review proceedings seeking orders of certiorari to quash the magistrate's two decisions together with an order of mandamus directing that a date be set for the hearing of his stay application before a referral was made to the Tribunal. 3. On 8 March 2004, having heard argument, I granted leave to apply for judicial review, making the orders requested. I said that reasons would be given later. Those reasons, which fall within a relatively narrow compass, are contained in this judgment. Background 4. In October 2002, a Hong Kong magazine known as Eastweek published an article which concerned the kidnapping of an actress. The article was accompanied by a photograph of the actress which had been taken when she was in the hands of her kidnappers. It showed her naked. Although the photograph was edited to lessen the starkness of the depiction, the publication of the article and photograph attracted considerable public criticism. 5. A day or so after the publication of the article, the Television and Entertainment Licensing Authority referred it to the Obscene Articles Tribunal ('the Tribunal') for classification in terms of Part III of the Ordinance. The tribunal considered the matter in private, as it is empowered to do in terms of s.14 of the Ordinance, and classified the article as obscene. 6. Thereafter, the applicant, who had been a member of the editorial staff of Eastweek , was charged with the offence of publishing an obscene article. 7. It is the applicant's defence that the article is not obscene. 8. In terms of s.29 of the Ordinance, only the Tribunal has the power to make a determination whether, for the purposes of criminal proceedings, an article is or is not obscene. A 'determination' pursuant to s.29 is to be distinguished from a 'classification' in terms of s.14. In making a determination under s.29, the Tribunal is vested with the powers of a magistrate : see s.11 of the Ordinance. Section 29 itself reads : \" (1) A Tribunal shall have exclusive jurisdiction to determine whether ( a ) any article is obscene or indecent; ( b ) any matter that is publicly displayed is indecent; or ( c ) the ground of defence under section 28 is proved in respect of the publication of an article or the public display of any matter. (2) Subject to subsection (3), where in any civil or criminal proceedings before a court or magistrate a question arises as to any of the matters mentioned in subsection (1), that court or magistrate shall refer that question to a Tribunal; and the parties to those civil or criminal proceedings and, in the case of proceedings to which a public officer is not a party, the Secretary for Justice or their representatives, may appear and be heard at any hearing of that Tribunal relating to that reference.\" 9. Accordingly, in a prosecution for publishing of an obscene article pursuant to s.21(1)(a) of the Ordinance, for it to be proved that the article in question is obscene, that issue is not determined by the criminal court but must be remitted to the Tribunal for determination. That determination is not merely procedural. It is manifestly the determination of an essential element of the offence. 10. In the present case, of course, before criminal proceedings had been instituted against the applicant, the Tribunal had already classified the article published in Eastweek as obscene pursuant to s.14 of the Ordinance. It was the view of the applicant that this classification, while not a determination pursuant to s.29, nevertheless vitiated the lawfulness of the prosecution proceedings against him. As I understand it, this contention was based inter alia on two assertions : (i) The Tribunal, having already classified the article as obscene for the purposes of Part III of the Ordinance, and having done so in the absence of the applicant, it would not now be possible for the Tribunal to make a determination in respect of the same article for the purposes of criminal proceedings that was unbiased or unaffected by the earlier classification so as not to be prejudicial to the applicant. In short, in respect of an essential element of the offence of which he was charged, the applicant would be denied a fair hearing. (ii) The submission of the article to the tribunal for classification prior to the applicant's prosecution had constituted an illegitimate exercise of power in that it would have been done for the purpose of influencing the result of the prospective criminal proceedings or, if not done for that purpose, had the same result. 11. On the assertion that it would not be possible for him to have a fair trial before the Tribunal and that a hearing before the Tribunal would amount to an abuse of process, the applicant sought a date for the hearing of his application for a stay of proceedings, that date to be set before any hearing took place before the Tribunal. The magistrate, however, directed that the date given to him would be after the Tribunal had made a determination pursuant to s.29 of the Ordinance. 12. A study of the transcript of proceedings before the magistrate reveals that the magistrate was concerned solely with fixing an appropriate date. He did not in any way seek to deal with the merits of the applicant's intended application for a stay. 13. It goes without saying that, in this judgment, I myself make no determination of the merits of the applicant's intended application for a stay other than to recognise that it cannot be dismissed as so obviously lacking in merit that it should not delay either this court or a magistrate. Were the magistrate's decisions lawful? 14. It must be recognised that the very purpose of the applicant's application for a stay of proceedings was, of course, to avoid being subjected to a trial of a substantive issue before the Tribunal when, in his view, it would be impossible for that trial to be fair and when it would therefore amount to an abuse of process. 15. In Jago v. District Court of New South Wales (1989) 168 CLR 23 at p.30, Mason CJ put it as follows : \"The continuation of processes which will culminate in an unfair trial can be seen as a 'misuse of the Court process' which will constitute an abuse of process because the public interest in holding a trial does not warrant the holding of an unfair trial.\" The Chief Justice continued : \"The question is not whether the prosecution should have been brought, but whether the court, whose function is to dispense justice with impartiality and fairness both to the parties and to the community which it serves, should permit its processes to be employed in a manner which gives rise to unfairness.\" 16. The long-established supervisory jurisdiction of this court will, of course, be used when the need arises to ensure the integrity of proceedings in the magistrate's courts; that is, when matters go to the fundamental legality of the process, where, for example, it is alleged that the courts are acting without jurisdiction, that an abuse of power is being perpetrated or that the proceedings constituted a breach of natural justice. 17. In the present case, I was satisfied that the court should exercise its supervisory jurisdiction. I came to this conclusion because I was satisfied that the proceedings directed by the magistrate in terms of his two decisions, while not denying the applicant the right at any time during the course of the prosecution to apply for a stay of proceedings, had the effect of denying him that right in respect of the very set of proceedings within that prosecution which were the subject of his application. Directing that the application be adjourned until after the applicant had been forced to undergo a trial before the Tribunal rendered the application in this instance of no value. I do not see how the applicant could then seek to stay; that is, to stop or bring a halt to, proceedings that were already concluded. 18. As was stated in Jago v. District Court of New South Wales (supra) , a judgment cited with approval by the Court of Final Appeal in HKSAR v. Lee Ming Tee & Another [2001] 1 HKLRD 599 , the inherent purpose of an application for a stay of proceedings is to avoid the continuation of a process which will culminate in an unfair trial. It is to avoid a situation in which the court allows its process to be used unfairly. It is therefore invariably a prospective or current application, one that seeks to avoid a future or present event. It is not an application of the nature of an appeal which is retrospective, looking back to a substantive hearing already concluded. 19. In the present case, for the reasons given, I was therefore satisfied that denying the applicant the opportunity to seek a stay of proceedings before the matter was remitted to the Tribunal constituted a substantial procedural unfairness sufficient to vitiate the legality of the process. For that reason the application for judicial review was granted, costs following the event. (M.J. Hartmann) Judge of the Court of First Instance, High Court Representation: Mr Paul Harris & Mr Jon K.H. Wong, instructed by Messrs Bosco Tso & Partners, for the Applicant Mr Kevin P. Zervos, SC, SADPP & Ms Agnes Chan, SGC of Department of Justice, for the Respondent Look up this case on Lawcite Noteup",
  "length": 11180,
  "headers_seen": [
    "Introduction",
    "Background",
    "Were the magistrate's decisions lawful?"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2004/80",
  "query": "stay of proceedings",
  "ts": "2025-10-14T11:23:19",
  "ok": true
}