{
  "title": "WOLIK LTD V. WING HONG CONTRACTORS LTD | [2005] HKDC 85 | HKLII",
  "court": null,
  "year": 2002,
  "date": null,
  "content": "HKLII Databases District Court [2005] HKDC 85 WOLIK LTD V. WING HONG CONTRACTORS LTD Judgment Information Date 10 May, 2005 Action No. DCCJ6060/2003 Neutral Cit. [2005] HKDC 85 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History DCCJ6060/2003 DCCJ000031A/2003 DéCOR FLOORS ENGINEERING LTD v. WING HONG CONTRACTORS LTD AND ANOTHER DCCJ31/2003 IN THE DISTRICT COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION CIVIL ACTION NO. 31 OF 2003 ____________ BETWEEN DÉCOR FLOORS ENGINEERING LIMITED Plaintiff and WING HONG CONTRACTORS LIMITED 1 st Defendant TAI FONG ENGINEERING HONG KONG COMPANY LIMITED 2 nd Defendant and TAI FONG ENGINEERING HONG KONG COMPANY LIMITED Third Party ____________ DCCJ5894/2003 IN THE DISTRICT COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION CIVIL ACTION NO. 5894 OF 2003 ____________ BETWEEN POON WING KEE METAL WORK Plaintiff and WING HONG CONTRACTORS LIMITED Defendant and TAI FONG ENGINEERING HONG KONG COMPANY LIMITED Third Party ____________ DCCJ6060/2003 IN THE DISTRICT COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION CIVIL ACTION NO. 6060 OF 2003 ____________ BETWEEN WOLIK LTD Plaintiff and WING HONG CONTRACTORS LIMITED Defendant and TAI FONG ENGINEERING HONG KONG COMPANY LIMITED Third Party ____________ Before : Her Honour District Judge Marlene Ng in Chambers Dates of Hearing : 16th and 17th March 2005 Date of Handing Down Decision: 10th May 2005 _______________ D E C I S I O N _______________ I. Introduction 1. The applications before me relate to three actions (“ Actions ”) : (a) DCCJ No.31/2003 whereby Décor Floors Engineering Limited (“ Décor ”) sues Wing Hong Contractors Limited (“ Wing Hong ”) and Tai Fong Engineering Hong Kong Company Limited (“ Tai Fong ”) (“ Décor Action ”), (b) DCCJ No.5894/2003 whereby Poon Wing Kee Metal Work (“ PWK ”) sues Wing Hong (“ PWK Action ”) and (c) DCCJ No.6060/ 2003 whereby Wolik Ltd (“ Wolik ”) sues Wing Hong (“ Wolik Action ”). In all three Actions, Wing Hong issued third party proceedings against Tai Fong (“ TP Proceedings ”). H H Judge Muttrie granted judgment after trial in favour of Décor against Wing Hong but dismissed its claim against Tai Fong. Wing Hong recently settled the main action in Wolik Action with Wolik, but the main action between PWK and Wing Hong is yet to be tried (separately from TP Proceedings). 2. In each Action, the applications before me are concerned with TP Proceedings and Tai Fong’s counterclaim thereunder (“ TP Counterclaim ”) : (a) Tai Fong seeks to restrain Wing Hong from proceeding with and/or taking further step in the arbitration between Tai Fong and Wing Hong commenced in/about November 2002 (“ Arbitration ”) (“ Restrain Application ”); (b) Tai Fong applies for TP Proceedings in all three Actions to be transferred to and tried together in the Court of First Instance (“ Transfer Application ”); (c) Wing Hong applies for TP Counterclaim to be struck out as being scandalous, frivolous, vexatious or an abuse of process of the court or alternatively be stayed pending Arbitration pursuant to the inherent jurisdiction of the court; (d) Tai Fong applies for directions for the further conduct of TP Proceedings (“ Summons for Directions ”). Tai Fong also seeks leave to re-amend its Amended Defence and Counterclaim in TP Proceedings in PWK Action. 3. I granted leave for Wing Hong to amend its summonses in (c) above to seek an order that (i) TP Counterclaim be struck out or (ii) the whole of TP Proceedings or alternatively TP Counterclaim be stayed on the above-stated grounds (“ Strik e Ou t/Stay Application ”). If I am with Tai Fong on Restrain and Strike Out/Stay Applications, Tai Fong is willing to withdraw or not pursue its claim in Arbitration and Wing Hong will not oppose Transfer and/or Amendment Applications subject to usual directions for consequential amendments and costs. Although Tai Fong has applied to amend its pleadings in PWK Action only, Wing Hong does not object to Tai Fong making similar amendments to its pleadings in all three Actions (“ Amendment Application ”). Both parties agree that Summons for Directions should be adjourned sine die with liberty to restore. 4. The selectively included affirmation evidence in the hearing bundle is for use in all three Actions. Particulars in the chronology of events prepared by Wing Hong’s solicitors (“ Chronology ”) are not agreed but the parties accept that Chronology presents a general overview of events. II. Contractual background 5. The Architectural Services Department (“ ASD ”) entered into a maintenance contract with Wing Hong as contractor to repair/maintain public properties (“ Principal Contract ”). Wing Hong entered into a Sub-contract with Tai Fong in respect of such works (“ Sub-contract ”). Sub-Contract provides that all disputes arising therefrom are to be referred to arbitration (“ Arbitration Clause ”). Wing Hong terminated Sub-contract on/about 5 th May 2002 and the legitimacy of such termination is in dispute. III. HCA No.3043/2002 (“HC Action”) 6. On 7 th August 2002, Tai Fong sued Wing Hong for HK$31,260,767.96 under Sub-contract or on quantum meruit basis for work done/materials supplied at Wing Hong’s request and for HK$191,154,629.00 being loss of profit for wrongful termination of Sub-contract. Pursuant to the consent order of Master Yuen dated 14 th September 2002 (“ Consent Order ”), HC Action was withdrawn and all disputes between the parties relating to HC Action were to be referred to arbitration. IV. Arbitration (a) Tai Fong’s claim (“TF Arb Claim”) 7. The background to TF Arb Claim is the increased works issued by ASD that exceeded Tai Fong’s estimation of the required financial resources. Wing Hong extended two loans to Tai Fong and represented that it would financially support Tai Fong in carrying out such works. When ASD issued further works, Tai Fong requested further loans pursuant to Wing Hong’s representations. Wing Hong promised to grant a third loan and agreed for all outstanding loans to be repaid with interest commencing nine months after the release of the third loan. After releasing three instalments of the third loan, Wing Hong failed to release the balance or provide further financial support. Further, although Wing Hong confirmed it would reduce the loan amounts successively from interim payments payable to Tai Fong, it only chose to deduct a substantial sum from two interim payments some time afterwards in March 2002. 8. By reason of Wing Hong’s false representations, refusal of financial support, failure to release the balance of the third loan, premature loan repayment demands and deferral of interim payment deductions to March 2002, Wing Hong was in repudiatory breach of Sub-contract (which repudiation Tai Fong accepted). Tai Fong also relies on a promissory estoppel argument on the same grounds. In/about May 2002, the parties orally agreed on payment for work done by Tai Fong up to 5 th May 2002. 9. Tai Fong claims against Wing Hong for the following : (a) outstanding payment for work done under Sub-contract up to 5 th May 2002 (HK$42,692,395.72) under the oral agreement of May 2002; (b) alternatively, outstanding payment for work done under Sub-contract up to 5 th May 2002 (HK$25,545,590.72) pursuant to ASD certified interim payments less payments received up to 5 th May 2002, outstanding loans and contra charges; (c) alternatively, a sum for work done and materials supplied by Tai Fong by way of quantum meruit ; (d) loss of profit (HK$84,423,926.91) as a result of Wing Hong’s wrongful termination of Sub-contract or alternatively damages to be determined by the arbitrator Mr Jean Peter Ho (“ Arbitrator ”). (b) Wing Hong’s defence and counterclaim 10. As a result of Tai Fong’s slow progress of the works and inadequacy of materials/labour, Wing Hong’s termination of Sub-contract was lawful. Wing Hong denies inter alia (a) having agreed to or represented it would provide financial support to Tai Fong, (b) the averment of promissory estoppel, (c) the accuracy of Tai Fong’s claimed value of work done as at 5 th May 2002 and (d) the applicability of the quantum meruit principle. 11. In respect of (c) above, Tai Fong has ignored changes in estimates, differences between estimates and dimension book submission, and the effect of “Batching” and “Clawback” procedures. Tai Fong has also underestimated the cost of engaging replacement sub-contractors to complete Sub-contract works after 5 th May 2002 and the consequent increased costs imposed on Wing Hong. In fact there has been overpayment to Tai Fong after taking into account “Batching”/“Clawback” procedures between ASD and Wing Hong and contra charges arising from Tai Fong’s failure to follow accounting procedures under Principal Contract. Wing Hong’s counterclaim against Tai Fong in Arbitration (“ WH Arb Counterclaim ”) is for inter alia the following : (a) consequential costs in engaging sub-contractors to complete the uncompleted works order under Sub-contract; (b) liquidated damages payable by Wing Hong to ASD due to Tai Fong’s delay; (c) payments made by Wing Hong to Tai Fong’s workers for non-payment of wages; (d) payments to Tai Fong’s suppliers in respect of services/materials ordered prior to but provided/payable after 5 th May 2002 (“ Appendix L Claim ”); (e) payments made or to be made by Wing Hong for contracts entered into by Tai Fong with suppliers of materials/services in Wing Hong’s name or on its behalf (“ Supply Contracts ” - note the claims by Décor, PWK and Wolik against Wing Hong fall into this category) (“ Appendix N Claim ”); (f) costs of rectifying Tai Fong’s defective works. 12. For Appendix N Claim, Wing Hong pleads that there were 33 occasions when Tai Fong entered into Supply Contracts and represented to suppliers that such contracts were made with Wing Hong when in fact Tai Fong should be the proper contracting party (“ Para.79 Assertion ”). Tai Fong specifically denies this. 13. Wing Hong goes on to plead that Sub-contract did not confer authority on Tai Fong to use Wing Hong’s name to enter into Supply Contracts or to do so as Wing Hong’s agent. But Tai Fong knowingly so contracted in Wing Hong’s name as evidenced by its admission in correspondence to using Wing Hong’s name to purchase materials because most suppliers were unwilling to contract with Tai Fong (“ Para.80 Assertion ”). Tai Fong does not specifically deny such assertion. 14. Wing Hong then says Appendices N and O to its Re-re-amended Defence and Counterclaim set out the litigation claims arising from such unauthorised Supply Contracts and Wing Hong’s costs in obtaining legal advice on Sub-contract and legal claims arising therefrom, which costs are consequential upon Tai Fong’s breach of Sub-contract and/or recoverable under common law (“ Para.81 Assertion ”). Tai Fong does not admit such assertion. (c) Discovery 15. Arbitration has been on-going for about two years since late 2002. Arbitrator issued 7 Orders for Directions mostly on inter alia pleadings, submissions, witness statements with documents annexed, requests for discovery and up-to-date schedule of accounting between Wing Hong and ASD for work done up to 5 th May 2002. Wing Hong’s solicitors claim Tai Fong has on/about 25 occasions requested and received from Wing Hong a total of about 28,972 pages of discovered documents and has paid HK$86,916.00 in photocopying costs. (d) Updating quantum 16. The accounting procedure between ASD and Wing Hong for receivables on work done under Principal Contract is a continuing process and Wing Hong anticipates the final accounts will be completed in/about mid-2005. Then Wing Hong will have to update its pleadings (last done in February 2005). Wing Hong therefore expects Arbitration can be heard within this year. (e) Preliminary issues 17. Wing Hong proposed to have a hearing on preliminary issues, namely, (a) whether the termination of Sub-contract is lawful and (b) whether Wing Hong is liable to indemnify Tai Fong for loss of profit arising from such termination (“ Preliminary Issues ”). On 2 nd and 9 th December 2004, Tai Fong informed Arbitrator and Wing Hong that it was “considering the abandonment of its claim against Wing Hong for loss of profits”. Wing Hong notified Arbitrator of Restrain Application. On 7 th January 2005 Arbitrator by Order for Directions No.7 gave directions inter alia for hearing Preliminary Issues in mid-May 2005. V. Actions (a) Main actions 18. Décor, PWK and Wolik claim against Wing Hong for the outstanding price of materials/services supplied for the performance of Sub-contract (“ Main Actions Claim ”). Wing Hong’s defence is that such contracts were entered into with Tai Fong. (b) Wing Hong’s claim in TP Proceedings(“WH TP Claim”) 19. Initially in Décor Action’s TP Proceedings, Wing Hong sought a declaration that Décor’s Supply Contract was made with Tai Fong and an indemnity for any amount due from Wing Hong to Décor with costs (“ Indemnity Claim ”). Subsequent to Arbitrator’s Ruling (see below), Wing Hong removed Indemnity Claim and pleaded the following causes of action in WH TP Claim : (a) Tai Fong was in breach of fiduciary duty by holding itself out to Décor and generally as having authority (when it did not have any) to deal with parties other than ASD, to procure materials/services from and enter into transactions with third parties and to carry out/continue with other activities without Wing Hong’s knowledge/consent, and by failing to act bona fide in Wing Hong’s best or any interests (“ Breach of Duty Claim ”); (b) Tai Fong represented to Décor that it had Wing Hong’s authority and was Wing Hong’s agent/representative for entering into Supply Contract with Décor and that Wing Hong would pay Décor for the work done, which representations were malicious falsehoods (“ Malicious Falsehood Claim ”); (c) liability for contribution/indemnity in respect of Wing Hong’s liability to Décor under the Civil Liability (Contribution) Ordinance Cap.377 and/or Clause 13.1 of Sub-contract. Wing Hong claims for loss/damages being amounts which it is required to pay Décor and costs (i) for defending the main action, (ii) which Wing Hong is liable to pay Décor and (iii) incurred by Wing Hong in bringing TP Proceedings. Wing Hong also claims damages for breach of fiduciary duty to be assessed. In its current amended state, WH TP Claim is substantially the same in all three Actions. 20. Breach of Duty Claim as pleaded is wider in scope than Main Actions Claim and Malicious Falsehood Claim. Breach of Duty Claim seeks damages for breach of Tai Fong’s fiduciary duty owed to Wing Hong vis-à-vis Main Actions Claim and generally (ie over 30 demands made to Wing Hong for payments under unauthorised Supply Contracts). However, Mr Manzoni, counsel for Wing Hong, says Breach of Duty Claim is only intended to be coextensive with Main Actions Claim and Wing Hong undertakes (unless TP Proceedings are stayed) to amend WH TP Claim in all three Actions to record such position. Mr Manzoni submits that given such open indication Restrain and Strike Out/Stay Applications should not be determined on a pleading point. I propose to consider the applications before me on the basis that the scope of Breach of Duty Claim is as indicated by Mr Manzoni. (c) Tai Fong’s defence and counterclaim 21. Broadly speaking, Tai Fong adopts two lines of defence, namely, (a) it is entitled and authorised to contract on Wing Hong’s behalf as part of the arrangements for Wing Hong to provide financial support and to charge the purchase of materials/ services for Sub-contract works to Wing Hong (which defence relies partly on Tai Fong’s proposed amendments under Amendment Application (“ TF Amendments ”)) (“ TF Pure Defence ”) and (b) TP Counterclaim for value of work done and loss of profit that gives rise to an equitable set-off defence (“ TF Set-Off Defence ”). In light of Wing Hong’s stance on Amendment Application and Mr Manzoni’s suggestion not to take pleading points, I will consider the applications in light of TF Amendments. 22. For TF Pure Defence, Tai Fong claims Wing Hong has appointed Tai Fong’s employees as its authorised representatives and has cloaked them with authority for approving Tai Fong to enter into Supply Contracts in Wing Hong’s name with suppliers for the supply of materials/services for Tai Fong’s use. Such authority is also implied as a matter of business efficacy and/or custom of the building trade. Tai Fong also acts and has been authorised to act as Wing Hong’s agent pursuant to Sub-contract. Tai Fong further claims that it was agreed that Wing Hong would provide financial support (including payment for the purchase of materials/services from suppliers) to Tai Fong for the performance of Sub-contract works. 23. Tai Fong goes on to plead that subject to TF Set-Off Defence, Wing Hong is entitled to back charge Tai Fong for purchases from suppliers (including the amounts under Main Actions Claim) by deductions from retention monies held by Wing Hong and payments due to Tai Fong (“ Back Charge Admission ”). Wing Hong’s alleged loss under Breach of Duty and Malicious Falsehood Claims is substantially the same as the sum back-chargeable by Wing Hong to Tai Fong. 24. TP Counterclaim (which repeats TF Pure Defence) is largely similar to TF Arb Claim. But Mr Manzoni complains of Tai Fong’s discrepant approach between denying or not admitting Paras.79-81 Assertions in Arbitration and (subject to TF Set-Off Defence) making Back Charge Admission in TP Proceedings (“ Alleged Discrepant Treatment ”). He submits that WH TP Claim has been necessitated by Alleged Discrepant Treatment. Mr Smith SC, leading counsel for Tai Fong, disagrees, but more of this later. VI. Scope of Arbitrator’s jurisdiction 25. In January/February 2004 Tai Fong issued summonses in all three Actions to stay TP Proceedings (then only comprising Indemnity Claim) pending determination of Arbitration. In March 2004 Tai Fong again issued summonses in PWK and Wolik Actions to set aside/strike out the third party notices and to dismiss TP Proceedings. The above summonses are collectively referred to as “ TP Stay Summonses ”. 26. In/about April 2004 Wing Hong sought to persuade Arbitrator that what later became Breach of Duty and Malicious Falsehood Claims (but which at that time were not yet pleaded or formulated in detail) were outside Arbitrator’s scope of jurisdiction conferred by Arbitration Clause. Mr Manzoni accepts that these claims are alternative routes to Tai Fong’s legal liability under Appendix N Claim. Wing Hong was concerned it might be debarred from recovery if TP Proceedings were stayed and Arbitrator dismissed Appendix N Claim but considered he had no jurisdiction to make an award under the alternative causes of action. Wing Hong claimed as follows : “…… To bring the malicious falsehood and illegal agency arguments within the scope of the arbitration would be contrary to the arbitration agreement, and would run the risk that any award in favour of Wing Hong would be unenforceable. To bring an argument in front of the Court that Tai Fong is in breach of the terms of the Sub Contract would also be contrary to the terms of the arbitration agreement. Thus, as a result of the arbitration agreement, it is necessary for Wing Hong to have split the forum for determination of these issues in this way.” 27. Tai Fong pointed out that at that stage Wing Hong’s alternative claims were hypothetical and in any event Wing Hong should not be allowed any double recovery. If Appendix N Claim were successful, Wing Hong would have been fully compensated for any loss/damages arising under Breach of Duty and/or Malicious Falsehood Claims. Tai Fong said one tribunal should determine all issues arising from the same factual matrix, the key one being whether Tai Fong had authority to enter into Supply Contracts with suppliers. Wing Hong by making Appendix N Claim has chosen Arbitration as the forum of adjudication. On the limited information then available in respect of Wing Hong’s alternative claims, Tai Fong suggested they could be determined by Arbitrator. 28. Wing Hong denied any risk of double recovery because the claims in different tribunals were in the alternative. It further denied any risk of inconsistency because “any award made prior to determination of the court proceedings would be conditional upon a finding that no entitlement arises for breach for fiduciary duty or malicious falsehoods” and “the findings in each forum will be interlinked, because the arbitrator’s findings will be dependent upon the court reaching the view that Wing Hong’s liability to the supplier (if there is one) was not created by a breach of fiduciary duty or malicious falsehood”. 29. In May 2004 Arbitrator ruled he had no jurisdiction to deal with Wing Hong’s alternative causes of action (“ Ruling ”). TP Stay Summonses became moot. In case any TP Stay Summonses have not been formally concluded yet, I ordered (without objection from Mr Smith SC or Mr Manzoni) that there be no order in respect such summonses. Since Ruling Wing Hong has amended WH TP Claim to plead Breach of Duty and Malicious Falsehood Claims. VII. Mandatory stay 30. Wing Hong does not apply for a mandatory stay of TP Proceedings/TP Counterclaim under Article 8 of UNCITRAL Model Law and the Arbitration Ordinance Cap.341 but relies on Order 18 rule 19 of the Rules of District Court and the inherent jurisdiction of the court for Strike Out/Stay Application. VIII. The law : equitable set-off (a) Legal and equitable set-off 31. Legal/independent set-off is a right to set off mutual debts which may arise from different transactions but which are liquidated and due. It is essentially an accounting process. This is contrasted with equitable or transactional set-off which is a substantive defence. Suffiad J in Alco International Limited v Akai Electronic Co Ltd [2000] 3 HKC 724 , 728 said as follows : “In so far as an equitable set-off is concerned, a statement of law can be found in the words of Simon Brown LJ in the case of Esso Petroleum Co. Ltd v Milton [1997] 1 WLR 938 , at 950, where he said : For equitable set-off to apply, it must therefore be established, first that the counterclaim is at least closely connected with the same transaction as that giving rise to the claim, and second that the relationship between the respective claims is such that it would be manifestly unjust to allow one to be enforced without regard to the other.” Mr Smith SC submits that the rationale for such defence is that a party should be entitled to bring all related disputes before the court and a wider examination of related facts will show that the claimant’s claim is wholly or partially extinguished. (b) Close and inseparable connection 32. Mr Manzoni submits that the set-off must have a close or intimate connection that “impugned the demand”. He refers to Wood, English and International Set-Off (1989) para.4.51 at pp.119-120 as follows : “ (a) Where the creditor has defaulted in the main obligation for which he is seeking payment, the debtor can set off his damages for the breach …... (b) Where the creditor has defaulted in some ancillary obligation under the transaction and claims the main payment under the contract, the law is more jealous to protect the creditor’s claim from erosion …… (c) Where the creditor’s primary claim is for some ancillary payment under the contract – not the fundamental payment – and the debtor’s cross-claim is for default by the creditor in some ancillary obligation, then transaction set-off is more readily allowed. Since the creditor’s claim is ancillary, his own claim is not subject to unpredictability or vexatious delay and the cash-flow principle is not infringed. (d) Where the debtor’s cross-claim is so uncertain that it would require extensive investigation to establish it, then transaction set-off may be refused because the creditor is unfairly delayed in receiving payment ……” 33. Mr Manzoni also refers to British Anzani (Felixstow) Limited v International Marine Management (UK) Ltd [1979] 2 All ER 1063 , 1068 where Forbes J said the set-off had to go to the very root of the plaintiff’s claim and must impeach the legal demand or be such that it was manifestly unjust to allow the claimant to recover without taking into account the cross-claim. Mr Manzoni argues that reciprocal claims arising out of the same transaction do not necessarily qualify for equitable set-off ( English and International Set-Off (supra) paras.4-2 and 41-51 – 4-54 at pp.4-5 and 119-120). 34. But Mr Manzoni also agrees with the principles in the case of Bim Kem i AB v Blackburn Chemicals Ltd [2001] 2 Lloyd’s Rep 93 cited by Mr Smith SC. There Potter LJ referred to The Nanfri [1978] 1 Lloyd’s Rep 132 and the British Anzani case, but preferred Lord Brandon’s test in Bank of Boston Connecticut v Europe Grain and Shipping Co Ltd [1989] 1 AC 1056 , 1103 of “a cross-claim flowing out of and inseparably connected with the dealings and transactions which also gave rise to the claim”, which plainly regarded the concept of impeachment of the title to the claimant’s demand unhelpful. He also referred to Dole Dried Fruit & Nut Co v Trus tin Kerwood [1990] 2 Lloyd’s Rep 309, 310 where the English Court of Appeal upheld Lord Brandon’s test and clarified that the test of impeachment of the plaintiff’s demand in The Nanfri ’s case was in fact “the same test in different language”. 35. After considering the earlier authorities, Potter LJ preferred Lord Brandon’s test unconstrained by the former concept (difficult to define and apply) of “impeachment of title”. The learned judge even said such former concept has since been replaced or at least redefined by Lord Brandon’s test because “on the one hand it emphasizes that the degree of closeness required is that of an “inseparable connection”, while on the other it makes clear that it is not necessary that the cross-claim should arise out of the same contract; all that is required is that it should flow from the dealings and transactions which gave rise to the subject of the claim” (p.100 of the judgment). (c) Manifest injustice 36. Potter LJ at p.102 said as follows : “…… Once Lord Brandon made clear in the Bank of Boston case that the question of closeness required inseparable connection with the dealings and transactions giving rise to a claim, without reference to the issue of “manifest injustice”, it is difficult to envisage in what circumstances, assuming his test to be satisfied, it would be other than just to allow an equitable set-off, save in certain category of case where the Court has traditionally taken a strict view of the right of the claimant to be paid the liquidated sum which he claims free of any set-off. Examples are to be found in claims for rent, freight, and sums due under bills of exchange. Nonetheless, as it seems to me, it is appropriate in every case to give separate consideration to the question of manifest injustice; cf. the approach of Lord Justice Simon Brown in Esso Petroleum v Milton at p.905D. …… the Judge below …… dealt first with the closeness of the connection and, having found it sufficient posed the further question whether, nonetheless, there were present factors or circumstances which militated against the justice or fairness of recognizing Blackburn’s right of set-off . He concluded there was none. He was right to do so, given that none of the additional matters advanced on Bim Kemi’s behalf …… went to the central issue of the nature and inter-relationship of the claim and cross-claim pleaded, as supplemented by the witness statements before the Court.” (my emphasis) 37. Mr Smith SC suggests that the italicised words above indicate it is up to the party disputing the right of set-off to establish manifest injustice that militates against recognising such right. Mr Manzoni says it is for Tai Fong to establish that pleading TP Set-Off Defence is not manifestly unjust in all the circumstances. (d) Analysisof the relevant test 38. I do not consider Lord Brandon’s test to be substantially different from the tests referred to in the British Anzani case or in the learned textbook referred to above. It is, as the court said in the Dole Dried Fruit & Nut Co case, the same test in different language. But if I were wrong, I prefer Lord Brandon’s test as adopted by Potter LJ in the Bim Kemi case. Our Court of Appeal in Townearn Industrial Ltd v Golden Globe Holdings Ltd [2003] 1 HKC 186 and The Incorporated Owners of King Yip Factory Building v Kwun Wah Flower and Plant Manufactory Limited CACV128/2003 (unreported, 13 th November 2003) endorsed the principles in the Bim Kemi case. Mayo VP in the Townearn Industrial Ltd case said at p.192 that “[it] is apparent …… that an overall view of the situation has to be considered and that no single factor is likely to be conclusive of the matter”. 39. Mr Manzoni refers to the British Anzani case where Forbes J at p.1076 said the relevant consideration was what would be regarded as fair or just. Mr Manzoni submits that since equitable set-off arises from the courts of equity, its whole development has been one on discretionary basis. Mr Smith SC on the other hand submits that the discretion is limited. It is useful to refer to Benford Ltd and anor v Lopecan SL [2004] 2 Lloyd’s Rep 618, 622 where Morrison J said : “…… I start with the textbook which has helpfully been provided to me, called “The Law of Set Off” by Rory Derham (3 rd ed.). At p. 83 of the book it is made plain by the learned author that, so far as the Courts are concerned, the approach in a set-off situation is not to ask the question, “Would it be just or fair to deprive the defendant of a potential set-off?” These are not questions which determine whether there is a transaction set-off situation or not. It was put much more elegantly by the late Mr. Justice Hobhouse, where he said, in the case of Leon Corporation v. Atlantic Lines & Navigation Co. Inc. (The Loan), [1985] 2 Lloyd’s Rep. 470 at p.474 : Equitable principles derive from a sense of what justice and fairness demand. This does not mean that equitable set-off has been reduced to an exercise of discretion. Since the merging of equity and law equitable set-off gives rise to a legal defence. This defence does not vary according to the length of the Lord Chancellor’s or arbitrator’s foot. The defence has to be granted or refused by an application of legal principle.” In the end, Mr Manzoni accepts that the discretion is not unfettered and the court has to ask the twin questions of whether there is close inseparable commercial connection between the claim and cross-claim and whether there is manifest injustice. 40. Coming to the issue of manifest injustice, Potter LJ in the Bim Kemi case said it was difficult to envisage, once the close connection requirement is satisfied, in what circumstances manifest injustice will be established apart from the traditional categories of cases. Although it is a question that requires separate consideration in each case, I find it awkward and onerous if the burden is on the party relying on the set-off to establish a double negative, namely, that the set-off defence is not manifestly unjust. In my view, the burden of showing manifest injustice falls on Wing Hong. This is illustrated by the various factors raised by Bim Kemi (the party disputing the set-off) in its attempt to establish manifest injustice in the Bim Kemi case. Nevertheless, the discussion below shows that irrespective of where the burden lies, manifest injustice has not been established in respect of TF Set-Off Defence. IX. The law : equitable set-off and arbitration 41. Mr Smith SC submits that it is well settled that notwithstanding that a claim may be covered by an arbitration agreement, it may be pleaded in the context of an equitable set-off defence and the court will determine the merits of such claim. He refers to the rationale explained by Hoffman LJ in Acetra Refining and Marketing Inc v Exmar NV [1994] 1 WLR 1634 , 1650 as follows : “In the case of transactional set-off, the authorities are in favour of allowing the set-off to be pleaded, notwithstanding its submission to arbitration …… …… [in a case of equitable set-off, the] defendant is pleading a confession and avoidance to the plaintiff’s claim. He is saying that, although the facts alleged by the plaintiff entitle him to judgment for the amount claimed, a wider examination of related facts would show that the claim is wholly or partly extinguished. It would be quite unreasonable for a plaintiff who has chosen to sue in one forum to rely upon an arbitration …… clause to confine the court to the facts which he chooses to prove and prevent it from examining related facts as well.” 42. These principles have been affirmed by the English Court of Appeal in the Bim Kem i case, where the judge below held that Blackburn was entitled to plead by way of equitable set-off a claim arising from breaches of an agreement which contained an arbitration clause. Potter LJ at p.96 of the judgment cited with approval the views of Hoffman LJ in the Acetra case and dismissed the plaintiff’s appeal. X. The law : power to restrain arbitration proceedings 43. Mr Smith SC submits that unless the court makes an order granting a stay in favour of arbitration, a party cannot be deprived of his right to have recourse to the courts. Where the court refuses a stay, it is seised of and will be the sole tribunal for determining the dispute. Otherwise there will be a wholly undesirable race to judgment between the court and a private tribunal on the same issues. 44. Mr Manzoni’s written submissions suggest there is no precedent authority for the situation where a court has effectively granted a stay and referred a matter to arbitration it will subsequently restrain the parties from pursuing the arbitration it itself has ordered. However, Mr Manzoni clarifies in his oral submissions that the court has jurisdiction to restrain court and/or arbitration proceedings, but the discretion has to be exercised along the principles set out in University of Reading v Miller (1994) 75 BLR 99. 45. The Miller case adopts the principles for the exercise of such power as set out in The “Oranie” and The “Tunisie” [1966] 1 Lloyd’s rep 477, 487, namely (a) the stay must not cause injustice to the claimant in the arbitration and (b) the applicant for a stay must satisfy the court that the continuance of the arbitration will be oppressive or vexatious to him or an abuse of process of the court : in short, that it will be unjust. 46. Judge Lloyd QC at p.111 of the Miller case said it is clear that unless and until the court intervenes there may be concurrent proceedings arising out of the same contracts by way of court action and arbitration. However, the court has power to restrain the continuance of an arbitration whose issues are being litigated before the court, but that power will only be exercised sparingly along the aforesaid principles. He cited Doleman and Sons v Ossett Corporation [1912] 3 KB 257 , 296 where Fletcher Moulton LJ said : “…… If the Court has refused to stay an action, or if the defendant has abstained from asking it to do so, the Court has seisin of the dispute, and it is by its decision, and by its decision alone, that the rights of the parties are settled. It follows, therefore, that in the latter case the private tribunal, if it has ever come into existence, is functus officio, unless the parties agree de novo that the dispute shall be tried by arbitration. There cannot be two tribunals each with the jurisdiction to insist on deciding the rights of the parties and to compel them to accept its decision …… In each case where the Court has decided that it will retain in its own hands the decision of the case, there would thus be a race between it and a private tribunal which should be first to give a decision in the matter …… This would be ousting the jurisdiction of the Court in a most ignominous way.” 47. Judge Lloyd QC at p.110 went on to refer to Lloyd v Wright [1983] 1 QB 1065 , 1075 as follows : “In Lloyd v Wright [1983] 1QB 1065 Eveleigh LJ said of the opening of this passage (at page 1073D-E) that Farwell LJ had made it “clear that the existence of arbitration proceedings will have no effect upon the court’s power to decide the question which the plaintiff asks it to decide, unless it entertains an application under section 4 of the Act”. Dunn LJ in the same case said of the same passage (at page 1075G-H) that “the court has ample powers to restrain further proceedings in the arbitration by an injunction, or to refuse a stay of the action if the appropriate applications are made to it. In those circumstances, there can be no question of a race between the arbitration and the court proceedings. The court retains control throughout, if asked to do so .” [Emphasis supplied] I also emphasise the following extracts from the judgment of Farwell LJ: “The King’s Courts do not compete with arbitrators, or permit their own proceedings to be interfered with in any way by them … It appears to me to be impossible to allow more than one proceeding to continue without landing the Court in inextricable difficulties.”” 48. In Hong Kong, Hunter J in John Lok & Partners Ltd v Wharf Properties Ltd [1984] HKC 96 also held that the court has power to control the arbitrator and has jurisdiction to restrain an arbitrator from deciding issues which are being litigated before the court, citing inter alia the Doleman and Lloyd cases. XI. Summary ofTai Fong’s contentions 49. Mr Smith SC submits that since Wing Hong brought WH TP Claim to the courts (with no mandatory stay of TP Proceedings/TP Counterclaim) but has not advanced any or any convincing free-standing basis for Strike Out/Stay Application, Tai Fong cannot be deprived of its right to litigate TP Counterclaim properly brought before the courts and Strike Out/Stay Application must necessarily fail. He cited Farwell LJ at p.273 of the Doleman case that “[the] plaintiffs cannot be deprived of their right to have recourse to the Court when the agreement is a mere agreement to refer, unless the Court makes an order to that effect under s. 4 of the Arbitration Act”. 50. Even if it becomes necessary to consider Strike Out/Stay Application, according to the Acetra line of cases, Tai Fong is entitled to plead matters which operate as proper defences to WH TP Claim notwithstanding they may fall within the scope of Arbitration Clause. Such matters include either or both TF Pure Defence (not dependent on TF Set-Off Defence) and/or TF Set-Off Defence (on the basis that it is an equitable set-off defence). Strike Out/Stay Application should therefore be dismissed. 51. Irrespective of whether TF Set-Off Defence is an equitable set-off defence or not (but more so if it is), Arbitration should be restrained under the Miller principles because of the similarity of the underlying factual matrix for both Arbitration and TP Proceedings and the undesirability of having two parallel proceedings going on at the same time, particularly with regard to Wing Hong’s serious allegations of fraud/ malice/dishonesty under Malicious Falsehood Claim (“ Fraud Concern ”). It is inappropriate for Arbitrator to determine such serious allegations. Since the courts are seized of the matter, Arbitration will ordinarily be restrained from proceeding. 52. If it is necessary to consider TF Set-Off Defence, it is an equitable set-off defence since the dealings and transactions that underlie WH TP Claim and TP Counterclaim are inseparably connected and there is no manifest injustice in allowing Tai Fong to raise such set-off defence. XII. Summary of Wing Hong’s contentions 53. Mr Manzoni submits that since TP Counterclaim is part and parcel of Arbitration and the court has by Consent Order stayed HC Action in favour of Arbitration, it is an abuse of process and unjust in all the circumstances for Tai Fong to litigate and bring TP Counterclaim back to the courts in a full circle. In fact it is Tai Fong’s Alleged Discrepant Treatment that forced Wing Hong to bring WH TP Claim to the courts. In such circumstances, even assuming it is arguable that TF Set-Off Defence is an equitable set-off defence (“ Assumption ”), ie without any need to decide whether TF Set-Off Defence is an equitable set-off defence or to consider the Acetra line of cases, TP Proceedings should be stayed or TP Counterclaim should be struck out/stayed. If it becomes necessary to consider TF Set-Off Defence, Mr Manzoni says it does not amount to an equitable set-off defence and it is manifestly unjust to allow Tai Fong to raise such defence. There is therefore insufficient basis under the Miller principles for restraining Arbitration from proceeding. 54. Wing Hong’s primary position is to stay the whole TP Proceedings (which should sufficiently address Fraud Concern) and as an alternative to stay TP Counterclaim. Mr Manzoni does not press too strongly on striking out TP Counterclaim but submits it is nevertheless liable to be struck out or stayed on the same grounds. 55. If TP Proceedings are to be stayed, in the event that Arbitration result is adverse to Wing Hong, then depending on Arbitrator’s findings Wing Hong may revive TP Proceedings in the future. If only TP Counterclaim is to be struck out/stayed, there can be parallel court and arbitration proceedings as they deal with unrelated issues albeit arising from the same factual matrix with probable overlap of witnesses. Mr Manzoni accepts that the Acetra principles allow Tai Fong to rely on all proper defences it wishes to raise (eg TF Pure Defence) against WH TP Claim notwithstanding that they are part and parcel of Arbitration, but TF Set-Off Defence not amounting to an equitable set-off is not a proper defence within the Acetra principles. XIII. The court’s approach 56. Both Mr Smith SC and Mr Manzoni appear to suggest that an overview without full analysis of whether TF Set-Off Defence amounts to an equitable set-off defence will lead me to a conclusion in their respective favour. On one hand, Mr Smith SC says that barring any compelling reason the court will not stay any action before it and Tai Fong is free to plead/litigate TP Counterclaim and TF Set-Off Defence. On the other hand, Mr Manzoni says litigating TP Counterclaim and TF Set-Off Defence in the historical context of HC Action, TP Proceedings and Arbitration amounts to an abuse of process. These arguments (as well as the application of the Acetra and Miller principles) necessitate a consideration of the relevant circumstances. Since Mr Manzoni suggests I should first proceed to consider Strike Out/Stay Application (and conversely Restrain Application) on the basis of Assumption, I will do so and then go on to consider whether TF Set-Off Defence amounts to an equitable set-off defence. XIV. The analysis (a) Channel Tunnel case 57. Mr Manzoni refers to Channel Tunnel Group Ltd & anor v Balfour Beatty Construction Ltd [1993] AC 334 where the defendants threatened to suspend work over contractual disputes and the plaintiff issued a writ seeking to restrain them from doing so. The court under its inherent jurisdiction stayed the action which was brought in breach of the agreed method of resolving disputes by arbitration. Lord Mustill said at p.353 as follows : “My Lords, I also have no doubt that this power should be exercised here. …… The parties here were large commercial enterprises, negotiating at arms length in the light of a long experience of construction contracts, of the types of disputes which typically arise under them, and of the various means which can be adopted to resolve such disputes. It is plain that clause 67 was carefully drafted, and equally plain that all concerned must have recognised the potential weaknesses of the two-stage procedure and concluded that despite them there was a balance of practical advantage over the alternative of proceedings before the national courts of England and France. Having made this choice I believe that it is in accordance, not only with the presumption exemplified in the English cases cited above that those who make agreements for the resolution of disputes must show good reasons for departing from them, but also with the interests of the orderly regulation of international commerce, that having promised to take their complaints to the experts and if necessary to the arbitrators, that is where the appellants should go. The fact that the appellants now find their chosen method too slow to suit their purpose, is to my way of thinking quite beside the point.” 58. Mr Smith SC acknowledges that the Channel Tunnel case gives the court a fairly large discretion on case management. He agrees that if all things were equal with an agreement to arbitrate and the arbitration already underway, it is usual to expect the arbitration proceedings to continue. The questions here are whether all things are equal and whether Wing Hong has sufficiently made out a case of abuse of process to strike out/stay TP Proceedings or TP Counterclaim. (b) Arbitration Clause and Consent Order 59. The parties agreed to Arbitration Clause. Pursuant to Consent Order, HC Action was stayed in favour of arbitration. Mr Manzoni submits Consent Order amounts to a secondary agreement to arbitrate and the parties should not be allowed to resile from the agreed mode of dispute resolution. Mr Smith SC says that by withdrawing HC Action Tai Fong is not prevented from bringing a similar claim to court if it so wishes and the referral to arbitration in Consent Order is merely coterminous with Arbitration Clause without adding further benefit. I agree with Mr Smith SC but find it unnecessary to go further than to consider the persuasiveness of Consent Order in light of the circumstances under which it was made and which led Tai Fong to plead TP Counterclaim and TF Set-Off Defence. 60. Mr Manzoni suggests that since the court in HC Action has expressly exercised its discretion in favour of arbitration, it is not open to Tai Fong to plead TP Counterclaim which raises the same issues as in HC Action (albeit not pleaded in detail) and which mirrors TF Arb Claim in Arbitration commenced shortly after Consent Order was granted. He argues that the whole crux of the dispute between the parties is an exercise in settling final accounts between them (based on the value of work done by Tai Fong) consequent on termination of Sub-contract, which is better left to determination by Arbitrator. Mr Manzoni submits that although Consent Order does not debar me from exercising my discretion in respect Strike Out/Stay and Restrain Applications, it is highly persuasive in suggesting that Tai Fong should not be allowed to adopt a contrary stance now. Mr Manzoni draws assistance from the headnote in the Lloyd case (supra at p.1066) as follows : “…… there was no principle that required arbitration proceedings to terminate if a party to the arbitration evoked the assistance of the court; that, unless the party consented not to continue with his action or the court ordered a stay of the proceedings, the court would grant its assistance and, if necessary retain control of the matter but the arbitration proceedings could continue concurrently.” 61. In my view, Wing Hong’s arguments gloss over the reality of situation. It is Wing Hong and not Tai Fong that initiated the fresh court proceedings by TP Proceedings/WH TP Claim. Tai Fong only pleaded TP Counterclaim and TP Set-Off Defence in defence thereto. On Assumption that TF Set-Off Defence arguably amounts to an equitable set-off (and hence a properly pleaded) defence to WH TP Claim, Tai Fong is entitled under the Acetra principles (which Mr Manzoni does not dispute) to plead all the defences it can properly raise notwithstanding Arbitration Clause and its submission to Arbitration. Further, as seen below, I find TF Set-Off Defence is actually an equitable set-off defence. 62. Consent Order was made even before Actions were commenced, let alone Wing Hong’s pleading of Breach of Duty and Malicious Falsehood Claims or Tai Fong’s pleading of TP Counterclaim in defence thereto. Mr Manzoni is therefore constrained in his oral submissions to agree that Consent Order was granted in quite different circumstances. Further, the circumstances that led to the pleading of TP Counterclaim are different from those in the Channel Tunnel case where the applicant for stay of proceedings was not the party who brought the claim to the court. Further, the application in that case was considered immediately upon issuance of the writ. Mr Smith SC submits (and I agree) the effect of the Channel Tunnel case is neutral here. (c) TF Stay Summonses 63. Had Wing Hong not brought WH TP Claim to the courts by way of TP Proceedings, there is nothing to suggest that Tai Fong intends to migrate TF Arb Claim back to the courts. Indeed, even before Wing Hong pleaded Breach of Duty and Malicious Falsehood Claims in TP Proceedings, Tai Fong issued (a) TF Arb Claim to resolve disputes between the parties by Arbitration and (b) TF Stay Summonses to strike out/stay Wing Hong’s TP Proceedings (which only comprised Indemnity Claim at that time). Rather it is Wing Hong who insisted on litigating TP Proceedings in the courts by putting before Arbitrator broad outlines of Breach of Duty and Malicious Falsehood Claims without formal amendment of pleadings or full formulation of the allegations of fraud/malice/dishonesty under Malicious Falsehood Claim and by pre-empting TF Stay Summonses as a result of Ruling sought from Arbitrator. It is only when Breach of Duty and Malicious Falsehood Claims found their way to the courts that Tai Fong pleaded TP Counterclaim in defence. When TF Stay Summonses are placed in their proper context, I do not read Tai Fong’s present stance as a deliberate departure from any earlier undertaking by conduct or otherwise that Arbitration should be the forum of adjudication. (d) Alleged Discrepant Treatment and full circle argument 64. But Mr Manzoni submits the above view is incorrect because it is Tai Fong who forced Wing Hong to commence TP Proceedings/WH TP Claim. He says Appendix N Claim in Arbitration is essentially a claim by Wing Hong for back or contra charges and is part of the final accounts exercise between the parties. By reason of (a) the scope of Arbitration Clause which precludes resolution of Breach of Duty and Malicious Falsehood Claims by Arbitration and (b) Tai Fong’s denial/non-admission in Arbitration that Wing Hong is entitled to back or contra charge Tai Fong for the amounts claimed by suppliers of materials/services, Wing Hong was forced to issue TP Proceedings against Tai Fong and plead additional routes of recovery (ie Breach of Duty and Malicious Falsehood Claims) in TP Proceedings which overlap with the relief sought under Appendix N Claim. Wing Hong is concerned that even if it agrees to confer ad hoc jurisdiction on Arbitrator, the limited scope of Arbitration Clause may render any eventual award unsafe. Mr Manzoni suggests that Tai Fong has deliberately engineered the present situation by unclear pleading, namely, Alleged Discrepant Treatment. Had Tai Fong adopted Back Charge Admission in Arbitration, Arbitrator can resolve all questions without any need for TP Proceedings. Mr Manzoni submits that if Tai Fong is willing to plead Back Charge Admission for Appendix N Claim in Arbitration, then subject to the question of costs Wing Hong is prepared to withdraw the whole TP Proceedings. 65. In a nutshell, Wing Hong is saying that Tai Fong has by its own conduct brought WH TP Claim upon itself. It is therefore not open for Tai Fong to bring the matter a full circle from the Court of First Instance (HC Action) to Arbitration to the District Court (TP Counterclaim) and then potentially back to the Court of First Instance (Transfer Application). It is also not open for Tai Fong to deny Appendix N Claim, force Wing Hong to cover itself by litigating Breach of Duty and Malicious Falsehood Claims in this court and then seek to migrate the entire Arbitration back into the courts by pleading Back Charge Admission and TF Set-Off Defence. 66. The crux of Wing Hong’s argument is that it was forced to split the causes of action between Arbitration (Appendix N Claim) and the courts (Breach of Duty and Malicious Falsehood Claims) because of inter alia Alleged Discrepant Treatment. However, I agree with Mr Smith SC that in relation to the sums paid or payable by Wing Hong under Supply Contracts entered into by Tai Fong with suppliers, Appendix N Claim does not plead such sums as back or contra charges for the final accounts exercise between the parties. In my view, a fair reading of Paras.79-81 Assertions that comprise Appendix N Claim shows their essential averments to be inter alia that (a) Tai Fong has no authority to enter into Supply Contracts in Wing Hong’s name or on its behalf or to make representations that Wing Hong will pay for materials/supplies under such contracts and (b) Tai Fong in breach of Sub-contract has wrongfully entered into Supply Contracts on 33 occasions. Wing Hong therefore seeks damages for such breach of Sub-contract and for accountability under common law set out and quantified in Appendices N and O to the Re-re-amended Defence and Counterclaim in Arbitration. Appendix N Claim is therefore at best a cross-claim or defence of set-off against TF Arb Claim and Tai Fong’s denial (whether specific or general) and non-admission of Paras.79-81 Assertions amount to denial/non-admission of the above essential averments or of Wing Hong’s cross-claim or set-off defence. I am unable to read into such denial/non-admission a denial of back or contra charges. 67. As Mr Smith SC submits, the nature of Appendix N Claim can be more easily understood by comparing it with Wing Hong’s treatment of Appendix L Claim (ie Wing Hong’s claim for payments it made to Tai Fong’s suppliers of materials/services after 5 th May 2002 under contracts made with Tai Fong (not Wing Hong)). Wing Hong claims that voluntary payments have been made to such suppliers for discharging construction work, to ensure they provide the required certifications and/or warranties and to mitigate loss. Appendix L Claim is described as “Materials/Specialist sub-contractor back charges for Tai Fong’s work paid by Wing Hong after 5 May 2002 ($1,768,623.08)” (my emphasis) in paragraph 94 of Wing Hong’s Re-re-amended Defence and Counterclaim in Arbitration. 68. But Wing Hong gives Appendix N Claim (ie claim in respect of Supply Contracts Tai Fong entered into without authority in Wing Hong’s name or on its behalf) a different treatment. Indeed, Wing Hong has (until its very recent settlement with PWK) resisted claims by (and payment to) Décor, PWK and Wolik. Appendix N Claim is described in paragraph 94 of Wing Hong’s Re-re-amended Defence and Counterclaim in Arbitration as “Wing Hong’s claim for payments to Tai Fong’s suppliers of materials who have contracts in the name of Wing Hong entered by Tai Fong without authority from Wing Hong ($3,076,042.37)” with no mention of back or contra charges. It is plain Wing Hong treated Appendix N Claim as a cross-claim for breach of Sub-contract and a set-off defence. 69. Even if I were wrong and Tai Fong’s denial/non-admission of Paras.79-81 Assertions amount to denial of back or contra charges in respect of Appendix N Claim, it does nothing more than put Wing Hong to strict proof of Appendix N Claim (subject to Tai Fong’s positive averments in relation to its authority to enter into Supply Contracts in Wing Hong’s name or on its behalf). Whilst Mr Smith SC fairly accepts that further development of the pleadings may bring greater clarity to the contested issues, I am unable to read into Tai Fong’s denial/non-admission of Paras.79-81 Assertions any prompting or, worse still, any directive requiring Wing Hong to proceed to the judicial forum to pursue additional causes of action covering the same subject matter of claim or to seek the relief Wing Hong wants. It is Wing Hong’s right and choice (subject to the court’s jurisdiction over matters with which it is seised) to proceed with different causes of action in a different forum and it is not correct to say Tai Fong has forced such decision on Wing Hong. 70. In the circumstances, I do not agree with Wing Hong’s full circle argument. I further do not find any abusive disregard of Arbitration Clause and Arbitration or “jurisdiction shopping” by Tai Fong. Wing Hong has decided to pursue Breach of Duty and Malicious Falsehood Claims and Tai Fong therefore defends such claim by inter alia TP Counterclaim. It is not for me to say whether Wing Hong’s decision is appropriate, but I have to consider the consequences of such decision. (e) Fraud Concern 71. Wing Hong by Malicious Falsehood Claim asserts that Tai Fong has published various representations “ knowing they were false or made recklessly, not caring whether they were true or false, in order to induce [Décor, PWK or Wolik] into entering into a contractual relationship with [Tai Fong] in [Wing Hong’s] name” (my emphasis). Mr Smith SC suggests this is a clear allegation of fraud, malice or dishonesty and the court should give particular regard to such serious allegations. Since, as Mr Manzoni accepts, the reliefs sought by Wing Hong in WH TP Claim and Appendix N Claim overlap insofar as they relate to Décor, PWK and Wolik although the causes of action are different and since these claims share a common factual matrix (the key element being whether Tai Fong has been authorised to enter into Supply Contracts in Wing Hong’s name or on its behalf) with probable overlap of witnesses, Mr Smith SC submits it is inappropriate for Arbitrator to adjudicate on such related claims/counterclaims by reason of Fraud Concern and the court should by reason of the duplication of the factual issues restrain Arbitration under the Miller principles. Mr Smith SC relies on such argument irrespective of whether TF Set-Off Defence amounts to an equitable set-off defence. 72. Mr Smith SC submits that it is well recognised that fraud issues should be dealt with by the courts and not by arbitration. Section 26 (2) of Arbitration Ordinance Cap.341 (“ Section ”) provides as follows : “Where an agreement between any parties provides that disputes which may arise in the future between them shall be referred to arbitration, and a dispute which so arises involves the question whether any such party has been guilty of fraud, the Court shall, so far as may be necessary to enable the question to be determined by the Court, have power to order that the agreement shall cease to have effect and power to give leave to revoke the authority of any arbitrator or umpire appointed by or by virtue of the agreement.” 73. In Binnie and Partners International v Swire Chemsyn Limited HCA1600/1981, Jackson-Lipkin J (unreported, 17 th June 1982), which deals with the court’s power to restrain dispute from proceeding to arbitration despite an arbitration clause, the learned judge held he had no jurisdiction to do so. I need not be concerned with this aspect of the judgment since both counsel accept there is jurisdiction under the Miller principles. The learned judge in the Binnie case went on to discuss the exercise of his discretion if he had jurisdiction. He referred to Section and the headnote in Turner v Fenton & ors which stated that where allegations of incompetence, negligence and impropriety were made so that a man’s professional reputation was at stake, he ought to have the benefit of a trial in the High Court, even though no allegations of actual fraud or dishonesty were involved. 74. Mr Smith SC submits that if I am to stay TP Proceedings in favour of Arbitration only to have such proceedings possibly revived after a decision by Arbitrator adverse to Wing Hong or if I am to strike out/stay TP Counterclaim leaving Wing Hong to proceed with Breach of Duty and Malicious Falsehood Claims in parallel with Arbitration, Tai Fong will be put in an invidious position of having to resist a fraud allegation with a real risk of having its defence constrained by issue estoppel or res judicata arising from Arbitrator’s findings or there will be an ignominious race to judgment to forestall such risk. 75. Mr Smith SC says the undesirability of the resulting unfairness to Tai Fong by hiving off an important issue (ie fraud issue) from Arbitration to the courts is well recognised by the Miller principles. He says it is far more desirable for TP Proceedings dealing with the fraud allegation to go ahead in light of Section and the Binnie case and Wing Hong cannot complain if it chooses to plead such allegation. 76. Mr Manzoni does not dispute Section and the principles drawn from the Binnie case. It appears he accepts that Fraud Concern should be addressed as seen from his application to amend the summonses for Strike Out/Stay Application for such purpose to include the option of staying the whole TP Proceedings and from his open indication that this is Wing Hong’s primary stance. Mr Manzoni submits this approach is sufficient to meet Fraud Concern. Even Wing Hong’s alternative stance of staying TP Counterclaim and proceeding with WH TP Claim (ie allowing Tai Fong to raise TF Pure Defence but not TF Set-Off Defence) and Arbitration in parallel is sufficient to resolve all issues. Mr Manzoni argues it is inappropriate for this court to bow to the sole countervailing injustice of Fraud Concern by effectively ordering a stay of the whole Arbitration and restarting TP Proceedings again by migrating Arbitration claims/counterclaims into such proceedings when Fraud Concern can be addressed. 77. Mr Smith SC fairly points out that Tai Fong in TP Counterclaim pleads that (a) various representations made to Tai Fong by Wing Hong’s representative Mr Yiu that Wing Hong would use its best endeavours to fully support Tai Fong to carry out new works orders to be issued by ASD are false and untrue and (b) Wing Hong made the same recklessly not caring whether the same are true or not, or negligently. Such plea contains an allegation of recklessness but there is no charge of actual knowledge of falsity or malice. Tai Fong has made a similar assertion in TF Arb Claim. However, neither Mr Manzoni nor Wing Hong complains about the inclusion of such assertion by Tai Fong in Arbitration. As explained above, their approach is that Fraud Concern over Malicious Falsehood Claim can be sufficiently addressed in the manner suggested. 78. In my view, Fraud Concern is a relevant consideration and a justifiable concern in deciding whether to restrain Arbitration. Although both counsel accept that (a) the underlying factual matrix of Appendix N and Malicious Falsehood Claims overlaps, (b) the witnesses for both claims may also overlap and (c) similar factual issues are at large for both Arbitration and TP Proceedings, the fraud allegation under Malicious Falsehood Claim is not to be canvassed by Arbitrator. Fraud Concern is also unaffected by Wing Hong stripping down the scope WH TP Claim to be coextensive with Main Actions Claim. 79. There is no doubt that Section and the Binnie case lean against dealing with fraud issues in Arbitration. But will staying TP Proceedings or TP Counterclaim be adequate in addressing Fraud Concern? The implications of such stay will be considered in more detail under section (f) below. Suffice to say here that I am not satisfied the alternative approaches suggested by Mr Manzoni are sufficient. Even with a stay of TP Proceedings, it is possible that Wing Hong may revive and pursue Malicious Falsehood Claim after the conclusion of Arbitration. In such eventuality Tai Fong will be placed in the unenviable position of having to face a serious allegation with possible adverse findings by Arbitrator on the factual background common to Appendix N and Malicious Falsehood Claims and on the credibility of probably common witnesses. I cannot see how such “interim” stay pending possible revival of TP Proceedings can adequately address Fraud Concern. 80. It will be even worse if only TP Counterclaim is stayed with parallel on-going proceedings by way of TP Proceedings (less TP Counterclaim and TF Set-Off Defence) and Arbitration on common factual matrix and probably common witnesses even though the causes of action are different. This falls squarely within the undesirable situation envisaged in the Doleman and Miller cases of having the court and the private tribunal racing for judgment. But more of this below. 81. I find Fraud Concern lends much weight to the view that Arbitration should be restrained and TP Proceedings should continue. To accede to Strike Out/Stay Application is to allow Wing Hong to circumvent Section and Fraud Concern. (f) Wing Hong’s alternatives and parallel proceedings 82. Given the current state of TP Proceedings and Arbitration, is it appropriate (as Wing Hong contends) to stay TP Proceedings or strike out/stay TP Counterclaim or (as Tai Fong contends) to restrain Arbitration? 83. If TP Proceedings are to be wholly stayed, Arbitration will presumably progress to an eventual award by Arbitrator. Mr Manzoni has warned that depending on Arbitrator’s award/findings it is possible Wing Hong may need to revive TP Proceedings to pursue Breach of Duty and Malicious Falsehood Claims. Wing Hong is concerned to ensure by one way or another the sums being the subject matter of Breach of Duty and Malicious Falsehood Claims are brought into account when the final accounts between the parties are drawn, so the possibility of revival of TP Proceedings cannot be ignored. Wing Hong also accepts in its submissions to Arbitrator for Ruling the close interrelationship between the eventual findings in each forum, going so far to say that the findings in one tribunal are conditional or dependent upon the conclusions in the other tribunal. Mr Smith SC argues that, irrespective of Fraud Concern (but more so because of Fraud Concern) and TP Set-Off Defence, it is unreasonable to tie Tai Fong’s hands in its defence of Breach of Duty and Malicious Falsehood Claims (if revived) by potential issue estoppel and/or res judicata arising from Arbitrator’s findings. 84. In my view, if Arbitrator decides Tai Fong has authority to enter into Supply Contracts with suppliers in Wing Hong’s name or as Wing Hong’s agent, revival of TP Proceedings will be unnecessary since such finding also disposes of Breach of Duty and Malicious Falsehood Claims. But if Arbitrator decides that Tai Fong does not have the requisite authority but somehow declines to find in favour of Wing Hong in respect of Appendix N Claim so that pursuit of Breach of Duty and Malicious Falsehood Claims becomes necessary, Arbitrator will have decided against Tai Fong on a key factual matter which Wing Hong needs to establish in order to succeed in such claims. Tai Fong is then left to contest the remaining elements of Breach of Duty and Malicious Falsehood Claims on reduced arguments. This clearly poses a disadvantage for Tai Fong and goes against the philosophy of Section and the Binnie case. 85. There is also no compelling reason why determination on a common factual matrix with some common factual issues and probably common witnesses should potentially be split between two tribunals when one tribunal (ie the court) is capable of dealing with all issues and the other tribunal (ie Arbitrator) is handicapped in that it can only deal with some issues. The Doleman and Lloyd cases are clear that there should not be competition between the courts and arbitrators. To allow Arbitration to proceed with the spectre of future revival of TP Proceedings in the wings is to put the parties and the court into inextricable difficulties. I find such circumstances to be oppressive against Tai Fong. But, as discussed below, a stay of Arbitration will not cause overriding injustice. 86. If alternatively TP Counterclaim is to be struck out or stayed, Tai Fong will be unable to put forward TF Set-Off Defence, which will be unreasonable either on Assumption or on the basis, as I find below, that it is actually an equitable set-off defence. Under the Acetra principles, Tai Fong should be entitled to put forth all the defences it can properly raise against WH TP Claim notwithstanding it is part and parcel of Arbitration and Wing Hong should not be able to obtain judgment without litigating all proper defences, including a set-off defence that may potentially extinguish the claim. 87. Further, irrespective of whether TF Set-Off Defence is or is not an equitable set-off defence, if TP Counterclaim is to be struck out or stayed, Wing Hong envisaged parallel proceedings by way of TP Proceedings (less TF Set-Off Defence) and Arbitration with overlapping factual matrix. TF Pure Defence also touches on alleged collateral agreements between the parties on financial arrangements which are also subject of Arbitration. There will be duplication of issues and costs as well as a race to judgment on concurrent subject matter with a risk that Arbitrator may make findings that bind the parties in TP Proceedings or vice versa . Since the fraud issue is to be canvassed in TP Proceedings, the disadvantages will be more acute if Arbitrator makes an award before the conclusion of TP Proceedings. I agree with Mr Smith SC that all issues should be decided in one forum and it is wrong in principle to have a race to judgment. 88. Mr Smith SC says the problem will become more aggravated if TF Set-Off Defence amounts to an equitable set-off defence. He submits (and I agree) that in such circumstances it is wrong to hive off TP Counterclaim and TF Set-Off Defence to be determined by Arbitration in parallel with on-going TP Proceedings on Breach of Duty and Malicious Falsehood Claims that leaves Tai Fong to resist such claims on TF Pure Defence. It will be unfair if Tai Fong has to suffer judgment entered against it in TP Proceedings (because it is unable to pursue TP Set-Off Defence) but eventually succeeds in TF Arb Claim. Mr Manzoni’s answer to such ill is that Tai Fong can apply for stay of execution. In my view, if TF Set-Off Defence amounts to an equitable set-off defence, it is not good enough to stay execution of judgment against Tai Fong (which at best is a discretionary relief requiring consideration of the principle that a successful party should not be denied the fruits of a judgment in his favour) if a proper defence will afford Tai Fong the opportunity to extinguish the claim and prevent judgment from being entered in the first place. There is no convincing or compelling reason why Wing Hong should be allowed to gain a tactical advantage by bringing alternative causes of action into different tribunals and improving its claim in court proceedings by hiving off a proper defence by Tai Fong to a private tribunal. 89. I disagree with Mr Manzoni’s suggestion (para.37 of his written submissions) that if TP Proceedings or TP Counterclaim is to be stayed but Arbitration does not fully determine all disputes between the parties, they will be “free to come back to court to argue the whole claim again, including the right of set-off”. In my view, litigating issues twice over is certainly not the most efficient, effective and fair way of disposing the contested issues. 90. On the above analysis and the current status of the court and arbitration proceedings, I do not consider it abusive of the court’s process to continue with TP Proceedings/TP Counterclaim. Rather I consider it unjust not to restrain Arbitration. (g) Amendment of WH TP Claim 91. Mr Manzoni submits that if Arbitration is to be restrained, Wing Hong will have to bring WH Arb Counterclaim back into TP Proceedings by amendment of its Amended Third Party Notice or Third Party Statement of Claim but there is no certainty that the court will grant leave to do so. He submits it is unfair to place Wing Hong at the mercy of the courts. 92. Mr Smith SC says Tai Fong does not seek any tactical advantage in one forum or another. Indeed, Mr Manzoni’s concern is merely that the necessary amendments will be at the mercy of the courts. Mr Smith SC says that if Arbitration is to be restrained and Tai Fong is entitled to pursue TP Counterclaim and TF Set-Off Defence, it is Tai Fong’s stance that Wing Hong should be entitled to plead by new pleadings or amendments WH Arb Counterclaim in TP Proceedings. I am persuaded that Mr Manzoni’s concern is more apparent than real. Further, if there is any difficulty with the necessary amendments (which I consider remote), I can envisage no better case for Wing Hong to apply to expunge any order to restrain Arbitration on such changed circumstances. (h) Progress made in Arbitration 93. Mr Manzoni says there has been substantial progress with Arbitration (see Chronology and 7 Orders for Directions) which will be nearing resolution within a few months. He submits that Arbitrator has by Order for Directions No.7 dated 7 th January 2005 given directions for the further conduct of the main part of Arbitration that will result in a speedy resolution. This is to be contrasted with the position of TP Proceedings where pleadings are not even closed. On the other hand, Mr Smith SC submits that although Arbitration commenced in late 2002, it has only made limited progress and the parties have only recently completed discovery. 94. I agree Arbitration has progressed to in a more advanced state than TP Proceedings. However, I am not confident that Arbitration will be resolved in a few months. Order for Directions No.7 provides for updated calculations of Wing Hong’s various claims (based upon ASD’s accounting procedure which Wing Hong estimates to be 70% complete) by February 2005, which has been done by amendment of WH Arb Counterclaim. According to Wing Hong’s solicitors, it will take up to mid-2005 for ASD and Wing Hong to complete their accounts whereupon Wing Hong will have to again update/amend the pleadings in Arbitration. Akin to the Order for Directions No.7 (which gives consequential directions for discovery and inspection following the updating in February 2005), such exercise will most likely lead to another flurry of discovery, inspection and perhaps revision of expert opinion on quantum. 95. Further, although Order for Directions No.7 provides for expert directions, Arbitrator has yet to give further directions for witness statements and give further directions/fix hearing for considering expert opinion and issues arising therefrom. It is plain Arbitration is not yet at the doorstep of the ultimate resolution or final hearing. Further, considering the overall situation, the more advanced state of Arbitration is insufficient to override the concerns and other factors discussed in this decision. (i) Costs and delay 96. Mr Manzoni submits that substantial costs will be wasted and substantial delay will result if the matter is to be heard entirely by the courts. There has been 25 occasions of requests for discovery in Arbitration and photocopying charges of over HK$86,000.00 have been incurred. He suggests that if Arbitration is to be restrained, discovery will have to be re-started and re-done for TP Proceedings at a huge expense. I can see no reason why the discovery exercise done to date cannot be used or even stand as discovery in TP Proceedings. This approach contradicts the very sensible position Wing Hong adopted in its written outline at the hearing before Arbitrator on 7 th January 2005, namely, that “[as] will be clear from the directions sought, there is much that can be usefully done in the interim, which will be useful wherever the dispute is ultimately resolved, and that work will not prejudice [Restrain Application] hearing or result in ultimately wasted costs” (“ Without Prejudice Stance ”). 97. The same argument applies to Mr Manzoni’s contention that substantial costs and delay will be incurred by amending and re-starting pleadings in TP Proceedings as a result of restraining Arbitration. I do not see why the pleadings in Arbitration cannot be adopted or stand as part of the pleadings in TP Proceedings. The flexibility of modern case management allows parties (if they set their minds to it) get through procedural steps with minimum delay and costs. 98. Mr Manzoni complains that if Arbitration is restrained, the parties will have to await trial in the Court of First Instance and will be prevented from having an early resolution of the contested issues. He submits this is a significant factor and a huge injustice given the state of the court diary in the Court of First Instance when Arbitrator can hear the matter within a shorter timeframe. Such injustice, Mr Manzoni says, overrides Fraud Concern that figuratively hangs over Tai Fong’s head. 99. I agree with Mr Smith SC that too much has been made of the alleged disadvantages when in reality the major steps taken so far in Arbitration, eg pleadings and discovery, can effectively be used in TP Proceedings. There is no reason why parties have to retrace every step along a well-trodden path. This is implicitly accepted in Wing Hong’s written outline before Arbitrator on 7 th January 2005. Further, the costs of various steps/materials drawn from Arbitration and used in TP Proceedings can be treated as costs of the court proceedings. Arbitrator can resolve any remaining costs issue after resolution of TP Proceedings or otherwise. 100. Although Mr Manzoni complains against wasting costs/efforts in shoehorning a very substantial Arbitration claim (which he says will resolve the issues of final accounts between the parties and of Tai Fong’s loss of profit) into a small confined dispute in TP Proceedings with Tai Fong’s Back Charge Admission, there will be potential savings in costs/time/efforts if (a) future revival of stayed TP Proceedings or (b) parallel Arbitration and court proceedings can be obviated. If there is potential future revival of stayed TP Proceedings, there is in effect no assurance of finality despite incurring substantial costs for Arbitration and there will be additional costs if TP Proceedings are revived. If there are to be parallel proceedings, the parties will incur double costs in dealing with a substantial arbitration claim and a smaller third party claim covering similar factual matrix. I do not see any pressing need to incur such double costs. 101. There is no material before me as to the current state of the court diary for trials in the construction and arbitration list in the Court of First Instance. Mr Manzoni says the heavy court diary is a matter of common knowledge. Even if it takes longer to bring the matter to trial than for hearing before Arbitrator, I am not persuaded this is such a huge injustice that overrides the considerations discussed in this decision and the effect of TF Set-Off Defence being an equitable set-off defence discussed below. (j) Preliminary Issues 102. Mr Manzoni submits there will be a hearing on Preliminary Issues in about mid-May 2005, so there will be an immediate resolution or primary determination between the parties on such issues. However, such contention must be viewed in context. Tai Fong’s solicitors informed Arbitrator of Restrain Application just prior to the directions hearing on 7 th January 2005 and proposed to have a short stay of Arbitration pending Restrain Application. Wing Hong sets out Without Prejudice Stance in its written outline for the hearing. Plainly, Order for Directions No.7 for inter alia fixing the hearing on Preliminary Issues with consequential directions is premised on a presumption that Arbitration will be allowed to continue (which as at 7 th January 2005 was yet to be determined) but the parties clearly do not intend to prejudice the present applications before me or to apply pressure on this court in the determination of such applications. This factor is therefore neutral although I have borne in mind the fact that Arbitration has progressed to a stage where hearing on Preliminary Issues is possible. (k) Quantity surveyor as tribunal 103. Mr Manzoni submits that Arbitrator is a quantity surveyor proposed by Tai Fong and he is more suited than the courts to resolve difficult and complicated quantity survey issues arising from valuation of work done by Tai Fong prior to the termination of Sub-contract. He argues that by restraining Arbitration all the good that has been done to date by appointing Arbitrator will become undone. 104. In light of Wing Hong’s stance on Transfer Application, if Arbitration is to be restrained, TP Proceedings will be transferred to the Court of First Instance and assigned to the construction and arbitration list. As apparent from Arbitrator’s Order for Directions No.7, both parties will retain or have retained experts on quantum for Arbitration. There is no reason why these experts cannot continue to assist the judge in charge of the construction and arbitration list who is well experienced in dealing with construction cases and disputes arising therefrom. 105. I note Arbitrator has by letter dated 6 th June 2003 invited the parties to explain the legal basis and cite relevant case references relied on for and against the pleadings in relation to “implied terms”, “collateral agreement” and “promissory estoppel”. Only Wing Hong’s written submissions of 5 th July 2003 are disclosed in the hearing bundle. It is not known whether there is any dispute between the parties over the legal principles, but a number of legal authorities and learned textbooks have been cited in Wing Hong’s submissions. A judge is clearly well suited to deal with such legal issues. (l) Intention of the parties 106. Both counsel addressed me on the intentions of Wing Hong and Tai Fong in initiating TP Proceedings and TP Counterclaim respectively. Wing Hong believes Tai Fong brought TP Counterclaim into TP Proceedings in order to make such proceedings more complicated and of much higher value than they are. Mr Manzoni submits that Tai Fong’s obvious intention is to frustrate Arbitration and to have the substance of TF Arb Claim tried and heard in the absence of WH Arb Counterclaim. He says it is unfair for Tai Fong to delay the resolution of WH Arb Counterclaim and yet bring about the resolution of its own claims. I note that Mr Smith SC has plainly indicated this is not Tai Fong’s intention at all (see section (g) above). 107. Mr Smith SC on the other hand submits that Wing Hong initiated TP Proceedings because it was sued by Décor, PWK and Wolik and it wanted to pass Main Actions Claim onto Tai Fong without waiting for the eventual award by Arbitration. He further says it is apparent from Wing Hong’s attitude to TP Counterclaim that it wants to seek relief against Tai Fong in a manner that allows it to obtain judgment under WH TP Claim without giving credit for Tai Fong’s cross-claim/set-off defence or without waiting for the award under Arbitration. 108. I find it unnecessary to speculate on the subjective intentions of the parties. It is sufficient to consider their conduct objectively and to carry out a balancing exercise along the aforesaid legal principles. (m) Conclusion 109. I remind myself that I should not view the above factors individually and that I should consider the matter globally by balancing the various factors discussed above and by taking into account the whole of the circumstances that have led to the present state of affairs. Upon considering the totality of the circumstances, I am not persuaded that there is any abuse of process by Tai Fong in pleading TP Counterclaim or TF Set-Off Defence. There is no sufficient basis to strike out TP Counterclaim on the Order 18 rule 19 grounds or to stay TP Proceedings/TP Counterclaim under the inherent jurisdiction of the court. Striking out is only available in plain and unarguable cases and it is not so here. 110. The present case falls within the scenario contemplated in the Acetra case so that it is unreasonable for Wing Hong who commenced TP Proceedings against Tai Fong in these courts to rely on Arbitration Clause, the history of this matter and Arbitration to restrict the defences Tai Fong may choose to present and to prevent the courts from examining related facts and claims. As discussed below, TF Set-Off Defence is a true equitable set-off defence. Under the Miller principles, it is also unjust and oppressive against Tai Fong to allow Arbitration to proceed or to allow parallel proceedings race to judgment. XV. TF Set-Off Defence : an equitable set-off? 111. The issue here is whether TP Counterclaim is capable of being set-off in equity against WH TP Claim. Mr Smith SC submits there is a close relationship between the dealings and transactions that give rise to WH TP Claim and TP Counterclaim and it will be manifestly unjust to allow enforcement of one claim without taking into account the other. (a) Close and inseparable connection 112. Mr Manzoni accepts that WH TP Claim and TP Counterclaim arise from the same transaction or closely connected transaction. However, he argues (on the principles set out in English and International Set-Off (supra at p.106)) that Tai Fong has failed to satisfy the further requirement that “the creditor has defaulted in performance of the very obligation for which he is seeking payment in his primary claim or (sometimes) has defaulted in the performance of some ancillary obligation”. As I have indicated above, I prefer to adopt Lord Brandon’s redefined test as approved in the Bim Kemi case and by our Court of Appeal. 113. Mr Manzoni says there is no close connection between WH TP Claim and TP Counterclaim. TP Counterclaim goes to the root of the substantial dispute between Wing Hong and Tai Fong under Sub-contract, which (although hotly contested) relates to the true value of the work done by Tai Fong and the legitimacy of Wing Hong’s termination of Sub-contract. Mr Manzoni argues that WH TP Claim has nothing to do with the value of the work done or the termination of Sub-contract but relates to “a small, and unconnected transaction” which is now subject of Back Charge Admission. Therefore TP Counterclaim does not impeach the legal demand or go to the root of WH TP Claim. Further, Tai Fong’s claim for loss of profit arising from the termination of Sub-contract has nothing to do with the purchase of materials by Tai Fong in Wing Hong’s name. 114. My first observation is that Potter LJ in the Bim Kemi case preferred (as I do) the formulation by Lord Brandon and not the former concept, difficult to define and apply, of “impeachment of title”. In applying Lord Brandon’s redefined test, I agree with Mr Smith SC that there is close connection between TP Counterclaim and WH TP Claim because the dealings and transactions that give rise to these two claims are inseparably connected. Indeed, Mr Manzoni accepted the close connection of the underlying transactions. 115. It is also important not to lose sight of the fact that the analysis turns not on the pleaded legal causes of action but on whether the cross-claim flows out of and is inseparably connected with the dealings and transactions which give rise to the subject of the claim. It is not necessary that the cross-claim should arise out the same contract. 116. WH TP Claim covers inter alia Breach of Duty and Malicious Falsehood Claims. Mr Manzoni by his submissions strips down the scope of WH TP Claim so that it becomes coextensive with Main Actions Claim. Even so, Breach of Duty and Malicious Falsehood Claims are grounded on the limited scope of the agency and authority granted by Wing Hong to Tai Fong under or pursuant to Sub-Contract and on Tai Fong’s alleged obligations under Sub-contract to procure and pay for materials/services for the performance of Sub-contract works in its own name. Likewise, TP Counterclaim and TF Set-Off Defence are premised on the same transactions and dealings, namely, Sub-contract and Supply Contracts. Such cross-claim can be broadly divided into 2 heads of claim : (a) damages for breach of various financial arrangements between Wing Hong and Tai Fong in relation to the performance of Sub-contract (part of which arrangements is Tai Fong’s entry into Supply Contracts in Wing Hong’s name or on its behalf) and (b) loss of profit or damages for Wing Hong’s wrongful termination of Sub-contract. I find the dealings and transactions that underlie (a) above and WH TP Claim inseparably connected and capable of supporting an equitable set-off defence. 117. I disagree that TP Counterclaim does not impeach the legal demand in WH TP Claim because of Back Charge Admission. Such confusion amply justifies why Potter LJ declined to apply the “impeachment of title” requirement. The Nanfri case (cited at p.96-97 of the judgment in the Bim Kemi case) explained the meaning of “impeachment of title” and referred to “cross-claims which go directly to impeach the plaintiff’s demand, that is so closely connected with his demand that it would be manifestly unjust to allow him to enforce payment without taking into account the cross-claim ……” Thus the “impeachment of title” test is no different from the test propounded by Lord Brandon, so that an equitable set-off defence properly raised by reason of close and inseparable connection with the claim impugns the legal demand by confession and avoidance even if the claim is admitted (see extract from Hoffman LJ’s judgment in the Acetra case in paragraph 41 above). Indeed, an equitable set-off defence is particularly useful in such situation. 118. I further find Tai Fong’s loss of profit claim has the requisite degree of closeness with WH TP Claim. Tai Fong claims that Wing Hong has failed to honour its commitments in providing financial support for handling a substantial increase in workload under Sub-contract and that Wing Hong’s wrongful termination of Sub-contract (which leads to the loss of profit claim) also hinges on its failure to provide such financial support. Under TF Amendments, Tai Fong further claims that its authority to enter into Supply Contracts with suppliers on Wing Hong’s behalf forms part of Wing Hong’s commitment to provide it with financial support. In the circumstances, the element of loss of profit flows out of the same dealings and transactions, namely, the promise of financial assistance and Wing Hong’s failure to keep such promise which is part and parcel of the arrangements and authority for Tai Fong to enter into Supply Contracts. WH TP Claim and TP Counterclaim both require investigation into the same factual matrix, ie the existence and terms of the financial arrangements between Wing Hong and Tai Fong. 119. In the circumstances, there is the required close connection between the dealings and transactions that give rise to WH TP Claim and TP Counterclaim. I therefore find the first limb of Lord Brandon’s test satisfied. (b) Manifest injustice 120. Mr Smith SC argues it will be unfair if Wing Hong is allowed to pursue WH TP Claim without regard to TP Counterclaim relating to outstanding payments for work done by Tai Fong under Sub-contract because (a) the materials/supplies purchased by Tai Fong on Wing Hong’s behalf from the suppliers were used in Sub-contract by Tai Fong, (b) the value and benefit of such materials/supplies as incorporated into Sub-contract works have now passed to Wing Hong for which Wing Hong has presumably been paid under Principal Contract by ASD and (c) Wing Hong will thus have the benefit of the materials/supplies as well as a full claim for their purchase price. 121. Mr Manzoni submits that TP Counterclaim is uncertain because it requires evaluation of the validity of the termination of Sub-contract, an assessment of loss of profit and proper valuation of all work done under Sub-contract prior to the date of termination before it can be quantified. He further says TP Counterclaim relates to the true value of works done, which is best resolved by the final accounts exercise by Arbitration, and it will be unjust to allow the set-off defence. It is also manifestly unjust for Tai Fong to bring the full weight of TP Counterclaim into TP Proceedings. Mr Manzoni also relies on the other factors discussed in this judgment. 122. As I understand, there is no requirement that an equitable set-off has to be liquidated (see the Bim Kemi case). It is useful to note that in the Bim Kemi case, Bim Kemi (the party disputing the set-off defence) raised a number of factors which it claimed would militate against the justice or fairness of recognising Blackburn’s right of set-off. Potter LJ endorsed the approach of the judge below who “dismissed reliance upon the arbitration clause on the grounds of the potential injustice, delay and extra cost which would arise from a requirement to conduct a separate arbitration” (p.97 of the judgment). The judge below in Bim Kemi ’s case went on to say as follows : “I do not find it useful to evaluate, particularly at this early stage such matters as the lack of detail and particularisation of the breaches alleged by Blackburn …… The further difficulty is that the further one moves into discretion the more features may become relevant …… but I suggested …… that if broad discretion is relevant it might not be unreasonable for Blackburn’s cross-claims to be permitted to proceed in this court. It would obviously be much cheaper and quicker for all disputes to be resolved in one forum. It might be fair for that forum to be the Commercial Court, Bim Kemi’s own chosen forum venue for its closely related claims …… The more one lengthens the list of potential discretionary factors, the further one moves away from the central issue which, as I see it, must be the nature of the claims and cross claims itself. ” (my emphasis) 123. Potter LJ agreed with the views of the judge below in rejecting the factors suggested by Bim Kemi. He said at p.102 of the judgment that “[the judge below] was right to do so, given that none of the additional matters advanced on Bim Kemi’s behalf (see par. 15 above) went to the central issue of the nature and inter-relationship of the claim and cross-claim as pleaded, as supplemented by the witness statements and other documents before the Court ” (my emphasis). 124. I see nothing in Wing Hong’s arguments on the issue of manifest injustice (including the arguments in section (a) above which may overlap this issue) that sufficiently go to the central issue of the nature and inter-relationship of the claim and cross-claim. Mr Manzoni has commented on the disparity in the size of the claim and cross-claim, but I do not consider it a sufficient basis for establishing manifest injustice. In coming to such conclusion I have also considered the other factors discussed in this decision. XVI. Conclusion 125. I therefore make the following orders in each Action : (a) In respect of Restrain Application, it is ordered that Wing Hong, whether by itself, its servants, agents or any of them or otherwise howsoever, be restrained until the determination of TP Proceedings or until further order from proceeding with and/or taking any further step in Arbitration. (b) In respect of Transfer Application, it is ordered that TP Proceedings be transferred to and tried together with TP Proceedings of the other two Actions in the Court of First Instance. (c) In respect of Strike Out/Stay Application, it is ordered that the application be dismissed. (d) In respect of Summons for Directions, it is ordered that the summons be adjourned sine die with liberty to restore by either party. (e) In respect of Amendment Application, it is ordered that (i) leave be granted to Tai Fong to amend the Substituted Defence to Third Party Notice and Counterclaim in Décor Action and to re-amend the Amended Defence to Third Party Notice and Counterclaim in PWK and Wolik Actions in the manner set out in or similar to the draft annexed to Tai Fong’s summons in PWK Action dated 10 th March 2005; (ii) Tai Fong do file and serve the aforesaid re-amended and amended pleadings within 14 days from the date hereof; (iii) leave be granted to Wing Hong to amend its “without prejudice” Defence to the Third Party’s Counterclaim in all Actions within 21 days thereafter. (f) There shall be liberty to apply for consequential directions if necessary. 126. I also make the following costs order nisi in each Action : (a) In respect of Restrain Application, costs of the application (including all costs reserved) be paid by Wing Hong to Tai Fong to be taxed if not agreed. (b) In respect of Transfer Application, costs of the application and of TP Proceedings in the District Court be reserved to the discretion of the Court of First Instance. (c) In respect of Strike Out/Stay Application, cost of the application (including all costs reserved) be paid by Wing Hong to Tai Fong to be taxed if not agreed. (d) In respect of Summons for Directions, costs be reserved. (e) In respect of Amendment Application, costs of the application be paid by Tai Fong to Wing Hong to be taxed if not agreed. 127. Mr Smith SC has indicated he will be seeking certificate for two counsel if Tai Fong is successful in respect of the applications before me. Mr Manzoni is opposed to such application. However, they are content for me to deal with this matter on a costs nisi basis and to revisit the issue if necessary. I have been ably assisted by Mr Smith SC but consider that two counsel is unnecessary for this matter. I bear in mind that there are 3 Actions and several applications, and the amounts involved are very substantial. However, I am not concerned with the value of the claims. The legal issues are confined and essentially not disputed. Mr Smith SC’s learned junior was able to refer me to the Acetra case at a preliminary hearing of these applications. The substantive arguments turn more on the application of the legal principles to the facts of this case. I therefore grant a costs order nisi that there be certificate for counsel for Restrain, Strike Out/Stay and Amendment Applications. (Marlene Ng) District Judge Mr Clifford Smith SC and Mr Douglas Lam instructed by Messrs M L Tam & Co for Tai Fong Engineering Hong Kong Company Limited. Ms Charles Manzoni instructed by Messrs Tanner De Witt for Wing Hong Contractors Limited. Look up this case on Lawcite Noteup",
  "length": 98639,
  "headers_seen": [
    "I. Introduction",
    "II. Contractual background",
    "III. HCA No.3043/2002 (“HC Action”)",
    "IV. Arbitration",
    "(a) Tai Fong’s claim (“TF Arb Claim”)",
    "(b) Wing Hong’s defence and counterclaim",
    "(c) Discovery",
    "(d) Updating quantum"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkdc/2005/85",
  "query": "stay of arbitration",
  "ts": "2025-10-11T21:03:40",
  "ok": true
}