{
  "title": "PAN OCEAN CONTAINER SUPPLIERS CO LTD V. SPINNAKER EQUIPMENT SERVICES INC | [2024] HKCFI 1753 | HKLII",
  "court": null,
  "year": 2018,
  "date": "2003-01-02",
  "content": "HKLII Databases Court of First Instance [2024] HKCFI 1753 PAN OCEAN CONTAINER SUPPLIERS CO LTD V. SPINNAKER EQUIPMENT SERVICES INC Judgment Information Date 8 Jul, 2024 Action No. HCCT9/2023 Neutral Cit. [2024] HKCFI 1753 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCCT9/2023 HCCT9/2023 PAN OCEAN CONTAINER SUPPLIERS CO LTD v. SPINNAKER EQUIPMENT SERVICES INC HCCT 9/2023 [2024] HKCFI 1753 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO 9 OF 2023 ____________________ BETWEEN Pan Ocean Container Suppliers Co., Ltd Plaintiff and Spinnaker Equipment Services Inc. Defendant ________________ Before: Deputy High Court Judge Jonathan Wong in Chambers (Not Open to Public) Date of Hearing: 9 April 2024 Date of Judgment: 9 July 2024 ___________________ JUDGMENT ___________________ 1. Introduction 1.1 This is my judgment and decision on the following applications: (1) The Plaintiff’s application by its Amended Originating Summons (“ AOS ”) for (a) an order that the Award dated 15 June 2022 (“ Award ”) in HKIAC/A21141 administered by HKIAC (“ Arbitral Proceedings ”) be set aside (“ Section 81 Application ”) pursuant to section 81 of the Arbitration Ordinance Cap 609 (“ AO ”) and (b) an extension of time be granted for the Section 81 Application (“ EOT Application ”); and (2) The Plaintiff’s application by its summons dated 3 May 2023 for leave to re-amend the AOS (“ Amendment Application ”). 1.2 By an order dated 24 May 2023, the AOS and the Amendment Application were ordered to be heard together [1] . The EOT Application is not opposed by the Defendant [2] . 1.3 At the hearing, the Plaintiff was represented by Mr Patrick Chong (with Ms Athena Wong and Mr Han Sheng Lim) and the Defendant by Mr Toby Brown, all of counsel. 1.4 The Plaintiff and the Defendant were respectively the Respondent and the Claimant in the Arbitral Proceedings. 1.5 The Plaintiff is a Mainland company engaged in the manufacture of marine cargo containers. The Defendant is a Californian company engaged in the business of leasing and selling shipping containers. 1.6 On or around 7 August 2019, the Plaintiff and the Defendant entered into a purchase agreement (“ Purchase Agreement ”) by which the Defendant agreed to purchase and Plaintiff agreed to manufacture and sell marine cargo containers in accordance with purchase orders to be issued by the Defendant to the Plaintiff from time to time. Clause 14 thereof is a provision stipulating the applicable law (Hong Kong law) and the dispute resolution mechanism (arbitration in accordance with the rules of HKIAC). 1.7 In early 2021, the Defendant placed and Plaintiff accepted several sets of purchase orders (\" POs \"): (1) 63 purchase orders on 24 February 2021; (2) 26 purchase orders on 1 March 2021; and (3) 15 purchase orders on 3 March 2021. 1.8 Each of the POs incorporates the terms of the Purchase Agreement and stipulates a date on which the production of the containers stated therein had to be completed by the Plaintiff. Production of the containers covered by the POs placed on 24 February 2021 had to be completed by 31 March 2021, those covered by the POs placed on 1 March 2021 by 31 May 2021 and those covered by the POs placed on 3 March 2021 by 31 July 2021. The POs cover both 20’ and 40’ containers of various specifications. 1.9 Clause 5 of the Purchase Agreement is a liquidated damages clause. It provides, inter alia , as follows: “ [a] … Therefore, in the event Seller fails to make any of the Containers ready for delivery within 15 days after the end of the contractual month in which any such Container is scheduled to be produced and delivered, except for reasons of Force Majeure as defined in Clause 12, then Seller shall be liable to Buyer for liquidated damages at the rate of USD5.0 for each 20' Dry Container (or as otherwise set forth in the applicable Purchase Order) until the day on which Seller makes each such Container ready for delivery. If the Containers, or any of them, have not been made so ready for delivery by 15 days after the end of the scheduled production month, whether for reason of Force Majeure or otherwise, Buyer may, at its sole option, terminate this Agreement with respect to any undelivered Containers by seven (7) day's notice in writing without prejudice to any other rights and remedies then or thereafter available to Buyer hereunder or otherwise. [b] Liquidated damages payable under this Clause shall be in addition to, and not in lieu of, any damages to which the Buyer may be entitled if this Agreement is terminated due to Seller's default, and Buyer’s rights and remedies shall in no way be diminished or impaired by reason of the inclusion of the foregoing liquidated damages provision in this Agreement.” (emphasis added) 1.10 It is pertinent to note that the provision for liquidated damages is only applicable to 20’ Dry Containers. 1.11 The Defendant subsequently claimed that the Plaintiff failed to manufacture or make ready for delivery, whether on time or at all, any of the containers set out in 43 POs (out of the 63) placed on 24 February 2021 and all of the POs placed on 1 March and 3 March 2021 (“ Undelivered Units ”). As summarized at Award §57, amongst the Undelivered Units, 4,132 units were 20’ Dry Containers and 977 units were 40’ Containers. 1.12 The Arbitral Proceedings were commenced by a Notice of Arbitration dated 30 July 2021 (“ NOA ”). In the NOA, the Defendant applied for a direction for the proceedings to be conducted in accordance with the Expedited Procedure pursuant to Article 42.1 of the 2018 HKIAC Administered Arbitration Rules (“ 2018 Rules ”), which application was acceded to by HKIAC on 2 September 2021. 1.13 The Plaintiff did not participate in the Arbitral Proceedings throughout, on the alleged basis that it was not made aware of them. The arbitral tribunal was constituted on 18 October 2021, consisting of a sole arbitrator (“ Tribunal ”). Under the Expedited Procedure, the Award was to be communicated to the parties within 6 months from the date when HKIAC transmitted the case file to the Tribunal. In the present case, as the case file was transmitted to the Tribunal on 15 November 2021, the Award was to be communicated by 16 May 2022. As will be seen below, the Tribunal requested and was granted an extension by HKIAC to 16 July 2022. The Award was published on 16 June 2022, prior to the extended deadline. By the Award, the Defendant was awarded monetary compensation under its claim for liquidated damages in respect of the 20’ containers (US$4,080,240) (“ LD Claim (20’) ”) and for damages for non-delivery of the Undelivered Units (US$5,923,372) (“ Non-Delivery Claim ”), interest and costs [3] . 1.14 It is pertinent to note that, although the Plaintiff did not participate in the Arbitral Proceedings, the Tribunal disallowed two substantial claims made by the Defendant for (1) damages quantified at US$1,835,268 for delayed delivery of the 40’ containers [4] and (2) damages quantified at US$4,769,812 for loss of one way lease income [5] . Even in respect of the Non-Delivery Claim, the sum awarded was significantly less than that originally claimed by the Defendant, upon clarification requested by the Tribunal’s own initiation [6] . 1.15 It is the Plaintiff’s case that it never received the Award and only found out about it on 2 November 2022 when its bank in the Mainland informed it that its bank account was frozen by an order of the Ningbao Maritime Court, as a result of the Defendant’s application made on 10 October 2022 to enforce the Award in the Mainland (“ Mainland Enforcement Proceedings ”). 1.16 On 2 February 2023, the Plaintiff issued the Originating Summons (“ OS ”) to set aside the Award. 2. The Plaintiff’s applications 2.1 There is a degree of toing and froing in how the Plaintiff has formulated its grounds for the Section 81 Application. 2.2 In the OS (in Chinese), the Plaintiff relied on: (1) Article 34(2)(a)(ii) of the UNCITRAL Model Law (“ Model Law ”), namely it was not given proper notice of the appointment of the Tribunal or of the Arbitral Proceedings or was otherwise unable to present its case (“ Proper Notice Ground ”); (2) Article 34(2)(a)(iii) of the Model Law, namely the Award deals with a dispute not contemplated by or falling within the terms of the submission to arbitration, or contains decisions on matters beyond the scope of the submission to arbitration (“ Scope of Arbitration Ground ”); (3) Article 34(2)(a)(iv) of the Model Law, namely the composition of the arbitral tribunal or the arbitral procedure was not in accordance with the agreement of the parties (“ Due Procedure Ground ”); and (4) Article 34(2)(b)(ii) of the Model Law, namely the Award is in conflict with Hong Kong public policy (“ Public Policy Ground ”). 2.3 No supporting affirmation was filed with the OS. 2.4 The OS was amended on 1 March 2023 pursuant to an order granted on 27 February 2023. The entirety of the OS (in Chinese) was deleted. The AOS (in English) only advanced the Proper Notice Ground and the Public Policy Ground, abandoning the reliance on the Scope of Arbitration Ground and Due Procedure Ground. No supporting affirmation was filed at the time of the filing of the AOS. 2.5 The Amendment Application (made on 3 May 2023) seeks to resurrect the Plaintiff’s reliance on the Scope of Arbitration Ground and the Due Procedure Ground. The supporting affirmations (the 1 st and 2 nd Affirmations of Mr Ye Dao Gen (“ Ye ”)) were filed on 2 May 2023. 2.6 I propose to first deal with all the grounds advanced by the Plaintiff, followed by the Amendment Application. There is a difference between counsel on the proper approach to be adopted in the Amendment Application. However, I do not believe it was suggested by counsel that the merit of the setting aside grounds is not a relevant consideration in the court’s determination of the Amendment Application under either of the approaches advocated by counsel. 3. Proper Notice Ground 3.1 It is trite that the grounds for setting aside an award are exhaustively set out at section 81 of AO which gives effect to Article 34 of the Model Law. Article 34(2)(a)(ii) provides that an arbitral award may be set aside if the party making the application furnishes proof that: “ the party making the application was not given proper notice of the appointment of an arbitrator or of the arbitral proceedings or was otherwise unable to present his case…” (emphasis added) 3.2 Ye is and was at all material times the Chairman of the Plaintiff and the only deponent for the Plaintiff. It is Ye’s evidence that the Plaintiff did not have actual or proper notice of the Arbitral Proceedings: Ye’s 1 st Affirmation §§5 and 6. The Plaintiff seeks to demonstrate (1) service was not in accordance with the 2018 Rules to trigger their deeming effect and (2) even were the deeming provisions triggered, the evidence provided by the Plaintiff has the effect of rebutting them: Sun Tian Gang v Hong Kong & China Gas (Jilin) Ltd [2016] 5 HKLRD 221 §§37 and 58 and AB v CD [2021] HKCFI 327 §§39-41. 3.3 As summarized at Plaintiff’s Skeleton Submissions §33, the Plaintiff contends that the evidence shows the following: (1) All relevant physical mails were sent to an “ineffective” [7] address and never reached the Plaintiff’s management; (2) As confirmed by the Plaintiff’s fax service provider China Mobile Communication Group (\" China Mobile \"), the Plaintiff’s fax number did not receive any fax from Hong Kong at the material time; (3) Instead of sending the relevant emails to the Plaintiff’s management (specifically Ye), all relevant emails were sent to a low-ranking employee named Mr Barry Qin (\" Qin \") who resigned in September 2021 and had no authority to accept service of the NOA or any other written communications in the Arbitral Proceedings on the Plaintiff's behalf. Qin never brought the Arbitral Proceedings to the attention of the Plaintiff’s management; (4) As a result, the Plaintiff’s management was kept in the dark about the Arbitral Proceedings and did not receive any relevant documents, including but not limited to (a) the NOA, (b) HKIAC's notice that it was minded to appoint a sole arbitrator and (c) the Award. (i) Whether written communication communicated pursuant to the 2018 Rules 3.4 Section 10 of the AO (which gives effect to Article 3 of the Model Law), subject to the parties’ agreement otherwise, provides: “ [(1)] Article 3 of the UNCITRAL Model Law, the text of which is set out below, has effect – ‘ Article 3. Receipt of written communications … Unless otherwise agreed by the parties : (a) … any written communication is deemed to have been received if it is delivered to the addressee personally or if it is delivered at his place of business, habitual residence or mailing address; if none of these can be found after making a reasonable inquiry, a written communication is deemed to have been received if it is sent to the addressee’s last-known place of business, habitual residence or mailing address by registered letter or any other means which provides a record of the attempt to deliver it; (b) the communication is deemed to have been received on the day it is so delivered. (2) … The provisions of this article do not apply to communications in court proceedings.’ [(2)] Without affecting subsection (1), if a written communication (other than communications in court proceedings) is sent by any means by which information can be recorded and transmitted to the addressee, the communication is deemed to have been received on the day it is so sent. [(3)] Subsection (2) applies only if there is a record of receipt of the communication by the addressee.” (emphasis added) 3.5 In the present case, the parties did agree otherwise. Clause 14 of the Purchase Agreement provides: “ This Agreement shall be governed by the laws of Hong Kong SAR. Any controversy, dispute or claim arising out of or in relation to the interpretation or otherwise of any of the clauses of this Agreement shall be finally settled in accordance with the rules of Hong Kong International Arbitration Center . The proceedings shall take place in Hong Kong SAR and shall be held in English language .” (emphasis added) 3.6 The Plaintiff accepts that the Arbitral Proceedings were, pursuant to clause 14 of the Purchase Agreement, governed by the 2018 Rules [8] . Article 3 of the 2018 Rules, inter alia , provides as follows: “ [3.1] Any written communication pursuant to these Rules shall be deemed to be received by a party, arbitrator, emergency arbitrator or HKIAC if: (a) communicated to the address, facsimile number and/or email address communicated by the addressee or its representative in the arbitration; or (b) in the absence of (a), communicated to the address, facsimile number and/or email address specified in any applicable agreement between the parties; or (c) in the absence of (a) and (b), communicated to any address, facsimile number and/or email address which the addressee holds out to the world at the time of such communication; or (d) in the absence of (a), (b) and (c), communicated to any last known address, facsimile number and/or email address of the addressee; or (e) uploaded to any secured online repository that the parties have agreed to use. [3.2] If, after reasonable efforts, communication cannot be effected in accordance with Article 3.1, a written communication is deemed to have been received if it is sent to the addressee’s last-known address, facsimile number and/or email address by means that provides a record of attempted communication. [3.3] Any written communication shall be deemed received on the earliest day when it is communicated pursuant to paragraph 3.1(a) to (d), uploaded pursuant to paragraph 3.1(e), or attempted to be communicated pursuant to Article 3.2. For this purpose, the date shall be determined according to the local time at the place of receiving such written communication or a notice of the upload pursuant to paragraph 3.1(e)…” (emphasis added) 3.7 Under Article 4.1 of the 2018 Rules, the party initiating arbitration shall communicate the NOA to HKIAC and the other party. Therefore, the NOA is a written communication covered by Article 3.1. 3.8 At the time of the issuance of the NOA, the Plaintiff’s contact details were variously stated in a number of different sources. 3.9 The Plaintiff’s address printed on Ye and Qin’s business cards is stated to be “ North Side of Hangzhou Bay Road, Haiyan Economic Development Zone, Zhejiang, China ” (“ Business Card Address ”). Their business cards also provide a fax number (“ Business Card Fax Number ”) and the email addresses of Ye and Qin, respectively dgye@chinapanocean.com and ylqin@chinapanocean.com (“ Qin Email Address ”). 3.10 The Plaintiff’s address in the Purchase Agreement is stated to be “ Economic Development Zone of Hangzhou Bay Avenue, on the North side of Haiyan County, Zhejiang Province, China ” (“ PA Address ”). Clause 16 of the Purchase Agreement provides: “ All notices required to be given by either party shall be in writing and shall be airmailed, telexed or cabled to the address first stated above, except as may otherwise be provided in any Purchase Order , or at such other address as such party may hereafter from time to time designate in writing and shall be deemed received, in the case of airmail, five days after it is postmarked, and in the case of telex, upon transmission (with answer back confirmed) to the other party's telex facilities .” (emphasis added) 3.11 The Plaintiff’s address in the POs is stated to be “ Economic Development Zone of Hangzhou Bay Avenue, North Side of Hangzhou Bay Road, Haiyan 314305, Zhejiang Prov, China ” (“ PO Address ”). 3.12 Pausing here, it may be noted that the Business Card Address, the PA Address and the PO Address all appear, by Hong Kong standards, to be somewhat vague. Of the three, the PO Address contains the most details, it including what appears to be a postal code. I do not regard it unusual that the various formulations of the address do not contain for example a unit number or a street number, bearing in mind that the Plaintiff’s business involves the manufacturing of cargo containers, no doubt comprising of sizeable facilities for both production and storage of finished products. Indeed, a “vague” address is used in the Plaintiff’s business cards. 3.13 The Plaintiff’s address in its business certificate is stated to be “海盐经济开发区泾海路527号108室”(“ Registered Address ”). It is Ye’s evidence (which is disputed by the Defendant) that the Plaintiff had provided its business certificate to the Defendant in 2019. Ye further points out that the Registered Address is available to the public based on a PRC company search and it is the address used by the Defendant in the Mainland Enforcement Proceedings. It is suggested by Ye that the Defendant ought to have used the Registered Address for the purpose of sending the arbitral documents to the Plaintiff. 3.14 Under Article 4.3(b) of the 2018 Rules, the NOA should include the names and (in so far as known) the addresses, facsimile numbers and/or email addresses of the parties and of their representatives. In the NOA, the Defendant stated the Plaintiff’s contact details to be (1) the PO Address, (2) the Business Card Fax Number and (3) the Qin Email Address. Qin was also stated to be the Plaintiff’s contact representative (collectively “ P’s Contact Details ”). 3.15 For the reasons set out below, written communications communicated to the Plaintiff at P’s Contact Details stated in the NOA did trigger the deeming provisions under Article 3.1 of the 2018 Rules. In my view, written communications so communicated plainly do not fall within the type of “ fictional notice ” described at Sun Tian Gang §58: “ I also agree with Ms Wong that even if any of the Deeming Provisions can operate to “deem” service of the NOA on Sun, he was not given “proper notice” of the arbitral proceedings. The ground to set aside under Article 34 (2) (a) (ii) is not lack of “notice”, but lack of “proper notice”, which describes the necessary quality of the service. Fictional notice deemed by purported delivery to an address at which the recipient could not be found and, in this case, was known by Gas and JSM not to have been found, cannot be “proper notice ”.” (emphasis added) 3.16 As regards the PO Address provided as part of P’s Contact Details: (1) Whilst it is not the PA Address, it is still capable of falling within Article 3.1(b) as being “ the address specified in any applicable agreement between the parties ”. This is because, as noted above, Clause 16 of the Purchase Agreement specifically provides that the PA Address being the default address to which notice is required to be given is subject to the proviso “ except as may otherwise be provided in any Purchase Order ”; and (2) Even were (1) above not so, the PO Address is, on the evidence, the last known address under Article 3.1(d). All of the POs (affixed with the Plaintiff’s chop) were placed in February or March 2021 shortly before the commencement of the Arbitral Proceedings. 3.17 As regards the Business Card Fax Number provided as part of P’s Contact Details, it is within either Article 3.1(c) (as being the fax number which Plaintiff held out to the world) or Article 3.1(d) (as being the last known fax number). 3.18 As regards the Qin Email Address provided as part of P’s Contact Details, it is within Article 3.1(d) (as being the last known email address). On the evidence, the pre-action correspondence issued by the Defendant’s former solicitors (“ Ince ”) commencing on 21 June 2021 were only sent to the Plaintiff via the Qin Email Address. Indeed, the contemporaneous records show that emails relating to the Purchase Agreement and the POs were exchanged predominantly between the Defendant and Qin at the Qin Email Address (without copying Ye). The only email correspondence between Ye and the Defendant adduced by the Plaintiff was “social” in nature and did not relate to the Purchase Agreement and the POs. 3.19 It bears emphasis that the means of communication set out at Article 3.1 of the 2018 Rules are couched disjunctively. In other words, their deeming effect is triggered (1) when any of Articles 3.1(a) to (e) is complied with and (2) when a written communication is communicated by any of the means set out within each of Article 3.1 (a) to (d) (ie physical delivery, fax or email). 3.20 The Defendant has prepared a table (“ Table ”) [9] summarizing the means by which written communications were communicated to the Plaintiff by the Defendant, HKIAC and the Tribunal. It is plain from the Table that the Defendant, HKIAC and the Tribunal had throughout the Arbitral Proceedings ensured that the written communications were communicated in compliance with Article 3 of the 2018 Rules. Subject to a few exceptions (as to which see further below), the written communications were communicated to the Plaintiff via multiple means permitted under Article 3. 3.21 The foregoing may be illustrated by the specific examples relied on by Mr Chong (§3.3(4) above): (1) As regards the NOA, Ince sent the notice to the Plaintiff via email (to the Qin Email Address), fax (to the Business Card Fax Number), airmail (to the PO Address) and courier (via DHL to the PO Address). A successful fax transmission report and a report from DHL showing that the package was successfully delivered (and signed for) are adduced into evidence. There is no evidence that the airmail was unsuccessful [10] . It is pertinent to note that, at the request of HKIAC, on 3 August 2021, the Defendant furnished proof of service of the NOA on the Plaintiff to the HKIAC; (2) As regards the appointment of the Tribunal, HKIAC sent letters dated 2, 7 17, 24 September and 18 October 2021 by email, fax and courier to the Plaintiff’s Contact Details, the last-mentioned letter being the one setting out HKIAC’s appointment of the Tribunal. According to the Plaintiff, one of the identified letters (ie the one dated 17 September 2021) could not be couriered by SF Express due to “Incomplete receiver’s address”. Apart from that isolated incident, no documentary evidence has been adduced by the Plaintiff to show that HKIAC’s letters mentioned above were otherwise not successfully communicated by email, fax [11] and courier; (3) As regards the Award, it was sent by HKIAC to the Plaintiff by email, fax and courier (by Express Mail Service (“ EMS ”)). The evidence shows that the Award was not communicated successfully by fax or courier. In relation to fax, the Plaintiff had disconnected the Business Card Fax Number in June 2022. As regards courier, EMS has confirmed that the Award (and 5 other packages sent by HKIAC) were not signed for and therefore not delivered. The 6 undelivered packages were sent by HKIAC in April to June 2022. It is important to note that the explanation given by EMS is that the packages were not signed for, not that the address was erroneous or incomplete. I do not find that surprising as physical delivery and receipt by courier were in all likelihood affected by the COVID-19 pandemic. Contemporaneously, in May 2022, the Tribunal stated that some of her written communications would be communicated by email only. For example, in the Tribunal’s email dated 6 May 2022, the Tribunal stated: “ … the courier service to the PRC is still subject to various restrictions and there are still substantial delay due to the latest covid situation. I am therefore only sending my enquires and directions above by way of email.” 3.22 Having examined the Table, I am satisfied that all the written communications set out therein were communicated in compliance with Article 3 of the 2018 Rules, and as a result, they are deemed received by the Plaintiff. 3.23 The foregoing being the case, the further question is therefore whether there is sufficient and credible evidence to rebut the presumption of receipt. As stated at Sun Tian Gang §37: “ Even accepting that the Model Law is aimed to achieve effective arbitration without delay, and that the objective of the Rules is to provide for finality and certainty in the process of arbitration, I cannot agree that the Model Law can or was ever intended to derogate from principles of natural justice and fairness… I therefore do not agree that the Deeming Provisions set out in Article 3 (1) and Article 2 of the Rules can preclude a party from adducing evidence to show that, notwithstanding the delivery of any written communication to his last known place of business, habitual residence or mailing address, he had not in actual fact received such written communication. As highlighted in paragraphs 4 and 5 of this Decision, the initiation of the arbitration is an important step in the process, and it would offend fundamental rules of natural justice if a party is shut out entirely from presenting the evidence which can establish that he was never given actual notice of the arbitration, because he had never received the notice of commencement of the arbitration left at an address - which can be for a myriad of legitimate and conceivable reasons. It will be for the Tribunal and the court to consider and decide on the facts of each case whether there is sufficient and credible evidence to rebut the presumptions of receipt .” (emphasis added) 3.24 I should point out that the Tribunal was keenly aware of the fact that she needed to take extra care in maintaining the structural integrity of the Arbitral Proceedings in the light of the complete lack of response on the Plaintiff’s part. The Tribunal only came to her conclusion that due notices of the relevant written communications were given to the Plaintiff after a careful analysis: Award Section F. (ii) Whether deeming provision rebutted by the Plaintiff on the evidence 3.25 In my view, the Plaintiff has failed to adduce sufficient and credible evidence to rebut the presumption of receipt. It is important to bear in mind that the overarching theme in the Plaintiff’s evidence is that Ye himself or “the management” did not receive any of written communications each sent to the Plaintiff via multiple means (courier, fax and email). Physical delivery of written communication 3.26 The Plaintiff first seeks to demonstrate that the PO Address is an ineffective address and the proper address should be the Registered Address. I am unable to accept the Plaintiff’s argument for the following reasons: (1) In so far as it is suggested that the Registered Address is specific in that it includes a room number and a street number, no explanation has been proffered by the Plaintiff as to why the Business Card Address is as vague as, if not even more vague than, the PO Address; (2) Prior to the commencement of the Arbitration, a number of letters were couriered by Ince in June 2021 to the PO Address and signed for by Qin and one Wang Jian Yan (“ Wang ”). It is common ground that Qin was at the material time an employee of the Plaintiff and the Plaintiff has not disputed the Defendant’s evidence that Wang was also an employee of the Plaintiff; and (3) Following the commencement of the Arbitration, on a number of occasions, Ince couriered written communications to the Plaintiff by DHL and they were delivered and signed for by one Fang Zhou (“ Fang ”). There is no evidence to suggest that Fang was not an employee of the Plaintiff. 3.27 The Plaintiff then argues that some of the written communications sent to the PO Address were not successfully delivered: (1) The Plaintiff relies on HKIAC’s failure on 6 occasions to courier written communication by EMS. I have already dealt with this at §3.21(3) above. Moreover, as pointed out by Mr Brown, HKIAC sent 17 letters by courier to the PO Address, meaning the other 11 deliveries from the HKIAC were delivered at the PO Address; and (2) 2 letters sent by Ince to the Plaintiff via airmail were returned (but they were successfully delivered by courier, email and/or fax in any event). However, they were amongst the 18 letters sent by Ince to the Plaintiff via airmail which means that the other 16 letters were successfully delivered by airmail. 3.28 On the evidence, the majority of the written communications were successfully delivered to the Plaintiff at the PO Address. In my view, the PO Address is not an ineffective address as contended by the Plaintiff. Even if written communications were on sporadic occasions not delivered at the PO Address, it does not follow from the foregoing that the PO Address is ineffective, especially when some of those occasions were caused by factors unrelated to the “effectiveness’ of the address, for example COVID-19 considerations as identified by the Tribunal. 3.29 I also do not regard the Plaintiff’s case that the Registered Address is the “correct address” is a sound one. Were that to be the case, it is unclear why the Registered Address does not appear in the business cards, the PA or the PO. 3.30 I further do not see anything sinister (if so suggested by the Plaintiff) in the Defendant using the Registered Address in the Mainland Enforcement Proceedings. This may or may not be explained by the fact that there are different rules on service of documents in Mainland court proceedings. In any event, the Plaintiff’s evidence is not that it received notice of the freezing order granted in the Mainland Enforcement Proceedings at the Registered Address. Instead, the Plaintiff’s own evidence is that it only learnt about the freezing order from its bank. Delivery of written communications by fax 3.31 The first point taken by Mr Chong is that fax transmission is not an agreed mode of communication in the Purchase Agreement. However, one is here concerned with written communications communicated in the Arbitral Proceedings, which is plainly governed by the 2018 Rules and not the Purchase Agreement. 3.32 The Plaintiff next relies on a report from China Mobile. The China Mobile report only covers the period from December 2021 to May 2022 (“ Period ”). It is the Plaintiff’s case that it disconnected the Business Card Fax Number in June 2022. The China Mobile report shows that, during the Period, only fax transmissions from Mainland numbers were received at the Business Card Fax Number. 3.33 The difficulty with the Plaintiff’s reliance on the China Mobile report is that it is unclear whether the China Mobile report was compiled on the basis that it would include fax transmissions from overseas. The request made by the Plaintiff to China Mobile has not been adduced into evidence, and the China Mobile report does not expressly state that it was prepared on the basis that it would include both overseas and local fax transmissions. 3.34 The fax transmissions sent by the Defendant are accompanied by a confirmation of successful transmission (except those transmitted in June 2022 after the Business Card Fax Number was disconnected). These are contemporaneous records to which I attach significant weight. There is no suggestion by the Plaintiff that the contemporaneous fax confirmations are not authentic or unreliable. 3.35 I accept that where it is stated in the Table that a written communication was communicated by fax, that was done successfully (except for the period after the Business Card Fax Number was disconnected). Only confirmations for the Defendant’s fax transmissions to the Plaintiff are adduced into evidence. The burden being on the Plaintiff, there is no evidence adduced (apart from the China Mobile report to which I do not attach significant weight) to suggest that any fax transmission by HKIAC or the Tribunal to the Plaintiff was not successful. Delivery of written communications by email 3.36 Like fax transmissions, Mr Chong takes the point that email is not an agreed mode of communication in the Purchase Agreement. I have already dealt with this point at §3.31 above. 3.37 The contemporaneous evidence plainly shows that Qin was the Defendant’s main contact within the Plaintiff’s organization. Qin was involved in the negotiation of the Purchase Agreement, and the email correspondence was mainly conducted between Qin and the Defendant (without copying Ye). It is not difficult to see the reason for it, as on Ye’s own evidence, he does not understand English. It is also easy to understand why the written communications were sent to the Qin Email Address, as the Arbitral Proceedings were agreed to be conducted in English. 3.38 I do not accept Ye’s evidence that Qin was a low-ranking employee, or that Qin had resigned or was terminated in September 2021, his departure preceded by vacation leave in July 2021. 3.39 First, no documentary evidence has been adduced by the Plaintiff in relation to Qin’s departure (eg termination or resignation letter). 3.40 Secondly, the contemporaneous documents conversely show that even in December 2021 (around the time of filing of the Points of Claim by the Defendant in the Arbitral Proceedings on 20 December 2021), Qin sent an email to the Defendant from the Qin Email Address on 16 December 2021 in the following terms: “ Dear Juergen, We are writing this email to show our great apology for the trouble we bought for the previous orders. To be honest, your lawyer's leter [sic] after letter keep worrying us as well. We both know things have to be solved. So we don't want both of us keep being in a stalemate like that and we don't hope the relationship was broken forever for this issue. What we hope is both of us can find a good solution together and continue the cooperation. Above is our sincere wish. Hope to get your good and kind reply. Thanks.” (emphasis added) 3.41 It is plain that emails sent by Ince were received by Qin at the Qin Email Address. When there was no reply from the Defendant, Qin sent chaser emails from the Qin Email Address to the Defendant on 21 and 22 December 2021. 3.42 Thirdly, according to Ye’s own evidence, when he found out about the Award, his immediate reaction was to contact Qin to find out what happened. On 2 November 2022 (more than a year after his purported departure from the Plaintiff in September 2021), Qin emailed the Defendant from the Qin Email Address in the following terms: “ Dear Juergen, How are you? We both know we have some unhappy order issue between both of us. We hope both of us can find a good solution together and continue the cooperation. Above is our sincere wish. Hope to get your good and kind reply.” 3.43 Fourthly, on the Plaintiff’s own evidence, at around the same time on 15 November 2022, a notice of arbitration (in respect of another arbitration commenced by a party unrelated to the Defendant against the Plaintiff) was emailed to Qin at the Qin Email Address by a firm of solicitors in England. No explanation has been proffered by the Plaintiff as to why a foreign firm of solicitors would email a notice of arbitration to Qin, an alleged low-ranking employee, at the Qin Email Address more than one year after Qin’s purported departure from the Plaintiff. 3.44 Fifthly, Ye’s evidence is that only Qin had access to the Qin Email Address and no one else within the Plaintiff organization had access to it after Qin’s departure. As stated above, I do not accept Ye’s bare allegation that Qin had resigned or was terminated in September 2021. Even if that were so, it is plain that the Qin Email Address was used regularly to correspond with customers and outside parties. It makes no commercial sense to suggest that the Plaintiff, being a sizeable organization, would simply neglect or omit to make alternative arrangements to maintain communication flow with outside parties following Qin’s departure. 3.45 Sixthly, Qin clearly had access to the Qin Email Address in December 2021 after his alleged departure. The suggestion that Qin would on a frolic of his own sent the pacifying emails in December 2021 to the Defendant and then proceed to withhold notifying the Plaintiff of the Arbitral Proceedings does not make any or any commercial sense. In a similar vein, when the Plaintiff approached Qin in November 2022 after the freezing of its bank account, there is no documentary evidence to show that the Plaintiff made any complaints to Qin for having withheld the Arbitral Proceedings from the Plaintiff. 3.46 In my view, on the evidence before me, Qin was at least one of the persons designated within the Plaintiff organization to deal with the Arbitral Proceedings. In so far as necessary, I further agree with Mr Brown that the Plaintiff’s argument on Qin’s authority to receive written communication is misplaced. Mr Chong seeks to draw an analogy with the observations set out at Sun Tian Gang §45: “ Mr Chan SC relies on this Court’s decision in Dana Shipping and Trading SA v Sino Channel Asia Ltd (unrep., HCCT 47/2015, [2016] HKEC 599) (14 March 2016), to support his argument that service of the NOA on Du, as Sun’s authorised agent, is good service on Sun. Dana Shipping was a decision on an application for security, and this Court was only conducting a preliminary review of the merits of the respondent’s intended application to the English supervisory court to set aside an arbitral award. The question of an agent’s authority to accept service of arbitral proceedings was not fully argued before this Court. Since the decision of this Court in Dana Shipping, the English court in fact set aside the award on the ground that the agent had neither actual, nor implied or apparent authority to accept service of the notice of arbitration, referring to Lantic Sugar Ltd v Baffin Investments Ltd (The Lake Michigan) [2010] 2 Lloyd’s Rep 141. In The Lake Michigan, the English court held that the P&I Club agent did not have actual authority to accept service of a notice of arbitration, despite its wide authority generally to act on behalf of its members/principals, including conducting settlement negotiations and granting extensions of time to commence arbitration, etc. In Sino Channel Asia Ltd v Dana Shipping And Trading Pte Singapore [2016] EWHC 1118 (Comm), the English court accepted the analogy of the wide authority of solicitors to deal with a case on behalf of a client, but (without more) that does not translate into authority to accept service of proceedings on behalf of the client. Emphasis was placed on the significance of a notice to commence arbitration, being an important step which has significant legal consequence beyond the performance of ordinary contractual obligations.” 3.47 As pointed out by Mr Brown, Qin was not a third party in a position akin to a solicitor or a P&I Club agent but an employee of the Plaintiff. At the time of the issuance of the NOA (July 2021), Qin was indisputably an employee of the Plaintiff. 3.48 Further and in any event, the facts of the present case bear no resemblance to those in Sun Tian Gang which was concerned with service on a natural person who was at the material time incarcerated. Where, as here, one is dealing with service to a corporate entity under the 2018 Rules, it is a matter of internal management whether the arbitral documents reached the “correct” personnel within the Plaintiff organization (which I have found Qin to be in any event). As held at U v S [2018] HKCFI 2086 §16: “ As for the Respondent’s arguments on the lack of notice Ground, the relevant documents including the notice of arbitration had been delivered to the business address of the Respondent, and the Applicant pointed out that this was in accordance with the CIETAC Rules which governed the 2 nd Arbitration, as the parties had agreed under the arbitration agreement. The fact that it was redirected internally by the Respondent to the Parent, and was left unopened, was a matter of the Respondent’s internal management. The respondent in the 2 nd Arbitration is the corporate Respondent, and not the individual A named as its legal representative. The facts of the present case are entirely distinguishable from the facts of Sun Tian Gang v HK & China Gas (Jilin) Ltd [2016] 5 HKLRD 221 .” Conclusion on the Proper Notice Ground 3.49 In my view, the Proper Notice Ground is entirely opportunistic. I have no hesitation in rejecting it. I find that the Plaintiff has failed to prove that it was not given proper notice of the appointment of an arbitrator or of the arbitral proceedings or was otherwise unable to present his case. For completeness, I do not place any weight on the forensic submission that the Plaintiff is a sizeable organization and there was no reason for its lack of participation in the Arbitral Proceedings had proper notice been given. Nothing has been produced by Ye to suggest that the Plaintiff had engaged the Defendant prior to the commencement of the Arbitral Proceedings to dispute its liability. 3.50 As pointed out at KB v S & Ors , HCCT 13 of 2015, 15 September 2015 §1(6), in dealing with applications to set aside an arbitral award, or to refuse enforcement of an award, whether on the ground of not having been given notice of the arbitral proceedings, inability to present one’s case, or that the composition of the tribunal or the arbitral procedure was not in accordance with the parties’ agreement, the court is concerned with the structural integrity of the arbitration proceedings. In this regard, the conduct complained of “ must be serious, even egregious ”, before the court would find that there was an error sufficiently serious so as to have undermined due process. 3.51 The Plaintiff is unable to show that any of the written communication was not communicated successfully by at least one of the means permitted under Article 3.1 of the 2018 Rules. Any sporadic failure in respect of one of the means of communication does not materially affect the structural integrity of the Arbitral Proceedings and cannot be considered serious or egregious. 4. Public Policy Ground 4.1 In this section, I will deal with a number of alleged procedural irregularities which are advanced exclusively under the rubric of the Public Policy Ground. There are other alleged irregularities which cut across the Public Policy Ground and other grounds. Those are dealt with in the subsequent section. 4.2 The applicable principles are established. “ Contrary to public policy ” has been held by the Court of Final Appeal to mean “ contrary to the fundamental conceptions of morality and justice ” of the forum ( Hebei Import & Export Corp v Polytek Engineering Co Ltd (1999) 2 HKCFAR 111 at 139F-G). In A v R (Arbitration: Enforcement) [2009] 3 HKLRD 389 , the court explained (at para 23) that if the public policy ground is to be raised, there must be “ a substantial injustice arising out of an award which is so shocking to the court’s conscience as to render enforcement repugnant ”. (i) Failure to notify HKIAC that the Expedited Procedure no longer appropriate 4.3 The Plaintiff says that the Defendant, in discharging its duty of good faith, was required to inform HKIAC when the surrounding circumstances of the Arbitral Proceedings rendered the Expedite Procedure no longer appropriate. 4.4 The alleged irregularity arose in the following way. 4.5 Under Article 42.1(a) of the 2018 Rules, prior to the constitution of the arbitral tribunal, a party may apply to HKIAC for the arbitration to be conducted in accordance with Article 42.2 where the amount in dispute representing the aggregate of any claim and counterclaim (or any set-off defence or cross-claim) does not exceed the amount set by HKIAC, as stated on HKIAC’s website on the date the Notice of Arbitration is submitted. 4.6 Article 42.2 provides as follows: “ When HKIAC, after considering the views of the parties, grants an application made pursuant to Article 42.1, the arbitral proceedings shall be conducted in accordance with an Expedited Procedure based upon the foregoing provisions of these Rules, subject to the following changes: (a) the case shall be referred to a sole arbitrator unless the arbitration agreement provides for three arbitrators; (b) if the arbitration agreement provides for three arbitrators, HKIAC shall invite the parties to agree to refer the case to a sole arbitrator. If the parties do not agree, the case shall be referred to three arbitrators; (c) HKIAC may shorten the time limits provided for in the Rules, as well as any time limits that it has set; (d) after the submission of the Answer to the Notice of Arbitration, the parties shall in principle be entitled to submit one Statement of Claim and one Statement of Defence (and Counterclaim) and, where applicable, one Statement of Defence in reply to the Counterclaim; (e) the arbitral tribunal shall decide the dispute on the basis of documentary evidence only, unless it decides that it is appropriate to hold one or more hearings; (f) subject to any lien, the award shall be communicated to the parties within six months from the date when HKIAC transmitted the case file to the arbitral tribunal. In exceptional circumstances, HKIAC may extend this time limit; (g) the arbitral tribunal may state the reasons upon which the award is based in summary form, unless the parties have agreed that no reasons are to be given.” 4.7 Article 42.3 provides: “ Upon the request of any party and after consulting with the parties and any confirmed or appointed arbitrators, HKIAC may, having regard to any new circumstances that have arisen, decide that the Expedited Procedure under Article 42 shall no longer apply to the case. Unless HKIAC considers that it is appropriate to revoke the confirmation or appointment of any arbitrator, the arbitral tribunal shall remain in place.” 4.8 At NOA §(k), the Defendant sought a direction for the proceedings to be conducted under the Expedited Procedure: “ The Claimant seeks a direction pursuant to Article 42 that the arbitration be conducted in accordance with the Expedited Procedure set out in Article 42.2. The amount in dispute referred to above is equivalent to approximately HKD 8,340,000 and is accordingly well below the monetary threshold of HKD 25m set by the HKIAC. It follows that the matter falls under Article 42.1(a).” 4.9 In the NOA, the disputes referred to arbitration were as follows: “ Pursuant to the [Purchase Agreement], the Respondent was to manufacture and sell to the Claimant shipping containers of various types and sizes, in numbers and in accordance with a schedule to be determined under the terms of the [Purchase Agreement]. The Respondent has failed to manufacture a substantial number of units on time (or at all). The Claimant claims liquidated damages as provided for under the [Purchase Agreement], as well as damages at large for delayed delivery or, should the subject units never be delivered, for non-delivery. The Claimant has already invoiced the Respondent in respect of liquidated damages in the sum of USD 1,069,260. Liquidated damages continue to accrue and will continue to be invoiced regularly as they accrue. The Claimant may have further damages claims as referred to above, but those have yet to be quantified.” (emphasis added) 4.10 In the NOA, the relief or remedy sought was stated to be: “ The Claimant seeks an award of liquidated damages already invoiced in the sum of USD 1,069,260, together with further liquidated damages as may accrue prior to delivery of the subject units. Depending on if/when the units are ultimately delivered, the Claimant may seek further damages for delayed delivery or non-delivery. The Claimant further seeks interest and costs.” (emphasis added) 4.11 In the Statement of Claim communicated on 20 December 2021, consistent with the NOA, the Defendant expressly reserved its rights to claim over and above the LD Claim (20’). At Statement of Claim §19, it is stated: “ For the avoidance of doubt, at this stage the Claimant seeks an interim final award of the liquidated damages which have accrued and been invoiced to the Respondent as aforesaid, together with interest thereon and costs, as well as a declaration that the Respondent remains obliged to manufacture and make ready for delivery the Undelivered Units [(“ Declaratory Relief ”)]. The Claimant's hope and expectation is that the Respondent will ultimately perform those obligations. That being the case, the Claimant asks that the Tribunal reserve its jurisdiction as to other matters, including but not limited to: (a) Any claim for further liquidated damages which may accrue in future; and/or (b) Any claim for damages for delayed delivery of the 40' units, in respect of which no Liquidated Damages rate is set by Clause 5(a) or otherwise by the Purchase Agreement; and (c) Any claim for damages for non-delivery , in the event that the Respondent ultimately never manufactures and makes ready for delivery the Undelivered Units.” (emphasis added) 4.12 The Plaintiff argues that the Defendant should have on at least 2 occasions informed HKIAC that the Expedited Procedure was no longer appropriate. First, the Defendant’s LD Claim (20’) as at the date of the Statement of Claim had increased to US$4,080,240 and therefore exceeded the HK$25 million monetary threshold set by HKIAC. Secondly, when the Defendant decided to pursue claims in addition to the LD Claim (20’), its claims for damages had increased to over US$18 million. It is said by the Plaintiff that the increased quantum would have justified the scrutiny of a more robust procedure than that under the Expedite Procedure (for example a live hearing and a panel of 3 arbitrators). 4.13 As regards the first occasion, the LD Claim (20’) would by effluxion of time naturally increase. The increase in quantum does not affect the complexity of the underlying claim. As regards the second occasion, the Defendant’s pursuit of the additional claims was in response to an invitation by the Tribunal to it to set out its final relief in the event she was not minded to grant the Declaratory Relief [12] . As stated in the Award: “ [60] By further written submissions dated 6 April 2022, the Claimant clarifies that if the Arbitral Tribunal is to take the view that it should not grant the declaratory relief sought, nor, therefore, reserve its jurisdiction as to various other matter referred to in Paragraph 59 above, the relief sought as set out in the Notice and the Statement of Claim is as follows… [91] In the circumstances where the Claimant put forward evidence which shows that the Respondent is not willing nor in the position to make ready for delivery of the Undelivered Units, the Claimant no longer has any legitimate interest to keep the Agreement alive in the hope of future performance. The Arbitral Tribunal is not satisfied that a declaration sought by the Claimant should be made.” 4.14 It seems to me what is in fact suggested by the Plaintiff is that the Defendant is obliged to make a request under Article 42.3 to disapply the Expedited Procedure. No authority is cited for the proposition, namely where, as here, the Plaintiff had chosen not to participate in the Arbitral Proceedings, the Defendant was nevertheless obliged to make a request for a more elaborate procedure which the Plaintiff would unlikely participate in in any event. 4.15 Further, as pointed out at §1.14 above, even within the “streamlined” Expedited Procedure, the Tribunal was meticulous and careful in the process, even disallowing substantial parts of the Defendant’s claim without any input by the Plaintiff. The Plaintiff’s submissions fail to acknowledge this crucial aspect and barely asserts the need of closer scrutiny. 4.16 In my view, this complaint does not come close to having the character of precipitating a substantial injustice which is shocking to the court’s conscience. (ii) Failure to notify the Tribunal that the Plaintiff did not have proper notice 4.17 I have already dealt with the issue of proper notice at section 3 above. 4.18 There is one additional aspect. The Plaintiff argues that under Procedure Order No 1, the Tribunal had directed that written communication must be communicated to the Plaintiff by courier, fax and email. It is alleged that during the Arbitral Proceedings, the Defendant was in breach of its obligations, as some of the written communications were not communicated via all 3 means. 4.19 I do not agree. Procedural Order No 1 §5(2) provides: “ Notifications and communications shall be deemed to have been validly made when they have been sent: (2) If to the Respondent, using the following details ( as appropriate ):- Pan Ocean Container Supplies Co., Ltd Economic Development Zone of Hangzhou Bay Avenue, North Side of Hangzhou Bay Road, Haiyan 314305, Zhejiang Province, People's Republic of China By fax: +86 573 8905 2333 By email: ylqin@chinapanocean.com & by courier” (emphasis added) 4.20 When the underlined words “ as appropriate ” is read together with Procedural Order No 1 §6 and the 2018 Rules, it seems to me abundantly clear that the obligation is to communicate by any one of the means stated. Procedural Order No 1 §6 provides: “ A party shall notify the opposing party, the Sole Arbitrator and HKIAC immediately and in writing of any changes to its name, description, address(es), email address(es) or facsimile number(s). In the absence of such notifications, communications and notifications to the addresses, email addresses or facsimile numbers stated above shall be deemed validly made .” (emphasis added) 4.21 Indeed, as pointed out above, the Tribunal’s own interpretation of Procedural Order No 1 was that, during a period of the COVID-19 pandemic, it was permissible for her to only send communications to the Plaintiff and the Defendant via only email. 4.22 I likewise do not see how this complaint can remotely shock the court’s conscience. (iii) Exhibiting “without prejudice” communications as evidence 4.23 Statement of Claim §§17-18 plead as follows: “ [17] The Claimant would, in particular, highlight that on 2 July 2021 [C/113], the Respondent indicated its agreement to a proposal set out in a letter dated 25 June 2021 from the Claimant's solicitors [C/111-112]. (For the avoidance of doubt, certain messages from the Claimant to the Respondent which were marked “Without Prejudice” have been included here, so the Tribunal can see what it was the Respondent was agreeing to by its message of 2 July 2021. This is not intended to constitute a wider waiver of without prejudice privilege.) It was stated in the 25 June 2021 letter that: ‘ ... in the event that the proposed production schedule set out is fit/filled, our clients will consider forgoing their claims for liquidated damages and indeed damages more generally. In the meantime, liquidated damages will continue to accrue on all of the outstanding units as per the Purchase Agreement.’ [18] It follows that the Claimant did not agree to forego or waive its claims for Liquidated Damages, but only to consider doing so, in the event the production schedule proposed in the 25 June 2021 letter was fulfilled. Regrettably, within just ten days of its message of 2 July 2021, agreeing to the Claimant's proposal, the Respondent reneged on what had been agreed [C/119]. No further or subsequent agreement has been reached between the Claimant and the Respondent.” 4.24 The Plaintiff argues that it is shocking that the Defendant had violated without prejudice privilege. 4.25 Ince’s letter dated 25 June 2021 has been adduced into evidence [13] . It is not marked without privilege and it is plain that the letter simply urges the Plaintiff to commit to a revised production schedule (beyond the completion dates stipulated in the POs): “ Be that as it may, the Buyer wishes to find a solution to the present situation. That being the case, we urge you to commit to production as follows, in accordance with your obligations under the Purchase Agreement: (a) Build 3000 units of 20' dry van Containers by the end of August i.e. 31 August 2021, of which 1000 units should be built by the end of July i.e. by 31 July 2021. Our clients would expect to see a firm production plan for those 1000 units within 3 working days of the date of this letter, so as to give them confidence that those units will be produced by the end of July. (b) Build the remaining 2109 units of 20' and 40' Containers by the end of October i.e. by 31 October 2021, subject to a minimum of a combined total of 190 40' Containers and 40' HC Containers to be built by the end of August i.e. by 31 August 2021. (c) The Buyer reserves the ultimate right to vary, order and select, as and when appropriate, which P.O. is to be built, once there is agreement on the production slots. We look forward to receiving confirmation that you agree to the proposed production schedule set out above. Without prejudice to our clients' rights and claims, as set out in our previous letter, in the event that the proposed production schedule set out above is fulfilled, our clients will consider forgoing their claims for liquidated damages and indeed damages more generally. In the meantime, liquidated damages will continue to accrue on all of the outstanding units as per the Purchase Agreement. All our clients' rights are reserved and nothing herein is to be construed as a waiver.” 4.26 Another letter from Ince dated 15 July 2021 is in evidence [14] . It is again not marked without prejudice: “Despite your consistent failure to perform your obligations under the Purchase Agreement, our clients have been extremely conciliatory in proposing a new production schedule via email on 2 July 2021 at 00:03. In your 2 July Email, your Barry Qin responded in the affirmative that ‘for your proposal, all is fine. Please send us all the update orders and please allocate which POs are to be built in which production slot.’ (the ‘2 July Agreement’)… To our clients’ great frustration, within just 10 days of the 2 July Agreement, you have reneged on your promise, saying that ‘we found we actually cannot meet your below proposal.’ Our clients had already, on the basis of the 2 July Agreement, made commitments to their customers, only then to be undermined entirely by you going back on your word. It is, unfortunately, becoming difficult for our clients ever to trust or believe any statement or commitment you make. Our clients are not prepared to countenance any departure from the 2 July Agreement. They have been quite accommodating enough and their patience is now at an end. Our clients accordingly call upon you to stand by the 2 July Agreement and to perform your obligations under it and under the Purchase Agreement. It is time for you to realise that contractual obligations are binding, not things you can disregard whenever you happen to find them inconvenient.” 4.27 It is plain that the above 2 letters are not without prejudice communications. They are not stated as such, and their contents are merely assertions of the Defendant’s rights. The Plaintiff has not otherwise adduced into evidence what it considers to be without prejudice correspondence. However, the factual matters pleaded at Statement of Claim §§17-18 are already supported by Ince’s letters mentioned above, both written on an open basis and were predominantly letters asserting the Defendant’s rights. 4.28 It is entirely unclear what other without prejudice correspondence the Plaintiff is referring to, and how referring to such correspondence might shock the court’s conscience. 4.29 It is also pertinent to note that Plaintiff’s Skeleton Submissions §73 reads as follows: “ Further, it is clear from the face of the Award the fact that the Arbitrator based her finding that Pan Ocean breached the Agreement in part on the privileged correspondence. This affords a further ground for holding that the Award is contrary to public policy.” 4.30 First, it is not clear from the Award that the Tribunal did resort to any without prejudice material over and above the “open” correspondence. Secondly and in any event, section 81(3) of AO provides that the court does not have jurisdiction to set aside or remit an arbitral award on the ground of errors of fact or law on the face of the Award. Even had the Tribunal erred in admitting any without prejudice correspondence, a challenge made on the ground of errors of fact or law on the face of the Award is not a valid setting aside ground. 4.31 For completeness, I deal with Mr Chong’s reliance on AZ v BY [2023] EWHC 2388 (TCC). AZ is concerned with adjudication and is not a case on setting aside of an arbitral award. It is important to note the following distinction. It is stated at §18: “ In Ellis Building Contractors Limited v Vincent Goldstein [2011] EWHC 269 (TCC), Akenhead J also undertook a review of the relevant authorities. At the outset he noted that adjudicators are under a duty to apply the rules of natural justice. He referred in this context to Cantillon Ltd v Urvasco Ltd [2008] EWHC 282 (TCC) in which the second of the principles identified in that case was that 'any breach of the rules must be more than peripheral, they must be material breaches.' Following this, Akenhead J continued: ‘ 25. The improper deployment of \"without prejudice\" material in adjudication is something which happens in adjudication as in court although this Court has at least anecdotally seen an increase in this behaviour in adjudication. This often arises because parties represent themselves or are represented by consultants who are not legally qualified and, perhaps, they do not fully understand that truly \"without prejudice\" communications are privileged and should not be referred to in any legal or quasi-legal proceedings, including adjudication. Whilst if \"without prejudice\" communications surface in a court, the judge being legally qualified and experienced can usually put it out of his or her mind, it is a more pernicious practice in adjudication because most adjudicators are not legally qualified and there will often be a greater feeling of unease that the \"without prejudice\" material may have really influenced the adjudicator. This Court can only strongly discourage parties from deploying \"without prejudice\" communications in adjudication.’ ” (emphasis added) 4.32 Further on at §25: “ Both counsel submitted that the authority is not directly relevant in circumstances where this Court is in fact determining the question of whether the material submitted was without prejudice in the Part 8 claim. I agree. I would add, however, that I do not regard this as authority which goes further than stating, in the circumstances before the Court in that case, the test of apparent bias had not been made out. It is not authority, I would suggest, for the proposition that just because an adjudicator has turned his or her mind to the question of admissibility of the material, and received submissions from both parties, a challenge to that decision would not, at least under the law of England and Wales, be successful as a matter of principle. The question of admissibility is a question of law. It is trite that generally, adjudicator's decisions will be enforced notwithstanding the fact that they contain an error of law. But an error as to the admissibility of without prejudice material is an error of law that could potentially impact the fairness of the decision-making process in accordance with the rules of natural justice. It is similar, in this sense, to an error of law by an adjudicator in assessing the extent of their own jurisdiction. It is an error which can affect the enforceability of the decision. If, therefore, a court concludes (contrary to the determination of the adjudicator) that material was in fact without prejudice and that the test of apparent bias is made out, the decision should not be enforced. Not only is this the correct result analysing the position from first principles, it seems to me it also accords with the important public policy behind without prejudice communications, and, in the words of Akenhead J, is consistent with the Court's strong discouragement to parties from deploying \"without prejudice\" communications in adjudication . ” (emphasis added) 4.33 In the present case, the Tribunal is an experienced barrister and I have no doubt that she was able to put any reference to without prejudice communications out of her mind. In any event, as pointed out above, the Plaintiff has not adduced into evidence what it considers to be without prejudice material. I do not regard the Plaintiff can derive any assistance from AZ . 5. Due Procedure Ground / Scope of Arbitration Ground and related Public Policy Ground 5.1 The complaints underpinning these grounds relate to the Tribunal’s invitation for further submissions from the parties in the event that she was not minded to grant the Declaratory Relief. This led to the Defendant’s pursuit and the eventual award of the Non-Delivery Claim in addition to the LD Claim (20’). 5.2 What factually transpired is recorded at Award §41: “ … Upon the Arbitral Tribunal's further directions to the parties on 11 January 2022, 8 March 2022, 27 April 2022 and 6 May 2022, the Arbitral Tribunal further received from the Claimant (but not the Respondent) on 1 February 2022, 6 April 2022, 3 May 2022 and 13 May 2022 written submissions and clarifications on final relief including the loss and damage for breach of contract (if any), costs and interest together with their statement of costs and other enclosures…” 5.3 In gist: (1) After the Defendant communicated its Statement of Claim and its first witness statement, the Tribunal, on 8 March 2022, invited the parties to address her within 14 days on the final relief in the event she was to take the view that no specific performance ought to be granted; (2) On 21 March 2022, the Defendant asked for more time as the Tribunal’s request was not what it had anticipated needing to address. On the same day an extension of time was granted by the Tribunal; (3) On 6 April 2022, the Defendant communicated its further submissions and its second witness statement. In the second witness statement, the Defendant quantified the Non-Delivery Claim by using unit prices different from those stated in the POs; (4) On 25 April 2022, the Tribunal indicated to the parties that she would proceed to decide the dispute on the basis of the documentary evidence available; (5) On 27 April 2022, the Tribunal requested the parties to address the basis of the Defendant’s adoption of unit prices different from those set out in the POs; (6) On 3 May 2022, the Defendant provided an explanation for adopting unit prices different from those set out in the POs, but “ for the sake of simplicity ” indicated to the Tribunal that it was prepared to adopt the unit prices as per the POs (“ Revised Table ”). As a result, the quantification of the Non-Delivery reduced from US$8,288,716 to US$5,923,372; (7) On 6 May 2022, the Tribunal requested further clarification on how the figures set out in the Revised Table were calculated and directed the parties to address her within 14 days. As the original deadline for rendering the Award was on 16 May 2022, the Tribunal further indicated to the parties that she would seek an extension of time pursuant to Article 42.2(f) of the 2018 Rules to 16 July 2022; and (8) On 13 May 2022, the Defendant provided an explanation of the Revised Table. Essentially, the unit prices set out in the Revised Table were obtained through a simple arithmetic exercise of obtaining a weighted average of the different unit prices in the various POs. 5.4 As set out at Award §110: “ Insofar as the contract price is concerned, the Claimant adopts the weighted average purchase agreement price (\"WAPrice\") which is calculated based on the total sum of (units ordered under each purchase order times purchase order price for the corresponding purchase orders) divided by the total number of units ordered for that type of containers . The Claimant submits and the Arbitral Tribunal is satisfied that the use of the weighted average approach is convenient for the purpose of calculating the contract prices taking into account the different types of containers and their different agreed prices .” 5.5 The Plaintiff’s complaints in respect of the above matters are formulated in a number of different ways: (1) The Non-Delivery Claim is not within the scope of the arbitration; (2) It is said that the Tribunal failed to act fairly and impartially and conducted the Arbitral Proceedings to the advantage of the Defendant and disadvantage of the Plaintiff by inviting further rounds of submission on the basis that specific performance would not be granted thereby resulting in the award of the Non-Delivery Claim; (3) The above process was in any event not in accordance with the streamlined procedure contemplated under the Expedited Procedure. It is clear that the Tribunal did not accept the Defendant’s initial case (in departing from the unit prices set out in the POs) but afforded further opportunities to the Defendant to “perfect” its case; (4) The Revised Table was not backed up by witness statements; and (5) There was no exceptional circumstances warranting the Tribunal seeking an extension of time to render the Award. 5.6 I am unable to accept that any of the above complaints has any merit. 5.7 First, it is plain that the Non-Delivery Claim was referred to arbitration. I have already set out at §§4.9 to 4.11 above the relevant parts of the NOA and the Statement of Claim and at §4.13 above the relevant parts of the Award setting out the Tribunal’s decision that she was of the view that the Defendant had no legitimate interest in keeping the Purchase Agreement alive and therefore she was not minded to defer dealing with the Non-Delivery Claim. Where, as here, the Defendant had by the NOA and Statement of Claim asked the Tribunal to reserve its jurisdiction for any claim for damages for non-delivery. I do not see how it can be said that the pursuit by the Defendant of an award for the Non-Delivery Claim as its final relief was outside the scope of the arbitration. 5.8 As pointed out at The Hong Kong Arbitration Ordinance (Commentary and Annotations) , 2 nd Ed at 81.52, the question for determination is whether the Award (1) dealt with a difference not contemplated by the submission to arbitration, (2) dealt with a different not falling within the terms of the submission of the arbitration, or (3) decided matters beyond the scope of the submission of the arbitration. In my view, the Non-Delivery Claim does not fall foul of any of the foregoing. 5.9 Secondly and relatedly, I agree with Mr Brown that it was entirely appropriate for the Tribunal to ask the parties to address her on damages if she was disinclined to grant the Declaratory Relief. 5.10 Thirdly, I do not agree that the approach adopted by the Tribunal was not in accordance with the Expedited Procedure. Article 42 of the 2018 Rules does not oust Article 13.1, which enjoins the Tribunal to adopt suitable procedures for the conduct of the Arbitral Proceedings, provided that such procedures ensure equal treatment of the parties and afford the parties a reasonable opportunity to present their case. Throughout the entire process, due notices were given to the Plaintiff to address the Tribunal, which opportunities were not taken up by the Plaintiff. 5.11 Fourthly, I do not see how it can be said that the Defendant’s reliance on the Revised Table required further witness statements. The POs were already in evidence and the weighted averages involved only an arithmetic calculation. I also do not see any merit in criticizing the Defendant for its initial larger quantification, and the Tribunal’s alleged failure to form a negative view on the credibility of the Defendant’s case. As stated above, the Defendant conceded on a lower quantification for the sake of simplicity, which stance does not mean that its initial case, if pursued, would not be accepted by the Tribunal, bearing in mind that there was no evidence adduced by the Plaintiff to the contrary. 5.12 Fifthly, given the chronology stated above, I do not see how it can be said that the short extension sought for by the Tribunal to render the Award was not in accordance with the Expedited Process. As pointed out by Mr Brown, the Tribunal’s request was approved by HKIAC. There is no separate complaint made by the Plaintiff against HKIAC. 5.13 In so far as any of the above complaints is also pursued under the Public Policy Ground, I do not regard any of them has the effect of amounting to any breach of natural justice or shocking the court’s conscience. 6. The Amendment Application 6.1 Given my conclusion on the lack of merits in the Scope of Arbitration Ground and the Due Procedure, I dismiss the Amendment Application. 6.2 In so far as necessary, I would also dismiss the Amendment Application on the basis that no proper explanation has been proffered by the Plaintiff to explain the toing and froing in its formulation of the setting aside grounds. Whether one treats the Amendment Application is one for an extension of time (as Mr Chong contends) or as one for amendment (as Mr Brown contends), it seems to me that an explanation is required for the Plaintiff’s abandonment and resurrection of the Scope of Arbitration Ground and the Due Procedure Ground. 7. Conclusion 7.1 For the above reasons, I grant the EOT Application (on the basis that it is unopposed) but dismiss the AOS. I also dismiss the Amendment Application. 7.2 I also make a costs order nisi that the Plaintiff is to pay to the Defendant the costs of the AOS (including the EOT Application and any costs reserved) and the Amendment Application on an indemnity basis, to be taxed if not agreed. (Jonathan Wong) Deputy High Court Judge Mr Patrick CHONG, Ms Athena WONG and Mr Han Sheng LIM, instructed by Messrs. Wat & Co., for the Plaintiff Mr. Toby BROWN, instructed by Messrs. Squire Patton Boggs, for the Defendant [1] On 25 September 2023, the parties signed a consent summons for leave to be granted to the Plaintiff to correct a typographical error in the name of the Plaintiff. The consent application was approved by the court’s letter dated 28 September 2023 but the AOS and the Amendment Application do not reflect the name change. I proceed on the basis that the Plaintiff’s name has been corrected. [2] Defendant’s Written Submissions §71. [3] Award §§141. [4] Award §§98-103. [5] Award §§112-114. [6] Award §§60-61, 104-114. [7] Although Mr Chong had initially contended that the service address was a “wrong” address, he accepted at the hearing it was more appropriate to describe the service address as an “ineffective” address. [8] Plaintiff’s Skeleton Submissions §88. [9] Appendix 1 to Mr Juergen Matthias Moll’s Affidavit. A copy providing cross-references to the hearing bundles was provided after the hearing upon the courts’ request at the hearing. [10] In so far as necessary, the NOA sent via airmail would have complied with Clause 16 of the Purchase Agreement. [11] The China Mobile report does not cover the period between September and October 2021 (see further below). [12] In the Tribunal’s letter dated 8 March 2022, she regarded the Declaratory Relief was in substance a claim for specific performance. [13] D/714 [14] D/722 Look up this case on Lawcite Noteup",
  "length": 77422,
  "headers_seen": [
    "1. Introduction",
    "2. The Plaintiff’s applications",
    "3. Proper Notice Ground",
    "(i) Whether written communication communicated pursuant to the 2018 Rules",
    "(ii) Whether deeming provision rebutted by the Plaintiff on the evidence",
    "Physical delivery of written communication",
    "Delivery of written communications by fax",
    "Delivery of written communications by email"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2024/1753",
  "query": "HKIAC",
  "ts": "2025-10-17T10:44:52",
  "ok": true
}