{
  "title": "RE S Y ENGINEERING CO. LTD. | [2000] HKCFI 1058 | HKLII",
  "court": null,
  "year": 2000,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2000] HKCFI 1058 RE S Y ENGINEERING CO. LTD. Judgment Information Date 25 Oct, 2000 Action No. HCCW664/2000 Neutral Cit. [2000] HKCFI 1058 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCCW664/2000 HCCW000664/2000 RE S Y ENGINEERING CO. LTD. HCCW000664/2000 HCCW 664/2000 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE COMPANIES WINDING UP NO. 664 OF 2000 ____________ BETWEEN S Y ENGINEERING CO LTD AND IN THE MATTER OF THE COMPANIES ORDINANCE ( CAP. 32 ) ____________ Coram: Hon Chu J in Court Date of Hearing: 23 and 26 October 2000 Date of Decision: 26 October 2000 Date of Reasons: 1 November 2000 _______________________ REASONS FOR DECISION _______________________ 1. This is an application to rescind the winding-up order made against S Y Engineering Company Limited (\"the Company\") on 23 October 2000. The application was initially brought by the Company, but subsequently joined by one of its contributories, Mr Ma Koon Sik. It was opposed by the Petitioner . After hearing submissions, I rescinded the winding-up order. The reasons appear below. Background 2. The Petition herein was presented on 25 July 2000 by the Petitioner, a creditor of the Company. The Petition is based on a debt of $1,191,707.34, being the taxed costs of an application by the Company for leave to appeal against an arbitration award in favour of the Petitioner as certified by an allocatur dated 26 June 2000. The Petitioner served a statutory demand on 30 June 2000, which was not met. After the Petition was presented, the Company made partial payments of $895,524.83, leaving a balance of $479,930.80 together with daily interest accruing at the rate of $106.52. The Company opposed the Petition on the basis that the Company has a claim against the Petitioner for the costs of work done and materials supplied under 2 construction projects and the amount of the claim well exceeds the outstanding balance under the allocatur. The Company sought to set-off the balance of the debt due against the claim against the Petitioner. The Petitioner in reply referred to further liabilities owed by the Company to it, being the costs of the arbitration proceedings estimated to be $16.9 million and a sum of $713 million as damages and expenses due from the Company certified under several surveyor's certificates. The costs of arbitration has yet to be taxed by the Court. The liability for the sum of $713 million is contested by the Company. 3. At the hearing of the Petition, I ordered that the Company be compulsorily wound up, having regard to the fact that there was no dispute to the debt on which the statutory demand and the Petition were found, the statutory demand was not satisfied and the debt was not fully discharged at the hearing of the Petition. There was also no evidence of solvency filed by the Company nor any offer by the Company to pay off the outstanding balance. The mere fact that the Company may have a cross claim against the Petitioner is not a bar to the making of a winding-up order. The winding-up order was, however, ordered to take effect only upon the Petition being amended to state the name of the Company correctly and the verifying affidavit being filed. The Recission Application 4. In the afternoon of the hearing of the Petition, the Company applied by summons for a recission of the winding-up order. In the supporting affirmation, it was indicated that the Company could discharge in full the outstanding petition debt within 24 hours. The application was heard on an urgent basis. The Petitioner opposed the application and asked for time to consult counsel and to file evidence in opposition. The hearing was therefore adjourned to 26 October 2000. In the meantime, I ordered that the Company brought into Court the balance of the petition debt. I also, on the Company's application, granted an interim stay of the winding-up order. 5. At the resumed hearing, the Company applied to amend the summons by adding Mr Ma, a contributory, as one of the applicants. This is clearly necessary because the Company on its own has no locus standi. The summons was allowed to be amended accordingly. At the same time, Mr Ma filed a further supporting affirmation setting out, inter alia, the financial position of the Company with a view to demonstrating that the Company is solvent. The Petitioner challenged the assertion that the Company is solvent. Reasons for Recission of the Winding-Up Order 6. There can be no doubt that the Court has jurisdiction to rescind or review a winding-up order before it is drawn up and sealed. In England, that is specifically provided for by the Insolvency Act 1986. In Hong Kong, the position is governed by common law: see In Re Crown Bank (1890) 44 Ch D 634 . The Court will have regard to any new evidence, which was not before the Court on the making of the winding-up order, on hearing such applications: Re Portedge Ltd [1997] BCC 23 . 7. Where the petition debt is not disputed, the Court will rescind the winding-up order upon being satisfied that: (1) the petition debt and all the sums owed to the supporting creditors have been paid or arrangements are made to pay them forthwith upon the dismissal of the petition; (2) it is established that the Company is solvent; and (3) the official receiver does not consider that the affairs of the company require investigation and his costs are paid: Boyle & Marshall, Practice and Procedure of the Companies Court (1997 edition), para. 9.151 at p. 339. 8. In the present case, the Company had paid into Court the outstanding petition debt. There is no other creditor appearing to support the Petition. The Official Receiver has no comment on the application for recission. The contributory has undertaken to pay the costs of the application. The only outstanding matter and which is the bone of contention is whether it is established that the Company is solvent. 9. Mr Ma in his further supporting affirmation exhibited an audited account of the Company for the year ending 31 December 1999, which is the latest audited report. His affirmation also mentions various projects currently undertaken by the Company and the income and payments to be derived from these projects. On this affirmation, there can be no doubt that the Company is an active trading concern. The audited account shows that the Company had sustained trading loss in 1998, but had made a profit in 1999. But because of the loss brought forward from 1998, the account for 1999 remains to be in the deficient. Nevertheless, the Company was in a much more healthy position in 1999 when compared to that in 1998. One of the factors contributing to this improved state of affairs is that an amount owed to director in the sum of $68,624,071.00 had been written off. The Petitioner's argument is that on the accounts, the Company was insolvent by the end of 1999 in that it could not pay its debts as and when they fell due, and there is no reason to believe that the situation has since improved. Counsel for the Petitioner also described the writing off of the debt due to director as \"creative accounting\". 10. On the last point, it is to be noted that there is no suggestion nor material indicating that it is against established accounting practice to write off an amount due to director. This is not a matter that the Court should hold against the Company. Indeed, in considering whether a company is solvent, it is permissible to leave out sums owed to directors: Boyle & Marshall , supra, para. 9.151 at p. 339. 11. As to the question of solvency, it ought to be approached by asking whether the assets of the Company is greater than its liabilities. By the end of 1999, the current assets of the Company exceeded its current liabilities by about $2.3 million. It is true that included in the current assets is retention money in the sum of $6.7 million, but that is an amount which the Company can legitimately expect to receive in due course. The position remains that the current asset value was greater than the current liabilities on the Company's balance sheet. Mr Ma's affirmation deposed that the Company's financial position remains unchanged since the end of 1999. By that, I take Mr Ma to mean that the overall financial picture of the Company remains similar to that by the end of 1999. This means that the Company continues to derive profits from the projects undertaken and with the profits the accumulated loss will be reduced. The reference in Mr Ma's affirmation to the ongoing projects and the payments expected from them serves to confirm and particularize the income expected to accrue to the Company. 12. I am satisfied on the material before the Court that the Company is solvent on the accounts. Further, considering that the Company is an active trading concern, generating regular income and profits, and also the fact that there is no other supporting creditor, public interest is better served by preserving the Company rather than by winding it up. 13. In the circumstances, the winding-up order is rescinded with costs of the application to be paid by the contributory. The amount paid into Court on 24 October 2000 by the Company is to be paid out to the Petitioner forthwith. (Carlye Chu) Judge of the Court of First Instance Representation: Mr Jonathan Harris, instructed by Messrs Deacons, for the Petitioner Mr Kenneth C L Chan and Mrs Dora Chan, instructed by Messrs Peter Mo & Co., for the contributory and the Company Miss Hardwick, for the Official Receiver Look up this case on Lawcite Noteup",
  "length": 9637,
  "headers_seen": [
    "Background",
    "The Recission Application",
    "Reasons for Recission of the Winding-Up Order"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2000/1058",
  "query": "costs of arbitration",
  "ts": "2025-10-16T10:45:13",
  "ok": true
}