{
  "title": "SECRETARY FOR JUSTICE V. SUDEWO | [2022] HKCFI 1642 | HKLII",
  "court": null,
  "year": 2022,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2022] HKCFI 1642 SECRETARY FOR JUSTICE V. SUDEWO Judgment Information Date 5 May, 2022 Action No. HCMP1263/2021 Neutral Cit. [2022] HKCFI 1642 Parallel Cit. [2022] 3 HKLRD 246 Download MS Word Judgment Corrigendum Reading Options Translation Toggle Highlight Case History HCMP1263/2021 HCMP 1263/2021 [2022] HKCFI 1642 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE MISCELLANEOUS PROCEEDINGS NO 1263 OF 2021 _________________ BETWEEN SECRETARY FOR JUSTICE Plaintiff and SUDEWO Defendant _________________ Before: Hon D’Almada Remedios J in Court Date of Hearing: 6 May 2022 Date of Decision: 6 May 2022 Date of Corrigendum: 1 June 2022 ____________________ C O R R I G E N D U M ____________________ Please note the following amendment in the Decision: On page 1, line L, “Chambers (Open to the Public)” should read as “Court”. Dated this 1 st day of June, 2022. (Benjamin CHAN) Clerk to Hon D’Almada Remedios J HCMP1263/2021 SECRETARY FOR JUSTICE v. SUDEWO HCMP 1263/20 21 [2022] HKCFI 1642 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE MISCELLANEOUS PROCEEDINGS NO 1263 OF 2021 _________________ BETWEEN SECRETARY FOR JUSTICE Plaintiff and SUDEWO Defendant _________________ Before: Hon D’Almada Remedios J in Chambers (Open to the Public) Date of Hearing: 6 May 2022 Date of Decision: 6 May 2022 ______________ D E C I S I O N _______________ 1. This is an originating summons taken out by the Secretary for Justice against the defendant, Sudewo, under Order 52, rule 1 and 3 of the Rules of the High Court . The Secretary for Justice’s application is for the defendant to be committed to prison and/or be fined for contempt of court for taking photographs and making audio recording in court 26 in the High Court Building during the criminal proceedings listed as HCCC 217/2019. All the papers in respect of these proceedings have been served on the defendant. The defendant is present and not legally represented but acting in person, his application for legal aid having been refused. The defendant expressed his intention to represent himself. 2. The defendant admitted the Statement of Facts as was read to him in court and in brief, they can be stated as follows. 3. On 1 September 2020, the defendant attended court 26 of the High Court and sat in the public gallery. During the hearing of the criminal proceedings, HCCC 217/2019 relating to an application for reversal of plea of guilty to a charge of trafficking in dangerous drugs, the defendant took photographs and audio recorded the proceedings. After taking the photographs and making audio recordings, the defendant then disseminated these photos and audio recordings to a person by the name of “Money” in his telephone by way of WhatsApp. 4. During the course of the parties’ submissions in the proceedings my clerk (the clerk) and I heard the replaying of oral exchanges of the proceedings inside the courtroom emitting from the public gallery. Upon the Court’s enquiry the defendant admitted making an audio recording of the proceedings with his mobile phone purportedly out of an interest as he was a tourist from Indonesia. 5. I directed the court be stood down and requested the clerk to observe the defendant delete the audio recording from his mobile phone. At that time, I did not know that the defendant had disseminated the audio recording by WhatsApp to another person. 6. During the adjournment the clerk found within the mobile phone the audio recording and two photographs. One photograph captured the Daily Cause List outside Court no 26 on 1 September 2020. The second photograph captured, among other things, the defendant in the criminal proceedings whose name was “Lam” in the dock, two officers of the Correctional Services Department, the paralegal representing “Lam” and another unidentified person. The clerk also noticed in the mobile phone a WhatsApp conversation where the photographs and the audio recording had been decimated to “Money”. 7. The clerk observed the defendant deleting the photographs and audio recording from the mobile phone. The clerk then asked the defendant to wait in the courtroom. Before the court hearing resumed the clerk checked the defendant’s mobile phone again. He found that the defendant had already deleted all of the WhatsApp conversation between “Money” and the defendant. 8. The clerk informed me during the adjournment that the defendant had forwarded the photos and audio recording to another person in his mobile phone in a WhatsApp conversation and when he looked at the defendant’s mobile phone again, the defendant had deleted all of the WhatsApp conversation between “Money” and the defendant. Upon hearing this, I directed the matter be reported to the police for investigation regarding the offence of perverting the course of justice which may have been committed by the defendant. 9. The defendant was invited to go to Central Police District Headquarters. He was not arrested. The police conducted a video-recorded interview with the defendant. Under caution the defendant claimed he was not acquainted with “Lam” and was at court to hear the outcome of the criminal proceedings on behalf of a friend known as “Siu Lung”, whom he referred to as “Money” in the WhatsApp conversation with him in his mobile. The defendant admitted he knew he was not allowed to take photographs in the courtroom but did so purportedly to prove to “Siu Lung” that he attended the court. Further, he admitted having made the audio recording inside the courtroom so that he could listen to it again and explain to “Siu Lung” later. Incidentally the police noted that one of the arrested persons related to the criminal proceedings also had the alias of “Siu Lung”. 10. By the defendant’s admission to liability the defendant admitted his conduct was intentional and deliberate and he knew he was not allowed to take photos in the courtroom. He admitted that his actions constituted interference or impediment to the due administration of justice and therefore his actions amounted to contempt of court. 11. As a result of his admission of liability for contempt of court, the issue is what sentence is to imposed on the defendant for his contempt of court. 12. The defendant is 57 years of age. He was born in Indonesia. He has completed Secondary 5 school education. Prior to coming to Hong Kong he was a salesman for cosmetic products earning approximately $2,000 a month. He is presently in Hong Kong as a Form 8 recognisance holder. 13. The defendant has three previous convictions in Hong Kong, two of theft and one of a breach of condition of stay. He was sentenced for all three offences to 20 days’ imprisonment in total in September 2018. 14. The defendant submitted a letter he wrote to this court dated 6 May 2022 stating that he is remorseful for what he did in the courtroom. He regrets what he did and he asked the court to be lenient on him in his sentence. He informed the court that his father just passed away, his daughter has breast cancer and he wished to monitor her situation as he is a single parent. He asked that if he has to go to prison, could he take his gout medicine with him as the government medicine does not suit him. 15. Ms Kao, Government Counsel for the applicant submitted a previous similar case for the court’s consideration: Secretary for Justice v Tang Lin Ling before Andrew Chan J. In that case a person in the gallery took photos in court and in that case the contemnor was sentenced to 7 days’ imprisonment after contesting she was in contempt of the court. 16. Chan J said in Tang Lin Ling the following about the seriousness of contempt of court when taking photographs. He said at page 77 of the transcript: “Taking photographs using mobile phones in court has become a problem and concern, especially in criminal cases the reason for this concern is obvious: that the High Court where a criminal trial is determined by the jury taking photographs of the jurors causes concern and unease amongst jurors. Jurors are also distracted from their task. They may be worried about reprisals. The court must protect them from any form of unnecessary interference. …” He went on to say: “As such illegal photography in court has every tendency to put prejudice or interfere with the administration of justice. In today’s world, photographs taken inside the court can easily be passed onto others through electronic means. The dissemination of these photographs is fast and is often non-retrievable. Once these photographs are in the hands of bad elements, they can be misused. Photographs in court therefore must be deterred.” 17. Although there were no jurors in the court during these proceedings I wholly agree with Chan J. This was such an instance where the defendant did disseminate the photos and audio recording by WhatsApp to another person and it did interfere and impede the administration of justice. 18. Most importantly, what is most concerning in this particular case is that the person who the photographs and audio recording was disseminated to was “Money”, who appeared to be a related party in the criminal proceedings of “Lam”. The defendant admitted that “Money” had sent him to court to listen to these criminal proceedings. This, in my view, is a very serious matter because not only had it interfered with the administration of justice but the defendant may have committed an offence of perverting the course of justice. 19. In this case, the defendant’s conduct was intentional and deliberate. He admitted he knew he was not allowed to take photographs in the courtroom. It constituted a clear interference of the due administration of justice. 20. The defendant has through his admission however saved the court’s time by admitting that he is in contempt of court. I understand these are not criminal proceedings but are civil proceedings for contempt however I consider that credit for his early admission and for saving the court’s time be given to him. 21. Had the defendant been found liable for contempt of court after trial, I would have taken 12 days as an immediate term of imprisonment. In a criminal case, a plea of guilty at the earliest opportunity affords a discount of one-third from the sentence imposed after trial. I intend to use the same principle in this case. 22. In the present case the defendant has admitted he was in contempt of court at the first opportunity. His admission came on the day of contempt and adopted on the trial day. The defendant has saved the court’s time. In the circumstances the defendant will be sentenced to 8 days’ imprisonment. (S. D’ Almada Remedios) Judge of the Court of First Instance High Court Ms Vivian Kao, GC of the Department of Justice, for the applicant The defendant appeared in person Look up this case on Lawcite Noteup",
  "length": 10898,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2022/1642",
  "query": "contempt of court",
  "ts": "2025-10-16T12:11:37",
  "ok": true
}