{
  "title": "MAGNUS LEONARD ROTH V. VITALY PETROVICH ORLOV | [2020] HKCFI 525 | HKLII",
  "court": null,
  "year": 2020,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2020] HKCFI 525 MAGNUS LEONARD ROTH V. VITALY PETROVICH ORLOV Judgment Information Date 25 Mar, 2020 Action No. HCA1093/2017 Neutral Cit. [2020] HKCFI 525 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCA1093/2017 HCA1093/2017 MAGNUS LEONARD ROTH v. VITALY PETROVICH ORLOV HCA 1093/2017 [2020] HKCFI 525 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE ACTION NO. 1093 OF 2017 ________________________ BETWEEN MAGNUS LEONARD ROTH Plaintiff and VITALY PETROVICH ORLOV Defendant _______________________ Before: Hon Anthony Chan J in Chambers Date of Defendant’s Written Skeleton Submissions: 24 February 2020 Date of Plaintiff’s Written Skeleton Submissions: 11 March 2020 Date of Defendant’s Written Reply Skeleton Submissions: 13 March 2020 Date of Decision: 26 March 2020 _________________ D E C I S I O N _________________ 1. By a Summons filed on 21 December 2018 (“Summons”), the Defendant seeks an order to (1) stay this Action in favour of arbitration pursuant to an arbitration agreement between the Plaintiff and him contained in a Framework Agreement dated 28 April 2016 (“Framework Agreement”) under s.20 of the Arbitration Ordinance , Cap 609 (“Ordinance” and “Stay Application”); and (2) set aside the leave granted to the Plaintiff to serve proceedings against the Defendant out of jurisdiction (“Set Aside Application”). 2. Pursuant to the invitation of the court, the parties had agreed that this application be disposed of on paper. Issues 3. The Stay application turns upon whether the Plaintiff’s claims in this Action fall within the Arbitration Clause contained in the Framework Agreement. According to the Defendant, should he succeed on the Stay Application, the court would automatically grant the Set Aside Application. The Plaintiff disagrees. Background 4. In addition to the undisputed facts set out in the Affirmations, this court was invited by the Plaintiff to (1) take notice of a recent judgment of Coleman J in respect of unfair prejudice proceedings between the parties: Magnus Leonard Roth v Vitaly Orlov [2019] HKCFI 2120 at §§12-127 (“UP Judgment”); and (2) refer to the claims set out in the Statement of Claim, which have not been contradicted for present purposes. 5. Based on the materials before the court, the undisputed factual background can be summarized as follows. 6. In 1997, the Plaintiff and the Defendant, respectively a Swedish national and a Russian national, commenced a jointly owned fisheries business which, over time, developed into a significant fishing group with complex corporate structures (including operating entities incorporated in Spain, the Bahamas, and Lithuania) and global operations encompassing Europe and the USA. 7. The Russian fishery operations came to be held under the Norebo Group, a Russian company, which was the subject of the Framework Agreement to come. The non-Russian fishery operations came to be held under Three Towns Capital Ltd, a Hong Kong company, which was the subject of the UP Judgment. It is clear that the Plaintiff and the Defendant are experienced and sophisticated international businessmen, and that they are in the position to hire whatever advisers they see fit to engage. 8. In late 2014, their relationship began to sour. In November 2015, the parties entered into an Initial Agreement for the sale of the Plaintiff’s Norebo Group Interest to the Defendant to be completed by 29 February 2016. 9. The Norebo Share Sale was not completed as planned. In mid-April 2016, the parties reached an Oral Agreement whereby the Defendant was to pay the Plaintiff US$2 million by 30th April 2017 as compensation for the former’s delay in completing the Sale. 10. On about 27 April 2016, a two-page draft written agreement was prepared to reduce the Oral Agreement to writing [1] . It was framed as a Loan Agreement with the Defendant having the liability to repay US$2 million to the Plaintiff by 30 April 2017. The Loan Agreement contained a choice of law clause in favour of Hong Kong law, under the heading “Governing Law – Jurisdiction”. 11. On 28 April 2016, the Framework Agreement was entered into between the Plaintiff, Defendant and three Russian corporate vehicles belonging to the Defendant. That Agreement contained an Arbitration Clause and a choice of law clause for English law. It was signed by, inter alia , the Plaintiff and Defendant with their respective legal advisers as witnesses. 12. The Plaintiff and Defendant also enter into a Deed of Undertaking dated 28 April 2016 as part and parcel of the Framework Agreement. 13. On about 30 April 2016, the Loan Agreement was entered into. However, the parties mistakenly used an earlier draft which provided incorrectly (under “Drawdown”) that the Loan would be made available to the Defendant after the execution of the Agreement. That error was previously noticed by the Plaintiff’s lawyer who suggested that the Defendant should acknowledge that the Loan “will be considered made available to [him] with effect from [the completion of the Framework Agreement]”. 14. On 6 May 2016, the Closing of the Framework Agreement took place and the Purchase Price was received by the Plaintiff in full. 15. In late 2016, with the souring of their relationship, the parties commenced multiple legal proceedings against one another, including the unfair prejudice proceedings. 16. On 9 May 2017, the Plaintiff commenced the present proceedings, seeking to enforce the Oral Agreement and the Loan Agreement, as well as rectification of the latter. 17. On 16 July 2018, the Plaintiff obtained leave to serve these proceedings on the Defendant outside jurisdiction upon the contentions that Hong Kong was the proper and appropriate forum based on (1) the Oral Agreement was governed by Hong Kong law; and (2) both of the parties had a close and real connection to Hong Kong as they used Hong Kong corporate vehicles to operate their non-Russian fishing business and disputes between them relating to those companies were being litigated in Hong Kong. Relevant clauses 18. Clause 28.2 of the Framework Agreement provided that: “[a]ny dispute arising out of or in connection with [the Framework Agreement], including any question regarding its existence, validity or termination, shall be referred to and finally resolved by arbitration under the LCIA Rules … The seat … of arbitration shall be London …”. 19. The Defendant also relies upon the Entire Agreement Clause (19.1) which provided that: “[the Framework Agreement] (together with the other Transaction Documents) constitutes the entire agreement and understanding between the Parties in respect of the subject matter of [the Framework Agreement] … [The Framework Agreement] supersedes any and all previous agreements or understandings (whether oral or written) relating to the subject matter of the Transaction Documents, which shall cease to have any further force or effect”. Law 20. S.20 of the Ordinance provides that: “[a] court before which an action is brought in a matter which is the subject of an arbitration agreement shall, if a party so requests not later than when submitting his first statement on the substance of the dispute, refer the parties to arbitration unless it finds that the agreement is null and void, inoperative or incapable of being performed.” 21. The pre-requisites for the application of s.20 are: (1) the existence of an arbitration agreement between the parties; (2) the arbitration agreement is capable of being performed; (3) there is in reality a dispute or difference between the parties; and (4) the dispute or difference is within the ambit of the arbitration agreement: see Tommy CP Sze & Co v Li & Fung (Trading) Ltd [2003] 1 HKC 418 , §§18-23 per Ma J (as he then was). 22. The burden of proof lies on the applicant to establish a prima facie or plainly arguable case that those pre-requisites have been satisfied: see PCCW Global Ltd v Interactive Communications Service Ltd [2007] 1 HKLRD 309 , §§49-51 per Tang VP (as he then was). As identified above, only the fourth criterion is in dispute. 23. The court does not usurp the function of the arbitrators, and unless the point is clear, the proceedings should be stayed for arbitration: see PCCW Global Ltd , §§59-61. 24. It is uncontroversial that the Arbitration Clause is to be construed in accordance with English law (being the applicable law of the Framework Agreement). However, there is no suggestion that for the present purpose there is any material difference between English and Hong Kong law. Stay Application 25. The Defendant’s case relies heavily upon the breadth of the Arbitration Clause (“dispute arising out of or in connection with [the Framework Agreement]”) as well as the Entire Agreement Clause (“supersedes … all previous agreements … relating to the subject matter of the Transaction Documents”). 26. It is accepted by the Plaintiff that the Loan Agreement is “broadly related to the Framework Agreement” [2] . However, it is argued that, despite the relationship, the Loan Agreement is separate and free-standing. 27. It is trite that the factual matrix and context are of key importance to the construction of contractual provisions: see Fully Profit (Asia) Ltd v Secretary for Justice (2013) 16 HKCFAR 351 , §15 per Ma CJ. I agree with the Plaintiff that in considering the factual matrix, this court would have regard to the fact that the parties are sophisticated businessmen and they were advised by lawyers: see McMeel on the Construction of Contracts , 3 rd edn, [5.54]-[5.55]. 28. One point which stands out from the factual matrix is that despite the Framework Agreement, the parties separately entered into the Loan Agreement (2 days after the former). That Loan Agreement could have been made part of the Framework Agreement, possibly in a separate but related Transaction Document like the Deed of Undertaking. 29. The timing and existence of the Loan Agreement take much of the wind out of the reliance on the Entire Agreement Clause, which cannot apply to an agreement made subsequent to the Framework Agreement. I have not lost sight of the fact that the Oral Agreement was made prior to the Framework Agreement, but the fact remains that the parties saw fit to have a separate document entered after the Framework Agreement to govern their agreement on the compensation. 30. Whilst it must be accepted that the wordings of the Arbitration Clause are embracing, it was pointed out by the Plaintiff that the Clause was not universally adopted in all the Transaction Documents: (1) Clause 8 of the Framework Agreement provided that the Defendant was to procure his corporate vehicles to execute share charges as security for his purchase price payment obligations; (2) Schedule 5 contained the form of the share charge to be executed; (3) Clause 15 of the share charge contained a choice of law in favour of Hong Kong law and an exclusive jurisdiction clause in favour of Hong Kong courts, contrary to the terms of the Arbitration Clause. 31. In contrast with the Share Charges, clause (8) of the Deed of Undertaking expressly incorporated the Arbitration Clause. Both the Share Charges and the Deed of Undertaking were part of the Transaction Documents under the Framework Agreement. 32. Not only was the Loan Agreement made after the Framework Agreement, it contained a choice of law clause which was different to that of the latter. The parties could easily have incorporated the Arbitration Clause if it was, as contended by the Defendant, intended that their disputes would be decided by a single forum. These circumstances militate against the suggestion that the Arbitration Clause applies to the disputes under the Loan Agreement (and/or the Oral Agreement) simply by reason of the relationship with the Framework Agreement. 33. Although I agree with the Defendant that the Loan Agreement did not contain a jurisdiction clause, the Plaintiff is right that a litigant is not to be deprived of his right to have a dispute decided by a court of law unless he has consciously and deliberately agreed that it should be so: see Carrier Hong Kong Ltd v Dickson Construction Co Ltd [2005] 4 HKC 142 , §12 per Burrell J. 34. The parties had chosen Hong Kong law as the governing law for the Loan Agreement. Although Hong Kong law is very similar to English law, certainly in relation to commercial disputes, the fact is that the parties had deliberately chosen Hong Kong law, as opposed to English law, to govern that Agreement. I see no real reason why it can be said, in the face of that choice, that they had agreed to refer the disputes under the Loan Agreement to arbitration in London with the application of English law. Even without an express choice of jurisdiction, at the very least, I see no justification to say that the parties had excluded Hong Kong courts as the appropriate forum to resolve the disputes under the Loan Agreement. 35. Further, the subject matter of the Loan Agreement, namely, compensation for the failure to complete the sale of the Plaintiff’s interest in the Norebo Group by 29 February 2016, can be seen as a free-standing matter to the Framework Agreement. That is consistent with the treatment of the subject matter under a separate agreement made after the Framework Agreement. 36. Finally, I agree with the Plaintiff that the “Fiona Trust Approach [3] ” – in construing an arbitration clause the court should start from the assumption that the parties, as rational businessmen, are likely to have intended any dispute arising out of the relationship into which they have entered or purported to enter to be decided by the same tribunal – does not assist the Defendant in this case. 37. First and foremost, there were more than one tribunal provided for dispute resolution under the Transaction Documents within the Framework Agreement. 38. In PT Thiess Contractors Indonesia v PT Kaltim Prima Coal [2011] EWHC 1842 (Comm) (14 July 2011) at §§36-37, Blair J observed : “… In Fiona Trust , however, the question was as to the scope of the disputes within an arbitration clause. In the present case, the application for a stay is made in the context of two agreements, one containing an arbitration clause, and the other a submission to the jurisdiction of the English courts … … The decision in Fiona Trust has limited application to the questions which arise where parties are bound by several contracts which contain jurisdiction agreements for different countries. There is no presumption that a jurisdiction (or arbitration) agreement in contract A, even if expressed in wide language, was intended to capture disputes under contract B; the question is entirely one of construction …” 39. In the case of Etihad Airways v Lucas Flother [2019] EWHC 3017 (Comm) (18 November 2019), which the Defendant relies upon heavily, it was held, inter alia , that (1) the Fiona Trust Approach was “potentially applicable” to a case involving multiple agreements, depending on whether they were part of a package of agreements which contained no competing jurisdiction clause; and (2) in ascertaining the parties’ intention, it was relevant to consider the closeness of the connection between the agreements (per Jacobs J at §69). 40. According to the analysis above, the connection between the subject matter of the Loan Agreement and the Framework Agreement cannot be said to be a close one. The former was about a failure to complete the transaction by an agreed date, and with the latter the transaction was set out in a comprehensive and complex set of legal documents. Further, the Loan Agreement is governed by Hong Kong law as opposed to English law. To adopt the metaphor used by Jacobs J, those Agreements can be seen as being in individual silos (§108), or free-standing. 41. In Trust Risk Group SpA v AmTrust Europe Ltd [2015] 2 Lloyd’s Rep 154, §46 per Beatson LJ, it was held that the Fiona Trust Approach was not applicable to a case “[w]here the overall contractual arrangements contain two or more differently expressed choices of jurisdiction and/or law in respect of different agreements” [emphasis added]. 42. In the premises, I hold that there is no prima facie case that the disputes in these proceedings are within the ambits of the Arbitration Clause. Set Aside Application 43. The assertion of automatic set aside (see para 3 above) falls away. 44. The Defendant has also boldly asserted that apart from claiming that Hong Kong law applies under the Loan Agreement, there is zero connecting factor which ties this Action to Hong Kong. However, the Defendant has failed to deal with the evidence referred to in para 17 above. 45. Further, the express choice of Hong Kong law in the Loan Agreement is generally a factor which renders Hong Kong the appropriate forum: see VTB Capital Plc v Nutritek International Corp [2013] 2 AC 337 at §46 per Lord Mance. 46. I am unable to find merits in this application. Conclusions 47. The Summons is dismissed. 48. Costs normally follow the event, and I am aware of no reason to depart from that general rule. However, I am troubled by the fact that all the affirmations in this application were made by solicitors as opposed to the parties (see Hong Kong Civil Procedure 2020 , vol 1, [41/5/4]). Some of the affirmations may be said to contain argumentative submissions. I invite the parties’ submissions to address these concerns, limited to no more than 3 pages (in normal font size and double-line spacing), to be lodged and served no more than 3 working days after the handing down of this Decision. I shall decide on the appropriate costs order after having considered those submissions. (Anthony Chan) Judge of the Court of First Instance High Court Mr Christopher Chain, instructed by Howse Williams, for the Plaintiff Mr William Wong SC and Mr Justin Lam, instructed by Boase Cohen & Collins, for the Defendant [1] According to the Statement of Claim, the written agreement was to “evidence and/or embody the Oral Agreement”. [2] Para 20 of the Plaintiff’s Skeleton Submissions. [3] Fiona Trust and Holding Corp v Privalov [2007] UKHL 40 , §13. Look up this case on Lawcite Noteup",
  "length": 18246,
  "headers_seen": [
    "Issues",
    "Background",
    "Relevant clauses",
    "Law",
    "Stay Application",
    "Set Aside Application",
    "Conclusions"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2020/525",
  "query": "seat of arbitration",
  "ts": "2025-10-16T10:49:33",
  "ok": true
}