{
  "title": "SHANGHAI FUSHENG SOYA FOOD CO LTD AND ANOTHER V. PULMUONE HOLDINGS CO LTD | [2014] HKCFI 894 | HKLII",
  "court": null,
  "year": 2014,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2014] HKCFI 894 SHANGHAI FUSHENG SOYA FOOD CO LTD AND ANOTHER V. PULMUONE HOLDINGS CO LTD Judgment Information Date 24 Apr, 2014 Action No. HCCT48/2012 Neutral Cit. [2014] HKCFI 894 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCCT48/2012 HCCT48/2012 SHANGHAI FUSHENG SOYA FOOD CO LTD AND ANOTHER v. PULMUONE HOLDINGS CO LTD HCCT 48/2012 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO 48 OF 2012 ____________ IN THE MATTER of Order 73 rule 5 of the Rules of the High Court ( Cap 4A ) and IN THE MATTER of an Arbitration Award dated 11 August 2012 in case No 17251/CYK made by the International Court of Arbitration, International Chamber of Commerce and IN THE MATTER of section 34C (4) of the Arbitration Ordinance ( Cap 341 ) and Article 34 of The UNCITRAL Model Law on International Commercial Arbitration _____________ BETWEEN SHANGHAI FUSHENG SOYA-FOOD CO, LTD (上海福生豆制食品有限公司) 1st Applicant SHANGHAI ZHANGXIAOBAO GREEN FOOD DEVELOPMENT CO, LTD (上海張小寶綠色食品發展有限公司) 2nd Applicant and PULMUONE HOLDINGS CO, LTD Respondent _____________ Before: Hon Mimmie Chan J in Chambers Date of Hearing: 1 April 2014 Date of Reasons for Decision: 25 April 2014 _________________________ REASONS FOR DECISION _________________________ Background 1. This is an application made by Shanghai Fusheng Soya-Food Co Ltd and Shanghai Zhangxiaobao Green Food Development Co Ltd (“ Applicants ”) to set aside an arbitration award dated 11 August 2012 made by the International Court of Arbitration, International Chamber of Commerce (“ Award ”) in case number 17251/CYK (“ Arbitration ”), on the ground that the Award is in conflict with the public policy of Hong Kong. After hearing the parties on 1 April 2014, I dismissed the application. The following are the reasons for my decision. 2. The Applicants and Pulmuone Holdings Co Ltd (“ Respondent ”) entered into a joint venture agreement (“ JV Agreement ”) to form a joint venture company (“ JV Company ”) to carry on the business of producing soya and other green food in China. 51% of the shares in the JV Company were held by the Respondent, and 49% of the shares were held by the Applicants. The JV Agreement provides for PRC law to be the governing law and for disputes to be arbitrated in Hong Kong. 3. Disputes arose between the parties under the JV Agreement in around September 2009. In May 2010, the Respondent commenced proceedings (“ Action No 80 ”) in the Shanghai No 2 Intermediate People’s Court (“ Shanghai Court ”), with the Applicants named as defendants and the JV Company named as third party. The Respondent claims that Action No 80 was brought by the Respondent on behalf of the JV Company, and was analogous to a derivative action since the JV Company was in the control of the Applicants. In Action No 80, claims were made against the Applicants for recovery and payment to the JV Company of the sum of RMB 19.4 million said to have been misappropriated by the Applicants and Mr Zhang (“ Zhang ”), the Chairman of the JV Company. 4. Action No 80 was contested by the Applicants. 5. On 6 July 2010, the Respondent also initiated the Arbitration, claiming that the Applicants were in repudiatory breach of the JV Agreement, and sought the dissolution of the JV Company, as well as payment of damages pursuant to the provisions of the JV Agreement. An arbitral tribunal was formed for the Arbitration on 14 October 2010 (“ Tribunal ”). 6. In the Arbitration, the Respondent complains (inter alia) that the Applicants had refused to establish a new factory for the joint venture in accordance with resolutions duly passed at board meetings of the JV Company, had wrongfully excluded the Respondent’s representatives from the management of the JV Company, had misappropriated funds of the JV Company in breach of the JV Agreement and the articles of the JV Company, and had failed to perform its obligations under the JV Agreement to inject capital into the JV Company. The amounts claimed by the Respondent in the Arbitration represent repayment of the funds it had invested in the JV Company, of approximately US$9 million, liquidated damages of US$261,799.30 in respect of the Applicants’ failure to inject capital into the JV Company, and interest. 7. The Applicants denied the claims made by the Respondent in the Arbitration, and asserted that it was the Respondent which had acted in breach of the JV Agreement by (inter alia) seizing the common seal of the JV Company, misappropriating funds of the JV Company and commencing vexatious litigation against the Applicants including Action No 80. The Applicants further counterclaimed for damages in respect of the Respondent’s breaches. 8. The substantive hearing of the Arbitration took place from 13 to 17 June 2011. 9. On 15 May 2012, the Shanghai Court handed down its judgment in Action No 80 (“ Judgment ”). In respect of the misappropriation claim made by the Respondent against the Applicants, it was held by the Shanghai Court that the Applicants had accounted for most of the transactions forming the basis of the claim for the RMB 19.4 million, but had failed to provide sufficient evidence in respect of a sum of RMB 1,892,807.90 which they had received from the JV Company. The Shanghai Court ordered the Applicants to repay the RMB 1,892,807.90 to the JV Company, with interest. The Applicants say that this was only a “discretionary repayment” as ordered. 10. On 14 June 2012, the Applicants wrote to the Tribunal to draw the attention of the Tribunal to the Judgment. This was after the parties’ receipt of a letter dated 6 June 2012 from the Tribunal, by which the Tribunal declared the Arbitration proceedings closed on 15 May 2012 (the last date on which the parties had filed submissions) pursuant to Article 22 of the ICC Rules of Arbitration. The Applicants pointed out in the letter of 14 June 2012 that the Judgment was provided for the Tribunal’s reference “to avoid any inconsistency”, since there was duplication in the issues decided in Action No 80 and the issues raised in the Arbitration. 11. The chairman of the Tribunal responded on 15 June 2012, stating that as the Tribunal had declared the Arbitration closed, the parties to the Arbitration could not make further submissions or produce further evidence, unless requested by the Tribunal. The Tribunal enquired with the Respondent as to whether it would consent to the new evidence of the Judgment being admitted, and the Respondent wrote on 15 June 2012 to state its objection. 12. On 11 August 2012, the Tribunal issued the Award, whereby the Tribunal ruled that the Applicants had repudiated the JV Agreement, that the JV Company should be dissolved, and that the Applicants should pay to the Respondent US$9,020,000 as damages, US$261,799.30 as repayment of capital, interest, and the costs of the Arbitration. 13. The Applicants now argue that the Award is contrary to the public policy of Hong Kong and should be set aside, since the Tribunal had turned a blind eye and had failed or refused to take note of the Judgment, and the fact that the Judgment in Action No 80 dealt with and decided the same issues which were raised in the Arbitration, which bind the Applicants and the Respondent in the Arbitration. The Applicants claim that the Award is contrary to the public policy that there should be finality in the resolution of disputes and that re-litigation on the same issues should be prevented. Applicable legal principles 14. The authorities are clear. “Contrary to public policy” is narrowly construed in the context of setting aside or refusing enforcement of an arbitral award under the Arbitration Ordinance and the Model Law. As the court observed in Qinhuangdao Tongda Enterprise Development [1993] 1 HKLR 173 , at 178, “it must not be seen as a catch-all provision to be used whenever convenient. It is limited in scope and is to be sparingly applied”. 15. In Hebei Import & Export Corp v Polytech Engineering Co Ltd (1999) 2 HKCFAR 111 , Sir Anthony Mason NPJ held (at p 130F) that “contrary to the public policy of that country” means “contrary to the fundamental conceptions of morality and justice of the forum”. In the same case, Bokhary PJ explained (at p 123H-I) that before a Convention jurisdiction can refuse enforcement of a Convention award on public policy grounds, “the award must be so fundamentally offensive to that jurisdiction’s notions of justice that, despite its being a party to the Convention, it cannot reasonably be expected to overlook the objection”. In A v R (Arbitration: Enforcement) [2009] 3 HKLRD 389 , Reyes J explained that if the public policy ground is to be raised, “there must be something more, that is, a substantial injustice arising out of an award which is so shocking to the court’s conscience as to render enforcement repugnant”. 16. In Grand Pacific Holdings Ltd v Pacific China Holdings Limited (in liq) (No 1) [2012] 4 HKLRD 1 , the Court of Appeal made it clear that in an application for setting aside an arbitral award under Article 34 of the Model Law, the court is only concerned with the structural integrity of the arbitration proceedings, since the remedy of setting aside is not an appeal as to the substantive merits of the dispute or the correctness or otherwise of the award. When dealing with the nature of errors which can be regarded as a violation of Article 34 (2) (a) (ii), i.e. inability to present one’s case, Tang VP highlighted (at paragraph 94 of his judgment) that the conduct complained of “must be serious, even egregious”, and that only a sufficiently serious error which has undermined due process would suffice (paragraph 105 of his judgment). There is no reason why a less stringent test should be applied in the consideration of whether an arbitral award is contrary to public policy by reason of any error or matter complained of in the process of the arbitration. 17. In the context of public policy, the courts have recognized that it is in the interests of public policy to uphold an agreement made between parties to submit their dispute to arbitration, and to enforce an arbitral award which is binding on the parties and enforceable under and in accordance with the international Convention. In A v R (Arbitration: Enforcement), the court observed: “Public policy itself leans towards the enforcement of foreign arbitral awards as a matter of comity. The parties agreed to resolve the disputes by arbitration, rather than through the court. They should be held to what they have agreed and be obliged to comply with an arbitration award. By choosing arbitration, the parties must be deemed to have undertaken the risk that an arbitrator might get matters wrong in his decision. An error (whether of law or fact does not matter here) by an arbitrator in an award cannot by itself counterbalance the public policy bias towards enforcement. If the public policy ground is to be raised, there must be something more, that is, a substantial injustice arising out of an award which is so shocking to the court‘s conscience as to render enforcement repugnant. Public policy is often invoked by losing party in an attempt to manipulate and enforcing court into the opening matters which have been (or ought to have been) determined in an arbitration. The public policy ground is thereby raised to frustrate or delay the winning party from enjoying the fruits of a victory. The court must be vigilant that the public policy objection is not abused in order to obtain for the losing party a second chance at arguing a case. To allow that to happen would be to undermine the efficacy of the parties’ agreement to pursue arbitration. That by itself would not be conducive to the public good. ” Effect of Action No 80 on the Arbitration 18. As Mr Jat on behalf of the Respondent has emphasized, Action No 80 was commenced by the Respondent in the nature of a derivative or representative action instituted on behalf of the JV Company, for repayment of RMB 19.4 million to the JV Company. In contrast, the Arbitration was commenced by the Respondent in its own right as a party to the JV Agreement, for discharge of the JV Agreement, dissolution of the JV Company and payment of compensation to the Respondent for the Applicants’ breach of the JV Agreement. The Respondent made no claim in the Arbitration for recovery of the RMB 19.4 million (which, if payable, is payable to the JV Company and not to the Respondent). Although the Respondent complained of various matters in the Arbitration, which matters include the Applicants’ alleged misappropriation or unauthorized use of funds of the JV Company, the alleged misappropriation or misuse of funds (including the amount of RMB 19.4 million) was only raised as a complaint to establish the Applicants’ breach of the JV Agreement and to support the Applicants’ claim for discharge of the JV Agreement and the dissolution of the JV Company. The Respondent did not seek any relief in the Arbitration for the Applicants’ payment to it of any of the sums alleged to have been misappropriated or misused by the Applicants (as it is not entitled so to claim). 19. The parties to the Arbitration, and the Tribunal itself, had been fully aware of the commencement and conduct of Action No 80. They were aware of the issues raised in those proceedings, and their relevance to and effect on the Arbitration, if any. The Applicants had referred to and relied on Action No 80 in the Arbitration, in the witness statement of Zhang filed on behalf of the Applicants, and had made submissions to the Tribunal on Action No 80. The Applicants in fact applied to strike out from the scope of the Arbitration matters which they claimed were duplicated in Action No 80. The striking out application was refused, as the Tribunal considered, and explained in the Award, that the disputes which were the subject matter of the other proceedings instituted by the Respondent (including Action No 80) were different in nature to the dispute in the Arbitration, that the Arbitration related to a dispute under the JV Agreement, involving the key issue of whether the Respondent had the right to discharge the JV Agreement, which issue is not the subject of the Respondent’s claim in Action No 80. The Tribunal accordingly took the view that Action No 80 would not have any effect on the Arbitration. 20. The Applicants sensibly abandoned their initial attempt to argue that they had been unable to present their case and to make submissions to the Tribunal on issues of res judicata, issue estoppel and collateral attack, raised as a result of the Judgment in Action No 80. Since they had knowledge of the existence of and issues in Action No 80 from the time of its commencement, they could have raised these issues in the Arbitration at any time even before the Judgment was handed down. They clearly had the opportunity to present to the Tribunal their case on Action No 80, and the likely issues and impact such proceedings may raise or have on the Arbitration and any award to be made. They did in fact deal with Action No 80 in the Arbitration (see the preceding paragraph), and did apply to strike out matters covered in Action No 80 from the scope of the Arbitration, but were unsuccessful. The Tribunal had considered the matter and found against the Applicants. An application to set aside an arbitral award should not be used as an opportunity to re-argue the case, or be treated as an appeal against orders made by the Tribunal. 21. On behalf of the Applicants, Mr Lam sought to argue their case on the basis that the Tribunal had refused to consider the Judgment after it was handed down and submitted by the Applicants, on the basis that it was new evidence and the Arbitration had been closed. Mr Lam argued that in so doing, the Award should be set aside as being against public policy in that the Tribunal had shut its eyes to the fact that, prior to the issue of the Award, the parties were bound by the findings made by the Shanghai Court in the Judgment, and in particular, the findings made by the Shanghai Court that the Applicants had not misappropriated RMB 19.4 million, as the Respondent claimed. Mr Lam submits that the findings of the Shanghai Court in the Judgment would have required the Tribunal to give effect to them in determining whether the Applicants were liable for breach of and repudiating the JV Agreement. If the Judgment had been considered by the Tribunal, it is claimed that there is a real possibility that the Award would have been different. Does res judicata or issue estoppel apply? 22. Mr Lam relies on issue estoppel: that the Shanghai Court has determined the issue of the Applicants’ alleged misappropriation of RMB 19.4 million, by finding that the Applicants had only failed to account for their use of RMB 1,892,807.90 of the funds of the JV Company. 23. The issues in dispute between the parties in the application before me are whether there is identity of the parties, or their privies, concerned in Action No 80 and in the Arbitration, and whether the issues decided in Action No 80 were the same as, or had any effect on, the issues determined by the Tribunal in the Arbitration. 24. Mr Jat argued that the Respondent had litigated in Action No 80 in a different capacity as it did in the Arbitration. In Action No 80, the Respondent was litigating in a representative capacity, on behalf of the JV Company which was under the control of the Applicants and Zhang. In the Arbitration, the Respondent was acting in a personal capacity and in its own right as a party to the JV Agreement. Res judicata does not apply, as the Judgment does not bind the Respondent in its personal capacity (paragraph 9.22, Spencer Bower and Handley: Res Judicata (4 th edition)). 25. Mr Lam relied on paragraph 9.47 of Spencer Bower and Handley , to argue that the court should be prepared to recognize the substantial identity between the JV Company and its controlling directors and shareholders, and that a company may be the privy of its shareholders in the context of res judicata estoppel, including issue estoppel. 26. In China North Industries Investment Ltd v Chum [2010] 5 HKLRD 1 , the Court of Appeal held that, for privy to apply in the context of issue estoppel: “The required commonality is a direct interest in the subject matter of the litigation, a parallel or corresponding interest in that subject matter and not simply a financial interest in the result of the action”. 27. The Respondent as a shareholder of the JV Company may have a financial interest in the outcome of Action No 80, and whether the JV Company can recover the amounts said to have been misappropriated by the Applicants, but I am not satisfied that the Respondent has any direct interest, legal or beneficial, in the subject matter of Action No 80. The misappropriated funds are the JV Company’s. The Respondent’s loss is merely a reflection of the loss suffered by the JV Company, and reflective losses are generally not recoverable at the suit of a shareholder ( Johnson v Gore Wood & Co [2002] 2 AC 1 ). 28. Mr Jat further sought to highlight that the Respondent’s complaint of the Applicants’ misappropriation or misuse of funds consisted of 3 separate incidents: the 1 st incident involving RMB 600,000, the 2 nd incident involving RMB 1.1 million, and the 3 rd incident relating to the JV Company’s acquisition of the shares of a company in Shanghai (“ Acquisition ”) involving RMB 19.4 million. Whereas the Shanghai Court found that the Applicants had failed to prove that it had accounted for or repaid the sum of RMB 1,892,807.90 to the JV Company, the Respondent argued that the Shanghai Court only made a finding on the 2 nd incident of alleged misappropriation, and did not make any finding on the issue of the Respondent’s complaint regarding the 3 rd incident, and the alleged misappropriation of RMB 19.4 million by the Applicants. The Respondent therefore argued that there is in fact no inconsistency between the Award and the Judgment, so far as the findings are concerned. 29. Mr Lam argued that for issue estoppel to apply, all that is required is for there to be an overlapping of common issues between common parties, and inconsistency per se is not a requirement. Even if he is right on that, I consider that the question of whether there are inconsistent findings in the Judgment and the Award is highly relevant to the question of whether the Judgment is material, and whether it would have affected the Award and the issues to be decided in the Arbitration. The substance of the Judgment made in Action No 80 30. The allegations made by the Respondent against the Applicants in Action No 80 are that the Applicants had received or diverted funds of the JV Company, including the sum of RMB 19.4 million intended for the Acquisition. Under the Judgment, the Shanghai Court found the Applicants liable to pay RMB 1,892,807.90 to the JV Company. 31. The Applicants claim that the amount of RMB 1,892,807.90 so found against the Applicants is less than 10% of the sum of RMB 19.4 million which formed the crux of the Respondent’s misappropriation claim relating to the Acquisition. The substance of the Award made in the Arbitration 32. It is pertinent to note the substance of the Award and the findings made by the Tribunal. In summary, the Tribunal found that the Respondent was entitled under the Contract Law of the PRC to terminate the JV Agreement as a result of the Applicants’ breach of the JV Agreement. The Tribunal found that the JV Company should be dissolved, and that the Applicants should pay to the Respondent damages represented by the capital which the Respondent had paid into the JV Company, interest, and liquidated damages calculated in accordance with the JV Agreement for the Applicants’ breach. 33. In paragraph 235 of the Award, the Tribunal explained that in unilaterally terminating the services of the General Manager of the JV Company and dismissing the Chief Financial Officer of the JV Company, the Applicants had committed a serious breach of contract, and that when this is considered in conjunction with the Applicants’ other acts of breach of contract, including their failure to act in accordance with the resolutions of the board of directors of the JV Company, their refusal to convene directors’ meetings, their misuse or misappropriation of funds of the JV Company, and their failure to discharge their duties to inject capital into the JV Company, the Applicants had deprived the Respondent of the right to participate in the management of the JV Company, caused the JV Company to be unable to carry on its operations in accordance with the JV Agreement, and rendered it impossible to implement the objectives under the JV Agreement. On that basis, the Tribunal found that the Respondent was entitled to exercise its rights under article 94 (4) of the Contract Law to discharge the JV Agreement. 34. Even if the Tribunal had considered the Judgment prior to its Award, and had taken into account the finding of the Shanghai Court that the Respondent’s complaint regarding the alleged misappropriation of RMB 19.4 million had not been proved and that the Applicants were not held liable therefor, I have very little doubt from reading the Award that the Tribunal would have come to the same conclusions which it did, as set out in paragraph 235 of the Award. 35. It should be borne in mind that in relation to the complaint of the alleged misappropriation of the funds of the JV Company, the Tribunal made it clear in paragraphs 219 to 221 of the Award that in its view, both the Applicants and the Respondent had misappropriated or misused funds of the JV Company. The Tribunal considered that the Respondent had used RMB 1.3 million of the funds of the JV Company without the approval of the Chairman of the board of directors, and that on its part, the Applicants had misappropriated RMB 1.1 million of the funds of the JV Company, such that both instances constituted breaches of the agreed procedures and the articles of the JV Company. The Tribunal had clearly considered the extent of the involvement of both the Applicants and the Respondent in the alleged misappropriation and misuse of funds, in the overall context of its determination of the Applicants’ breach of contract. In my view, the Applicants have exaggerated the impact of the Judgment, and the findings of the Shanghai Court on the complaint made by the Respondent that the Applicants were guilty of misappropriation to the extent of RMB 19.4 million, and any effect such Judgment may have on the Tribunal and its Award. 36. On a plain reading of paragraph 235 and the findings made by the Tribunal, it is clear that the Tribunal came to its conclusion that the Applicants were in repudiatory breach of the JV Agreement, after taking into consideration all factors, the Applicants’ misuse of RMB 1.1 million of the funds of the JV Company being only one of such factors. Whether the Award is contrary to public policy 37. Against the background described in the preceding paragraphs, can it be said that the Award is contrary to the public policy of Hong Kong? In my view, there is nothing shocking to the court’s conscience, nothing offensive to our notions of justice and morality, to permit the Respondent to enforce the Award. 38. The Applicants complain that it is contrary to public policy to allow the Respondent to re-litigate and reopen the issue of the alleged misappropriation of RMB 19.4 million decided in the Shanghai Action. As mentioned in paragraph 19 above, the Applicants had been aware of the commencement and conduct of Action No 80 and the issues raised therein. They had participated in both Action No 80 and the Arbitration with such knowledge. They had been given the opportunity to make submissions in the Arbitration on Action No 80, any duplication of issues raised in the Arbitration and Action No 80, and the effect which Action No 80 (and any judgment which may be made in Action No 80) may have on the Arbitration, and they did make such submissions. They applied for a striking out in the Arbitration, which was determined by the Tribunal (rightly or wrongly). The Tribunal was aware of the issues raised in Action No 80, and decided that they had no relevance to or effect on their award in the Arbitration. The issues decided in the Arbitration and the findings made in the Award in relation to the Applicants’ breach of the JV Agreement, its termination and the dissolution of the JV Company, are distinct from the issues of the Applicants’ misappropriation of the funds of the JV Company, as decided in Action No 80. 39. In my view, this is not a case which cries out for setting aside the Award on the ground that it is an affront to the administration of justice, or that to enforce the Award would be to violate the most basic notions of morality and justice of the Hong Kong Court. There is no serious breach which has undermined due process, the Applicants had a fair opportunity to present their case on all the issues raised in the Arbitration, and I can find no injustice caused to the Applicants as a result of the existence or effect of the Judgment. Discretion 40. The Ordinance and the Convention give effect to the principles of finality and comity by prohibiting recourse to a court against an arbitral award, except in the cases for which they provide in Article 34 of the Model Law. Article 34 (2) only provides for the grounds on which an arbitral award “ may be set aside”. The courts have a residual discretion to enforce an award despite the proven existence of a valid ground. 41. Even if it can be established that the Tribunal had erred in failing to give due regard to the Judgment, for the reasons set out in paragraph 38 above, I consider that the Judgment has no material effect on the Award, and that there is no doubt that by reason of the matters set out in paragraph 235 of the Award, the Tribunal would have come to the same conclusion even if it had paid heed to the findings made by the Shanghai Court in the Action that the Applicants had not misappropriated the RMB 19.4 million as the Respondents claim. I am not satisfied that the Applicants had been prejudiced as a result of any such error, and will not exercise my discretion to set aside the Award. 42. Not being satisfied that the Award is in conflict with public policy, I see no reason to suspend the setting aside proceedings (as the Applicants suggested), and to remit the Award to the Tribunal for it to consider the Judgment and to take other action. Orders made 43. For all the above reasons, the application was dismissed, and in the absence of any special circumstances having been made out by the Applicants in respect of their unsuccessful challenge of the Award, I ordered that the Applicants pay the Respondent’s costs of the application to set aside, on indemnity basis, with certificate for 2 Counsel. (Mimmie Chan) Judge of the Court of First Instance High Court Mr Douglas Lam and Mr Kerby Lau, instructed by DLA Piper Hong Kong, for the 1 st and 2 nd applicants Mr Jat Sew Tong SC and Ms Zabrina Lau, instructed by Stevenson, Wong & Co, for the respondent Look up this case on Lawcite Noteup",
  "length": 29383,
  "headers_seen": [
    "Background",
    "Applicable legal principles",
    "Effect of Action No 80 on the Arbitration",
    "Does res judicata or issue estoppel apply?",
    "The substance of the Judgment made in Action No 80",
    "The substance of the Award made in the Arbitration",
    "Whether the Award is contrary to public policy",
    "Discretion"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2014/894",
  "query": "Model Law",
  "ts": "2025-10-15T11:34:51",
  "ok": true
}