{
  "title": "AMERICAN INTERNATIONAL GROUP, INC AND ANOTHER V. HUAXIA LIFE INSURANCE CO LTD | [2016] HKCFI 2077 | HKLII",
  "court": null,
  "year": 2016,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2016] HKCFI 2077 AMERICAN INTERNATIONAL GROUP, INC AND ANOTHER V. HUAXIA LIFE INSURANCE CO LTD Judgment Information Date 5 Dec, 2016 Action No. HCCT60/2015 Neutral Cit. [2016] HKCFI 2077 Download MS Word Judgment Reading Options Translation Toggle Highlight Appeal History HCCT60/2015 HCCT60A/2015 AMERICAN INTERNATIONAL GROUP, INC AND ANOTHER v. HUAXIA LIFE INSURANCE CO LTD HCCT 60/2015 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO 60 OF 2015 ______________ IN THE MATTER of Order 73 rule 5 of the Rules of the High Court ( Cap 4A ) and IN THE MATTER of Arbitration Award dated 23 September 2015 in Case No 20025/RD (c. 20026/RD) made by the International Court of Arbitration, International Chamber of Commerce and IN THE MATTER of section 81 of the Arbitration Ordinance ( Cap 609 ) and Article 34 of The UNCITRAL Model Law on International Commercial Arbitration ______________ BETWEEN AMERICAN INTERNATIONAL GROUP, INC 1st Plaintiff AIG CAPITAL CORPORATION 2nd Plaintiff and HUAXIA LIFE INSURANCE CO LTD Defendant ______________ Before : Hon Mimmie Chan J in Chambers (Open to Public) Date of Hearing : 5 December 2016 Date of Reasons for Decision: 6 December 2016 _________________________ REASONS FOR DECISION _________________________ 1. The Plaintiffs seek leave to appeal against my Decision of 30 August 2016, refusing to set aside a Hong Kong arbitral award of 23 September 2015 (“ Award ”). After hearing submissions from the parties, the application for leave to appeal was dismissed. The following are my reasons. 2. The Plaintiffs argued that I had erred by failing to make any finding in the Decision as to whether the Majority of the Tribunal had erred as a matter of New York law in respect of their findings in the Award, and that this was necessary before I can decide whether, by reason of such error and all the circumstances of the case, the Majority had consciously disregarded the governing New York law in reaching its decision contained in the Award. 3. I do not agree that any such failure is material. Even at the hearing on 5 December 2016, Leading Counsel for the Plaintiffs accepted in the submissions made that the essential issue was whether, on the totality of the evidence, the Majority had consciously disregarded New York law. Paragraph 12 of the Decision sets out the question for determination (and decided) on the application before the Court in August 2016: whether the errors of law contended by the Plaintiffs to have been made by the Majority amount to their “conscious disregard” of the agreed New York law, in order to reach the equitable or fair decision which the Majority intended to make. 4. At the hearing in August 2016, the Plaintiffs accepted that it must be shown that the circumstances of the case give rise to a clear inference that the Majority made its erroneous findings of fact, in conscious disregard of New York law, and intentionally reached the result contrary to New York law which is comported by their own notions of justice and equity. It was to that extent that the Plaintiffs argued that the Tribunal had exceeded its mandate. 5. In paragraph 23 of the Decision, I had made it clear that on a review of the US authorities, my view was that the Majority had considered the relevant decisions, and had made a genuine effort to analyze the cases in question and to apply what the Majority understood to be the case law, rightly or wrongly, and that I was not satisfied that the Majority had distorted New York law or the relevant legal principles. 6. In paragraph 26 of the Decision, it was further pointed out that even if the Majority had made errors of law, as the Plaintiffs contended, applying the principles set out in Nina Kung v Wang Dan Shin (2008) 8 HKCFAR 387 and HKSAR v Lee Ming Tat & Securities and Futures Commissi on (2003) 6 HKCFAR 336 , it was not open to this Court to infer, from any error which the Majority may have made, that the Majority had made a conscious and deliberate choice to ignore New York law and to come to their own perception of a fair result. There was simply no factual basis and no admissible evidence, whether direct or indirect, in all the circumstances of the case, in support of such an inference. 7. There is no question that the standard of “conscious disregard”, as advocated by the Plaintiffs, was applied in the determination. 8. I am not satisfied that there are any arguable grounds of appeal which have any reasonable prospects of success. Even if there is no mandatory requirement for the “reasonable prospect of success” test for an appeal referred to in s 81 (4) of the Arbitration Ordinance , it does not mean that the need to show reasonable prospects of success for the intended appeal does not arise. Such was the test considered by the Court of Appeal in China International Fund Ltd v Denis Lau & Ng Chun Man & Architects & Engineers (HK) Ltd [2015] 4 HKLRD 609 . 9. The clear objectives and aims of the Arbitration Ordinance are to facilitate the fair and speedy resolution of disputes by arbitration without unnecessary expense. The parties to an arbitration agreement have agreed to accept an arbitral award as final and binding, and that recourse to the courts should be limited. Having to show reasonable prospects of success should be required, before leave is granted to a party to appeal against a decision made by the Court under the Arbitration Ordinance under s 81(4), or s 84(3) . 10. Further, in view of the objectives of the Arbitration Ordinance , I do not agree that the Court of Appeal would be prepared to take a more rigorous role in addressing the evidence on an appeal from an order made under s 81 of the Arbitration Ordinance . 11. For all the above reasons, I was not persuaded that the Plaintiffs can establish that there are reasonable prospects of success in their intended appeal. Balancing the amount of the Award with the merits of the proposed appeal and the principles and objectives of the Arbitration Ordinance , I was not satisfied that leave to appeal should be granted, and accordingly dismissed the application for leave, with costs to the Defendant on an indemnity basis. (Mimmie Chan) Judge of the Court of First Instance High Court Mr Russell Coleman SC, instructed by Morrison & Foerster, for the 1 st & 2 nd plaintiffs Mr Ambrose Ho SC and Mr Jean-Paul Wou, instructed by Deacons, for the defendant Look up this case on Lawcite Noteup",
  "length": 6539,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2016/2077",
  "query": "Model Law",
  "ts": "2025-10-15T11:34:54",
  "ok": true
}