{
  "title": "BERTE NARCISCO JR. ESPEJON V. COMPASS TECHNOLOGY CO LTD AND ANOTHER | [2009] HKDC 225 | HKLII",
  "court": null,
  "year": 2009,
  "date": null,
  "content": "HKLII Databases District Court [2009] HKDC 225 BERTE NARCISCO JR. ESPEJON V. COMPASS TECHNOLOGY CO LTD AND ANOTHER Judgment Information Date 15 Sep, 2009 Action No. DCCJ3501/2008 Neutral Cit. [2009] HKDC 225 Download MS Word Judgment Reading Options Translation Toggle Highlight Appeal History DCCJ3501/2008 DCCJ003498A/2008 TEMPRA Virginia Pido v. COMPASS TECHNOLOGY CO LTD AND ANOTHER DCCJ 3498/2008 IN THE DISTRICT COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION CIVIL ACTION NO. 3498 OF 2008 ____________ BETWEEN TEMPRA Virginia Pido Plaintiff and COMPASS TECHNOLOGY COMPANY LIMITED 1 st Defendant WILLIAM M TOLEDO 2 nd Defendant * * * DCCJ 3499/2008 IN THE DISTRICT COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION CIVIL ACTION NO. 3499 OF 2008 ____________ BETWEEN SEBASTIAN Jonathan San Pedro Plaintiff and COMPASS TECHNOLOGY COMPANY LIMITED 1 st Defendant WILLIAM M TOLEDO 2 nd Defendant * * * DCCJ 3500/2008 IN THE DISTRICT COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION CIVIL ACTION NO. 3500 OF 2008 ____________ BETWEEN ORDONA Rizalindo Jacildone Plaintiff and COMPASS TECHNOLOGY COMPANY LIMITED 1 st Defendant WILLIAM M TOLEDO 2 nd Defendant * * * DCCJ 3501/2008 IN THE DISTRICT COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION CIVIL ACTION NO. 3501 OF 2008 ____________ BETWEEN BERTE Narcisco Jr. Espejon Plaintiff and COMPASS TECHNOLOGY COMPANY LIMITED 1 st Defendant WILLIAM M TOLEDO 2 nd Defendant * * * DCCJ 3502/2008 IN THE DISTRICT COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION CIVIL ACTION NO. 3502 OF 2008 ____________ BETWEEN PERALTA Eugenio Sarmiento Plaintiff and COMPASS TECHNOLOGY COMPANY LIMITED 1 st Defendant WILLIAM M TOLEDO 2 nd Defendant * * * DCCJ 3503/2008 IN THE DISTRICT COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION CIVIL ACTION NO. 3503 OF 2008 ____________ BETWEEN OGDAMIN Roel Mark Franco Plaintiff and COMPASS TECHNOLOGY COMPANY LIMITED 1 st Defendant WILLIAM M TOLEDO 2 nd Defendant * * * DCCJ 3504/2008 IN THE DISTRICT COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION CIVIL ACTION NO. 3504 OF 2008 ____________ BETWEEN CORNEL Antonio JR. Belandres Plaintiff and COMPASS TECHNOLOGY COMPANY LIMITED 1 st Defendant WILLIAM M TOLEDO 2 nd Defendant * * * DCCJ 3505/2008 IN THE DISTRICT COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION CIVIL ACTION NO. 3505 OF 2008 ____________ BETWEEN ALGIRE Lester Llanto Plaintiff and COMPASS TECHNOLOGY COMPANY LIMITED 1 st Defendant WILLIAM M TOLEDO 2 nd Defendant * * * Coram: His Hon Judge Leung in chambers (open to public) Date of hearing: 10 September 2009 Date of decision: 10 September 2009 Date of handing down reasons: 16 September 2009 REASONS FOR DECISION 1. In these actions, the Plaintiffs (“ the employees ”) claim in tort of conspiracy. On 20 August 2009, I handed down my decision in the applications by the 1 st Defendant (“ Compass ”) to strike out the amended statements of claim in each of these 8 actions. I dismissed the applications with costs to the employees and gave the consequential directions for the further conduct of these cases (“ the Decision ”). 2. Compass applied for leave to appeal which I gave at the end of the hearing. This is an unusual case involving a cause of action not often argued in Hong Kong. I therefore indicated that I would state my brief reasons for granting leave. Leave to appeal 3. Leave to appeal shall not be granted unless this court is satisfied that the appeal has a reasonable prospect of success or there is some other reason in the interests of justice the appeal should be heard: see section 63A of the District Court Ordinance (“ the Ordinance ”). 4. I do not propose to repeat here the background set out in paragraphs 4 to 11 of the Decision. I also adopt the same abbreviations and expressions defined in the Decision. 5. The grounds of the intended appeals are contained in the draft notices of appeal attached to the summonses for leave. Essentially they are as follows: (1) The employees have no viable cause of action in reliance of the conspiracy to which each of the employees was party. (2) They have no viable claim based on the tort of conspiracy. (3) The actions are abuse of process. 6. Miss Lau repeated the contention that the claims amount to a collateral attack on the findings at the criminal trial in which Toledo was convicted of conspiracy to defraud the Immigration Department. She emphasized the abusive nature of the employees’ claims to enforce the 1 st contracts which the employees knew to be bogus. 7. If the employees are indeed seeking to enforce the 1 st contracts or to claim the benefits of the 1 st contracts, then this court’s observation does not really differ from Miss Lau’s contention: see paras.17; 20-28; 32 of the Decision. But the contention on behalf of Compass that I differed from is this: It was argued, and Miss Lau also repeated, that the employees could not claim to be the victims of a conspiracy to which they were parties, and that they had not suffered any pecuniary loss to found the cause of action in the tort of conspiracy. 8. I understand the employees’ case to be that their agreeing to take part in defrauding the Department and hence their coming to work in Hong Kong all flowed from the conspiracy between Compass and Toledo. While the employees knew that they were representing to the Department the false salaries to obtain the employment visas, there is no suggestion that they had ever confessed knowing the meaning or significance of the false salaries in terms of the entitlement of imported workers independent of the 1 st contracts (though the salaries under the 1 st contracts might provide the measure of such entitlement and therefore the extent of their loss): see paras. 33-35; 38-39; 42-45 of the Decision. 9. The question turns on the proper understanding of the cause of action in conspiracy and whether the pleadings of the employees, as they now stand, permit the case being run by the employees as discussed in the preceding paragraph. I decided not to rule out a reasonable prospect of success in the intended appeal concerning this question. Stay of proceedings 10. Compass also applied for stay of proceedings in these actions pending the determination of the appeals. 11. The jurisdiction of this court to stay proceedings on its own motion or upon application comes from section 48(5) of the Ordinance. I accept Miss Lau’s submission that in considering such an application, the court has to balance the convenience and fairness between the parties as well as to ensure logical and fair case management: see Tan Man Kou & Anor v Chime Corp Ltd , HCMP 4146/2001, 11 March 2005. 12. A stay of proceedings would cause prejudice to the employees in terms of delay. Yet the ramification of the appeals, if allowed, may well suggest an abuse of process by the employees. Allowing the proceedings to continue and Compass and the employees (who are supported by public fund) to incur further costs in view of such contingency is undesirable. On balance, I think it is appropriate to maintain the status quo by staying the proceedings in these actions pending the determination of the appeals. But there will be liberty to apply in case of material change in circumstances. The order 13. I gave leave to appeal. I granted the stay of proceedings pending the determination of the appeal with liberty to apply. Costs of these applications were ordered to be in the cause of the appeal with certificate for counsel. I add that the employees’ own costs shall be subject to legal aid taxation. Simon Leung District Judge Mr Melville T C BOASE of Messrs Boase Cohen & Collins for the Plaintiffs in all the actions upon the assignment of the Director of Legal Aid Miss Queenie LAU instructed by Messrs Lovells for the 1st Defendant in all the actions Appeals by the plaintiffs to Court of Appeal allowed. Please refer to CACV210/2009 dated 17 March 2010 Look up this case on Lawcite Noteup",
  "length": 7946,
  "headers_seen": [
    "Leave to appeal",
    "Stay of proceedings",
    "The order"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkdc/2009/225",
  "query": "stay of proceedings",
  "ts": "2025-10-14T11:23:22",
  "ok": true
}