{
  "title": "HKSAR V. EKSTROM PATRIK TOBIAS | [2024] HKCFI 3592 | HKLII",
  "court": null,
  "year": 2024,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2024] HKCFI 3592 HKSAR V. EKSTROM PATRIK TOBIAS Judgment Information Date 10 Nov, 2024 Action No. HCCC272/2023 Neutral Cit. [2024] HKCFI 3592 Download MS Word Judgment Reading Options Translation Toggle Highlight Appeal History HCCC272/2023 HCCC272A/2023 HKSAR v. EKSTROM PATRIK TOBIAS HCCC 272/2023 [2024] HKCFI 3592 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CRIMINAL CASE NO 272 OF 2023 ________________________ HKSAR v Ekstrom Patrik Tobias ________________________ Before: Recorder Derek Chan, SC Date: 11 November 2024 at 5.02 pm Present: Ms Diane M Crebbin, on fiat, for HKSAR Mr Simon S Y So and Mr Herman Ho Yui-ming, instructed by Kingston Tong & Co, for the accused Offence: (1) Rape (強姦) (2) Non-consensual buggery (未經同意下作出肛交) ______________________________ Transcript of the Audio Recording of the Sentence in the above Case ______________________________ COURT: On 22 August 2024, the defendant was convicted by a jury of one count of rape, contrary to section 118 (1) of the Crimes Ordinance , Cap 200 , that is Count 1. The defendant was also convicted by a jury of one count of non-consensual buggery, contrary to section 118A of the Crimes Ordinance , Cap 200 , that is Count 2. I sentence on the basis that X’s testimony had been accepted by the jury, and the defendant’s testimony had been rejected by the jury. At around 11.24 pm on 27 October 2022, the defendant returned to his house in Unir Garden in Shek O. There is no dispute that the defendant’s wife and the defendant’s children had departed for Japan earlier that day, and there were only X, the defendant’s stepfather, who had been referred to as “uncle” during the trial and the driver in the house at the time. After the defendant returned home, the defendant said to X, his domestic helper, that he wanted to have sex with her. X said no repeatedly. The defendant then threatened to kill her and hit her. The defendant then grabbed X’s shoulders and dragged X upstairs to the master bedroom. Inside the master bedroom, the defendant undressed X, pushed her down onto the bed, forced her legs open and inserted his penis into her vagina without her consent. X kept telling the defendant that she did not want to do it. After about 4 to 5 minutes, the defendant turned X over and had anal intercourse with X without her consent. After that, the defendant pulled her down from the bed and tried to force X to have oral sex, which X refused. The defendant did not ejaculate in the process. The defendant did not wear a condom. After the incident, X went back to her room in the basement and cried. She left the house at 7 am on a taxi and went straight to Wan Chai Police Station to make a report of rape. X was examined by a forensic pathologist at around 4.50 pm that same day. The forensic pathologist found no injuries to X’s body or her private parts. The Victim Impact Report A victim impact report was obtained for an assessment of X’s mental and psychological condition. X was greatly affected after experiencing the sexual assault incident. She manifested various symptoms associated with post-traumatic stress reactions, such as nightmares, insomnia, and frequent flashback of the incident. X found it difficult to regulate her emotions and reportedly experienced low mood for an extended period of time. She also suffered from various somatic symptoms, such as palpitations and sweating. X also spent extended time in women shelters after the incident, unable to earn any income and isolated from her daughters who were in India. X had undergone extensive therapy and post-incident counselling, with X describing it as a difficult period, but that has helped her in managing the negative psychological impact arising from the incident. The psychologist opined that X appeared to have moved past the adverse effects of the incident. X’s clear understanding of accountability, her religious beliefs, the empowerment gained from her disclosure, the assistance she received from professionals, have all facilitated her development of post-traumatic growth despite the tremendous psychological impacts she encountered post-incident. Background of the Defendant The defendant is now 36 years old and was 33 years old at the time of the offence. He was married in 2017 and has three children. Since October 2022, his wife and children left the defendant and resided in Japan. The defendant studied in Sweden for his primary and secondary education. In 2010, the defendant studied one year in Shanghai Donghua University, and then he moved to Hong Kong to study at City University. The defendant had built up his own successful business in Hong Kong in the wholesale and distribution of electronics. At the time of the offence, the defendant’s wife had just left him and took their children to Japan. The defendant also had to take care of his stepfather who was living with him at the time. The defendant’s stepfather passed away in December 2022. As at the date of the offence, the defendant had one previous conviction of drunk driving in 2013. Psychiatric and Psychological Reports of the Defendant I have obtained a psychological report and a psychiatric report in respect of the defendant. The defendant reported that he was heterosexual and denied having any features of paraphilia. Both reports noted the defendant’s history of alcohol abuse, and in around November, which was November 2022 which was around a month after the incident, the defendant had been diagnosed with Bipolar Affective Disorder, severe manic episode with psychotic behaviour, alcohol dependent syndrome, and harmful use of psychoactive substances. It was noted that the defendant’s mental status appeared to have been unstable since mid-2022, when the defendant began to experience a number of stressors, including problems related to his business, his deteriorating relationship with his wife, and his stepfather’s health issues. The defendant resorted to alcohol and substance abuse, which in turn led to his mental health deterioration. In particular, the psychiatric report noted that the defendant had manic features for two months leading to his diagnosis in around November 2022, including elated mood, increase in energy, excessive talkativeness, and increased sex drive. The psychological report noted that, at the time of the incident, the defendant had an intense feeling of abandonment from his wife and having sex with X was the way the defendant used to cope with his negative emotions. It was noted in both reports that the defendant had since abstained from alcohol and substance abuse, his mental state had stabilised over the past year, and he is willing to continue receiving psychiatric follow-up. On the other hand, both reports also noted the defendant’s denial of the present offence and expressed no remorse. The psychologist noted that the defendant minimised the harm done to X, and assessed the defendant’s sexual reoffending risk to be on the higher end of the moderate range. Mr So invited this court to reject the psychologist’s assessment of the defendant’s risk of reoffending, on the basis that the defendant has now recovered from his mental health issues. However, the psychologist’s assessment was not entirely based on the defendant’s mental health issues, but on the basis of the defendant’s “persistent sense of loneliness and abandonment, his impulsive tendency, sexualised preoccupation and using sex as coping” as the salient risk factors. I therefore see no basis for rejecting the psychologist’s assessment. I do, however, accept that, at around the time of the offence, the defendant was faced with a significant number of stressors in his life, and it does appear from the psychiatric and psychological reports that he had difficulty coping with these stressors and his life was spiralling out of control, culminating in the diagnosis of a Bipolar Affective Disorder, severe manic episode with psychotic behaviour. I accept that the defendant’s mental state played a part in the defendant’s commission of the present offences. Sentencing Considerations In HKSAR v Chan Tung Hing, Band [2010] HKCA 58 at paragraph 11, the Court of Appeal observed that “in a relationship of employer and domestic helper, it is often the case that the helper is in a particularly vulnerable position. Not only is the helper financially dependent on the employer, the helper will be far away from her home country and her immediate family. We view the preying on such persons particularly seriously”. I have also had particular regard to the case of HKSAR v Lo Cheung On [2002] HKCA 138 , which also involved the rape of a domestic helper. Mr So has drawn this court’s attention to the sentences imposed in a number of other cases involving the rape of domestic helpers. I did not find those cases to be helpful as the sentences were only mentioned in judgments concerning appeals against conviction, and there were no analysis on the sentences that were passed. In considering the appropriate sentences in the present case, I considered the following eight factors to be relevant: (1) The gross breach of trust, as the defendant was obviously in a position of power and influence over X. (2) X was particularly vulnerable. X was in a foreign country, lived in the defendant’s residence, and had no other place to go. This was her first job in Hong Kong. The defendant was aware that X was vulnerable and took advantage of her position as an employee who had a strong reliance on the job, and threatened to fire X and cancel her visa if she did not comply with his request for sexual intercourse. (3) The defendant did not use a condom, but I also take into account the evidence that the defendant did not ejaculate. (4) Some violence was used, with the evidence indicating that the defendant had dragged X from the ground floor corridor up to the master bedroom, and that the defendant had threatened to hit and kill X. However, this has to be balanced with the fact that no physical injuries were found on X. (5) The age difference between the defendant and X is minimal. (6) There is nothing to indicate that the incident was pre-planned. The defendant was at the time going through a tough time in his life, with his wife taking their children to Japan and leaving the defendant just shortly before the commission of the present offences. It was likely that his later diagnosis of Bipolar Affective Disorder relatively shortly after the commission of the offence had affected his mental state at the time. (7) X suffered from post-traumatic stress symptoms, although X is gradually recovering. (8) The defendant’s sexual reoffending risk was assessed to be on the higher end of the moderate range. Taking the above factors in the round, I consider the appropriate sentences to be 7 years’ imprisonment for Count 1, and 4 years’ imprisonment for Count 2, with the sentences to be served concurrently as both counts arise from a single incident. Defendant, I sentence you to a total of 7 years’ imprisonment. Look up this case on Lawcite Noteup",
  "length": 11123,
  "headers_seen": [
    "The Victim Impact Report",
    "Background of the Defendant",
    "Psychiatric and Psychological Reports of the Defendant",
    "Sentencing Considerations"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2024/3592",
  "query": "drunk driving",
  "ts": "2025-10-17T10:42:23",
  "ok": true
}