{
  "title": "ASTRO NUSANTARA INTERNATIONAL B.V. AND OTHERS V. PT AYUNDA PRIMA MITRA AND OTHERS | [2016] HKCA 595 | HKLII",
  "court": null,
  "year": 2016,
  "date": "2003-01-02",
  "content": "HKLII Databases Court of Appeal [2016] HKCA 595 ASTRO NUSANTARA INTERNATIONAL B.V. AND OTHERS V. PT AYUNDA PRIMA MITRA AND OTHERS Judgment Information Date 4 Dec, 2016 Action No. CACV272/2015 Neutral Cit. [2016] HKCA 595 Download MS Word Judgment Reading Options Translation Toggle Highlight Appeal History CACV272/2015 CACV272/2015 ASTRO NUSANTARA INTERNATIONAL B.V. AND OTHERS v. PT AYUNDA PRIMA MITRA AND OTHERS CACV 272/2015 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF APPEAL CIVIL APPEAL NO. 272 OF 2015 (ON APPEAL FROM HCCT NO. 45 OF 2010) ________________________ BETWEEN (1) ASTRO NUSANTARA INTERNATIONAL B.V. Applicants/ (2) ASTRO NUSANTARA HOLDINGS B.V. Claimants in the (3) ASTRO MULTIMEDIA CORPORATION N.V. Arbitration/ (4) ASTRO MULTIMEDIA N.V. Judgment Creditors (5) ASTRO OVERSEAS LIMITED (formerly known as AAAN (Bermuda) Limited) (6) ASTRO ALL ASIA NETWORKS PLC (7) MEASAT BROADCAST NETWORK SYSTEMS SDN BHD (8) ALL ASIA MULTIMEDIA NETWORK FZ-LLC and (1) PT AYUNDA PRIMA MITRA Defendants/ (2) PT FIRST MEDIA TBK (formerly known as PT BROADBAND MULTIMEDIA TBK) Respondents in the Arbitration/ (3) PT DIRECT VISION Judgment Debtors ________________________ Before: Hon Kwan JA and Lok J in Court Date of Hearing: 15 November 2016 Date of Judgment: 5 December 2016 ________________________ J U D G M E N T ________________________ Hon Kwan JA (giving the judgment of the court): A. INTRODUCTION 1. This is an interlocutory appeal brought by the 2 nd defendant (“First Media”) against the judgment of Chow J on 17 February 2015 (“the Judgment”), in which the judge dismissed First Media’s application by summons dated 18 January 2012 seeking, inter alia : (1) an extension of time to apply to set aside – (a) two orders made by Saunders J on 3 August 2010 and 9 September 2010 (collectively “the Hong Kong Orders”) giving leave to the 1 st to 8 th applicants (collectively referred to as “Astro”) to enforce five Singapore arbitration awards (“the Awards”); and (b) the judgment of Saunders J entered on 9 December 2010 (“the Hong Kong Judgment”) pursuant to the Hong Kong Orders; (2) an order that the Hong Kong Orders and Hong Kong Judgment be set aside; and (3) an order that the garnishee order to show cause (“the Garnishee Order Nisi ”) made by Master Levy on 22 July 2011 be discharged. 2. This appeal was brought by leave of the judge in a decision handed down on 8 December 2015 (“the Decision”; [2016] 1 HKLRD 591 ), having ruled that: “... once the extension of time sought was refused by the court, there was no question of the court granting any substantive order to set aside the Hong Kong Orders and Hong Kong Judgment. The substantive setting aside application would, strictly speaking, not arise for consideration. ... the decision refusing to grant an extension of time to First Media to apply to set aside the Hong Kong Orders and Hong Kong Judgment was determinative of the First Media’s setting aside application and, therefore, whether leave to appeal against the Judgment to the Court of Appeal is required should be tested by reference to that decision.” (the Decision, §6) 3. The judge held that applying the “application test” the Judgment cannot be regarded as a final judgment or order, nor did it determine in a summary way the “substantive rights” of a party to an action within Order 59 rule 21 (1)(a) of the Rules of the High Court as it determined procedural as opposed to substantive rights, and hence leave to appeal is required. 4. In the Judgment, the judge held against First Media that in the exercise of his discretion time should not be extended to apply to set aside the Hong Kong Orders and Hong Kong Judgment and, in any event, First Media should not be permitted to rely on section 44 (2) of the Arbitration Ordinance , Cap 341 (“the Ordinance”) [1] to resist enforcement of the Awards on the ground that it had acted in breach of the “good faith” principle. He decided to grant leave to appeal because the contrary views are reasonably arguable and the proper scope of the “good faith” principle for the purpose of enforcement of a foreign arbitral award is an issue of general or public importance. B. BACKGROUND 5. The judge has set out in considerable detail the relevant background matters in §§9 to 53 of the Judgment, which we gratefully adopt. B1. The Subscription and Shareholders’ Agreement (“the SSA”) 6. As stated in the §§10 to 13 of the Judgment: “10. The dispute between the parties arose out of a joint venture agreement called the Subscription and Shareholders’ Agreement (“the SSA”) dated 11 March 2005 entered into between companies belonging to an Indonesian conglomerate (“the Lippo Group”) on the one hand and companies within a Malaysian media group (“the Astro Group”) on the other for the provision of multimedia and television services in Indonesia. The joint venture vehicle was the 3 rd defendant in these proceedings (“Direct Vision”). 11. The Lippo Group’s interest in the joint venture was held by the 1 st defendant in these proceedings (“Ayunda”), whose obligations to the Astro Group under the joint venture were guaranteed by First Media, an Indonesian company with its shares listed on the Indonesian Stock Exchange. On the other hand, the Astro Group’s interest in the joint venture was held by the 3 rd and 4 th applicants, with the 5 th applicant guaranteeing their obligations. 12. The original parties to the SSA were the 3 rd to 5 th applicants on the side of the Astro Group, and Ayunda, First Media and Direct Vision (hereinafter collectively referred to as “Lippo”) on the side of the Lippo Group. Subsequently, pursuant to a novation agreement, the 1 st and 2 nd applicants took the place of the 3 rd and 4 th applicants in the joint venture. 13. The Additional Parties were, however, never made parties to the SSA.” 7. The “Additional Parties” referred to in the Judgment are the 6 th to 8 th applicants. The focus of the arguments below related to the enforcement of the Awards by the Additional Parties against First Media, as the principal monetary relief awarded by the arbitral tribunal in Singapore (“the Tribunal”) was in favour of the Additional Parties. 8. The SSA contained an arbitration agreement in clause 17. The dispute resolution procedure was in the form of binding arbitration under the auspices of the Singapore International Arbitration Centre (“SIAC”) in accordance with the rules of SIAC. Clause 18.5 of the SSA provided that the agreement shall be governed by and construed in accordance with the laws of the Republic of Singapore. B2. How the dispute arose 9. The dispute arose in the circumstances as related in §§16 to 18 of the Judgment: “16. The SSA contained a number of conditions precedent upon which the parties’ respective obligations thereunder were predicated. It was agreed that the parties would have until July 2006 to fulfil those conditions precedent. In the meantime, funds and services were provided by the Additional Parties to Direct Vision to build up the latter’s business from about December 2005. 17. As a matter of fact, the conditions precedent were not fulfilled. By about mid-August 2007, it became clear to the parties that the joint venture would not close. Nevertheless, the Additional Parties continued to provide funds and services to Direct Vision while the parties were exploring exit options. A dispute then arose between Lippo and Astro. Lippo contended that the Additional Parties had, orally or by conduct, agreed to continue to provide funds and services to Direct Vision, but Astro was not willing to do so. 18. In October 2008, the Additional Parties stopped further provision of funds and services to Direct Vision. In the meantime, in September 2009, Ayunda commenced proceedings in the Indonesian court against, inter alia , the Additional Parties (“the Indonesian Proceedings”).” B3. The Arbitration 10. The commencement of arbitration, its progress and the rendering of the Awards were covered in §§19 to 26 of the Judgment: “19. On the basis that the commencement of the Indonesian Proceedings amounted to a breach of the arbitration agreement contained in the SSA, Astro commenced Arbitration No 62 of 2008 (“the Arbitration”) at the SIAC by a notice of arbitration dated 6 October 2008 against Lippo. 20. In the notice of arbitration, Astro sought, inter alia , the following relief against Lippo: (i) an anti-suit injunction against Ayunda in respect of the Indonesian Proceedings; (ii) declarations that the SSA was the parties’ only joint venture agreement which had lapsed and there was no continuing obligation on the part of Astro to continue to provide funds and services to Direct Vision, and (iii) payment of various sums by way of restitution and/or quantum meruit. 21. In view of the fact that the Additional Parties were not parties to the SSA, Astro stated in the notice of arbitration that the Additional Parties had consented to being added as parties to the Arbitration, and made an application pursuant to rule 24(b) of the 2007 SIAC Rules (“Rule 24(b)”) to join the Additional Parties as parties to the Arbitration (“the Joinder Application”). 22. The Joinder Application was contested by Lippo. 23. Rule 24(b), under the heading of “Additional Powers of the Tribunal”, states as follows: “In addition and not in derogation of the powers conferred by any applicable law of the arbitration, the Tribunal shall have the power to: b. allow other parties to be joined in the arbitration with their express consent, and make a single final award determining all disputes among the parties to the arbitration”. 24. On 7 May 2009, the Tribunal rendered an award (“the Award on Preliminary Issues”), holding that (i) on the true construction of Rule 24(b), it had power to join the Additional Parties as parties to the Arbitration as long as they consented to being joined, and (ii) the power to join the Additional Parties as parties to the Arbitration should be exercised. 25. Thereafter, between 3 October 2009 and 3 August 2010, the Tribunal rendered four other awards, including an interim final award on the merits of the parties’ disputes dated 16 February 2010 (“the Interim Final Award”). 26. The total monetary award made by the Tribunal in favour of Astro against Lippo under the Awards was in excess of US$130 million.” 11. As noted by the judge in §27 of the Judgment, Lippo did not take any steps to challenge or apply to set aside the Awards before the supervisory court of the Arbitration, i.e. the Singapore court, and the time to do so has long since expired. The Awards are therefore final and binding. Of the total amount of the Awards in excess of US$130 million, all but US$700,000 was to be paid to the Additional Parties as non-contractual, restitutionary relief. 12. The judge described Astro’s attempts at enforcement of the Awards in various jurisdictions in §28 before he focussed on the proceedings in Singapore and Hong Kong: “Astro sought enforcement of the Awards in various jurisdictions, including Singapore, Hong Kong, England, Malaysia and Indonesia. I am told that Lippo did not resist proceedings for the recognition and enforcement of the Awards in England or Malaysia, because Lippo had no assets in those jurisdictions on which execution of the judgments giving effect to the Awards could be levied. For the same reason, Lippo did not originally take steps to resist proceedings for the recognition and enforcement of the Awards in Hong Kong, but subsequently adopted a different stance when it transpired that there were assets of Lippo to be found here (disputed by Lippo). Lippo did take active steps to resist proceedings for the recognition and enforcement of the Awards in Indonesia on various grounds which it is not necessary to set out in this judgment.” B4. The Singapore Proceedings 13. The judge dealt with the enforcement proceedings in Singapore in §§29 to 33. In a nutshell, while the Awards can no longer be challenged by First Media before the supervisory court of the Arbitration in Singapore, enforcement of the Awards by the Additional Parties against First Media in Singapore has been refused by the Court of Appeal, being the highest court in Singapore, in a judgment of 31 October 2013 (“the SCA Judgment”), on the ground there was no valid arbitration agreement between the Additional Parties and First Media and the Tribunal had no jurisdiction to make the Awards in favour of the Additional Parties against First Media. This was explained by the judge in §§29 to 33: “29. In so far as Singapore is concerned, leave to enforce the Awards was originally granted by the Singapore High Court on 5 August and 3 September 2010 (“the Singapore Enforcement Orders”), but the judgments entered pursuant to those orders on 24 March 2011 were later set aside on 22 August 2011 at the instance of First Media on the ground of irregular service of the enforcement orders. On 12 September 2011, First Media applied (“the Singapore Setting Aside Application”) to set aside the Singapore Enforcement Orders, but its application failed at first instance by a judgment of the Singapore High Court rendered on 22 October 2012. First Media then appealed against the first instance judgment to the Singapore Court of Appeal, which led to the SCA Judgment. 30. In view of the fact that the seat of the Arbitration was in Singapore, the Awards were regarded as “domestic international awards” in so far as proceedings for their recognition and enforcement in Singapore were concerned. The statutory regime governing the enforcement of a domestic international award in Singapore is s 19 of the International Arbitration Act ( Cap 143A , 2002 Rev Ed) (“IAA”), which states as follows: “An award on an arbitration agreement may, by leave of the High Court or a Judge thereof, be enforced in the same manner as a judgment or an order to the same effect and, where leave is so given, judgment may be entered in terms of the award.” 31. The following provisions of the 1985 Model Law on International Commercial Arbitration (“the Model Law”) adopted by the United Nations Commission on International Trade Law (“UNCITRAL”) are relevant for the purpose of understanding the SCA Judgment: (1) Article 16(3) : “The arbitral tribunal may rule on a plea referred to in paragraph (2) of this Article [i.e. a plea that the arbitral tribunal does not have jurisdiction] either as a preliminary question or in an award on the merits. If the arbitral tribunal rules as a preliminary question that it has jurisdiction, any party may request, within thirty days after having received notice of that ruling, the court specified in article 6 to decide the matter, which decision shall be subject to no appeal; while such a request is pending, the arbitral tribunal may continue the arbitral proceedings and make an award.” (2) Article 34(1) : “Recourse to a court against an arbitral award may be made only by an application for setting aside in accordance with paragraphs (2) and (3) of this article.” (3) Article 34(2) : “An arbitral award may be set aside by the court specified in article 6 only if (a) the party making the application furnishes proof that: (i) ... the said agreement is not valid under the law to which the parties have subjected it or ... (iii) the award deals with a dispute not contemplated by or not falling within the terms of the submission to arbitration, or contains decisions on matters beyond the scope of the submission to arbitration ...” (4) Article 34(3) : “An application for setting aside may not be made after three months have elapsed from the date on which the party making that application had received the award ...” (5) Article 36(1) : “Recognition or enforcement of an arbitral award, irrespective of the country in which it was made, may be refused only: (a) at the request of the party against whom it is invoked, if that party furnishes to the competent court where recognition or enforcement is sought proof that: (i) ... the said agreement is not valid under the law to which the parties have subjected it or ... (iii) the award deals with a dispute not contemplated by or not falling within the terms of the submission to arbitration, or it contains decisions on matters beyond the scope of the submission to arbitration ...” 32. The Singapore Court of Appeal found in favour of First Media, for the following reasons (see in particular paragraphs 22, 30, 143, 158, 178, 198, 224 and 230 of the SCA Judgment): (1) The enforcement of domestic international awards is governed by s 19 of the IAA, the construction of which must be consonant with the underlying philosophy of the Model Law. (2) The overarching scheme of the Model Law is to de-emphasise the importance of the seat of the arbitration and facilitate the uniform treatment of international arbitration awards. (3) The principle of “choice of remedies”, under which passive remedies will still be available to the award debtor who did not utilise his active remedies, is fundamental to the design of the Model Law. In this connection, (i) “active remedies” means taking positive steps to invalidate an arbitral award such as by an application to challenge a preliminary ruling on jurisdiction under article 16(3) of the Model Law or to set aside an award on the grounds set out in article 34(1) of the Model Law, (ii) “passive remedies” means resisting the recognition or enforcement of an award in the jurisdiction where and when the award is sought to be enforced under article 36 of the Model Law, and (iii) “choice of remedies” means the award debtor may resist enforcement of an award by “passive” means even though it had not pursued “active” remedies to challenge the preliminary ruling or set aside the award. (4) It follows that the best way to give effect to the philosophy of the Model Law would be to recognise that the same grounds for resisting enforcement under article 36(1) of the Model Law will be equally available under s 19 of the IAA. (5) Article 16(3) of the Model Law is neither an exception to the principle of “choice of remedies”, nor a “one-shot remedy” (meaning that a preliminary ruling on jurisdiction must be challenged within the prescribed 30-day time limit, failing which the party objecting to the ruling will be deprived of any other chance to subsequently raise the same jurisdictional ground in setting aside or enforcement proceedings, and if the preliminary ruling is challenged but not set aside by the supervisory court, the party objecting to jurisdiction cannot raise the same grounds in any subsequent application to set aside the award before the supervisory court, or to resist enforcement of the award before the enforcement court, irrespective of whether the latter is in the same jurisdiction as the supervisory court or elsewhere). (6) As such, pursuant to s 19 of the IAA, First Media may apply to set aside the Singapore Enforcement Orders under any of the grounds which are found in article 36(1) of the Model Law, even though it did not pursue “active remedies” to challenge the Award on Preliminary Issues under article 16(3) of the Model Law or set aside the Awards under article 34(1) of the Model Law. (7) It is a matter to be determined by Singapore law whether the Additional Parties were properly joined to the Arbitration so as to establish an arbitration agreement with First Media. (8) Upon the true construction of Rule 24(b), it does not confer on the Tribunal the power to join third parties who are not parties to the arbitration agreement (i.e. the SSA in the present case) into the Arbitration. (9) Accordingly, the Tribunal’s exercise of its power under Rule 24(b) to join the Additional Parties to the Arbitration was improper with the corollary that no express agreement to arbitrate existed between the Additional Parties and First Media. (10) In addition, First Media did not waive its rights or conduct itself in such a way that it is estopped from raising the joinder objection. (11) In consequence of the foregoing, First Media is entitled to resist the enforcement of the Awards pursuant to s 19 of the IAA. (12) Nevertheless, partial enforcement of the Awards in favour of the 1 st to 5 th applicants (whom First Media did not dispute were proper parties to the SSA and the Arbitration) is viable, and leave to enforce the Awards, to the extent of those parts which are exclusively directed at the 1 st to 5 th applicants, would be granted. 33. In a further judgment rendered by the Singapore Court of Appeal on 11 September 2014 to settle the terms of the order to be made, the Singapore Court of Appeal referred to First Media’s observation or complaint that the SCA Judgment did not address the merits of First Media’s argument that the Tribunal did not have jurisdiction over the 1 st to 5 th applicants on the ground of non-compliance with the “multi-tier” dispute resolution mechanism contained in clause 17 of the SSA. The Singapore Court of Appeal noted that the Tribunal had found that the conditions precedent for commencing arbitration had been complied with and there was no basis to reverse the Tribunal’s finding on that specific issue.” B5. The Hong Kong Proceedings 14. The measures taken by Astro to enforce the Awards in Hong Kong were covered in §§34 to 53 of the Judgment: “34. By an order dated 3 August 2010 (i.e. the first of the two Hong Kong Orders), Mr Justice Saunders: (1) granted leave to Astro to enforce the arbitration awards made by the Tribunal dated: (a) 7 May 2009 (i.e. the Award on Preliminary Issues); (b) 3 October 2009 (“the Further Partial Award”); (c) 5 February 2010 (“the Award on Costs for the Preliminary Issues”); and (d) 16 February 2010, as amended by a memorandum of correction dated 23 March 2010 (i.e. the Interim Final Award); in the same way as judgments of the High Court of the HKSAR pursuant to ss 2GG and 42 of the Ordinance; (2) entered judgments against Lippo pursuant to s 2GG of the Ordinance giving effect to the aforesaid four arbitration awards; and (3) directed that Lippo might apply to set aside the order within 14 days after the service on Lippo of the order [2] . 35. By a further order dated 9 September 2010 (i.e. the second of the two Hong Kong Orders), Mr Justice Saunders: (1) granted leave to Astro to enforce the arbitration award made by the Tribunal dated 3 August 2010 (“the Final Award – Interests and Costs”) in the same way as a judgment of the High Court of the HKSAR pursuant to ss 2GG and 42 of the Ordinance; (2) entered judgment against Lippo pursuant to s 2GG of the Ordinance giving effect to the Final Award – Interests and Costs; and (3) directed that Lippo might apply to set aside the order within 14 days after the service on Lippo of the order. 36. No application was made by Lippo to set aside the Hong Kong Orders within the time limit as stipulated in those orders. Accordingly, on 9 December 2010, Mr Justice Saunders entered judgment (i.e. the Hong Kong Judgment) against Lippo in terms of the Awards, pursuant to s 2GG of the Ordinance. 37. The reason why First Media initially did not take any step to seek to set aside the Hong Kong Orders within the time limit as stipulated in those orders or challenge the Hong Kong Judgment is set out in paragraphs 31 and 32 of the affidavit of Charles William Allen of Sidley Austin (First Media’s former solicitors) filed on 18 January 2012 in support of the present application, as follows: “31. ... according to advice received from MR & Partners [First Media’s Indonesian lawyers], First Media did not (and indeed still does not) have any assets in Hong Kong, First Media did not take any steps in the Hong Kong proceedings. In particular, it did not make any application to set aside the Hong Kong Orders. Further, when the Hong Kong Judgment was subsequently entered, First Media remained of the view that it was not necessary for it to take any action in Hong Kong. 32. ... [Astro] have also registered the Awards in England and Wales, and in Malaysia. Consistent with its position that it has no assets in those jurisdictions either, First Media has taken no steps to set aside those registrations either.” 38. In passing, I should mention that Mr Allen also stated in the said affidavit that, according to preliminary advice which First Media received from MR & Partners, the service of the Hong Kong Orders and Hong Kong Judgment was contrary to Indonesian law. It was said that First Media was entitled to argue that it was not properly served with the Hong Kong Orders and Hong Kong Judgment in accordance with their terms and Order 73, rule 10 and Order 11, rules 5, 6 and 8 of the Rules of the High Court , but nonetheless it did not in fact seek to set aside the Hong Kong Orders and Hong Kong Judgment on that ground. In his oral submissions to the court, Mr Landau made it clear that First Media was not taking the point that it had not been properly served with the Hong Kong Orders and Hong Kong Judgment, but relied on the advice given by the Indonesian lawyers as being relevant to the issue of whether First Media’s conduct (namely, the delay in making the present application) was reasonable. 39. First Media’s stance regarding the Hong Kong proceedings changed, however, when Astro successfully obtained the Garnishee Order Nisi on 22 July 2011 to attach a debt of US$44 million (“the Debt”) due from AcrossAsia Limited (“AAL”) to First Media to answer the Hong Kong Judgment. AAL is a company incorporated in the Cayman Islands, with its shares listed on the Growth Enterprise Market of the Stock Exchange of Hong Kong, and holds 55.1% of all the issued shares in First Media. 40. The Debt arose out of a facility agreement (“the Facility Agreement”) entered into between First Media and AAL on 30 June 2011, whereby First Media granted a loan facility of US$44 million to AAL. 41. On 5 August 2011, the Garnishee Order Nisi was served on First Media. On 16 August 2011, AAL filed an affirmation of Yuk Hung Chan to oppose the grant of a garnishee order absolute, on the principal ground that a Hong Kong garnishee order would not extinguish the underlying debt owed by AAL to First Media which was governed by Indonesian law, because such order would not be recognised by the Indonesian courts. In other words, it was argued that AAL would be at risk of “double jeopardy” in having to pay the Debt twice. In that affirmation, it was also stated that “steps will also be taken by First Media to challenge the applications in Hong Kong to enforce [the Awards]”. 42. On 18 January 2012, First Media took out the present summons seeking an extension of time to apply to set aside the Hong Kong Orders and Hong Kong Judgment, and an order to set aside those orders and judgment and to discharge the Garnishee Order Nisi .” 15. Other applications and orders made by the Hong Kong court may be mentioned briefly. On 15 March 2012, Deputy High Court Judge Lok (as he then was) granted a stay of all further proceedings in this action including the summons of First Media issued on 18 January 2012 pending the determination by the Singapore court of the Singapore Setting Aside Application. He further ordered that pending the final determination of the Singapore Setting Aside Application, AAL was to pay all sums due and payable, or as they became due and payable, to First Media into court. An appeal lodged by AAL only in respect of the payment in order was dismissed by the Court of Appeal on 10 August 2012 in CACV 71/2012. AAL has not paid the monies into court. 16. We continue with the narrative at §§47 to 53 of the Judgment: “47. On 24 September 2012, AAL took out two summonses for (i) an order to set aside the Payment-In Order, and (ii) an order to lift the stay in respect of the garnishee proceedings and discharge the Garnishee Order Nisi . 48. On 27 September 2012, Deputy High Court Judge Lok made an order lifting the stay in respect of the garnishee proceedings, and directing AAL’s two summonses and the Garnishee Order Nisi be heard at an early date. 49. AAL’s two summonses and the Garnishee Order Nisi were heard by Deputy High Court Judge Mayo in September and October 2013. After a contested hearing involving viva voce evidence given by the parties’ witnesses, Deputy High Court Judge Mayo gave a written decision on 31 October 2013 ordering that the Garnishee Order Nisi be made absolute (“the Garnishee Order Absolute”) and dismissing AAL’s applications to set aside the Payment-In Order and to discharge the Garnishee Order Nisi . 50. It is apparent from Deputy High Court Judge Mayo’s written decision that the learned judge was highly critical of the conduct of AAL and First Media. In particular, the learned judge expressed the view that: (i) AAL and First Media acted in collusion (paragraphs 202, 203 and 231(5)). (ii) The Facility Agreement, and the “BANI Award” (being a reference to an arbitration award dated 12 September 2012 obtained by First Media against AAL in Indonesia ordering AAL to pay First Media the sum of US$45,774,403 under the Facility Agreement and that this payment should be paid only to First Media in Indonesia within 45 days of the award) and the action consequential thereon, amounted to a “charade” (paragraph 231(b)). (iii) There was no question of AAL being at risk of “double jeopardy”, but even if it did it would have been self inflicted (paragraphs 251 and 259). 51. It will be recalled that it was also on 31 October 2013 that the Singapore Court of Appeal rendered the SCA Judgment. 52. By a notice of appeal dated 27 November 2013, AAL appealed against the aforesaid decision of Deputy High Court Judge Mayo. First Media did likewise by a notice of appeal dated 28 November 2013. These appeals, I understand, have not yet been heard. 53. On 24 January 2014, Madam Justice Mimmie Chan granted a stay of execution of the Garnishee Order Absolute pending the determination of the present application. Astro’s subsequent application seeking leave to appeal against Madam Justice Mimmie Chan’s order was refused by the Court of Appeal on 25 June 2014.” 17. M Chan J had granted an unconditional stay of the Garnishee Order Absolute pending the determination of First Media’s present summons, taking the view that First Media had “good prospects of success” in its application to set aside the Hong Kong Orders and Hong Kong Judgment. In refusing leave to appeal against that order, the Court of Appeal made the remark in its decision in HCMP 835/2014 at §13 that “it will indeed be remarkable if, despite the Singapore Court of Appeal judgment on the invalidity of arbitration awards, Astro will still be able to enforce a judgment here based on the same arbitration awards that were made without jurisdiction.” C. THE ISSUES RAISED BELOW AND ON APPEAL 18. The judge fully recognised the force of the above remark of the Court of Appeal in HCMP 835/2014 (at §§6 and 7 of the Judgment). In the Decision granting leave to appeal, he again recognised and accepted that his decision is “indeed exceptional” (at §36). For the reasons fully explained in the Judgment, he was ultimately persuaded by the arguments advanced on behalf of Astro that (1) he should not exercise his discretion to extend time for First Media to apply to set aside the Hong Kong Orders and Hong Kong Judgment, with the consequence that they shall remain undisturbed; and (2) in any event, even if an extension of time is granted, First Media would be precluded from relying on section 44(2) of the Ordinance to resist enforcement of the Awards for breaching the “good faith” principle. 19. These are the two main issues raised by First Media in the present appeal. First Media also contended that even if time is not extended, enforcement of the Awards should nevertheless be refused on the basis that Astro is unable to satisfy the statutory pre-conditions for enforcement of the Awards in section 43 of the Ordinance (i.e. “the stage 1 versus stage 2 enforcement argument”). 20. There is no cross-appeal by Astro in respect of the issues decided against it in the Judgment and it is unnecessary to mention them except for two of the issues: (1) The judge rejected Astro’s contention that the Tribunal’s decision is correct and that the Hong Kong court is not bound by the decision of another enforcing court, namely, the Singapore Court of Appeal. He held that the issue (whether the Tribunal had power to join the Additional Parties under Rule 24(b) and whether it had jurisdiction to render the Awards as between the Additional Parties and First Media) is governed by Singapore law, which has now been conclusively settled by the SCA Judgment and, in any event, Astro is precluded from questioning the findings in the SCA Judgment by issue estoppel per rem judicatam (at §§94 to 99). (2) He also rejected the submission that First Media’s setting aside application was precluded by the Tribunal’s finding in the Interim Final Award that First Media had made a further binding submission to arbitration by signing the Memorandum of Issues on 31 July 2009 for the arbitration of the issues so identified. He held that the true construction of the Memorandum of Issues is a question of Singapore law and given the rejection of this contention in the SCA Judgment, this argument was no longer open to Astro to advance (at §§100 to 105). 21. In this appeal, Mr Toby Landau, QC [3] on behalf of First Media put his arguments attacking the judge’s findings on the “good faith” principle in the forefront, before he addressed the issue that whether in the light of the circumstances of this case (that is, in the light of this court finding favour with his challenge on the “good faith” principle and the setting aside application of First Media is of merit), there should be an extension of time for First Media’s setting aside application. 22. Mr David Joseph, QC [4] submitted for Astro that the principal issue for determination by this court is not whether First Media is precluded by the “good faith” principle from relying on section 44(2) of the Ordinance to resist enforcement of the Awards. The issue before this court is whether there is any proper basis to challenge or interfere with the judge’s exercise of discretion in refusing to extend time. If there is no proper basis, the appeal should be dismissed. In refusing to exercise his discretion to extend time, not only had the judge considered First Media had failed to show merits in respect of its setting aside application, he had determined in §131 that even if he was wrong about that and had reached the opposite conclusion on the merits, he would still not be prepared to exercise his discretion to extend time for the reasons given in §129 of the Judgment. 23. In the Judgment, the judge considered the exercise of his discretion to extend time as a separate issue after he had dealt with all the other issues going to the merits of the substantive application to set aside the Hong Kong Orders and Hong Kong Judgment. He was conscious of the general undesirability of turning an application for extension of time into an occasion for a detailed examination of the merits of the substantive application. He decided to make an exception in this case because the extension of time application and the substantive application had been fully argued before him and he was mindful that an appeal would be highly likely whatever the outcome of his decision (at §65). 24. We will follow the same scheme in this judgment. We think we should address the arguments on the “good faith” principle, which were likewise fully advanced before us, having regard to the fact that one of the reasons for the judge granting leave to appeal is that the proper scope of the “good faith” principle in the enforcement of a foreign arbitration award is a matter of general or public importance. We do not think the order in which we deal with the “good faith” principle and the discretion to extend time should affect the disposition of this appeal. D. THE PRINCIPLE OF GOOD FAITH D1. The statutory provisions 25. We will start with the relevant provisions in the Ordinance before going to the case law. 26. Section 42(1) provides that a “Convention award” shall be enforceable either by action or in the same manner as the award of an arbitrator is enforceable by virtue of section 2GG. Section 2GG(1) stipulates that an award, order or direction made or given in relation to arbitration proceedings by an arbitral tribunal is enforceable in the same way as a judgment, order or direction of the court that has the same effect, but only with the leave of the court or a judge of the court. If leave is given, the court or judge may enter judgment in terms of the award, order or direction. 27. The Awards we are concerned with are Convention awards in that the New York Convention on the Recognition and Enforcement of Foreign Arbitral Awards apply. As noted by the judge in §73(2), the Hong Kong courts approach Convention awards with a pro-enforcement bias. 28. Section 44 is the statutory enactment of Article V of the New York Convention. Section 44(1) provides that enforcement of a Convention award shall not be refused except in the cases mentioned in that section. Enforcement of a Convention award is mandatory unless a ground is made out under section 44(2) or (3), in which case the court has discretion whether to permit or refuse enforcement. 29. The parts of section 44(2) relevant for present purpose read: “Enforcement of a Convention award may be refused if the person against whom it is invoked proves – ... (b) that the arbitration agreement was not valid under the law to which the parties subjected it or, failing any indication thereon, under the law of the country where the award was made; or ... (d) subject to subsection (4), that the award deals with a difference not contemplated by or not falling within the terms of the submission to arbitration or contains decisions on matters beyond the scope of the submission to arbitration. ...” 30. Section 44(3) reads: “Enforcement of a Convention award may also be refused if the award is in respect of a matter which is not capable of settlement by arbitration, or if it would be contrary to public policy to enforce the award.” 31. As explained by Sir Anthony Mason NPJ in Hebei Import & Export Corp v Polyteck Engineering Co Ltd (1999) 2 HKCFAR 111 (the Hebei case) at 136C to E: “Under the Ordinance and the New York Convention, the primary supervisory function in respect of arbitrations rests with the court of supervisory jurisdiction as distinct from the enforcement court ... But this does not mean that the enforcement court will necessarily defer to the court of supervisory jurisdiction. The Convention distinguishes between proceedings to set aside an award in the court of supervisory jurisdiction (arts. VI and VI(e) [5] ) and proceedings in the court of enforcement (art. VI). Proceedings to set aside are governed by the law under which the award was made or the law of the place where it was made, while proceedings in the court of enforcement are governed by the law of that forum. The Convention, in providing that enforcement of an award may be resisted on certain specified grounds, recognises that, although an award may be valid by the law of the place where it is made, its making may be attended by such a grave departure from basic concepts of justice as applied by the court of enforcement that the award should not be enforced .” (emphasis supplied) D2. The case law 32. In Hong Kong, the principle of “good faith” in the context of the enforcement of foreign arbitral awards is established by a decision of Kaplan J in China Nanhai Oil Joint Service Corporation Shenzhen Branch v Gee Tai Holdings Co Ltd [1995] 2 HKLR 215 (the Nanhai case), which has the approval of the Court of Final Appeal in the Hebei case. 33. In the Nanhai case, it was held that the doctrine of estoppel can apply to the grounds of opposition set out in Article V of the New York Convention. Kaplan J made extensive reference to The New York Convention of 1958 by Dr Albert Jan van den Berg (Kluwer, 1981) at pages 182 to 185 in which the author discussed three possible solutions to the question of estoppel from invoking the non-compliance with the written form of the arbitration agreement as required by Article II(2) (held by Kaplan J to be equally apposite in relation to other parts of the Convention) and expressed a preference for the third solution. Of relevance are the second and third solutions. 34. The second solution is to approach the matter on the basis of municipal law and the relevant law will be the law of the forum. Under this solution, the Convention remains applicable to the enforcement whilst the estoppel from invoking the non-compliance with Article II(2) is to be decided according to municipal law. Thus, under this solution it may happen that the enforcement can be pursued on the basis of the Convention although Article II(2) is not met because under the law of the forum a party is deemed to be estopped from invoking the non-compliance ( The New York Convention of 1958 , p 184). 35. The third solution is to regard the question of estoppel as a “fundamental principle of good faith”, which principle overrides the formalities required by Article II(2). Under this solution, the Convention would also remain applicable, but differing from the second solution in that it does not depend on the diverse municipal laws. “The principle of good faith may be deemed enshrined in the Convention’s provisions. The legal basis would be that Article V(1) [6] provides that a court may refuse enforcement if the respondent proves one of the grounds for refusal of enforcement listed in that Article. The permissive language can be taken as basis for those cases where a party asserts a ground for refusal contrary to good faith.” ( The New York Convention of 1958 , p 185) 36. Kaplan J was satisfied that the third solution is the correct one to apply, and that it is applicable to the grounds of opposition set out in Article V. He stated at 225: “It strikes me as quite unfair for a party to appreciate that there might be something wrong with the composition of the tribunal yet not make any formal submission whatsoever to the tribunal about its own jurisdiction, or to the arbitration commission which constituted the tribunal and then to proceed to fight the case on the merits and then 2 years after the award attempt to nullify the whole proceedings on the grounds that the arbitrators were chosen from the wrong CIETAC list. I think there is much force in Dr. van den Berg's point that even if a ground of opposition is proved, there is still a residual discretion left in the enforcing court to enforce nonetheless . This shows that the grounds of opposition are not to be inflexibly applied. The residual discretion enables the enforcing court to achieve a just result in all the circumstances although I accept that in many cases where a ground of opposition is established, the discretion is unlikely to be exercised in favour of enforcement. If the enforcing court was obliged to refuse enforcement in the event of the establishing of a ground of opposition, I believe that it would be far harder to import the doctrine of estoppel. But a discretion there is, and I for myself are prepared to hold that on a true construction of the Convention there is indeed a duty of good faith which in the circumstances of this case required the Defendant to bring to the notice of the full tribunal or the CIETAC Commission in Beijing its objections to the formation of this particular arbitral tribunal. Its failure to do so and its obvious policy of keeping this point up its sleeve to be pulled out only if the arbitration was lost, is not one that I find consistent with the obligation of good faith nor with any notions of justice and fair play .” (emphasis supplied) 37. In the Hebei case, Mason NPJ endorsed the approach adopted by Kaplan J, which gives effect to the objects of the Ordinance as stated in section 2AA [7] , stating at 138D to G: “I agree with his Lordship that the use of the word “may” in s.44 of the Ordinance and art. V of the Convention enables the enforcing court to enforce an award, notwithstanding that a s.44 ground might otherwise be established. Whether a court would so act in such a case would depend in very large measure on the particular circumstances. [It] is difficult to imagine that a court would do so, if enforcement were contrary to public policy, but there is no reason why a court could not do so where, as here, the factual foundation for the public policy ground arises from an alleged non-compliance with the rules governing the arbitration to which the party complaining failed to make a prompt objection, keeping the point up its sleeve, at least when the irregularity might be cured. Whether one describes the respondent’s conduct as giving rise to an estoppel, a breach of the bona fide principle or simply as a breach of the principle that a matter of non-compliance with the governing rules shall be raised promptly in the arbitration is beside the point in this case. On any one of these bases, the respondent’s conduct in failing to raise in the arbitration its objection arising from the communications to the Chief Arbitrator was such as to justify the court of enforcement in enforcing the Award.” 38. It has not been disputed that these decisions support the proposition that the enforcing court has discretion under section 44(2) of the Ordinance to decline to refuse enforcement, even if a ground for refusal might otherwise be made out, in circumstances where there has been breach of the “good faith” principle by the award debtor. The judge noted at §81 that the breadth of this principle has not yet been fully set, and opined that “it is probably not possible, and in any event not desirable, to do so, but it would be wide enough to cover situations recognised under our domestic law as giving rise to an estoppel or waiver”. 39. The scope of the “good faith” principle is disputed on appeal. Mr Landau submitted that properly understood and analysed, this principle is applicable to the situation in which a party to an arbitration who wishes to rely on a procedural or jurisdiction objection has concealed the objection from the arbitral tribunal, keeping the point up its sleeve and proceeding with the arbitration as if there were no procedural irregularity or objection to jurisdiction. This is reflected in Articles 4 [8] and 16(2) [9] of the Model Law. The principle has no application to a situation in which an objection on jurisdiction was taken before the arbitral tribunal and the adverse ruling of the tribunal has not been challenged in the supervisory court under Article 16(3) of the Model Law, and the judge is wrong to hold otherwise. 40. Before we deal with the above and other arguments raised by Mr Landau that the judge is in error, it would be convenient to mention the factual basis on which the principle is invoked in this case. D3. The factual matters relied on for invoking the principle 41. The factual matters relied on by Astro that First Media should not be permitted to resist enforcement of the Awards are summarised in §66 of the Judgment: “(1) On 20 October 2008, First Media lodged an objection to the Tribunal’s jurisdiction in response to Astro’s notice of arbitration dated 6 October 2008. (2) By a letter dated 11 February 2008 from its lawyers, Drew & Napier LLC, to the Tribunal, First Media proposed that the Tribunal determined the issues of jurisdiction and joinder of the Additional Parties as preliminary issues, on the ground ( inter alia ) that “[t]his would save time and costs in avoiding a situation where the parties proceed to take various steps and file pleadings, only for the Tribunal to decide that it has no jurisdiction, with the arbitration then being terminated. All the time and work done on the substantive issues would then be wasted”. (3) The Tribunal then gave directions for a timetable leading up to the preliminary hearing for the presentation of oral testimony and oral submissions, which took place in April 2009. (4) Following the preliminary hearing, by the Award on Preliminary Issues rendered on 7 May 2009, the Tribunal ruled that it did have jurisdiction over Astro’s claims and ordered the Additional Parties to be joined as parties to the arbitration pursuant to Rule 24(b). (5) In objecting to Astro’s subsequent application to fix an urgent directions hearing for dealing with the substantive merits of the claims, First Media stated, in a letter issued by Drew & Napier LLC dated 19 May 2009, that they were considering an appeal against the Award on Preliminary Issues to the Singapore High Court, and article 16(3) of the Model Law permitted any party to request, within 30 days of receipt of the award, the Singapore High Court to decide the matter. (6) On 20 May 2009, Astro’s lawyers wrote to Drew & Napier LLC attaching a draft “Final Award and Order on Preliminary Issues” and stating that the Tribunal had finally determined the questions of jurisdiction. Paragraph 1 of the draft also stated that the Tribunal had “[f]inally dismisses the Respondents’ challenge to the jurisdiction of the Tribunal”, and paragraph 2 stated that the Tribunal had “[f]inally declares and joins [the Additional Parties] to this arbitral reference ... pursuant to Rule 24.b of the SIAC Rules”. (7) In response, Drew & Napier LLC stated that there was no need for any formal order because the conclusion of the Tribunal at paragraph 109 of the Award on Preliminary Issues was entirely clear, but went on to say that “[w]ithout any prejudice to their position on appeal, [Ayunda and First Media] would ... have no objection to paragraphs 1 and 2 of the proposed draft, since these accurately reflect the Preliminary Award”. (8) By an email dated 22 May 2009 to the parties, the Tribunal confirmed that the Award on Preliminary Issues finally determined ( inter alia ) the jurisdiction and joinder issues. (9) In the event, none of the Lippo parties, including First Media, sought to challenge the Award on Preliminary Issues before the Singapore High Court pursuant to article 16(3) of the Model Law. (10) At a procedural hearing on 25 June 2009, in response to a question from the Tribunal as to “whether or not there’s a challenge to our award in Singapore”, counsel for First Media stated that “[t]here is no challenge to your award in Singapore”. (11) On 31 July 2009, First Media signed a “Memorandum of Issues”, which stated at its beginning that “[a] number of issues in this arbitration, including that of its jurisdiction, have already been fully and finally determined by the Tribunal in its Award dated 7 May 2009”, followed by a list of the “remaining claims and issues to be determined by the Tribunal” in the arbitration. (12) The arbitration then proceeded to its conclusion, with First Media contesting Astro’s claims on the merits. In particular, First Media resisted Astro’s claim for declaratory relief at a hearing in September 2009 which led to the making of the Further Partial Award dated 3 October 2009, and participated in a ten-day hearing from 30 November to 11 December 2009 which led to the making of the Interim Final Award dated 16 February 2010.” 42. The judge expressed his views on the conduct of First Media in §91: “In my view, what was considered to be so objectionable in China Nanhai Oil Joint Service Corporation Shenzhen Branch and Hebei Import & Export Corp v Polyteck Engineering Co Ltd was the idea that a party to an arbitration, while being fully aware of an objection (whether in relation to the jurisdiction of the tribunal or the procedure or conduct in the course of the arbitration), should be permitted to keep the objection in reserve, participate fully in the arbitration and raise the objection in the enforcing court only after an award had been made against him by the tribunal. This is effectively what happened in the present case. First Media was fully aware of its right to challenge the Tribunal’s ruling on jurisdiction before the Singapore High Court under article 16(3) of the Model Law, but chose not to do so. It seems clear that what First Media decided to do was to defend the claim on the merits in the hope that it would succeed before the Tribunal, and keep the jurisdictional point in reserve to be deployed in the enforcement court only when it suited its interests to do so. The fact that First Media did raise the objection with the Tribunal should not, in my view, make any difference having regard to its subsequent conduct as summarised in paragraph 66 above. In all the circumstances of the present case, I consider that First Media should not be permitted to rely on s 44(2) of the Ordinance to resist enforcement of the Awards because it has acted in breach of the good faith, or bona fide , principle.” D4. If there was conduct in breach of the good faith principle 43. Mr Landau submitted that none of the acts relied on by the judge in concluding that First Media breached the “good faith” principle is capable of breaching this principle, since each of the acts, as confirmed by the SCA Judgment, was entirely in accordance with the law in Singapore, which is the curial law or lex arbitri . The judge accepted in §90 that in principle, when one is considering whether First Media’s conduct amounts to a breach of the “good faith” principle, “one cannot, or should not, look at such conduct in a legal vacuum, or divorced from the legal regime governing the conduct in question.” Pertinently, the judge quoted these remarks of Mason NPJ in the Hebei case at 139J to 140A made in the context of approaching the question whether a ground based on sections 44(2)(c) and (3) [10] of the Ordinance had been made out for resisting enforcement: “it is relevant to take account of the fact that the parties agreed to an arbitration which was to be governed by the CIETAC Arbitration Rules and the PRC Arbitration Law. The fact that the parties agreed to procedures which differ from those which would ordinarily apply in Hong Kong is a circumstance of which we must take account (see the Arbitration Ordinance ( Cap 341 ) s. 2AA(2)(a)) [11] ”. 44. Similarly, in Gao Haiyan v Keeneye Holdings [2012] 1 HKLRD 627 at §§65 to 69, Tang VP (as he then was) emphasised the importance to give weight to the decision of the supervisory court of the seat of arbitration, as this is relevant to the decision of the enforcement court whether the award should be enforced, quoting from Colman J in Minmetals Germany GmbH v Ferco Steel Ltd [1999] CLC 647 at 661: “... In international commerce a party who contracts into an agreement to arbitrate in a foreign jurisdiction is bound not only by the local arbitration procedure but also by the supervisory jurisdiction of the courts of the seat of the arbitration. If the award is defective or the arbitration is defectively conducted the party who complains of the defect must in the first instance pursue such remedies as exist under that supervisory jurisdiction. That is because by his agreement to the place in question as the seat of the arbitration he has agreed not only to refer to all disputes to arbitration but that the conduct of the arbitration should be subject to that particular supervisory jurisdiction. Adherence to that part of the agreement must, in my judgment, be a cardinal policy consideration by an English court considering enforcement of a foreign award. In a case where a remedy for an alleged defect is applied for from the supervisory court, but is refused, leaving a final award undisturbed, it will therefore normally be a very strong policy consideration before the English courts that it has been conclusively determined by the courts of the agreed supervisory jurisdiction that the award should stand. Just as great weight must be attached to the policy of sustaining the finality of international awards so also must great weight be attached to the policy of sustaining the finality of the determination of properly referred procedural issues by the courts of the supervisory jurisdiction. I use the word ‘normally’ because there may be exceptional cases where the powers of the supervisory court are so limited that they cannot intervene even where there has been an obvious and serious disregard for basic principles of justice by the arbitrators or where for unjust reasons, such as corruption, they decline to do so. However, outside such exceptional cases, any suggestion that under the guise of allegations of substantial injustice procedural defects in the conduct of an arbitration which have already been considered by the supervisory court should be re-investigated by the English courts on an enforcement application is to be most strongly deprecated.” 45. Mr Landau took this court through each of the conduct of First Media criticised by the judge and identified the relevant parts in the SCA Judgment in which it was conclusively determined, as a matter of Singapore law, that First Media was entitled to act in the way it did. He made these salient points: (1) Astro complained that First Media pursued its jurisdictional objections before the Tribunal but chose not to challenge the Tribunal’s ruling under Article 16(3) of the Model Law. But the Singapore Court of Appeal ruled that Article 16(3) was not intended to be a ‘one-shot remedy’, much less would it affect the availability of defences at the stage of recognition and enforcement. It is merely an option, which need not be pursued by the objecting party. It was meant to provide parties with an additional option rather than to confine them to a particular course of action. Under the “choice of remedies” principle, an objecting party has a statutory right to reserve its position, to continue to fight the arbitration, and to raise its objections later, if and when enforcement is sought (SCA Judgment, §§100 to 123, 125 to 132). (2) Astro made the point that it was First Media that had proposed the Tribunal to determine the jurisdiction objection as a preliminary issue, in order to save time and costs, and following the Tribunal’s determination in the Award on Preliminary Issues, First Media agreed to paragraphs 1 and 2 of the proposed draft order (Judgment, §§66(6) and (7)). But these matters have been examined by the Singapore Court of Appeal, and it was held that First Media had not waived its rights, and was not prevented from raising the jurisdictional objections at the enforcement stage (SCA Judgment, §§205 to 219). (3) Reliance was placed on the Memorandum of Issues signed by First Media, which recorded that the issue of jurisdiction had been “fully and finally determined by the Tribunal” (Judgment, §66(11)). But as noted by the judge at §102 of the Judgment, the Singapore Court of Appeal has ruled that the Memorandum of Issues was only a statement of the remaining issues to be determined by the Tribunal and it was consistent with the choice of remedies (SCA Judgment, §§218 to 219). (4) Finally, Astro made the point that notwithstanding its jurisdiction objections, First Media proceeded with the arbitration and contested the merits of the dispute all the way to the end of the arbitration (Judgment, §66(12)). But as held by the Singapore Court of Appeal, this was entirely consistent with Singapore law, and on the facts, First Media has never waived its objections on jurisdiction, nor is it otherwise estopped from asserting its rights to resist the enforcement of the Awards (SCA Judgment, §§205 to 219, 222, 223 and 224(d)). 46. Mr Landau has also taken us to a coloured chart (to which the judge was referred, see Judgment, §89) which sets out the steps taken by First Media from the commencement of the Arbitration to the rendering of the Final Award, to demonstrate that First Media had persistently raised its objections to jurisdiction and had expressly reserved its rights in the course of the Arbitration. 47. Having said in §90 that First Media’s conduct should not be looked at in a legal vacuum or divorced from the legal regime governing the conduct, the judge went on to say in the beginning of §91 that the “Singapore Court of Appeal’s focus, apparently, was on the issues of waiver and estoppel as a matter of Singapore domestic law”, whereas he “[is] here exercising a discretion under s 44(2) of the Ordinance as a matter of Hong Kong law.” We have more to say on the exercise of discretion under section 44(2) in the next part of this judgment. But it does seem to us that the judge has fallen into error in not giving proper recognition to the findings in the SCA Judgment. It is part of Hong Kong law that in considering the conduct of the arbitration for the purpose of the “good faith” principle, it is particularly relevant to take account of the law of the seat of arbitration and the ruling of the supervisory court of the seat of arbitration, see the passages quoted above in the Hebei case at 139J to 140A and Gao Haiyan v Keeneye Holdings . The distinction he sought to draw in §91 – that the Singapore Court of Appeal was apparently concerned with waiver and estoppel as a matter of Singapore domestic law, whereas he is concerned with exercising a discretion under s 44(2) of the Ordinance as a matter of Hong Kong law – is not to the point. D5. The exercise of discretion 48. We also find it problematic the way the judge dealt with the exercise of his discretion in this context. 49. As mentioned above, at the outset of §91, the judge stated that he is exercising a discretion under section 44(2) of the Ordinance. He then went on to find in §91 that the conduct of First Media was such that it should not be permitted to rely on section 44(2) to resist enforcement of the Awards because it has acted in breach of the “good faith” principle. 50. In §92, the judge said if he was wrong in his conclusion that First Media has acted in breach of the “good faith” principle, he would have to consider the second question posed by Mr Joseph referred to in §74(2), namely, “what is the proper approach to the exercise of the discretion under s 44(2) of the Ordinance where a ground for refusing to enforce an arbitral award under that section is made out”. He came to the view that “the discretion under s 44(2) of the Ordinance to permit enforcement of an arbitral award where the award debtor is able to establish one or more grounds for refusal of enforcement is a narrow one. In particular, it would take a very strong case to permit enforcement of an arbitral award in circumstances where it was made by an arbitral tribunal without jurisdiction”. He referred to these authorities: Dallah Real Estate and Tourism Holding Co v Ministry of Religious Affairs of the Government of Pakistan [2011] 1 AC 763 , at §§58 and 61 per Moore-Bick LJ and §§74, 87 and 89 per Rix LJ (in the Court of Appeal), and §§67 to 69 per Lord Mance JSC and §§127 and 131 per Lord Collins of Mapesbury JSC (in the Supreme Court); Dardana Ltd v Yukos Oil Company Petroalliance Services Co Ltd [2002] 2 Lloyds Law Rep 326, at §§8 and 18 per Mance LJ; Kanoria v Guinness [2006] 2 All ER (Comm) 413, at §25 per Lord Phillips of Worth Matravers CJ and §30 per May LJ. 51. In §93, the judge concluded that “subject to the application of the good faith principle mentioned above, [he] would not feel able to exercise [his] residual discretion to permit enforcement of the Awards in circumstances where they were made by the Tribunal without jurisdiction.” 52. On the judge’s reasoning, the finding that the Awards were made without jurisdiction is not to be taken into account when he exercised his discretion whether First Media should be permitted to rely on any of the grounds in section 44(2) to resist enforcement (as canvassed in §91), but is only to be taken into account when he exercised his “residual discretion” whether to permit enforcement where a ground for refusing to enforce the Awards under section 44(2) is made out (as canvassed in §92). 53. We think this reasoning is erroneous. In considering whether the “good faith” principle may be successfully invoked to resist enforcement, there is only one discretion to exercise. It matters not whether this is called a discretion or residual discretion, and that discretion is found in the word “may” in the opening part of section 44(2), see the passage cited earlier in The New York Convention of 1958 , p 185; the Nanhai case at 225 with the relevant part as we have italicised; and the Hebei case at 138D to E. As stated by Mason NPJ, it is the use of the word “may” that “enables the enforcing court to enforce an award, notwithstanding that a s.44 ground might otherwise be established”. 54. This is also borne out by these passages in Dallah in the English Court of Appeal and the Supreme Court: “In sum, I see no reason arising out of the interesting arguments put before the court in this appeal to doubt, even if it was open to do so, this court’s views in the Dardana [2002] 1 All ER (Comm) 819 and Kanoria [2006] 2 All ER (Comm) 413 cases that any discretion to enforce despite the establishment of a Convention defence recognised in our 1996 Act is a narrow one. Indeed, it seems to me that in context the expression “may be refused . . . only if” (article V), especially against the background of the French text (“ne seront refusées”), and the expressions of the English statute “shall not be refused except” and “may be refused if” (section 103(1) and (2)) [12] , are really concerned to express a limitation on the power to refuse enforcement rather than to grant a discretion to enforce despite the existence of a proven defence. What one is left with therefore is a general requirement to enforce, subject to certain limited defences. There is no express provision however as to what is to happen if a defence is proven, but the strong inference is that a proven defence is a defence . It is possible to see that a defence allowed under Convention or statute may nevertheless no longerbe open because of an estoppel (Professor van den Berg’s view, see TheNew York Arbitration Convention 1958 , at p 265), or that a minor andprejudicially irrelevant error, albeit within the Convention or statutorylanguage, might not succeed as a defence (as in the China Agribusiness case [1998] 2 Lloyd’s Rep 76). But it is difficult to think that anything asfundamental as the absence of consent or some substantial and materialunfairness in the arbitral proceedings could leave it open to a court to ignorethe proven defence and instead decide in favour of enforcement .” (§89, per Rix LJ) (emphasis supplied) “Since section 103(2)(b) gives effect to an international convention, the discretion should be applied in a way which gives effect to the principles behind the Convention. One example suggested by van den Berg, op cit, p 265, is where the party resisting enforcement is estopped from challenge , which was adopted by Mance LJ in Dardana Ltd v Yukos Oil Co [2002] 2 Lloyd’s Rep 326, para 8. But, as Mance LJ emphasised at para 18, there is no arbitrary discretion: the use of the word “may” was designed to enable the court to consider other circumstances, which might on some recognisable legal principle affect the prima facie right to have an award set aside arising in the cases listed in section 103(2). See also Kanoria vGuinness [2006] 1 Lloyd’s Rep 701, para 25, per Lord Phillips CJ. Another possible example would be where there has been no prejudice to the party resisting enforcement: China Agribusiness Development Corpn v BalliTrading [1998] 2 Lloyd’s Rep 76. But it is not easy to see how that couldapply to a case where a party had not acceded to an arbitration agreement .” (§127, per Lord Collins of Mapesbury JSC) (emphasis supplied) “The power to enforce notwithstanding that the award has been set aside in the country of origin does not, of course, arise in this case. The only basis which Dallah puts forward for the exercise of discretion in its favour is the Government’s failure to resort to the French court to set aside the award. But Moore-Bick LJ was plainly right in the present case, ante, p 786, para 61, to say that the failure by the resisting party to take steps to challenge the jurisdiction of the tribunal in the courts of the seat wouldrarely, if ever, be a ground for exercising the discretion in enforcing anaward made without jurisdiction . There is certainly no basis for exercising the discretion in this case.” (§131, per Lord Collins of Mapesbury JSC) (emphasis supplied) 55. The New York Arbitration Convention 1958 at p 265 was referred to in the above extracts in Dallah . The relevant passage at p 265 reads: “It is to be noted that the opening lines of both the first and the second paragraph of Article V employ a permissive rather than mandatory language: enforcement “ may be ” refused. For the first paragraph it means that even if a party against whom the award is invoked proves the existence of one of the grounds for refusal of enforcement, the court still has a certain discretion to overrule the defence and to grant the enforcement of the award. Such overruling would be appropriate, for example, in the case where the respondent can be deemed to be estopped from invoking the ground for refusal.” 56. Also of note are these statements at p 266: “The question of estoppel has been dealt with in the context of the question whether a party can be estopped from invoking non-compliance with the written form of the arbitration agreement as required by Article II(2) of the Convention. ... The exceeding by an arbitrator of his powers (Art.V(1)(c)) as well as the composition of the arbitral tribunal or the conduct of the arbitral procedure not in conformity with the agreement of the parties (Art. V(1)(d)) may also be considered as provisions of the Convention which may involve estoppel. ...” 57. It is quite clear from the above extracts that in considering the exercise of discretion under section 44(2) whether to overrule the defence in one of the grounds in subsections (a) to (f) and to decline to refuse enforcement, as in the case where the respondent may be estopped from invoking the ground for refusal, fundamental jurisdictional objections are taken into account. 58. We have already cited Lord Collins of Mapesbury JSC at §§127 and 131. Other relevant statements in Dallah are: “... if the person opposing recognition or enforcement of an award can prove that he was not a party to the relevant arbitration agreement, it will rarely, if ever, be right to recognise or enforce it solely on the grounds that he has failed to take steps to challenge it before the supervisory court . That would be contrary to the policy of the Convention and would significantly undermine the principle which this court accepted in para 104 of its judgment in that case [13] ... . For those reasons I do not consider that it would be a proper exercise of the court’s discretion in the present case to allow enforcement of the award once it had reached the conclusion that there was no valid arbitration agreement between Dallah and the Government of Pakistan.” (per Moore-Bick LJ at §61) (emphasis supplied) “... the dicta in the Dardana case and in Kanoria v Guinness [2006] 2 All ER (Comm) 413 suggest that any discretion is narrow and would be unlikely to be exercised where the award in question was subject to a fundamental or structural defect. There canhardly be a more fundamental defect than an award against someone whowas never party to the relevant contract or agreement to arbitrate .” (per Rix LJ at §87) (emphasis supplied) “Absent some fresh circumstance such as another agreement or an estoppel, it would be a remarkable state of affairs if the word “may” enabled a court to enforce or recognise an award which it found to have been made without jurisdiction , under whatever law it held ought to be recognised and applied to determine that issue.” (per Lord Mance JSC at §68) (emphasis supplied) 59. The judge had misdirected himself and failed to take into account the fundamental defect that the Awards were sought to be enforced against the Additional Parties who were wrongly joined by the Tribunal into the Arbitration and the Awards were made without jurisdiction when he exercised his discretion under section 44(2) whether to refuse enforcement. Had he taken this into account, he could only have exercised his discretion to refuse enforcement. 60. For the reasons given in this section and the previous section of our judgment, the judge’s ruling that First Media is precluded by the principle of “good faith” from relying on section 44(2) to resist enforcement cannot be supported. D6. The scope of the “good faith” principle 61. It is therefore unnecessary to deal with the other arguments advanced by Mr Landau in respect of the “good faith” principle. In deference to the submissions made to us, we would confine ourselves to making just a few observations. 62. Regarding the scope of the principle, on the facts of the Nanhai case and the Hebei case, Mr Landau is of course correct in saying that the principle was invoked in the situation where a party had concealed his objection, did not raise it with the arbitral tribunal and carried on with the arbitration, keeping the point up his sleeve and only raising it in the enforcement proceedings. Neither the Nanhai case nor the Hebei case was actually concerned with Article 16(3) of the Model Law. Related to his argument that the scope of the “good faith” principle should not be extended to cover the situation where an objection was taken in the arbitral tribunal but no challenge was made to the supervisory court under Article 16(3) is his proposition that this principle should not be extended to make it inconsistent with the “choice of remedies” principle. It was accepted by the judge at §82 that “there is no general obligation on the part of an award debtor to exhaust his remedies in the supervisory court before he could rely on a Convention ground to resist enforcement in the enforcement court”, citing Paklito Investment Ltd v Klockner (East Asia) Ltd [1993] 2 HKLR 39 at 48 to 49. 63. Mr Joseph argued to the contrary. He submitted that the principle may be invoked where a party had raised his objection before the arbitral tribunal and did not challenge the adverse ruling against him by requesting the supervising court to decide the matter under Article 16(3) of the Model Law. He referred us to the Nanhai case at 224, in which Kaplan J made this terse comment about Article 16(3): “Similarly, under Article 16(3) if the tribunal rules that it has jurisdiction any party may request within 30 days, the court to decide the matter. It seems to follow from this that if you do not seek the view of the court, then you cannot raise the matter subsequently at enforcement stage.” 64. But this comment was made in the discussion of Kaplan J of the second solution to the question of estoppel proposed by Dr van den Berg, and he had agreed with Dr van den Berg that the third solution is the correct one to apply. We do not agree with Mr Joseph’s suggestion that Kaplan J’s comment was made in connection with “the fundamental principle of good faith”, which is the third solution. It seems to us what Kaplan J said about Article 16(3) was obiter . 65. Mr Joseph referred also to the Hebei case at 138H in which Mason NPJ, having come to the view that the respondent’s conduct was in breach of the “good faith” principle (in failing to raise its objection in the arbitration, having continued to participate in it and keeping the point for later use), stated there was no need to deal with the separate question whether failure to raise the point before the supervisory court in Beijing was an additional ground for reaching the same conclusion but he “would be disposed to answer it in the affirmative”. Again, that was an obiter statement. 66. Mr Joseph then cited a number of Hong Kong cases in which the “good faith” principle was applied. There is however no decided case sufficiently similar to the present situation. The closest case is Kahara Bodas Co LLC v Persusahaan Pertambangan Minyak Dan Gas Bumi Negara (No 2) [2003] 4 HKC 488 , in which Burrell J dealt with an objection of Pertamina regarding the method of appointing the arbitrators sought to be raised in enforcement proceedings before him. Pertamina did object to the arbitral tribunal before its preliminary award, it also did so in annulment proceedings in Indonesia. Burrell J rejected the argument of Pertamina and said this at §36: “... KBC accepts that Pertamina has objected at those times but that is not the point. The point is that once the tribunal had made its decision (on consolidation and on the appointment of the arbitrators) Pertamina made no challenge to the decision to the supervisory court. KBC has never accepted that Indonesia was the supervisory court, and this court has agreed with that stance, and so Pertamina’s submission to the Jakarta court is neither here nor there. The argument is, and this court agrees, that, having been ruled against on a preliminary issue, remaining silent thereafter until the enforcement stage may be construed as a waiver, if indeed there had been an irregularity.” 67. But as rightly pointed out by Mr Landau, the important distinction in the present situation is that First Media did not remain silent about its objection to jurisdiction even though it had not challenged the preliminary award under Article 16(3). First Media had expressly reserved its position as regards jurisdiction throughout, and, as held by the Court of Appeal in Singapore, it had reserved its position effectively, so as to preserve its rights. Astro did not rely on any conduct by First Media in relation to the reservation of the challenge on jurisdiction. It relied on its own understanding (which was mistaken) as to the legal consequences of First Media not having brought a challenge under Article 16(3) to the Tribunal’s ruling on jurisdiction in the supervisory court (SCA Judgment, §§ 224(d) and 214). 68. As stated by Mason NPJ in the Hebei case at 138E, whether the enforcing court would exercise its discretion under section 44(2) to enforce an award notwithstanding a section 44 ground might otherwise be established “would depend in very large measure on the particular circumstances”. We would venture to suggest that a dogmatic approach should not be adopted in applying the principle of “good faith” and we would not subscribe to the view that the principle would have no application to the omission to bring a challenge under Article 16(3) in any circumstances. 69. We do not think it controversial it is important to have regard to the “choice of remedies” principle. We agree with Mr Landau that the principle of “good faith” and the “choice of remedies” principle are not mutually exclusive but complementary. Applying the principle of “good faith” too rigorously whenever there is a failure to pursue active remedies might bring this into conflict with the “choice of remedies” principle. The answer may be that regard should be had to the full circumstances why an active remedy is not pursued or other relevant considerations (such as whether there was a clear reservation of rights so the opposite party was not misled). E. THE EXTENSION OF TIME E1. The judge’s ruling 70. It would be convenient to mention first the judge’s reasons for declining to grant an extension of time to First Media to set aside the Hong Kong Orders and Hong Kong Judgment. 71. The reasons appear in §§129 to 131 of the Judgment: “129. In the present case, I consider the following factors to be particularly relevant in the exercise of my discretion whether to extend to time: (1) The length of the delay, namely, 14 months, is a very substantial one, whether viewed on its own or in light of the short period of 14 days provided for in Order 73 , rule 10 of the Rules of the High Court for making the application, and having regard to the context of the application, namely, to resist enforcement of Convention awards. (2) The delay was the result of a deliberate and calculated decision not to take action in Hong Kong. First Media took the view that there was no need to take action in Hong Kong because it thought that it had no assets in Hong Kong upon which execution could be levied to satisfy any judgment which might be entered to give effect to the Awards. It seems to me clear that First Media took a calculated risk regarding the presence, or absence, of assets in Hong Kong. As events turn out, the risk has now materialised. I do not see why the court should then come to the aid of First Media and assist it to get out of its self-inflicted predicament. (3) Although First Media has successfully resisted the enforcement of the Awards before the Singapore Court of Appeal, the Singapore court was acting in its capacity as the enforcement court and not as supervisory court. The Awards have not been set aside. They are still valid and create legally binding obligations on First Media to satisfy them. The distinction between setting aside proceedings and enforcement proceedings was emphasised by Mr Landau before the Singapore Court of Appeal at paragraph 40 of First Media’s case dated 1 March 2013, as follows: “There is a well-understood and accepted conceptual difference between setting-aside proceedings and enforcement proceedings. Setting-aside proceedings are a means of ‘recourse against the award’, that is, they are proceedings to attack the award itself. If successful, the award is annulled and (in general) no longer exists. The legal and practical consequence is that (in general) the award is no longer capable of enforcement anywhere else... It also means that the award no longer binds the parties and fresh proceedings may be commenced. This is very different from a party merely raising defences to enforcement. A court’s ruling on whether to enforce an award within its own jurisdiction is not an attack against the award itself but a statement by the court that it will not lend its aid to the enforcement of the award in that jurisdiction. The effect of such a ruling is in principle confined to that jurisdiction alone and it is possible for an award to be refused enforcement in one jurisdiction but enforced in another.” In other words, declining to extend the time for First Media to apply to set aside the Awards merely means that Astro is permitted to obtain satisfaction of a legally binding debt due and owing by First Media to Astro. 130. I have not lost sight of the size of the Awards. I also accept that Astro has not suffered any substantial prejudice (other than costs which can be compensated) as a result of First Media’s delay of 14 months to make the present application. I do not, however, consider that these matters are sufficient to override the three factors mentioned above or tilt the balance in favour of granting an extension. 131. As mentioned above, I have also come to the conclusion that First Media is precluded from seeking to rely on s 44(2) of the Ordinance to resist enforcement of the Awards. If that conclusion is correct, obviously I should decline to exercise my discretion to extend the time for First Media to make the setting aside application. Even if I had come to the conclusion that First Media’s setting aside application had merits and should otherwise succeed based on s 44(2) of the Ordinance, I would still not be prepared to exercise my discretion to extend time by reason of the three factors mentioned above.” 72. This is an appeal against the exercise of discretion of the judge and the relevant principles are well established. The appeal court will not interfere with the judge’s discretion unless it is demonstrated that it was exercised under a mistake of law or in disregard of principle; or that he took into account irrelevant matters or failed to exercise his discretion or the conclusion he reached in the exercise of his discretion was “outside the generous ambit within which a reasonable disagreement is possible”, such that it was “plainly wrong” ( Hong Kong Civil Procedure 2017 , vol 1, §59/0/54). 73. Mr Landau submitted that the judge had taken an irrelevant matter into account in §129(3), and his refusal to extend time was so “plainly wrong” that it “must have been reached by a faulty assessment of the weights of the different factors which have to be taken into account” ( Tai Fook Futures Ltd v Cheung Moon Hoi Jeff , CACV 103/2005, 23 October 2006, §15). E2. The guidance in The Decurion and Terna Bahrain 74. Like the judge, we were referred to the guidance given by the Court of Appeal in The Decurion [2012] 1 HKLRD 1063 and by Popplewell J in Terna Bahrain Holding Company WLL v Al Shamsi & Ors [2013] 1 Lloyd’s Rep 86. 75. The Decurion concerned an extension of time to file a defence in proceedings in rem, but the guidance given by Cheung JA in §11 applies to applications for extension of time in general and has been followed in a number of different situations. This has been summarised by the judge in §122: “(1) The applicable principle in deciding whether time should be extended is to look at all relevant matters and consider the overall justice of the case. A rigid mechanistic approach is not appropriate. (2) There are two conflicting principles at play. First, a party is required to observe the procedural rules, the default of which may result in judgment being entered against it. Second, a party should not be deprived of an adjudication on the merits due to a procedural default unless there is prejudice to the other party which cannot be compensated by costs. These two principles are not absolute. A rigid application of the first principle may lead to dismissal of actions without consideration of whether the defendant has been prejudiced by the default. However, the Court has treated the existence of such prejudice to be crucial and often decisive. Likewise a rigid application of the second principle without exception may enable a wealthy litigant to flout the rules. The resolution of these two conflicting principles is to consider all the circumstances of the case and not confine the decision to the application of a universally applicable rule of thumb. (3) This approach has not been drastically changed by the introduction of the Civil Justice Reform in Hong Kong since 2 April 2009. An expeditious disposal of a case has to be considered together with the equally salutary objective of ensuring fairness between the parties.” 76. The judge made extensive reference to Terna Bahrain , which concerned an application for an extension of the 28-day period to challenge an arbitral award where the seat of arbitration was in England, under sections 67 and 68 of the Arbitration Act 1996. We reproduce the relevant paragraphs quoted by the judge in which Popplewell J set out the applicable statements of principle: “27.The principles regarding extensions of time to challenge an arbitration award have been addressed in a number of recent authorities ... from which I derive the following principles: (1) Section 70(3) of the Act requires challenges to an award under sections 67 and 68 to be brought within 28 days. This relatively short period of time reflects the principle of speedy finality which underpins the Act, and which is enshrined in section 1(a) . The party seeking an extension must therefore show that the interests of justice require an exceptional departure from the timetable laid down by the Act. Any significant delay beyond 28 days is to be regarded as inimical to the policy of the Act. (2) The relevant factors are: (i) the length of the delay; (ii) whether the party who permitted the time limit to expire and subsequently delayed was acting reasonably in the circumstances in doing so; (iii) whether the respondent to the application or the arbitrator caused or contributed to the delay; (iv) whether the respondent to the application would by reason of the delay suffer irremediable prejudice in addition to the mere loss of time if the application were permitted to proceed; (v) whether the arbitration has continued during the period of delay and, if so, what impact on the progress of the arbitration, or the costs incurred in respect of the arbitration, the determination of the application by the court might now have; (vi) the strength of the application; (vii) whether in the broadest sense it would be unfair to the applicant for him to be denied the opportunity of having the application determined. (3) Factors (i), (ii), and (iii) are the primary factors . 28. I add four observations of my own which are of relevance in the present case. First, the length of delay must be judged against the yardstick of the 28 days provided for in the Act. Therefore a delay measured even in days is significant; a delay measured in many weeks or in months is substantial ... 29. Secondly, factor (ii) involves an investigation into the reasons for the delay. In seeking relief from the court, it is normally incumbent upon the applicant to adduce evidence which explains his conduct, unless circumstances make it impossible. In the absence of such explanation, the court will give little weight to counsel’s arguments that the evidence discloses potential reasons for delay and that the applicant ‘would have assumed this’ or ‘would have thought’ that. ... 30. Thirdly, factor (ii) is couched in terms of whether the party who has allowed the time to expire has acted reasonably. This encompasses the question whether the party has acted intentionally in making an informed choice to delay making the application . In Rule 3.9(1) of the Civil Procedure Rules, which sets out factors generally applicable to extensions of time resulting in a sanction, the question whether the failure to comply is intentional is identified as a separate factor from the question of whether there is a good explanation for the failure [14] . This is because in cases of intentional non-compliance with time limits, a public interest is engaged which is distinct from the private rights of the parties . There is a public interest in litigants before the English court treating the court's procedures as rules to be complied with, rather than deliberately ignored for perceived personal advantage. 31. Fourthly, the court's approach to the strength of the challenge application will depend upon the procedural circumstances in which the issue arises. On an application for an extension of time, the court will not normally conduct a substantial investigation into the merits of the challenge application, since to do so would defeat the purposes of the Act. However if the court can see on the material before it that the challenge involves an intrinsically weak case, it will count against the application for an extension, whilst an apparently strong case will assist the application. Unless the challenge can be seen to be either strong or intrinsically weak on a brief perusal of the grounds, this will not be a factor which is treated as of weight in either direction on the application for an extension of time. If it can readily be seen to be either strong or weak, that is a relevant factor; but it is not a primary factor, because the court is only able to form a provisional view of the merits, a view which might not be confirmed by a full investigation of the challenge, with the benefit of the argument which would take place at the hearing of the application itself if an extension of time were granted. 32. The position , however, is different where , as has happened in the current case, the application for an extension of time has been listed for hearing at the same time as the challenge application itself, and the court has heard full argument on the merits of the challenge application . In such circumstances the court is in a position to decide not merely whether the case is ‘weak’ or ‘strong’, but whether it will or will not succeed if an extension of time were granted. The court is in a position to decide whether the challenge is a good or a bad one. If the challenge is a bad one, this should be determinative of the application to extend time. Whilst it may not matter in practice whether the extension is allowed and the application dismissed, or whether the extension is simply refused, logical purity suggests that it would be wrong to extend time in those circumstances: there can be no justification for departing from the principle of speedy finality in order to enable a party to advance a challenge which will not succeed. 33. Conversely, where the court can determine that the challenge will succeed, if allowed to proceed by the grant of an extension of time, that may be a powerful factor in favour of the grant of an extension, at least in cases of a challenge pursuant to section 68 [15] . In such cases the court will be satisfied that there has been a serious irregularity giving rise to substantial injustice in relation to the dispute adjudicated upon in the award. Given the high threshold which this involves, the other factors which fall to be weighed in the balance must be seen in the context of the applicant suffering substantial injustice in respect of the underlying dispute by being deprived of the opportunity to make his challenge if an extension of time is refused. Where the delay is due to incompetence, laxity or mistake and measured in weeks or a few months, rather than years, the fact that the court has concluded that the section 68 challenge will succeed may well be sufficient to justify an extension of time. The position may be otherwise, however, if the delay is the result of a deliberate decision made because of some perceived advantage .” “82. Even where a party has good grounds for challenging an award under section 68, if he deliberately chooses not to do so timeously, or deliberately delays in doing so, because of some perceived advantage, there is nothing necessarily unfair in precluding him from resorting to the court when the perceived advantage no longer seems to him sufficiently advantageous. To allow him to do so would undermine the principle of finality, against the background of which questions of fairness fall to be judged. The court will not be sympathetic to those who ask to be relieved of a strict time limit when the failure to observe it has been deliberate and tactical.” (emphasis supplied) 77. Mr Landau submitted that the principles as stated in Terna Bahrain should not be applied and instead the general guidance in The Decurion should be adopted. He pointed out that the application in Terna Bahrain was governed by Part I of the Arbitration Act, section 1(a) of which provides that “the object of arbitration is to obtain the fair resolution of disputes by an impartial tribunal without unnecessary delay or expense.” Popplewell J was not dealing with an application under Part III of the Act, which relates to the recognition and enforcement of foreign awards, and section 1(a) does not apply to Part III. He argued that in the context of Convention awards, “speedy finality” is a policy that an enforcing court can aspire to but it should not be given the same emphasis as ruled by the court of the seat of arbitration. In the latter situation, as Popplewell J had stated in §67, “the starting point ... is that by their agreement to resolve their dispute by arbitration in London, and their involvement in the arbitration process in London, the [award debtor] indicated a willingness and ability to understand and deal with English procedural matters relating to the dispute, with the benefit, if necessary, of legal advice about those matters from those qualified to give it.” In contrast, in enforcement proceedings, the forum is not of the award debtor’s own choosing. 78. We do not agree with his submission. Mr Joseph referred us to section 2AA(1) of the Ordinance, which provides that the object of the Ordinance “is to facilitate the fair and speedy resolution of disputes by arbitration without unnecessary expense”. Section 2AA is based on section 1 of the English Act [16] . Unlike the English provision, section 2AA(1) applies to domestic arbitration, the enforcement of Mainland awards, and the enforcement of Convention awards. We agree with him that the guidance given in Terna Bahrain is of particular relevance because the approach gives emphasis to speedy finality, which is the policy underpinning both our section 2AA(1) and section 1(a) of the English Act. 79. In the context of an application for leave to appeal under section 23(2) of the Ordinance in China Link Construction Co Ltd v China Insurance Co Ltd [2002] 1 HKLRD 844 , Ma J (as he then was) emphasised the importance of speedy finality at §21: “It is commonly accepted that the philosophy behind the provisions in the Ordinance is the promotion of what has frequently been called “party autonomy”, i.e., where parties have agreed to refer disputes to arbitration, the court will interfere as little as possible. This is expressly provided for in s. 2AA(2) of the Ordinance. The public policy behind this is that arbitrations provide a viable and often preferable alternative to proceedings in court. One of the accepted characteristics of arbitration is speed: arbitration provides a means whereby the disputes between parties (usually commercial disputes) are resolved relatively quickly. ...” 80. In §22, Ma J referred to a number of provisions in the Ordinance and Order 73 of the Rules of the High Court and made the point it is readily apparent that the importance of speed is emphasised in the Ordinance. 81. As rightly submitted by Mr Joseph, a more disciplined approach is called for in the arbitration context, with its emphasis on speedy finality and the short statutory time limits. It is accordingly in an “entirely different territory” from applications for extensions of time for compliance with interlocutory orders or rules applying during the currency of a case ( Soinco Saci v Novokuznetsk Aluminium Plant [1998] 2 Lloyd’s Rep 337 at 338, per Waller LJ). 82. Besides, we do not think the judge did not have regard to the general guidance in The Decurion . There is no suggestion he did not look at all relevant matters, or that he had approached the exercise of discretion in a rigid mechanistic fashion. As we understand Mr Landau’s submission, his real complaint is that the judge’s weighting of various factors was plainly wrong so the appeal court should exercise the discretion afresh. 83. Mr Landau emphasised the importance of the merits of the setting aside application. He complained that the approach in Terna Bahrain has relegated this to a factor of secondary importance as the strength of the application is not among the “primary factors” mentioned in §27(3). But what Popplewell J said earlier about the primary factors must be read with §33, in particular, those parts we have emphasised in italics. We do not think the judge had made any error in law or principle in following the guidance in Terna Bahrain. Nor did the judge relegate merits or other relevant matters to factors of secondary importance. E3. If an irrelevant factor was taken into account 84. We turn to the complaint that the judge had taken an irrelevant factor into account in §129(3), namely, that the Awards have not been set aside by the supervising court and that they are still valid and create legally binding obligations. 85. Mr Landau submitted this is irrelevant as this factor is no more than a result of the “choice of remedies” principle, and to regard this factor as relevant would be to undermine the “choice of remedies” principle. We fail to see why this should make the factor irrelevant. Under the “choice of remedies” principle, a party may choose to have recourse against the award and apply to have it set aside. But if the choice is made not to pursue this active remedy, the award remains valid and binding and is capable of being enforced in any of the contracting states under the Convention. The “choice of remedies” principle is not undermined because of this. 86. The judge was mindful of the ruling by the enforcement court in Singapore that the Awards in favour of the Additional Parties were made without jurisdiction. But as recognised by Mr Landau, “the effect of such a ruling is in principle confined to that jurisdiction alone and it is possible for an award to be refused enforcement in one jurisdiction but enforced in another”. In taking this factor into account, the judge had regard to the consequence of declining to extend time for First Media to apply to set aside the Hong Kong Orders and Hong Kong Judgment. This is just to give recognition that Astro is permitted to obtain satisfaction in this jurisdiction of a legally binding debt due and owing by First Media to the Additional Parties. And unless an award is set aside, it is treated as binding for all purposes between the parties as between whom it is made, see section 42(2) of the Ordinance. 87. We reject the contention that one of the three factors the judge took into account in §129 is irrelevant. Shorn of that complaint, it is acknowledged that for the appeal court to re-open the exercise of discretion, it must be shown that the result of the exercise of discretion was perverse and plainly wrong. E4. If the exercise of discretion was plainly wrong 88. Mr Landau made a forceful submission that although the judge had taken into consideration that First Media’s setting aside application had merits (the judge did so on the assumption he was wrong to hold that First Media is precluded from relying on section 44(2) to resist enforcement), he did not appear to have given sufficient weight to the incontrovertible and fundamental jurisdictional objection, which was upheld by the Court of Appeal in Singapore. That there was no consent to arbitrate and no jurisdiction for the Tribunal to make the Awards in favour of the Additional Parties should have been given “paramount weight” in the balancing exercise. Mr Landau submitted that this must be the absolute end of the scale as far as merits are concerned. To refuse an extension of time in these circumstances gave rise to a “punitive, unprincipled result”. 89. He also contended that the judge had failed to give sufficient weight to the fact that Astro has not suffered any substantial prejudice other than costs which can be compensated as a result of the delay, and the size of the Awards. And the judge had given undue weight to the length of the delay and that it was the result of a deliberate and calculated decision not to take action in Hong Kong. He contended that the decision not to take action, although deliberate as it was thought there were no assets here, was not for a malign tactical advantage. He said this must be viewed in the multi-jurisdictional context of the New York Convention, that an award debtor is at the mercy of the creditor who can take the award for enforcement to any and all of the 156 contracting states worldwide, has six years to do so under Hong Kong law, and the presence of assets in the jurisdiction is not a pre-condition under the Ordinance to the enforcement of the award ( Rosseel N V v Oriental Commercial & Shipping Co (UK) Ltd [1991] 2 Lloyd’s Rep 625 at 629). He also complained that the judge did not appear to have considered that Astro would have known all this time that First Media would take the jurisdictional objection in enforcement proceedings in Hong Kong, just as it had done so in Singapore. 90. Mr Landau referred to the Malaysian Court of Appeal decision in Government of the Lao People’s Democratic Republic v Thai-Lao Lignite Co., Ltd [2011] MLJU 361. The High Court of Kuala Lumpur, being the court of the seat of arbitration, refused to extend time for an application to be brought to set aside an arbitral award on the grounds that it dealt with a dispute not within the terms of submission to arbitration and the arbitrators had wrongly exercised jurisdiction over non-parties. The application was made nine months after the expiry of a 90-day time frame in the Malaysian legislation. In allowing the appeal, the Court of Appeal considered the length of the delay, the reason for the delay, the prospect of success and the degree of prejudice to the respondent if the application was granted (§16). In the exercise of the unfettered discretion to extend time (§14), the approach was to look into all the circumstances and recognise the overriding principle that justice must be done (§18). It took into account that the refusal to extend time was tantamount to requiring the Government of Laos to pay out sums in excess of jurisdiction (§§20 and 33); that the appellant was a foreign sovereign and it was implicit in the decision-making process of a sovereign state there would procedural delay as this would involve decision-making process at various levels (§21); and that the respondent was well aware from the opposition to enforcement proceedings in other jurisdictions that the appellant was challenging the award (§36). It took the view that the delay was excusable and the appellant had acted expediently to file the application as soon as it was advised about the applicable timeframes (§26). 91. This case was decided in July 2011, before guidance was given in Terna Bahrain. The circumstances there are rather different. We should mention that the judge did not find First Media’s delay excusable, see §125 of the Judgment. So we do not think we can derive much assistance from the Malaysian decision. 92. Mr Landau also drew our attention to the Dallah case at first instance and made the point that although it was said in some English cases that delay in this context ought to be measured in days not months, that was not the case in Dallah. There, the application to set aside the order to enforce the arbitral award was taken out some five months after the ex parte order was made, and an extension of time was granted. However, it would appear from the judgment of Aikens J ([2009] 1 All ER (Comm) at §§54 to 56) that the circumstances were quite different. For one thing, under the ex parte order, the award debtor, which was the Government of Pakistan, was given just short of three months after service of the order to apply to set aside the award, on account of the State Immunity Act 1978. It applied for an extension of time not long after the expiry of the initial period on good grounds, and the summons was issued within time as extended. The kind of delay in the Dallah case cannot be regarded as in any way comparable to the present situation. 93. Mr Landau acknowledged that the weighting of factors is not to be interfered with by the appeal court unless the result is perverse. He argued that in this situation where the merits are crystal clear, and the objection to jurisdiction is fundamental (unlike just a challenge to procedural irregularity), in weighing up merits against the other factors, the overall justice should come down in favour of granting an extension of time, also taking into account the size of the award and the lack of substantial prejudice to Astro other than costs which can be compensated. 94. We are not persuaded that the weighting of the various factors by the judge was so plainly wrong that it must have been reached by a faulty assessment. 95. The judge had taken merits into consideration, on the assumption he was wrong in his conclusion that First Media is precluded from relying on section 44(2) to resist enforcement. He could not have failed to notice that First Media would make a fundamental objection to jurisdiction, and this objection had succeeded before the Singapore Court of Appeal. The judge did not treat merits as the decisive factor in the circumstances but weighed it against the three factors in §129(1) to (3). There is nothing to suggest he did not give full credit to the merits factor. Had he treated the strength of the merits as decisive without balancing this against other matters, this would have been a rigid, mechanistic approach, which was rejected in The Decurion . We do not think the judge’s approach was in error. 96. We turn to the delay of 14 months. No English or Hong Kong cases have been cited to us in which anything like this kind of delay was forgiven in the enforcement of a Convention award. We are here concerned with a time scale of 14 days allowed under Order 73 rule 10(6) to apply to set aside an order to enforce an award, and it is provided in rule 10(6A) that the supporting affidavit must be filed at the same time as the summons. This is to ensure there is minimal delay in the application, see a similar provision in rule 5(4)(b) for an application for leave to appeal from an arbitral award, as noted in China Link Construction at §22(5). Hence, as stated in Terna Bahrain at §28, the length of the delay must be judged against the yardstick of the 14 days provided for in the Rules of the High Court ; therefore a delay measured even in days is significant and a delay measured in many weeks or in months is substantial. Otherwise this would make nonsense of the policy of speedy finality, which underpins section 2AA(1) of the Ordinance. 97. As for the deliberate and calculated decision not to take action in Hong Kong for 14 months, it is clear from the evidence that First Media was well aware of the time limit to apply to set aside the Hong Kong Orders very early on and had sought advice from its Indonesian lawyers, MR & Partners. The detailed letter of advice of MR & Partners dated 29 October 2010 is telling. The advice given was that First Media should send a letter to the Hong Kong court to complain about an alleged irregularity in the service of the Hong Kong Orders in Indonesia. The Indonesian lawyers also advised that information be given to the Hong Kong court that “by law the SIAC award dated May 7, 2009 which will be enforced in Hong Kong has been stipulated by District Court of Central Jakarta Decision dated October 28, 2009 as the award which cannot be executed in Indonesia (Non Eksekuatur).” In addition, First Media was advised to rely on Article V of the New York Convention, that the subject matter of the difference is not capable of settlement by arbitration or that the recognition and enforcement of the award would be contrary to public policy. The Indonesian lawyers recommended that after the Lippo defendants had been validly served under the law of Indonesia, an application be submitted to the Hong Kong court to set aside the Hong Kong Orders on the basis that First Media had no asset in Hong Kong except the shares owned by AAL and the assets owned by AAL could not be executed by the Hong Kong court. 98. As submitted by Mr Joseph, the objection First Media was advised to take to the Hong Kong court at that time was not a point of jurisdiction. First Media decided not to take the line of objection as recommended, for reasons best known to it, and decided to take no action in Hong Kong because it had no asset here, not on account of the “choice of remedies” principle that Mr Landau has been advocating. 99. The garnishee order nisi was made on 22 July 2011 and served on First Media on 8 August. It took another three months for First Media’s former solicitors to file a notice to act. Two weeks before the substantive hearing of the application of Astro to make absolute the garnishee order nisi, on 18 January 2012 First Media issued the present summons to set aside the Hong Kong Orders and Hong Kong Judgment, and to discharge the garnishee order nisi . In the supporting affidavit of its former solicitor Mr Allen, in which an adjournment of the garnishee proceedings was sought, he stated in §40 that the delay from August 2011 to January 2012 was due to “First Media seeking legal advice and preparing the necessary applications”. We note from the call-over hearing of the present summons before Deputy High Court Judge Burrell on 30 January 2012 that the judge took the view the listing of the summons for a call-over hearing two days before the garnishee hearing “looks like brinkmanship” (page 5 of the transcript, lines G to R). 100. Mr Landau argued that since First Media had opposed Astro’s application to stay all further proceedings in this action, including the present summons of 18 January 2012, pending the determination by the High Court in Singapore of First Media’s application to set aside the Singapore enforcement orders, this indicated that First Media had no intention to delay proceedings in Hong Kong. We would give little weight to this. As stated in Terna Bahrain at §29, it is incumbent on the applicant to adduce evidence which explains his conduct, unless circumstances make it impossible. The court would give little weight to counsel’s arguments in the absence of such explanation from the applicant. 101. The judge had regard to the public interest engaged in litigants before our courts treating the court’s procedures as rules to be complied with, rather than deliberately ignored for perceived personal advantage. To grant an extension of time in these circumstances would undermine the principle of finality, against the background of which questions of fairness fall to be judged. He declined to come to the aid of First Media to get it out of its self-inflicted predicament. 102. As mentioned earlier, the judge did have regard to the size of the Awards, as well as the absence of substantial prejudice of Astro other than costs which can be compensated. Mr Landau contended the judge did not appear to have considered that Astro would have known all this time that First Media would take the jurisdictional objection in enforcement proceedings in Hong Kong, just as it had done so in Singapore and so had failed to take a relevant matter into account. We are not persuaded the judge had failed to have regard to this, as this has featured prominently in the earlier part of the Judgment. We think it might well be subsumed in the factor of absence of substantial prejudice suffered by Astro. 103. The judge was keenly aware that in refusing leave to First Media to bring the setting aside application out of time, the outcome might be regarded as remarkable or exceptional. Having followed through his reasoning, and having considered the submissions made to us, we are not persuaded that his decision was outside the generous ambit within which a reasonable disagreement is possible such that it was plainly wrong. F. STATUTORY PRE-CONDITIONS FOR ENFORCEMENT OF THE AWARDS 104. We will deal with this briefly as Mr Landau did not press his arguments on this point. 105. Part IV of the Ordinance adopts a two-stage approach for the enforcement of a Convention award. Under section 43 (stage 1), a party seeking to enforce an award must produce inter alia (a) the duly authenticated original award or a duly certified copy of it; and (b) the original arbitration agreement or a duly certified copy of it. Under section 44 (stage 2), this provides that enforcement of a Convention award shall not be refused except in the cases mentioned in subsections (2) and (3) of that section. 106. Before the judge, it was argued by Mr Landau that as the Singapore Court of Appeal has made a full and final determination that there never was an arbitration agreement between the Additional Parties and First Media, it was impossible for Astro to produce the original arbitration agreement or a duly certified copy to satisfy the pre-condition to enforcement in section 43. 107. The judge rejected this argument. He followed the decision of Mance LJ (as he then was) in Dardana Ltd v Yukos Oil Company in §§10 and 12, in which the relationship between stage 1 and stage 2 was fully explained. As stated in §117 of the Judgment, to satisfy the statutory pre-conditions in section 43, the award creditor is only required to produce, inter alia, (a) the original arbitration agreement or a duly certified copy of it; and (b) the duly authenticated original award or a duly certified copy of it which must have been made by the arbitral tribunal purporting to act under such arbitration agreement. All further arguments relating to the validity of the award, and other grounds for refusal of enforcement of the award, are to be dealt with in stage 2. 108. The law as stated in Dardana Ltd v Yukos Oil Company has been applied recently by the English Court of Appeal in Rainstorm Pictures Inc v Lombard-Knight [2014] Bus L R 1196 at §§27 to 28. 109. We are not persuaded that the judge was wrong to apply the law in Dardana Ltd v Yukos Oil Company. G. CONCLUSION AND COSTS 110. For the above reasons, we dismiss the appeal of First Media. 111. We will make an order nisi that Astro should have 60% of the costs of this appeal, with a certificate for three counsel, in view of our ruling that First Media has succeeded on the issue relating to the principle of “good faith”, the arguments of which took up a considerable amount of time. 112. Any party who wishes to vary the costs order nisi may apply within 14 days of this judgment, with leave to the other party to respond within 14 days thereafter. It will be dealt with on paper. (Susan Kwan) Justice of Appeal (David Lok) Judge of the Court of First Instance Mr David Joseph QC, Mr Bernard Man SC and Mr Justin Ho, instructed by Clifford Chance, for the 1 st to 8 th Applicants (1 st to 8 th Respondents) Ms Toby Landau QC, Mr Mark Strachan SC and Mr Jeffrey Chau, instructed by Stephenson Harwood, for the 2 nd Defendant (Appellant) [1] The Ordinance applied at the time the applications for leave to enforce the Awards were made in August and September 2010. The new Arbitration Ordinance , Cap 609 came into effect in June 2011. [2] Pursuant to Order 73 rule 10 (6) of the Rules of the High Court , which provides that within 14 days after service of the order, or if the order is to be served out of the jurisdiction, within such other period as the court may fix, the debtor may apply to set aside the order. [3] With Mr Mark Strachan, SC and Mr Jeffrey Chau [4] With Mr Bernard Man, SC and Mr Justin Ho [5] This should be a reference to Article V(1)(e). [6] Enacted in section 44(2) of the Ordinance [7] Section 2AA(1) reads: “The object of this Ordinance is to facilitate the fair and speedy resolution of disputes by arbitration without unnecessary expense.” [8] Article 4 is headed “Waiver of right to object” and provides: “A party who knows that any provision of this Law from which the parties may derogate or any requirement under the arbitration agreement has not been complied with and yet proceeds with the arbitration without stating his objection to such non-compliance without undue delay or, if a time-limit is provided therefor, within such period of time, shall be deemed to have waived his right to object.” [9] Article 16(2) reads: “A plea that the arbitral tribunal does not have jurisdiction shall be raised not later than the submission of the statement of defence. A party is not precluded from raising such a plea by the fact that he has appointed, or participated in the appointment of, an arbitrator. A plea that the arbitral tribunal is exceeding the scope of its authority shall be raised as soon as the matter alleged to be beyond the scope of its authority is raised during the arbitral proceedings. The arbitral tribunal may, in either case, admit a later plea if it considers the delay justified.” [10] That the respondent was not given proper notice of the appointment of the arbitrator or the arbitration or was otherwise unable to present his case; that the award is in respect of a matter which is not capable of settlement by arbitration or it would be contrary to public policy to enforce the award [11] Section 2AA(2)(a) reads: “This Ordinance is based on the principles that – (a) subject to the observance of such safeguards as are necessary in the public interest, the parties to a dispute should be free to agree how the dispute should be resolved;” [12] The equivalent provisions in the Ordinance are section 44(1) and (2) [13] Svenska PetroleumExploration AB v Government of the Republic of Lithuania (No 2) [2007] QB 886 , para 104 [14] The equivalent provision in the Rules of the High Court is Order 2 rule 5. Similarly, whether the failure to comply was intentional (in rule 5(1)(c)) is identified as a separate factor from whether there is a good explanation for the failure to comply (in rule 5(1)(d)). [15] The relevant part of section 68 reads: “(1) A party to arbitral proceedings may ... apply to the court challenging an award in the proceedings on the ground of serious irregularity affecting the tribunal, the proceedings or the award ... (2) Serious irregularity means an irregularity of one or more of the following kinds which the court considers has caused or will cause substantial injustice to the applicant ...” [16] Report of Committee on Hong Kong Arbitration Law, 30 April 2003, §8.9 Look up this case on Lawcite Noteup",
  "length": 121204,
  "headers_seen": [
    "A. INTRODUCTION",
    "B. BACKGROUND",
    "B1. The Subscription and Shareholders’ Agreement (“the SSA”)",
    "B2. How the dispute arose",
    "B3. The Arbitration",
    "B4. The Singapore Proceedings",
    "B5. The Hong Kong Proceedings",
    "C. THE ISSUES RAISED BELOW AND ON APPEAL"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkca/2016/595",
  "query": "seat of arbitration",
  "ts": "2025-10-16T10:49:31",
  "ok": true
}