{
  "title": "TOMMY C.P. SZE & CO. V. LI & FUNG (TRADING) LTD. AND OTHERS | [2002] HKCFI 682 | HKLII",
  "court": null,
  "year": 2002,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2002] HKCFI 682 TOMMY C.P. SZE & CO. V. LI & FUNG (TRADING) LTD. AND OTHERS Judgment Information Date 27 Oct, 2002 Action No. HCCT29/2002 Neutral Cit. [2002] HKCFI 682 Parallel Cit. [2003] 1 HKC 418 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCCT29/2002 HCCT000029/2002 TOMMY C.P. SZE & CO. v. LI & FUNG (TRADING) LTD. AND OTHERS HCCT000029/2002 HCCT29/2002 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO. 29 OF 2002 -------------------------- BETWEEN TOMMY C.P. SZE & COMPANY, the Liquidator of FIGURE DEVELOPMENT LIMITED (in Creditors' Voluntary Liquidation) Plaintiff AND LI & FUNG (TRADING) LIMITED 1st Defendant AVON PRODUCTS INC. 2nd Defendant AVON PRODUCTS PTY. LTD 3rd Defendant AVON COSMETICS LTD 4th Defendant AVON COSTMETICS (MALAYSIA) SDN BHD 5th Defendant AVON CANADA INC. 6th Defendant AVON COSMETICS GMBH 7th Defendant ----------------------- Coram: Hon Ma J in Chambers Dates of Hearing: 2 and 5 September 2002 Date of Handing Down Judgment: 28 October 2002 ------------------------ J U D G M E N T ------------------------ The nature of the Plaintiff's claims 1) The writ of summons in the present action was issued on 4 October 2001. In this action, the Plaintiff claims against seven defendants, who can conveniently be divided into two groups : in the first, the 1st Defendant; the other defendants can be grouped together. 2) The Plaintiff is named in the writ as Tommy C.P. Sze & Company, being the liquidator of Figure Development Limited (\"FDL\") which has been in creditors' voluntary liquidation since 27 December 2000. Strictly speaking, the Plaintiff in the action ought to be FDL and not its liquidator, but no point is taken on this. 3) FDL carried on the business of manufacturing gift items. By various contracts entered into between FDL and the 1st Defendant acting as agent for and on behalf of the 2nd to 7th Defendants (various overseas companies) between November 1999 and July 2000, FDL sold gift items to the 2nd to 7th Defendants. 4) Each of these contracts took the form of documents headed \"Placement Memorandum\" setting out the usual purchase details and also terms and conditions on the reverse. These Placement Memoranda were in the 1st Defendant's standard form. I shall later set out the arbitration agreement relied upon by the 1st Defendant contained in these Memoranda. The Placement Memoranda contain or evidence the relevant contracts made between FDL and the Defendants. Though the 1st Defendant is expressly named in these Memoranda as the buying agent for and on behalf of the other Defendants, it is clear that the 1st Defendant was itself also subject to the terms and conditions thereof. 5) The Plaintiff's claims against the 2nd to 7th Defendants expressly refer to the Placement Memoranda and the terms and conditions contained therein. As pleaded, the Plaintiff's cause of action is breach of contract in that the 2nd to 7th Defendants have failed to pay the agreed purchase price or have wrongfully made deductions. The claims for the balance of the purchase price due under the various contracts are alleged to amount to US$490,937.43. 6) The nature of the claims against the 1st Defendant is less straightforward. The following causes of action appear to be pleaded : (1) Liability under the Placement Memoranda (by virtue of an implied term to this effect) in respect of the 2nd to 7th Defendants' obligations in connection with the same. (2) Monies had and received and /or constructive trust. The basis for these allegations is that if the 2nd to 7th Defendants had fully paid the 1st Defendant in respect of their payment obligations under the Placement Memoranda, the 1st Defendant was in turn accountable to FDL for such payments. (3) Liability for the tort of assisting or inducing the 2nd to 7th Defendants to breach their contracts with FDL by the failure to make full payment. (4) Breach of a collateral contract that the 1st Defendant would act in accordance with the Placement Memoranda by making payment to FDL once it had received the relevant payments from the 2nd to 7th Defendants. (5) Breach of contract or duty in wrongfully making deductions from the monies due under the Placement Memoranda from the other Defendants to FDL. 7) If I have somehow omitted reference to any other cause of action alleged by the Plaintiff against the 1st Defendant, it is because the Statement of Claim is not easily understood in many parts. In the end, I have come to the conclusion that upon analysis, all the causes of action alleged against the 1st Defendant arise in connection with the Placement Memoranda. I will develop this aspect more in due course. 8) I should also mention it is pleaded that the 1st Defendant has admitted in correspondence a liability for US$23,350 in relation to a debit note No. 070030 dated 3 July 2000 issued by the Plaintiff to the 2nd Defendant. This claim is treated as a separate claim to the US$492,937.43 pleaded against the Defendants as a whole. The applications before the court 9) By a summons dated 2 November 2001, the 1st Defendant has applied for a stay of the action pursuant to the Arbitration Ordinance , Cap. 341 (\"the Ordinance\") and the court's inherent jurisdiction. I deal briefly with this latter ground. There is of course no inherent jurisdiction to stay court proceedings by virtue of an arbitration agreement. The jurisdiction here is entirely statutory and it is therefore to the relevant provisions of the Ordinance that reference must be made in considering this application. 10) By a summons dated 20 August 2002, the Plaintiff applied under RHC, Order 27, rule 3 for judgment in the said sum of US$23,350 on the basis of admissions made by the 1st Defendant. 11) Both summonses were before me at the hearings on 2 and 5 September 2002. In these hearings, Mr Kenneth Chan appeared for the Plaintiff, Mr Paul Shieh for the 1st Defendant. The 2nd to 7th Defendants were not before the court. They were not served with either of the two summonses. I would add they have probably not even been served with the writ of summons in the present action. 12) The 20 August 2002 summons was disposed of by a consent order made on 2 September 2002 and I will say no more about that. The stay application was therefore the only contested application before the court. 13) Before dealing with the applicable law in this area, I should first set out the controversies that divide the parties in this application. The parties' respective positions on the stay application 14) The 1st Defendant relies on clause 25(b) of the terms and conditions on the reverse of the Placement Memoranda : \"All disputes at any time arising between Buying Agent [the 1st Defendant] and Vendor [FDL], or Buyer [the 2nd to 7th Defendants as the case may be] and Vendor, as to the performance of the Contract or as to any matter or thing arising out of the Contract or in any way connected herewith shall be referred to the arbitration as a single arbitrator who shall be agreed between Buying Agent and Vendor, or Buyer and Vendor, within 14 days of the dispute arising. Failing such agreement, the single arbitrator shall be appointed at the request of either party by the President for the time being of the Law Society of Hong Kong. The arbitration shall be conducted in accordance with the Arbitration Ordinance for the time being in force in Hong Kong. It is hereby agreed and declared by and between Buying Agent, Buyer and Vendor that the finding of an arbitrator appointed pursuant to this clause shall be final, conclusive and binding upon Buying Agent, Buyer and Vendor for all purposes and that neither Buyer Agent, Buyer nor Vendor shall in the absence of a mistake of law, have the right to appeal the arbitrator's decision to the courts of Hong Kong.\" 15) Its position is simple. Clause 25(b) is an arbitration agreement made between the Plaintiff and the Defendants. The Plaintiff's claims arise out of or are connected with the contracts contained in or evidenced by the Placement Memoranda and should therefore be referred to arbitration. It is immaterial whether the arbitration agreement was a domestic or an international arbitration agreement : on either view, the Plaintiff's claims in the present action should be referred to arbitration. Reliance is placed here on to section 6 of the Ordinance and article 8(1) of the UNCITRAL Model Law (set out in the Fifth Schedule to the Ordinance). 16) The Plaintiff's response to this is more elaborate but can be distilled into the following propositions : (1) Clause 25(b) is not an arbitration agreement in the true sense in that it does not require the parties to submit their disputes or differences only to arbitration. In these circumstances, arbitration is only one of the options open to either party to resolve their differences and they can instead institute court proceedings if they so wish. (2) Further, where the arbitration procedure in clause 25(b) has become inoperative or incapable of being performed, then court proceedings are in any event permissible. It is contended that the arbitration process in clause 25(b) is inoperative or incapable of being performed in the present case. (3) Furthermore, the disputes or differences between the Plaintiff (or FDL) and the Defendants in the present case, if any exists, do not come within the ambit or operation of clause 25(b). 17) The Plaintiff's position raises some fundamental questions as to the way the court approaches stay applications, and I hope I will be forgiven in dealing with this in some detail. The court's approach in stay applications 18) It is of course crucial in any application for a stay (whether under section 6 of the Ordinance or Article 8 of the Model Law) that there exists an arbitration agreement. By this is meant an agreement between the parties by which present or future disputes or differences between them are required to be resolved by the arbitral process. The definition of \"arbitration agreement\" is contained in section 2 of the Ordinance, which in turn refers to Article 7 of the Model Law. An agreement which does not compel parties to have disputes or differences resolved by arbitration is not an arbitration agreement for present purposes. Where, for example, an option is given to the parties to go to arbitration if they so choose but with litigation in the courts being an available option as well, this is not truly an arbitration agreement. There must be its element of compulsion in the agreement between the parties that any disputes or differences must be arbitration. 19) Thus, the logical starting point of all applications for a stay must be : Is the clause in question an arbitration agreement? (Question 1) If the answer is No, a stay will not be granted. 20) Next, the arbitration agreement (if there is one) must not be \"null and void, inoperative or incapable of being performed\" : see Article 8(1) of the Model Law. The inquiry here is therefore : Is the arbitration agreement null and void, inoperative or incapable of being performed? (Question 2) If the answer is Yes, no stay can be ordered. 21) On the assumption that there exists an arbitration agreement and that it is capable of being performed, the next step is to discover whether in reality there does exist a dispute or difference between the parties. If upon analysis no dispute or difference exists, there is nothing to refer to arbitration. Here, the relevant question is : Is there in reality a dispute or difference between the parties? (Question 3) If the answer is No, no stay will be ordered. 22) Finally, even where a dispute or difference truly exists, it must be determined whether the arbitration agreement then covers the dispute or difference in question. This involves first analysing the nature of the dispute or difference between the parties and then construing the arbitration agreement to see whether it comes within it. The question here is therefore : Is the dispute or difference between the parties within the ambit of the arbitration agreement? (Question 4) If the answer is No, a stay will not be ordered. 23) I have set out the four questions that a court must generally deal with in stay applications. It is of course open to the court to deal with the questions in whatever order seems efficient and one has to recognize the obvious fact but not all of these questions will be controversial in every case, but in my view they set out the logical and basic approach of the court. 24) I now deal with each of these questions in the context of the present application. It is fair to say that to varying degrees, all of the questions are controversial. Question 1: Is the clause in question an arbitration agreement? 25) This is not a question that is usually controversial in most stay applications, but in view of the way Mr Chan presents his submissions, it is very much so in the present case. 26) It is contended by Mr Chan that on its true construction, clause 25(b) in reality gives an option to the parties whether or not to go to arbitration to resolve disputes or differences and does not compel it. In other words, clause 25(b) merely gave FDL a choice to litigate its disputes whether by arbitration or litigation in the courts. If it chose the arbitration route, then it was obliged to refer any disputes arising to arbitration within the stated limit of 14 days of the dispute arising. If it did not or chose not to go to arbitration, then FDL was free to litigate in the courts. 27) It is contended that a clause which truly gives such an option to the parties, in cases when the applicable time limits have not been complied with, is a clause that merely bars the remedy, in contradistinction to a clause that bars the right or claim. Some support for this is derived from the textbooks : see the discussion in Mustill & Boyd : Commercial Arbitration (2nd Edition), at 202-4; Russell on Arbitration (21st Edition), at paragraph 5-006; Merkin : Arbitration Law (1991), at paragraphs 11.14-11.20 and Morgan : The Arbitration Ordinance of Hong Kong : A Commentary , at paragraph 29.02. 28) However, this sort of labelling, much favoured by lawyers, is apt to confuse in the arbitration context and in particular when dealing with stay applications. It is therefore important in my view to recognize this potential confusion : (1) In the first place, when reference is made to the barring of the remedy or of the claim/right, this is usually understood in the context of limitation periods. Thus the expiry of the 6 year limitation period for claims in contract (section 4 of the Limitation Ordinance , Cap. 347 ), is said to bar the remedy but not the right. In this situation, while the party claiming under the contract will be unable to enforce his claim by action or counterclaim (this being his \"remedy\"), the statutory limitation period, however, will not necessarily prevent recovery other than by those means. For example, money paid to a creditor by a debtor without appropriation may be appropriated to a statute barred debt. See here : the useful discussion in Halsbury's Laws of England , Vol. 28 (4th Edition Reissue), at paragraph 846. On the other hand, the expiry of the relevant limitation period for bringing actions for the recovery of land, will bar the right and not just the remedy : see section 17 of the Limitation Ordinance which extinguishes the title of the person seeking to recover the land in question. (2) The distinction between the barring of the remedy and the barring of the right (in the sense referred to in the previous paragraph) I will hereafter refer to, for convenience, as the \"classic distinction\". (3) The classic distinction in the sense identified in the previous paragraph carries over to limitation periods imposed by contract as well. Some will bar the right or claim altogether, others only the remedy. For a discussion of this critical distinction in contract : see Aries Tanker Corporation v. Total Transport Limited [1977] 1 WLR 185 (House of Lords). (4) Accordingly, in some circumstances it can become crucial to arrive at a view as to whether a statutory limitation period or term of contract (as the case may be) bars the right or merely the remedy. In most cases, however, the distinction will make no practical difference : a litigant is simply barred from making a claim by reason of the limitation period imposed by statute or contract. In this respect, arbitration is no different. Thus, in most cases, it may make no difference whether or not a clause bars the remedy or bars the right, but in the somewhat limited circumstances referred to in subparagraph (1) above, it may. Procedurally, it may also make no difference. For example, under the power which used to be vested in the court to extend time to commence arbitration proceedings (the old section 9 of the Ordinance), this power applied irrespective of whether the clause in question barred the remedy or the right in the classic sense referred to earlier : see Consolidated Investment & Contracting Company v. Saponaria Shipping Company Limited (The Virgo) [1978] 1 WLR 986 (English Court of Appeal). The power to extend time is now of course vested in both the arbitral tribunal and the court : see section 2GD of the Arbitration Ordinance . I shall have something more to say about this provision later. (5) The scope for confusion arises when the type of contractual clause giving the parties an option to arbitrate or litigate (see paragraphs 26 and 27 above) is also described as a clause which bars the remedy but not the right (when the contractual time limits or other conditions are not fulfilled for the bringing of arbitration proceedings). The reference to a clause that bars the remedy in this context is quite different from the classic sense referred to above. Here, the fact of the remedy (i.e. having the matter resolved by arbitration) being barred is not that the party affected becomes barred from making a claim at all (as one would under the classic distinction), only that he is merely barred from making a claim in arbitration proceedings, but he is otherwise free to claim in court proceedings. The critical distinction here is whether or not the clause in question truly gives, as it were, an option to arbitrate as opposed to a requirement to do so. (6) It can thus readily be seen that the distinction just referred to is not the classic distinction at all. Thus, as submitted by the Plaintiff in the present case, even though a time limit for bringing proceedings is involved, the relevance of the limitation is not the barring of the ability to make a claim absolutely, but merely the barring of the ability to make a claim in the arbitration forum, leaving open the ability to make the same claim in court proceedings. In short, it is as though an option is given to the party claiming : either arbitration or litigation in the courts. 29) In the present case, the court has therefore to determine whether or not the effect of the clause in question (clause 25(b)) is to allow a claimant to go to court to have the disputes with the other party resolved, should he not wish or is unable to go to arbitration for whatever reason. In other words, is it an option clause? If it is, then a stay is not granted because the claimant is not required to have the dispute or difference resolved by arbitration. If it is not, then the court will move on to the other Questions I have identified. 30) Mr Shieh argued that the issue of whether the clause was a remedy-barring or a claim-barring clause ought to be left to the arbitral tribunal to decide. In support of this, he referred to Merkin : Arbitration Law , at paragraph 11.16 and to the decision of Mance J in Grimaldi Compagnia Di Navigaziome Spa v. Sekihyo Lines Limited [1999] 1 WLR 708 , at 715. I agree in so far as the classic distinction between a remedy-barring provision and a right-barring one is concerned. However, that is not the distinction with which the present application is concerned. As stated just now, the court is concerned with the question whether or not clause 25(b) gives FDL some sort of option. This is another way of asking the question whether the clause requires disputes or differences to be resolved through arbitration. It is a question that the court alone must resolve. The passages from Merkin and Grimaldi , properly understood, refer only to questions arising from the classic distinction. 31) The high point of the Plaintiff's case is really the authority of Pinnock Brothers v. Lewis & Peat Limited [1923] 1 KB 690 . There, the arbitration agreement was in the following terms, \"Any disputes arising out of this contract shall be settled by arbitration in London, each party to the contract appointing one arbitrator\". Like the present case, a time limit was imposed for the commencement of arbitration proceedings. The proceedings not having been commenced in time, the arbitrator held that he had no jurisdiction to adjudicate on the claims. The claimant then instituted court proceedings. At trial, the defendant took the point that the claim was time barred. It was held, however, by Roche J that the presence of the arbitration agreement was not \"a bar to an action or a condition precedent to a right of action\" (emphasis added) : see 696. The learned judge continued : \".... It may be a ground for applying for a stay, but it is not even a ground upon which the Court is bound to grant a stay. The mere presence of an arbitration clause is no defence to an action on the contract. An award following on the arbitration clause may be an answer to the claim, and it wil be an answer where it deals with the claim. Ayscough's Case .... is an authority for that. But where, as in this case, the award does not deal with the claim but merely with the jurisdiction of the arbitrator, it is no answer. Accordingly, I hold that the defence relied upon under the arbitration clause and as to the period of limitation thereunder affords no defence to the plaintiffs' claim.\" 32) Given the clear and mandatory words of the clause in Pinnock , Mr Chan seeks to argue that the present clause 25(b) should similarly be construed. Accordingly, he argued, the effect of clause 25(b) should not be regarded as a bar to an action in court. In further support of his submissions, Mr Chan placed reliance on Hardwick Game Farm v. SAPPA [1964] 2 Lloyd's Rep. 227, at 273(2)-274(2) (English High Court). 33) In my judgment, care is required when considering cases like Pinnock and Hardwick Game Farm . Whatever may have been held to be the right conclusion in these cases, this does not necessarily or readily become applicable in all other cases : (1) The wording of the clause in question in any given case will be different. (2) More important, as a matter of construction of contracts, the context in which contractual clauses have been construed by the courts in previous cases must also be considered. Most of the time, the relevant context perhaps does not change. However, Pinnock and, to an extent, Hardwick Game Farm , were decided at a time when the English courts still somewhat jealously guarded the right of citizens to have access to the courts. Historically, this way of thinking derived from the Magna Carta . It is not the function of this judgment to embark on a survey of the changing attitudes to arbitration (for a useful discussion, see Mustill & Boyd : Commercial Arbitration , at 431 onwards), but it is sufficient to point out that the modern philosophy is quite different. The emphasis these days is on party autonomy with minimal interference by the courts and where parties have expressly agreed to refer disputes or differences to be determined by arbitration, it is generally safe to assume that it is their intention to have such disputes or differences to be resolved only by arbitration. As Mance J said in Grimaldi , at 717D, \"The dominant icon where litigation and arbitration inter-net is now party autonomy\". That was said in the context of the arbitration legislation in England. This is all the more so in Hong Kong, where this \"icon\" is embodied in section 2AA of the Ordinance. I should be very surprised if these days, a clause such as that in Pinnock would be construed in any way other than to require the parties to refer the relevant dispute to arbitration and arbitration alone. In order for the court to reach the view that if a party, say, fails to institute arbitration proceedings within a certain time, he is then at liberty to commence court proceedings (thus having effectively an option whether or not to arbitrate), the clause in question must be specific and clear to this effect. As Hobhouse J remarked in The World Era [1992] 1 Lloyd's Rep. 45, at 50(1), such clauses must be \"exceptional\". (3) It is also to be noted that in Pinnock (in the passage quoted above), Roche J expressly left open the question whether or not the clause in question in that case, could found an application for a stay though his remarks, necessarily obiter, would suggest that it would not. It should be remarked that Pinnock did not involve a stay application. (4) In my view, it must be extremely doubtful whether Pinnock and the cases that follow it are of much value these days. In so far as it is authority for the type of option clause I have referred to, it is, I think, best to treat that case as being one decided on its own special facts in that particular era rather than one that contains any statement of broad principle. 34) In my judgment, it is clear that clause 25(b) is an arbitration agreement. It makes little sense to construe the clause as somehow giving an option to the parties whether or not to have their disputes or differences resolved by arbitration. Nothing in the clause mentions an option as such. It is also difficult to see why parties would wish to have disputes or differences between them resolved both privately and publicly. It is surely one or the other. It does not readily make sense (in the absence of clear words dictating this result) that a party is able or is required to go to arbitration provided he fulfills procedural requirements (such as commencing proceedings within a certain time) but if he does not or chooses not to, then he can freely litigate in the courts. 35) I should just also record that Mr Chan tried to support his arguments further by referring to clause 25(a) (of the terms and conditions on the reverse of the Placement Memoranda) which states, \"The Contract shall be governed by and construed in accordance with the laws of Hong Kong\". Accordingly, he argues, the Limitation Ordinance must therefore apply and the more generous time limits provided therein are applicable to the Plaintiff's claims. It must therefore follow, his argument continues, that the time limits stipulated in clause 25(b) are only applicable to arbitration proceedings and the Plaintiff would be free to commence court proceedings relying on the time limits contained in the Limitation Ordinance . This argument fails in its premise. Clause 25(a) begs the question of what is the applicable law to the situation confronting the court. It does not by itself provide the answer. 36) The answer to Question 1 in this case is therefore Yes. 37) I have dealt with this Question at some length, mainly in order to try to dispel some of the confusion that arises when one deals with somewhat esoteric concepts such as the distinction between remedy-barring and claim-barring clauses. The cases are also somewhat confusing in this area, particularly Pinnock . In future, the relevant inquiry here should simply be : Is the clause in question one that requires disputes or differences to be resolved by arbitration? Question 2 : Is the arbitration agreement null and void, inoperative or incapable of being performed? 38) This inquiry is of course derived from the wording of Article 8 of the Model Law. In essence, before any dispute or difference is referred to arbitration, the court must be sure that this is a viable option; in other words, that an arbitration can take place to resolve the relevant disputes or differences. 39) Where, for instance, the alleged agreement is void (say for public policy), frustrated or simply incapable of being performed, it cannot and will not be enforced. The words \"null and void, inoperative or incapable of being performed\" have been the subject of many cases and text book discussion. I need only refer to the following : Mustill & Boyd : Commercial Arbitration , at 464-465; Morgan : The Arbitration Ordinance of Hong Kong : A Commentary , at 436-439. They are words that have existed in various forms in arbitration legislation, both here and elsewhere (such as section 9(4) of the Arbitration Act 1996 in England) and in international conventions (such as article II(3) of the New York Convention). 40) Mr Chan argues that the present case falls within these words by reason of the time bar element in the arbitration agreement. It will be recalled that clause 25(b) of the Placement Memoranda requires any disputes between the parties to be referred to arbitration within 14 days of the dispute arising. As the dispute between the Plaintiff and the defendants was not referred to arbitration within this time, the arbitration has now become \"null and void, inoperative or incapable of being performed\", so Mr Chan contends. 41) I am unable to agree with these submissions. 42) The existence of a time bar has never been regarded as rendering an arbitration agreement incapable of being performed. The thinking behind this is that the arbitration can of course proceed, only that the claim is at risk of being dismissed : see Mustill & Boyd : Commercial Arbitration , at 465. 43) This is all the more so when one considers the effect of section 2GD of the Ordinance giving power to the arbitral tribunal itself to extend the time stipulated in an arbitration agreement for the commencement of arbitration proceedings. Section 2GD states as follows : \" (1) This section applies to an arbitration agreement to refer future disputes to arbitration that provides for a claim to be barred, or for a claimant's right to be extinguished, unless the claimant, before a time or within a period fixed by the agreement, takes a step- (a) to commence arbitration proceedings; or (b) to commence some other dispute resolution procedure that must be exhausted before arbitration proceedings can be commenced. (2) On the application of a party to an arbitration agreement to which this section applies, an arbitral tribunal may, in accordance with this section, make an order extending the period for taking a step of the kind referred to in subsection (1). (3) An application may be made only after a claim has arisen and after exhausting any available arbitral procedure for obtaining an extension of time. (4) An applicant must give notice of the application to the other parties within 7 days after making it. Those other parties are entitled to be heard when the application is determined. (5) An arbitral tribunal may take an order under this section extending a period only if it is satisfied that-- (a) the circumstances were such as to be outside the reasonable contemplation of the parties when they entered into the arbitration agreement, and that it would be just to extend the period; or (c) the conduct of one party makes it unjust to hold the other parties to the strict terms of the agreement. (6) An arbitral tribunal may extend a period for such further period and on such terms as it thinks fit, and may do so even though the period previously fixed (whether by agreement or by a previous order) has expired. (7) This section does not affect the operation of any enactment that limits the period for commencing arbitration proceedings. (8) The power conferred on an arbitral tribunal by this section is exercisable by the Court or a judge of the Court if at the relevant time there is not in existence an arbitral tribunal that is capable of exercising it.\" 44) The words in section 2GD(1) are wide enough to cover both clauses barring the claim as well as those barring the remedy : c.f. The Virgo , at 990, 991 and 993. This seems to me to have been the intention of the drafters of the legislation and the references to the claim being \"barred\" and rights being \"extinguished\" confirm this. 45) Prior to the enactment of that section, the power to extend time lay with the court : see the old section 29 of the Ordinance. Consistent with the concept of party autonomy, that power now rests with the arbitral tribunal. Resort to the courts for an extension will only be possible where at the relevant time there is not in existence an arbitral tribunal capable of exercising that power : see section 2GD(8). 46) Against this, Mr Chan argues, in further support of his submissions here, that there is at the moment no arbitral tribunal that is in existence. Therefore, he continues, section 2GD(1) is inoperative and it is the court only that has the power to extend time (under section 2GD(8)). Thus, it is the court that has jurisdiction to deal with the present dispute between the parties. 47) With respect, this convoluted argument obscures what is clearly the intention behind section 2GD. In my view, that provision does not in any way prevent a court staying proceedings brought contrary to an arbitration agreement. The fact that those arbitration proceedings may be time barred does not prevent a court from referring the relevant dispute or difference to arbitration to be dealt with by the tribunal chosen by the parties. It will then be up to that tribunal to determine the dispute or difference either by reference to the time bar provisions in the contract or to extend the time for commencing arbitration proceedings under section 2GD(1) of the Ordinance. Afterall, this is similar to court proceedings brought after a limitation period has expired : an action can still be instituted and the court has the jurisdiction to determine the relevant dispute. As Hobhouse J also said in The World Era , at 50(1), a time bar does not go to the jurisdiction of the court or arbitral tribunal : it merely provides a defence to a claim. 48) I should finally add that despite Mr Chan's reference to section 2GD(8), there is no application made under that section to extend time. It is easy to see why not : the Plaintiff does not want to arbitrate at all. In these circumstances, nothing in section 2GD(8) prevents the court from staying the present proceedings in favour of arbitration. An interesting point might arise in the rare case where a stay application is brought at the same time as an application to extend time under section 2GD(8) (thus effectively requiring the court to determine whether it or an arbitral tribunal should determine the question of extending time for commencing arbitration proceedings), but this does not arise in the present case and I do not find it necessary therefore to deal with it. It is sufficient to dispose of Mr Chan's reliance on section 2GD(8) simply on the basis that this subsection does not prevent a court from staying proceedings. 49) The answer to Question 2 is No. Question 3 : Is there in reality a dispute or difference between the parties? 50) Prior to the enactment of the present section 6 of the Ordinance and Article 8 of the Model Law, the court's approach had been that proceedings would only be stayed (and the relevant dispute or difference referred to arbitration) if a genuine dispute existed between the parties. A genuine dispute was one in which there was a substantial or arguable defence to the claim brought by the Plaintiff in the action. 51) That is no longer the law. A dispute will exist unless there is a clear and unequivocal admission not only of liability but also of quantum : see, among many other cases, Tai Hing Cotton Mill Limited v. Glencore Grain Rotterdam BV [1996] 1 HKC 363 , Guangdong Agriculture Company Limited v. Conagra International (Far East) Limited [1993] 1 HKLR 113 , Louis Dreyfus Trading Company Limited v. Bonarich International (Group) Limited [1997] 3 HKC 597 and F&D Buildings Services Engineering Company Limited v. Chevalier (E&M Contracting) Company Limited [2001] 3 HKC 403 . 52) I have earlier set out a summary of the Plaintiff's claims against the Defendants. It is not contended by Mr Chan that no dispute exists for the Plaintiff's claims except for the claim in relation to the sum of US$23,350. As this latter claim has been disposed of by the consent order made on 2 September 2002, to which I have earlier referred, it is unnecessary to deal further with this aspect. The remainder of the Plaintiff's claims being disputed (both as to liability and quantum), Question 3 must be answered Yes. As I have said, the Plaintiff does not really contend otherwise. Question 4 : Is the dispute or difference between the parties within the ambit of the arbitration agreement? 53) The existence of disputes or differences between the parties is not by itself enough to activate the operation of an arbitration agreement. It is necessary further to demonstrate that such disputes or differences are matters which are intended by the arbitration agreement to be referred to arbitration. In other words, the relevant dispute or difference must come within the ambit of the arbitration agreement. 54) This part of the inquiry requires the court to construe the arbitration agreement in order to identify exactly what matters are required to be referred to arbitration. 55) The arbitration agreement in the present case is by no means an unusual one in this regard. The matters to be referred to arbitration are \"All disputes [between the Plaintiff and the Defendants] .... as to the performance of the [Placement Memoranda] .... or as to any matter or thing arising out of the [Placement Memoranda] .... or in any way connected therewith ....\". These are very wide words in my view. 56) The summary of the Plaintiff's claims demonstrates in my view that they clearly fall within the ambit of the arbitration agreement in the present case. The claims against the 2nd to 7th Defendants are all based on an alleged liability under the Placement Memoranda. The Plaintiff also claims against the 1st Defendant directly under the Placement Memoranda. As for the other claims made against the 1st Defendant, in so far as they can be understood, they are clearly connected to the contracts contained in the Placement Memoranda. For instance, one of the causes of action that Mr Chan says as pleaded is a claim based on constructive trust. Such a claim, he argues, is clearly not one based on contract. I accept that as far as it goes, but the words of clause 25(b) are sufficiently wide to cover a claim in constructive trust in circumstances where this arises out of the relationship created under the Placement Memoranda or is connected with it. 57) Words like \"in connection with\" or \"connected therewith\" are wide in nature and will cover all disputes other than those entirely unrelated to the transaction covered by the contract in question : see Mustill & Boyd : Commercial Arbitration , at 119. These words are wide enough to cover claims in constructive trust as long as they are related to the transaction covered by the arbitration agreement. 58) I think ultimately Mr Chan accepts this. His arguments, rather, center around the contention that if one analysed the correspondence between the parties, it is the defences there raised by the defendants that are not covered by the arbitration agreement. Specific reference is made to a letter dated 7 January 2002 from the 4th Defendant to the Plaintiff's solicitors in which it seems to be alleged that the 4th Defendant's contractual involvement was only with the 1st Defendant and not FDL. From this, Mr Chan submits that as the 4th Defendant is raising a dispute which is not based on the Placement Memoranda, this dispute is therefore not covered by the arbitration agreement contained therein. He adds the fact that the Plaintiff has made claims under the Placement Memoranda is not relevant because the arbitration agreement refers to \"disputes\", not \"claims\". 59) In deciding whether or not a dispute or difference comes within the ambit of an arbitration agreement (and therefore whether it should be referred to arbitration), the court adopts the following approach : (1) As stated above, it must first construe the arbitration agreement itself. (2) Next, it must analyse the nature of the dispute or difference by reference to the claim which is made. The nature of the claim will enable the court to decide the question whether or not the dispute or difference is one that is covered by the arbitration agreement. For example, where the arbitration agreement stipulates that all disputes or differences in connection with a contract should be referred to arbitration, the court will look at the claim that is made to see whether or not it is covered by these words. (3) What then of Mr Chan's point of principle that one must look also to the defence in determining whether or not the dispute or difference comes within the ambit of the arbitration agreement? In my view, the content of the defence is generally irrelevant to this question. Whatever the nature of the defence, the claim still remains the same. In the example referred to in subparagraph (2) above, a defence that the relevant contract is void or non-existent or that other contracts have to be taken into account (not containing an arbitration agreement) does not change the nature of the claim that is in dispute, namely, one that is connected with the relevant contract covered by the arbitration agreement. Afterall, in determining whether or not a dispute or difference exists, the court does not look at the contents of the defence to the claim at all : as stated above, a dispute or difference simply exists unless there is a clear and unequivocal admission, both of liability and quantum. I should perhaps add here that a defence along the lines that the relevant contract or arbitration agreement is non-existent or invalid does not deprive an arbitral tribunal of jurisdiction : see section 13B of the Ordinance and Article 16 of the Model Law. (4) I have said that the content of the defence is generally irrelevant to the question of whether or not a dispute or difference is within the ambit of the arbitration agreement in question. Where it is relevant, though, is where a true counterclaim is made consisting of claims that do not come within the ambit of the arbitration agreement. In most cases, they will, but in the case where an entirely new claim is made in the counterclaim, unrelated to the contract in question, the disputes based on such a claim would not be covered by the arbitration agreement. 60) In the present case, as I have said, the Plaintiff's (or FDL's) claims clearly come within the arbitration agreement. The defence raised by the defendants (in so far as they can be identified at all at this stage) does not alter this conclusion. 61) Accordingly, the answer to this Question is Yes. Conclusion 62) For the above reasons, I make an order that the present action be stayed and the Plaintiff's claims herein be referred to arbitration. 63) I shall also make an order nisi as to costs that the Plaintiff is to pay the 1st Defendant's costs of and occasioned by the stay application, such costs to be taxed if not agreed. The costs are to be taxable and payable immediately. (Geoffrey Ma) Judge of the Court of First Instance High Court Representation: Mr Kenneth Chan, instructed by Messrs C.W. Yuen & Co., for the Plaintiff Mr Paul Shieh, instructed by Messrs Jones, Day, Reavis & Pogue,for the 1st Defendant Look up this case on Lawcite Noteup",
  "length": 43936,
  "headers_seen": [
    "The nature of the Plaintiff's claims",
    "The applications before the court",
    "The parties' respective positions on the stay application",
    "The court's approach in stay applications",
    "Question 1: Is the clause in question an arbitration agreement?",
    "Question 2 : Is the arbitration agreement null and void, inoperative or incapable of being performed?",
    "Question 3 : Is there in reality a dispute or difference between the parties?",
    "Question 4 : Is the dispute or difference between the parties within the ambit of the arbitration agreement?"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2002/682",
  "query": "arbitration",
  "ts": "2025-10-14T11:21:13",
  "ok": true
}