{
  "title": "RE LEUNG KWAN TSAN KELVIN, A BANKRUPT | [2019] HKCFI 997 | HKLII",
  "court": null,
  "year": 2019,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2019] HKCFI 997 RE LEUNG KWAN TSAN KELVIN, A BANKRUPT Judgment Information Date 23 Apr, 2019 Action No. HCB11341/2002 Neutral Cit. [2019] HKCFI 997 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCB11341/2002 HCB11341A/2002 RE LEUNG KWAN TSAN KELVIN, A BANKRUPT HCB 11341/2002 [2019] HKCFI 997 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE BANKRUPTCY PROCEEDINGS NO 11341 OF 2002 ________________ RE: LEUNG KWAN TSAN KELVIN, a bankrupt BETWEEN LEUNG KWAN TSAN KELVIN, a bankrupt Applicant and FRED LEE, Trustee of the property of LEUNG KWAN TSAN KELVIN, a bankrupt Respondent and OFFICIAL RECEIVER Interested Party ________________ Before: Deputy High Court Judge William Wong SC in Chambers Date of Hearing: 11 April 2019 Date of Decision: 11 April 2019 Date of Reasons for Decision: 24 April 2019 ____________________________ REASONS FOR DECISION ____________________________ Applications 1. I handed down the judgment in this case on 4 January 2019 (“the Judgment”). I also made a costs order nisi that the Applicant is to pay the Official Receiver’s costs on an indemnity basis, to be taxed, if not agreed. My reasons are set out in §§106 and 107 of the Judgment as follows: “ 106. I am of the view that costs should be made on an indemnity basis because first, the Applicant has behaved unreasonably. Instead of informing the court that it is bound by the Court of Appeal’s decision in Re Ng Shiu Fan so that the court could dismiss the Summons, and the Applicant could then apply to a higher court with minimum costs to the public fund, the Applicant chose to seek directions for substantive arguments on unmeritorious grounds. 107. Secondly, the Director of Legal Aid was specifically directed by this court to reconsider the merits of the amendments to the Summons. The Applicant insisted on proceeding to argue the unconstitutionality of section 85 (5) of the Education Ordinance at the expense of public money. This ground of challenge is completely unmeritorious.” 2. The Applicant took out two summonses on 17 January 2019 to: (1) vary the costs order nisi to the effect that the Applicant is to pay the Official Receiver’s costs on a party to party basis (the “Costs Order Summons”); and (2) apply for a certificate to appeal against the Judgment to the Court of Final Appeal (the “CFA”), i.e., application for a leapfrog appeal under Part II Division 3 of the Hong Kong Court of Final Appeal Ordinance ( Cap 484 ) (“the Leapfrog Summons”). 3. The Applicant applied for an adjournment of the hearing of the Leapfrog Summons but the said application was disallowed by Madam Justice Au Yeung on 28 March 2019. Costs Order Summons 4. The Applicant appeared in person. When he filed his first skeleton submissions on 3 April 2019, he still argued strongly that this court erred in ruling that “no inequality before law was created either by the relevant provisions in the Bankruptcy Ordinance , Cap. 6 , or the recently enacted s.85(4) and (5) of the Education Ordinance Cap.279 .” (See §3 of the Applicant’s Skeleton Submissions) 5. However, when the Applicant appeared in person at the hearing, the Applicant made clear to this court that he would not pursue the constitutional challenge anymore. 6. Mr Liu for the Official Receiver submitted that this shows thatthe Applicant pursued an unmeritorious case, in particular, the constitutional challenge, unnecessarily and thereby wasted legal resources. I agree. Substantial costs were incurred because of the Applicant’s insistence to pursue the constitutional challenge. This court had deliberately invited the Director of Legal Aid to consider the merits of this ground of challenge but the then attitude of the Applicant was that he would take this challenge all the way to the Court of Final Appeal. 7. Whilst this court appreciates that the Director of Legal Aid has a difficult duty to discharge, nevertheless, when this court directed him to seriously consider the merits of an application, he must carefully consider the same and not unnecessarily pursue a wholly unmeritorious appeal at the expenses of limited public fund. 8. As Mr Liu rightly pointed out and as set out in §§6 – 9 and 28 – 30 of the Judgment, the Applicant failed to inform this court or agree with the Respondent at the second call-over hearing on 18 September 2018 that the Court of Appeal’s decision in Re Ng Shiu Fan [2009] 4 HKLRD 774 is binding on this court. If this were fairly done, as it should be, this court would simply have dismissed the application and the Applicant could then take this case to a higher court with minimum costs and time. Instead,the Applicant first argued that the case of Re Ng Shiu Fan was ‘ per incuriam ’ or wrongly decided and secondly, by way of amendment, pursued the constitutional challenge. The Applicant then insisted that this court should deal with his application (as amended) substantively, including the issues which have been dealt with by the Court of Appeal in Re Ng Shiu Fan , on the wrong premise that this court should not be boundby the Court of Appeal’s decision in Re Ng Shiu Fan . 9. I also agree with Mr Liu that the Applicant’s recent application by the Leapfrog Summons reveals that he had failed to give proper consideration as to the appropriateness of such an application when he was pursuing the constitutional challenge. As far as I see it, there is no basis upon which this court can allow the Leapfrog application if the Applicant is still pursuing the constitutional challenge. Indeed, the Applicant’s Notice of Appeal still contains references to the constitutional challenge. 10. The Applicant submitted that he did not act with evil intent. I accept that. I am sure the Applicant did not act maliciously in pursuing his application. However, that is not the test. The court has to be fair to both parties when it comes to a determination on costs. The Official Receiver was dragged into this case principally because of both the constitutional challenge and the argument that the case of Re Ng Shiu Fan is not binding on this court. The Official Receiver had filed a very detailed report and no doubt incurred substantial costs. It is unfair that the Official Receiver should bear any adverse costs consequences because of the Applicant’s unreasonable conduct. 11. The Applicant said that he was at all material times followinghis lawyers’ legal advice. I also accept that. However, that is not a good enough reason to vary the costs order nisi . If the Applicant were wrongly advised,then his relief lies somewhere else. 12. I am of the view that the Court should be robust to impose indemnity costs order if a party has pursued an unreasonable course of conduct in any legal proceedings and advanced totally unmeritorious grounds which resulted in a waste of judicial resources and time. This is particularly so when public money is involved. 13. Mr Liu referred me to the case of Hau King Wai Keith & Others v Hau Tak Cheung & Others [2018] HKCFI 2250 (unreported, H CAP 18 /2013, 15 October 2018), where Mr Justice Wilson Chan at §8(4) said: “ Order 62 , rule 5 of the Rules of the High Court has also listed a number of matters which the court may take into account in exercising the discretion on costs, such as the conduct of the parties, including:– (i) Whether it was reasonable to raise or pursue a particular allegation or issue; (ii) The manner in which a party has pursued or defend his case; (iii) Whether a party has succeeded in whole or in part of his claim; and (iv) Conduct before and during the proceedings.” 14. For the reasons I set out above, the Costs Order Summons is dismissed. The costs of the Costs Order Summons is to be paid by the Applicant to the Official Receiver forthwith, on a party to party basis, to be taxed if not agreed. Leapfrog Summons 15. Originally, I was minded to dismiss the Leapfrog Summons as there is simply no consent by the parties to the grant of a certificate under section 27C(1)(c) the Hong Kong Court of Final Appeal Ordinance , Cap 484 . There was not even an attempt to obtain consent from the Official Receiver. That should be the end of the Leapfrog Summons. 16. However, the Applicant submitted that he would drop his appeal on the constitutional ground and applied for an adjournment of the hearing of the Leapfrog Summons. 17. Mr Liu for the Official Receiver agreed to the adjournment onthe basis that the Department of Justice would need time to consider whether the Official Receiver would give its consent under section 27C (1)(c) of the Hong Kong Court of Final Appeal Ordinance , Cap 484 now that the Applicant indicates that he will not pursue the constitutional challenge. 18. The Applicant also submitted that there is a hearing scheduled on 2 August 2019 in relation to his application for further legal aid. If he fails to obtain legal aid, he will not pursue his appeal. In that eventuality, there is no need for him to proceed with the Leapfrog Summons. 19. Accordingly, I make an order that the Leapfrog Summons is adjourned sine die with liberty to restore. Costs of the Leapfrog Summons is reserved. Disposition 20. For the reasons set out above: (1) The Costs Order Summons is dismissed. (2) Costs of the Costs Order Summons is to be paid by the Applicant to the Official Receiver forthwith, to be taxed if not agreed, on a party to party basis. (3) The Leapfrog Summons is adjourned sine die with liberty to restore. (4) Costs of the Leapfrog Summons is reserved. 21. Finally, it remains for me to thank the Applicant and Mr Liu for the assistance they rendered to this court. (William Wong SC) Deputy High Court Judge The applicant appeared in person Lee & Chow, for the Respondent did not appear Mr William Liu, of the Department of Justice, for the Official Receiver Look up this case on Lawcite Noteup",
  "length": 9922,
  "headers_seen": [
    "Applications",
    "Costs Order Summons",
    "Leapfrog Summons",
    "Disposition"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2019/997",
  "query": "constitutional challenge",
  "ts": "2025-10-17T10:43:25",
  "ok": true
}