{
  "title": "ST OTHERWISE SST V. MFP | [2022] HKFC 168 | HKLII",
  "court": null,
  "year": 2010,
  "date": "2010-09-08",
  "content": "HKLII Databases Family Court [2022] HKFC 168 ST OTHERWISE SST V. MFP Judgment Information Date 11 Aug, 2022 Action No. FCMC7467/2009 Neutral Cit. [2022] HKFC 168 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History FCMC7467/2009 FCMC7467/2009 ST otherwise SST v. MFP FCMC 7467/2009 [2022] HKFC 168 IN THE DISTRICT COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION MATRIMONIAL CAUSES NO. 7467 OF 2009 ---------------------------- BETWEEN ST otherwise SST Petitioner and MFP Respondent ---------------------------- Coram: Her Honour Judge Sharon D. Melloy in Chambers (Not open to public) Dates of Hearing: 20 – 22 July 2021 Date of written closing submissions: 19 August 2021 Date of written replies: 2 September 2021 Date of Judgment: 12 August 2022 ___________________ J U D G M E N T (Variation of Order) ___________________ Introduction 1. There are two applications before the court that now require determination. The first in time is the Respondent husband’s summons dated the 12 June 2020 in the following terms: 1. The Order made by Her Honour Judge Melloy on 8 September 2010 be varied as follows: - a. The Respondent's undertakings in Recitals F, H, J, K, L (in so far as the air ticket is concerned), and N be discharged; b. Paragraph 1 of the Order, concerning periodical payments for the Petitioner, be varied downwards to such sum as the Court deems fair and reasonable: c. Paragraph 2 of the Order, concerning periodical payments for the child of the family, namely HOP [H], be varied downwards and to be paid directly to her; d. Paragraph 3 of the Order to be varied so as to discharge the Respondent's obligation to make any further payments 2. In other words, the husband seeks to significantly vary the terms of the order entered into by the parties by consent on the 8 September 2010. As will be seen he seeks to vary down the maintenance payments for the wife, that have not changed since 2010, and currently stand at HK$68,000 per month plus the maintenance payments for the only child of the family H, that had, by the time of the summons risen to HK$70,800 per month. He also asks to be released from various undertakings, including an undertaking that he would provide HK$54,000 per month from his housing allowance as a contribution towards the wife’s rental, which originally stood at HK$60,000 per month. In total then, as at the time of the husband’s summons, he was paying or providing financial support for the wife and H in excess of HK$192,000 per month. At the date of the consent summons that contribution was HK$176,000 per month (i.e., wife’s maintenance – HK$68,000 per month, H’s maintenance – HK$54,000 per month and the housing allowance of HK$54,000 per month = HK$176,000 per month). The difference between the two figures is due to a cost-of-living increase for H’s maintenance, which was included in the consent order for her but not for the wife. In addition, the husband undertook to utilize his education allowance provided by his employer for H’s school fees and school bus fees. He also undertook to pay for all of H’s necessary school expenses and to pay an annual amount of HK$120,000 into an education fund. As will be seen this undertaking is important and for that reason, I have decided to quote it in full at this juncture, as follows: N. AND UPON the Petitioner and the Respondent acknowledging and agreeing and undertaking to the Court and each other that they will open a bank account on trust for H for the purpose of maintaining an education fund to be set up pursuant to Paragraph 3 below (“the Education Fund”) no later than 31 st March 2011. The bank account will be operated by the parties jointly and should there be any surplus upon H finishing her full-time tertiary education, such surplus will be paid to H. In the event of the demise of one party, the surviving party shall operate this fund together with the deceased party's nominated guardian provide that the nominated guardian is not the spouse of the deceased party. The education fund is to be utilized for any of H's education expenses in the event the Respondent loses his education allowance and does not have the financial resources to pay for H's school fees, school bus fees and all other school expenses. Further the husband undertook to pay for H’s BUPA International medical insurance and for one return business class fare (HK – London) each year. 3. On the 17 November 2020, approximately 5 months after the husband issued his summons, the wife issued her own summons in which she asked for litigation funding, plus a variation up of her own maintenance and that of H’s, to include provision for rental costs in Hong Kong in lieu of the husband’s undertaking in relation to his housing allowance. The issue of litigation funding was dealt with separately and apart from that the summons stated as follows: 3. The Consent Order of Her Honour Judge Melloy on 8 September 2010 be varied as follows, including backdated payments from 12 June 2020: a. The Respondent be released from his Undertaking at Recital H therein and instead be Ordered to make such rental provision as may be deemed appropriate by this Honourable Court as part of her maintenance at paragraph 3 (b) below; b. Paragraph 1 therein, concerning periodical payments for the Petitioner be varied upwards to such sum as the Court deems fair and reasonable and to include a provision for her rental costs; and c. Paragraph 2 therein, concerning periodical payments for the child of the family, namely H, be varied upwards as the Court deems fair and reasonable and to include a provision for her rental costs Overview 4. It is the husband’s case that that he can no longer afford to pay the wife what he had agreed to pay in 2010, notwithstanding the fact that he has been promoted several times in the interim. He bases this, in part, on his relocation to New York, which he says will ultimately have significant tax implications and will lead to him having less available income than before. He also points to other changes in his circumstances, including the fact that he has remarried and has a child, his current wife has chosen not to return to the workforce in the short to medium term, he is coming to the end of his working life and needs to make provision for his retirement and that it was never intended that he should support the wife in the long term. He also accuses the wife of financial mismanagement. The wife for her part accuses the husband of significant and continual financial non-disclosure, of lying on oath and of otherwise being disingenuous. It is her case that the husband has significant financial resources at his disposal, including other income such as bonuses and that he is able to pay. She says that he simply does not wish to pay. Other issues include the wife and H’s spending patterns, the wife’s non employment and the prospects for her longer term plus her anticipated needs and those of H going forward. Background to the marriage 5. The parties met in London in or about 1995 and married there on the 31 March 2000, having cohabited from about 1998. They are both British and have one child, a daughter H, who was born on the 26 April 2002 and who is now 20 years of age. Early on in their relationship the wife worked as a senior advertising executive for a well-known tabloid newspaper in the UK and the husband for a media agency. The wife has not worked in a paid capacity since 2000, when the parties moved to Japan in order to take up a career opportunity for the husband. She became pregnant shortly thereafter and it is her case that she has devoted herself to H since then. The parties relocated to Hong Kong from Japan in June 2003 and both parties remained in the territory until the husband’s relocation to New York last year. The wife is now 54 years of age and the husband is 59. The parties separated in or about late 2006, after a marriage of 6 years, (which rises to about 8 years once the period of cohabitation is included). H was only about 4 ½ years old at the time of the separation. 6. The wife issued divorce proceedings based on two year’s separation on the 18 June 2009 and the decree nisi was pronounced shortly thereafter on the 14 September 2009. On the 23 September 2009, an order was made by consent for sole custody and care and control of H to the wife with reasonable access to the husband. As indicated above the parties finally came to terms with respect to ancillary relief and an order was made by consent on the 8 September 2010. The decree absolute then followed on the 16 September 2010. 7. The husband remarried about 6 months later, in March 2011, and had a further child, a son T, with his second wife on the 24 August 2012. T is now nearly 10 years old. The husband’s second wife, O is Korean and until recently worked as a senior broker running the Korean desk for a well-known trading company in Hong Kong, earning a base salary of HK$180,000 per month. The husband has never revealed what her total remuneration package was, including bonuses. The family finally relocated to New York towards the end of last year. There was some delay with this because of the Covid-19 pandemic. The circumstances surrounding the consent order and since 8. The parties filed their first round of Form E’s prior to entering into the consent summons in August and September 2009 respectively. These documents provide an insight into their financial circumstances at that time. The husband’s Form E states that he was then the CEO Asia Pacific, of a well-known Advertising and Media conglomerate. In part 3 he says that he received a basic income of HK$258,453 per month, plus a bonus which averaged out at HK$56,000 per month i.e., a total of just under HK$315,000 per month. In addition, he received a housing allowance of just over HK$100,000 per month (HK$101,300), which he and the wife subsequently shared. There was also reference to an education allowance. At paragraph 1.14 of his Form E, the husband describes the maintenance arrangements that the parties had voluntarily entered into following the separation as follows: 1.14 Give details of any maintenance arrangement or maintenance orders made between the parties. Up to July 2009, I paid $95,000 per month for the Petitioner and H, made up of HK$75,000 cash and HK$20,000 on the credit card. My company pays for H's school fees and school bus fees. I share my company housing allowance with the Petitioner. I pay for some of the utilities at the Petitioner's residence. My company also pays for the American Club Membership. I pay for the American Club spending. Health insurance for Petitioner and H are paid for by my employer as are business class return tickets to England. As of 25 August 2009, I will pay $89,000 per month for the Petitioner and H. This is because the credit card has been cancelled. Also, from August 2009, the Petitioner's rental at her new residence is about HK$6,000 per month more than the company housing allowance presently allocated to her. This is deducted from my salary. I will be deducting it from the Petitioner's monthly maintenance. 9. The wife was living in Stanley at the time and the husband was in Bel Air in Pokfulam. H was attending a prestigious international school namely the C School. Both parties had domestic help – the wife full time and the husband part time. The parties also had access to the American Club. The wife was not working and had not done so by this stage for about 10 years. 10. Unfortunately, and as is often the case, the parties did not have significant assets to match this lifestyle. They sold their property in London prior to the divorce and the proceeds of sale were split between them, although the wife complains that this was imposed on her. In any event according to the Form E’s the husband had approximately HK$4.5 million in his name at that time, which included items that were not immediately liquid including stock options, his MPF fund and other pensions. He held less than HK$1 million in cash. The wife had no assets at all save for a similar amount in cash. It seems likely that the cash most probably came from the sale of the London flat. 11. The husband has referred to a maintenance pending suit order (MPS) and the findings made by my fellow judge, DJ Angela Kot, in that judgment as being somehow relevant to the reasonable needs of the wife at this juncture. With respect I do not agree. MPS is, by its very nature broad brush and capable of revision down the line. It is of no relevance now. What is relevant is the order that the parties entered into by consent and what can be inferred from that. The consent order dated the 8 September 2010 12. The first point to note is that there is no suggestion at all, in any part of this document, that there would be a dismissal of the wife’s claims for income. The order made for periodical payments was a standard order made during the joint lives of the parties or until the wife’s death or remarriage. In the preamble, at the beginning of the document at Recital A, it states that it is intended that the order will be in full and final settlement of the wife’s capital claims only, not her claims for periodical payments for herself. It is also of note that nowhere is there an acknowledgment/agreement or even an undertaking from the wife that she would retrain and seek to find employment for herself in due course. Thus, the husband’s suggestion that it was always understood that the wife would take steps to become financially independent is, with respect, a little far-fetched, although I would accept that there had been some discussions about retraining. 13. It is also clear from the terms of the order that there was insufficient capital for there to be a clean break in any event. The wife received just under HK$4 million from the pot made up as follows: E. AND UPON the Respondent undertaking to the Court and the Petitioner that within 28 days from the date of this Order, or within 7 days of the granting of the Decree Absolute, whichever is the earlier, he will pay to the Petitioner a lump sum equivalent to 55% of the value of the following assets together with a lump sum of HK$150,000:- (1) Respondent's MPF Fund (2) Managed Capital Account Skandia in joint names (3) 84% of ABC unvested shares (4) 84% of ABC share option (5) 84% of ABC Stock at Merrill Lynch (6) 84% of ABC vested shares The total lump sum payable by the Respondent to the Petitioner =Total value of items (1) to (6) above × 55% + HK$150,000 = HK$3,974,359.78 Although the wife complains now that even then the husband did not make full and frank disclosure of his financial resources, the fact remains that she agreed to this. Further there does not appear to be any evidence to support the notion that there were significant hidden assets. The parties enjoyed a very comfortable life style when married by virtue of the husband’s ex patriate package. They had not, by this point, had an opportunity to accumulate many assets. The wife received a significant share of what they had, and I accept that this was most likely well in excess of 50% of the total pot. 14. In addition, the wife received maintenance that should have been sufficient to cater for her and H’s reasonable needs. As indicated above she received HK$122,000 per month for herself and H out of a total monthly income from the husband of approximately HK$258,453 per month (which did not include the bonus; approximately HK$315,000 per month with the bonus) plus just over half of the husband’s full housing allowance. In addition, the husband contributed to the education fund – the equivalent of another HK$10,000 per month. It is a reasonable maintenance order and should have enabled both parties to have lived comfortably going forward. What happens next is of significant concern and came as something of a shock to the husband. It seems that the wife did not invest any of the capital lump sum, nor did she buy a small property somewhere. Indeed, it was the wife’s evidence that this sum had been spent, in full, by 2014 – i.e., in broad terms an additional HK$1 million per annum on top of the significant maintenance provisions referred to above. She says that she was emotionally floored when the husband remarried and that she sought to over compensate by paying, for example, for friends and family to accompany her and H on trips over seas etc. There is no doubt that some of her capital outlay during this period was also legitimate, e.g., paying for new furniture etc. for a flat for herself and H, but other expenditure was clearly not. This has meant, in turn, that the wife now has no capital of any kind to support her own retirement and future living. It is trite but worth repeating at this point that the wife has no legal claim against the husband for a further lump sum. The wife says that she then got into a cycle of debt and maxed out on her credit cards. This was relieved somewhat when in 2017 she rather shockingly \"borrowed\" H’s inheritance from the husband’s late father in the sum of HK$452,727. She says that this was with H’s total agreement (H was about 15 years old at the time) and was on the premise that it would be repaid. Given that the wife is not currently working and is once again in significant credit card debt it is difficult to see how this was ever going to be achieved. In the witness box it was asked whether in reality she was asking that the husband pay her extra maintenance so that she could now repay H. She did not really have an answer to this line of questioning. As at the time of trial the wife was said to owe in the region of just under HK$500,000. I do not know what the current figures are. In the closing submissions this sum had risen significantly. I am also not sure if some of this sum related to outstanding legal fees, owed outside of the litigation funding provisions. 15. The other point to note, and what could not have possibly been anticipated at the time of the consent order, is that H is now training as a pre professional contemporary ballet dancer and is studying at the G School which forms part of the University of C. It is of note that although the mother has got herself into something of “a financial pickle”, that some of this has come about because, on her case, of her continued and unswerving support of H. H decided to stay at C school and take the IB programme, whilst at the same time pursuing her dream of becoming a professional dancer. This meant that she has had a significant and expensive dance schedule organised and facilitated by the wife whilst at the same time undertaking serious study. This included extra tuition which the wife said at one time cost in the region of HK$40,000 per month. The dance training would be in addition. It is of note that the wife could have sought financial assistance from the husband in this respect under his undertaking at Recital K (see paragraph 65 below), but that she chose not to do so. She said that she found the husband aggressive at times and that she chose not to rock the boat. 16. Further, H has also attended so called “intensives” during the holidays, which were always held overseas. The parties agreed that these would be funded by the Education Fund. At the time of the hearing there was approximately HK$426,000 left in that fund. It is of note that the parties, have by agreement now transferred this bank account to H for her to manage. 17. H began university in August 2020, but for the first year she attended remotely from Hong Kong, which meant in part attending dance classes during the night. The mother facilitated her schedule including her dance programme, her food, her academic study (she is taking an academic minor) and ensured that she was ferried around by car as required. It is the mother’s case that realistically, given H’s choices, that it was practically impossible for her to retrain or to return to the workforce and that even if she had done so she would not be able to fully support herself or H. Although I do not countenance everything that the wife says, I tend to accept what she says in this respect. The issues 18. These then are the issues to be determined, namely: i) Should the Respondent husband’s summons dated the 12 June 2020 be dismissed in its entirety, as argued by the wife? ii) How much maintenance should the husband now pay for the wife? How should the issue of the rent be dealt with? iii) How much maintenance should the husband now pay for H? Should any part of that maintenance come from the education fund? Should the husband pay H directly? iv) Can the husband afford to pay these sums? v) Should either of the maintenance figures be backdated and if so to when? vi) How should the husband’s original undertakings be dealt with? vii) What order should be made for costs? The law Maintenance orders 19. Each party’s application for a variation of maintenance is made pursuant to section 11 (7) of the Matrimonial Proceedings and Property Ordinance Cap. 192 , (MPPO) which provides that: “(7) In exercising the powers conferred by this section the court shall have regard to all the circumstances of the case, including any change in any of the matters to which the court was required to have regard when making the order to which the application relates ……” 20. It is accepted that when looking at a variation of maintenance and in considering a change of circumstances in that context, I may look at the case de novo. In other words, the court is not necessarily fettered by the existence of a previous order. I may look at the situation afresh and make an order based on the parties’ existing financial circumstances. (See Ch 3.131 Jackson’s Matrimonial Finance and Taxation, 7 th edition). It is also true that there would normally be a reason for the application to vary or what some might call a “trigger”. 21. The court has a very wide power, including a power to terminate maintenance payments and to backdate the variation ordered. The overall objective is to achieve a fair outcome (see M v M , FCMC 4070 of 1990, dated 12 May 2006, unreported). Other case law 22. The correct approach to an application to vary maintenance was summarized by the Court of Appeal in AEM v VFM [2008] HKFLR 106. In that case the Hon Cheung JA made the following points when setting out the law. Referring in particular to agreements reached by consent as here, he said as follows: 8. At the same time the basis and intended effect of the original order are relevant factors to which the Court on variation should pay regard and there should not be a radical departure from the approach taken by the parties themselves when they had entered into an agreement embodied in a consent order: Boylan v. Boylan [1988] FLR 282. 23. This theme was reiterated in a later Court of Appeal decision on variation, WNWG v PBF [2012] HKCU 675, where the Hon Lam J quoting in part from another important judgment on this issue, HCTT v TYYC [2008] 5 HKC 86 , added that: [12] As regards the approach that the court should adopt in considering an application for variation and the weight to be attached to the original order, Tang V-P said in HCTT v TYYC [2008] 5 HKC 86 at paras 15 to 16, “15. But as Garner v Garner [1992] 1 FLR 573 shows that does not mean that the earlier order, whether made by consent or not, carries no weight. How much weight should be given to the earlier order must depend on the circumstances. Cazalet J said in the English Court of Appeal: “Almost invariably, an application to vary an earlier periodical payments order will be brought on the basis that there has been some change in the circumstances since the original order was made, otherwise, except in exceptional circumstances, the application will, in effect, be an appeal. If it was correct when made, then there will usually be no justification for varying it unless there has been a material change in the circumstances. However, because of the impact of continuing inflation, because children grow older and cost more to support and because, for example, the cost of living in its increase may hit one party harder than another, it will usually follow that, if time has passed, there will inevitably have been some changes in the circumstances, and in particular in the financial circumstances, of the parties concerned. Following Lewis v Lewis , by which decision this court is bound, a court on the hearing of an application to vary is fully entitled to look at all the relevant matters set out in s. 25 of the Matrimonial Causes Act 1973. On occasions, the court may be slow to accede to an application to vary a consent order, not least because the parties’ solicitors might otherwise be deterred from either seeking to negotiate such a provision or to achieve finality. Another factor which may influence a court will be the time that has passed since the original order was made. If an application consequent on an order is brought very soon after that order has been made, the court, in normal circumstances, is likely to attach more weight to the earlier order than if it had been made some years previously. Likewise, the court would expect to pay full regard to any special terms agreed between the parties at the time the original order was made – as, for example, when endorsements on briefs or contemporaneous correspondence show that an agreed order has, for some particular reason, been set at an artificially low figure. Shortly stated, the court must decide what weight it should attach to the original order and all the surrounding circumstances. However, once an application to vary is before it, the court is fully entitled to make an order considering all the circumstances afresh, paying such regard to the old order as may be thought appropriate.” 16.Thus, although the jurisdiction to vary is untrammeled, normally the earlier order would not be varied unless there has been a material change in circumstances.” Remarriage and second families 24. The law on this is also quite clear. Although the court is charged with looking at the reality of the situation, if a litigant, here the husband, decides to remarry and have a second family, that does not entitle him as of right to reduce the maintenance to be paid to the first family. See, for example, HYS v SW , unreported, FCMC 11478 of 2003, 6 June 2013. Discharge of undertakings 25. In so far as the undertakings are concerned, it is also not disputed that the court cannot impose an undertaking on a party nor can it vary an undertaking of its own motion. The court may accept an undertaking; it may discharge an undertaking and it may, in some circumstances refuse either to accept a new undertaking or to discharge an old one. The duty of disclosure 26. It is trite, but given the circumstances of this particular case, necessary to state that the law is clear that in any financial application before the Family Court, there is a positive duty on both parties to make FULL and FRANK disclosure of their means. This means that the husband, in this instance, had a positive duty to inform both the wife and the court of all of his financial resources, not simply those that he considered relevant. This included those assets in which he held a beneficial and not simply a legal interest. This duty is ongoing and is independent of any specific discovery that was contained in the wife’s questionnaires. The principle is that both parties to ancillary relief proceedings, which include applications to vary, are under a continuing “duty to the court to make full and frank disclosure of all material facts to the other party and the court”: Livesey (formerly Jenkins) v Jenkins [1985] 1 AC 424 at 437H-438C per Lord Brandon of Oakbrook. As will be seen this did not happen in this case. Indeed, there was a strong “catch me if you can” element to the husband’s evidence. This has led to the parties spending more on legal fees than should otherwise have been the case. It also meant that it was almost impossible for the wife to enter into any meaningful negotiations to settle the matter with the husband, although it is of note that there was one attempt at mediation, which perhaps not surprisingly, failed. 27. It follows that if there has been material non-disclosure, that it is then open to the court to draw a reasonable adverse inference as to the husband’s financial resources and ability to pay. Open proposals 28. Counsel for the wife very helpfully set out the parties’ open positions in tabular form, by reference to the original consent order, in his opening submission as follows: B4. Summary 19. The parties' proposals for future maintenance are as follows: Consent Order [A/1/1-10] Petitioner's position [A/3/14-15; A/12/69/§150 B5/86/1072-1076] Respondent's Open Offer [C1/20/239-243] For the Petitioner Housing HK$54,000 HK$190,000 HK$80,000 Maintenance HK$68,000 Sub-total for the Petitioner HK$122,000 HK$190,000 HK$80,000 For H Tuition HK$44,551.65 HK$44,551.65 HK$44,764 Off-campus dance training + portfolio work(top up to Education Fund) HK$10,000 HK$10,000 HK$10,000 BUPA HK$7,165 HK$7,165 HK$6,500 Off-campus housing N/A Upon discussion with H Upon discussion with H Maintenance HK$70,800 HK$34,500 HK$7,800 Sub-total for H HK$132,516.65 HK$96,216.65 HK$69,064 Total: HK$254,516.65 HK$286,216.65 HK$149,064 The husband’s proposals 29. In his affirmation dated the 18 January 2021 the husband also proposed an alternative as follows: 69. … I therefore propose that: (1) I should continue to pay the current rate of maintenance to 1 January 2022. This gives S [the wife] plenty of time to re-organise her work/life balance. (2) I will pay her a lump sum of $5 million on 1 January 2022. 1 will undertake to pay this and invite the Court to dismiss the periodical payments on that payment. Once allowance is made for S's own earning capacity (even as a receptionist) and for her reduced income needs, it is more than five years’ of maintenance - i.e., it would take me to my mid-sixties by which time I will not be working having either retired or been forced out. 30. It is of note that the court, as has been pointed out by counsel for the wife in his opening, has no jurisdiction to make this order. There is no statutory clean break in Hong Kong as there exists in other jurisdictions and the court has no ability to order a second lump sum payment, although I accept that on occasions litigants may reach an agreement, which can encompass such an agreement and that this can then, in turn, be dealt with by way of undertakings etc. 31. In his open letter dated the 17 June 2021 the husband changed his position as follows: Proposal for H Our client will pay:- 1. H's university tuition fees at the University of C and accommodation for the duration of her course from August 2021 to June 2024. The fees, which include tuition, housing, dining/meals, books and supplies, personal and miscellaneous and transportation, total USD81,659 for 2021/22. Less USD12,500 in respect of H's scholarship, our client is paying USD69,159 for 2021/2022. If and when H has to move out of university accommodation into private accommodation, our client will also cover the rental costs but will expect that H will be discussing this directly with her father, with all relevant documentation to be provided by H so that they may agree on the rental of such accommodation and arrangements for payment. 2. Bupa medical insurance with the current premium being approximately USD10,000 per annum. Such provision will be made for H for the duration of her course ending in June 2024. 3. The sum of USD1,000 per month as H's allowance for the duration of her course ending in June 2024. 4. The additional sum of HKD120,000 per annum for 2 years, to be paid in April 2022 and April 2023. Our client has just paid HKD120,000 into H's Education Fund account. With this annual sum and the monthly allowance, H will be receiving HKD30,917 per month, calculated as follows:- HKD Current balance in Education Fund (HKD426,000 + HKD120,000) (2 additional years) 546.000 240,000 Allowance (HKD7,800 × 34) 265,200 Total 1,051,200 Over 34 months 30,917 (per month) 5. As a one-off, our client will pay the set up costs H has asked for - that is - HKD25,000 for what she needs to buy for University and the lap top to the value of HKD13,000. Our client will also pay for 5 nights' accommodation for H before she moves into university accommodation up to a maximum of HKD10,000. Our client has already paid for a bundle of air tickets (4 flights) of HKD36,000 and H's visa. If H comes back to Hong Kong for 5 months during school breaks, our client believes that, like most University students, especially with her acquired dance and language skills in English, Chinese and Spanish, H will be able, and should be encouraged, to earn some money for herself. Earning and careful spending of her own income is to be encouraged and form part of H becoming an adult, learning to manage her finances and embarking on the career she hopes to have. According to the above proposal, our client will be paying a total of HKD82,172 per month for H. This is more than the HKD70,000 that he is paying now. We see the above proposal for H as being reasonable and catering for not just her reasonable needs but also her special needs as a pre-professional dancer and University student. Especially in the case of H, we see a Court giving significant weight to the fact that our client has another child who is entitled to receive, in terms of education in particular, the same level as that which our client has provided for H. Our client's son is 8 years old. Our client has to provide for another 14 years of school and college, during which time he will be retired or otherwise be without employment and having to rely on his savings and assets. Proposal for your client Our client will pay:- 1. The sum of HKD80,000 per month starting from 1 st January 2022. 2. The lump sum of HKD200,000 towards your client's repayment of her credit card debts. Whilst we have advised our client that a Court will not order such sum. and there is in fact no reason why our client should offer any sum at all, our client is offering this sum on the basis that he will not have to pay further legal fees for a Trial. He is willing to make this sum available to your client only if and as part of an overall settlement before Counsel's brief is delivered. The due date for delivery of brief is 25 June 2021. 3. Subject to your client's actual enrolment in the re-training course (referred to in your client's 5 th Affidavit and in respect of which our client has asked for further particulars). the fees of a course up to HKD100,000, to be paid upon enrolment and upon invoice(s) being presented. The terms in Paragraph 2 also apply here to the extent that our client is willing to make this sum available to your client only if and as part of an overall settlement before Counsel's brief is delivered on 25 June 2021. 4. Your client's legal costs in respect of our client's variation application, on a party and party basis, to be taxed if not agreed. We are offering this even though a Court will not order costs against our client should it grant our client's application and may order costs against your client. In respect of your client's variation application, our client proposes that there be no order as to costs. We do not see, in view of our calculations below, that a Court will grant your client her application. Our client makes this offer even though, if your client does not succeed in her application, costs should follow the event. In this respect, it would be helpful if you could provide a breakdown of the costs that have been spent on our client's application and your client's application. The balance of the litigation funding that has been provided to your client has to be returned to our client, following agreement of your client's costs or taxation. We consider this to be a generous provision in relation to costs, given what we say in this letter. Further, it has been clear from the outset that a variation of maintenance, especially in relation to H, is inevitable, in light of her plan to attend university overseas and her turning 18. Yet, at no time did your client ever provide us with a sensible variation proposal. Nor has she even responded to our Without Prejudice proposals made in April 2021. Should this matter go to Trial, we shall be inviting the Court to make costs orders that the Judge in her discretion deems appropriate. The wife’s proposals 32. In the wife’s 5 th affidavit dated the 7 May 2021 she proposes as follows: 60. Therefore, I respectfully ask the Court to make an Order that: a. In accordance with M's proposal, him to pay H's Tuition Fees and other associated expenses from her attendance at University of C (including all costs associated with her housing on or off campus, such as rental deposit, set up costs, management / agency / legal fees if any, and compulsory meal plans) as well as her Bupa expenses directly; b. M to pay the sum of HK$34,500 (rounded up from HK$34,489) a month directly to H to enable her meet her basic needs. This payment to be Hong Kong CPI linked; c. M to pay my maintenance at an increased rate of HK$190,000 (rounded up from HK$189,705) per month. This is the maintenance as set out at Exhibit ST2-23, less the HK$5,000 per month to be apportioned to H directly for her share of the general household costs whilst living with me in Hong Kong. This maintenance should be paid monthly in advance: on a joint lives basis and should be CPI linked; d. M to pay my costs of these proceedings, in the event they are not covered by the litigation funding sums he has been paying monthly; and e. H's costs for her intensives and off campus training and portfolio work (HK$70,000 in August 2022 and 2023, HK$10,000 for June/July 2021 and HK$36,852 for December 2021 and June, July and December 2022-2023), totaling approximately HK$407,964, be taken from the Education Fund. Discussion Should the Respondent husband’s summons dated the 12 June 2020 be dismissed in its entirety, as argued by the wife? The husband’s non-disclosure 33. As I have said the husband has a continuing duty to make full and frank disclosure of all of his financial resources throughout the litigation process. Although clearly there can be argument about whether or not the receipt of a benefit is an asset or whether it forms part of income, generally speaking there can be no dispute over bonuses. These are almost always regarded as forming part of someone’s income stream notwithstanding the fact that they can be variable. In this instance the husband continually made misleading statements about two sums of money i.e., HK$400,000 withdrawn from his account on the 23 December 2019 and HK$4.2 million withdrawn from his account on the 27 April 2020, shortly before he issued these proceedings. In his Answer to the Wife’s Questionnaire dated the 29 July 2020, he says, when asked about the destination of both of these sums, that they went “To its savings account”. With respect this was an ambiguous statement – probably deliberately so. When asked again, he says in his supplemental Answer dated 7 September 2020 that he was obtaining the relevant bank statements. Those bank statements were only produced shortly before the trial. It then transpired that the money had been transferred to his current wife’s sole named account, an account in which he had said repeatedly that he had no beneficial interest. This was clearly untrue. It was only in a letter from the husband’s solicitors dated the 14 September 2020 that he admitted that this was not the case. This was then reiterated in the husband’s 2 nd affidavit dated the 18 January 2021 where he stated inter alia as follows: O and T [the husband’s second wife and son] 25. O and I have purchased properties in Seoul and Hong Kong as detailed in my Form E. Some of these properties have debt in the form of mortgage, key money (Korea). 26. O and I have separate bank accounts. We use her bank account as our cash savings and tax savings account in order to keep them separate from my salary income/day to day expenses account. This is a practice we have had in place for many years and still have. It is just how we manage our domestic finances. There is no Machiavellian plot or cunning plan in place to hide assets or distort our financial situation. O and I now have separate US bank accounts (HSBC) as well as HK HSBC accounts as before. 27. O also takes a more active interest in property management and has more time in which to do that and manage day to day tenants, financials etc. 28. There is no practice of deliberately hiding, hoodwinking the court or moving money or assets as alleged by S. 29. S states, in Paragraph 12 of her 3 rd affidavit, that I have been \"making regular large transfers to O\" and also \"transferred HD$4.6m to her just one month before he instructed his solicitors to write to me to launch his application \". The regular payments are savings for tax, household expenses. mortgage payments etc. The HK$4.6m was my annual bonus received in April and transferred to our family savings account as explained above. It is suggested by S that I transferred the bonus just before I made my application for variation to somehow hide this from her and the Court. I do not know how I could have hidden this, given the disclosure that is required by Form E. Also, the timing of my application had nothing to do with when the bonus was paid. 34. For the avoidance of doubt, I do not accept the husband’s position as set out here i.e., that he had not deliberately sought initially to hide his true income position from the court. That is exactly what he did. It is of note that during the trial he confirmed that he had also regularly transferred other cash to O’s account over the years. The quantum is, of course, unknown. 35. Similarly, with the Harbour One property. The husband continually stated that this was solely owned by O and that he had no interest in it, legal or beneficial. See in particular his Form E filed in support of this application, dated the 26 June 2020. This was later found to be completely false and in the witness box the husband accepted that the property was purchased from joint savings. Clearly, he has a beneficial interest in this property, which is of significant value (thought to be between HK$31 – 45 million). This property is also rented out at HK$65,000 per month. 36. In a similar vein it has proved very difficult to ascertain the value of the husband’s other benefits that accrue to his new and very senior position including 5080 company shares, which the husband simply denies that he owns and other grants of company stock, share options etc. Shortly before the trial the husband disclosed that between June 2020 and July 2021, he received share options of 28,930 stock. Again, this is an example of the husband not making full and frank disclosure in a timely and proper manner. The disclosure was a shot taken by his IPhone of his income and compensation records on his employer’s system. This is completely unacceptable litigation conduct, but be that as it may, according to the wife’s counsel this stock award alone should be worth in the region of HK$15 million. Clearly the husband has significant financial resources at his disposal. The husband’s US tax liability 37. In addition, it is the husband’s case that in truth his net income will fall, when compared to his income in Hong Kong immediately prior to his relocation, because he will be liable to pay 48% US income tax. This is a bald statement, made without reference to proper expert opinion. I am asked to accept this on the basis inter alia of an e-mail from PwC dated the 12 June 2020. It is also of note that rather oddly the husband has not produced a copy of his e-mail setting out the questions that he wished to have answers to. The e-mail states as follows: Hello M, I hope all is well with you and your family. We've included below a short response to your questions . However, happy to have a call to discuss this further. Let me know if you want to schedule a call to discuss further. Based on the current facts and circumstances, your 2020 US filing status will most likely change from what was previously discussed. Previously you were expected to travel to the US between Jan and July and relocate to the US during the year, thereby exceeding 183 days of physical presence during the year and establishing US residency in 2020 and taxable on worldwide income. However, as you have only been present in the US for 46 days so far, and will not be moving into the US until August, it is very likely that you will be under 183 days under the \"substantial presence test\". See calculation below. Remember that as a non-resident, you are only subject to US tax on your US sourced income (income associated with your US workdays between January and December 2020). So keeping the days under 183-days, using the below formula, will give you a bit more opportunity to keep some of the income (gain from the sale of the rental property, HK pension distribution, etc.) you expected to receive in 2020 away from 2020 US taxes. So the overall tax rate for 2020 will likely be lower than the 48% previously estimated and will vary based on the number of days-you work in the US. 100% (2020 US days) = 46 + 130 (Estimated days between 8/23 to 12/31 = 130 days) = 176 days 1/3 × (2019 US days) = (1 week × 1/3) = 2.33 days 1/6 × (2018 US days) = (1 week × 1/6) =1.17 days Total: 180 days For 2020, if you are physically present for 183 days and also less than 183 days under the 3 year look back formula shown above, you will file as a non-resident of the US and you will file a separate tax return and not a joint tax return with your spouse. For 2021, you will likely be a resident as of January 2021, taxable on worldwide income (irrespective of when the income was earned) and you can choose to file a joint return. Your marginal tax rate will likely be about 48% (Federal, NY, NYC and Social Security). Hope this helps. Let me know your availability if you wish to discuss. Thank you, 38. A couple of points arise out of this. Firstly, had the husband wanted to rely on expert opinion in support of his case then a proper request should have been made for a single joint expert to be appointed. Counsel for the husband says that if the wife does not agree with the e-mail above, then it is for her to challenge it. With respect I do not agree. Rather it is for the husband, in the first instance to make good his case. He has not done so. As the husband said in the witness box, the US tax regime is complicated and he is not a US tax expert. Again, and with respect, neither is the court. Judicial notice is taken of the fact that although it is accepted that the husband’s US tax obligations will most likely be significantly higher in New York than those he enjoyed in Hong Kong, the fact remains that there are many and varied legal ways for those who are subject to that tax regime to legitimately reduce their tax liability. None of that information has been provided to the court. 39. The husband subsequently disclosed a further e-mail dated the 26 June 2021 concerning capital gains tax primarily with respect to rental properties. Again, we are not shown a copy of the questions posed. Alicea Castellanos, the writer of this e-mail, responded as follows: O and M, Apologies for the delay. I am responding to your questions and including some articles that may be of interest. If you sell your rental properties today, while you are US tax residents, the gain, if any, and assuming you've held these for more than 1 year, would be subject to a federal long term capital gains tax rate of 20% plus a 3.8% net investment income tax, however, since the property was rented, any depreciation allowed or allowable will be added back, up to the amount of the gain and taxed at a rate of 25% at the federal level, this is called depreciation recapture see: https://learn.roofstock.com/blog/rental-property-depreciation-recapture. Depending on your overall income, the state tax rate would be an additional tax from 4% to 10.9%, and since you live in the city, there will be a city tax as well, from 3.078% to 3.876% see: https://www.nerdwallet.com/article/taxes/new- york-state-tax. Also note that if your capital gains are taxed overseas, you could get a credit for those taxes paid in the US if this income is being doubled taxed. You can see the 2021 federal long term capital tax rates here: https://www.globaltaxes.com/taxrates2.php Please note my responses are based on current tax law. There is a proposal by the current Biden administration to raise capital gains taxes to the highest ordinary tax rates for those taxpayers making more than $1,000,000, however, this is only a proposal and Congress would need to pass it for it to take effect (please see: https://www.cnbc.com/2021/06/21/biden-tax-plan-raises- top-capital-gains-dividend-tax-rate-to-among-highest-in-world.html). We probably won't know if this is passed until the end of the year but there are talks it could be retroactive to April 2021. If you need this on letter heard, or something else, or wish to discuss further, kindly let me know. Best, Alicea Castellanos CPA, TEP, N.P. 40. In the wife’s counsels closing submission he states as follows: (iv) R's Tax Liabilities 35. A central plank of R's application is that he has relocated to the United States where he is subject to 48% tax not only on his base income, but on all stocks, properties and other benefits[A/96/§31]. R produces only two emails to support his claim, one from PwC dated 12 June 2020 [B1/213], and one from Alicea Castellanos [C2/352] on the topic of capital gains tax. No preceding or succeeding correspondence giving context to these two emails has been disclosed. Neither email supports the sweeping claims R makes about having to pay 48% tax on, e.g. stock options, on his MPF, or on the full sale price ( cf. capital gains) of any property he might sell while he remains US tax resident. 36. It is totally incredible that a man of such wealth as R would not seek comprehensive tax advice for himself or for the purpose of his application to support his claim. Either he has sought advice and concealed it because it contradicts his claim, or he has been content to pay whatever tax his accountant tells him to and thus he has no idea what his real tax rate is. R admitted at trial that \" US tax is incredibly complicated and I am not a tax expert. \" 37. R has failed to substantiate his claim that he would be subjected to 48% tax across the board. In any case, even if one adopts the (not accepted) tax rate of 48% for R's income, this still leaves him with an after-tax income of at least HK$983,290.40 to utilise every month (see Schedule of Assets and Liabilities , Part III). After deducting R's expenses of HK$359,390 [C1/246], this still leaves HK$623,900.41 surplus with which he can pay any maintenance sought by P. Any claim that R cannot pay is baseless. Conclusion 41. In conclusion then it seems to me that prima facie the husband has indeed failed to show that he had any proper basis for issuing his summons of the 12 June 2020. In particular, he has not been able to make good his case that his income has fallen (this will be examined in more detail below) and that his relocation to the US is a triggering event necessitating a variation downwards. It is also of note that the husband’s income and financial resources generally have risen significantly since the divorce in 2010. How much maintenance should the husband now pay to the wife for her own maintenance? How should the issue of the rent be dealt with? The trigger 42. In many respects I accept that the trigger for this application was the husband’s original summons. The wife was clear that she would not have issued her own application had the husband not issued his. Indeed, she tried to persuade him to withdraw his summons and seemed willing then to simply soldier on regardless of the fact that she did have a case for an increase of some kind. When the husband refused to back down, she issued her own summons albeit somewhat reluctantly. It is then in those circumstances, that it is suggested by the husband’s counsel that the wife’s summons was a strategic or a tit for tat application. Although that may appear to be the case, I also accept that the wife had valid reasons for issuing her own summons, which cannot be dismissed simply on that premise. On a cost-of-living basis alone the wife was entitled to issue this application, although I accept that from a practical perspective, the legal costs involved in an application of this type can outstrip the practical benefits of making it. The rent 43. The parties agree that the husband should be released from his undertaking at Recital H, with respect to his housing allowance. They disagree on the amount of rental the wife shall be entitled to going forward. The husband’s housing allowance is now significantly higher than it was when the parties entered into the consent summons. The husband’s rent in New York is HK$190,000 per month, which I accept is reduced slightly by a two-month free period to HK$175,000 per month. This is significantly higher than his rent in Hong Kong, prior to his departure, which then stood at just over HK$100,000 per month. The wife for her part has recently moved into a smaller flat, still on South side, for HK$55,000 per month. She was heavily criticized during the trial for not moving into something cheaper, possibly in Happy Valley in the c HK$30,000 per month range. However, it seems to me that she should not be obliged, to significantly reduce her standard of living, given the terms of the original consent order. In such circumstances I accept that the husband shall be released from his undertaking at Recital H to utilize his rent allowance partly for the wife’s benefit and that the sum of HK$55,000 per month, being the wife’s actual rent should form part of her new maintenance order. The wife’s reasonable needs 44. The wife says that she “needs” HK$190,000 per month inclusive of the rental i.e., HK$135,000 per month for herself alone. In her second affidavit dated the 17 November 2020 she set out those needs as follows: General household expenses General Item Amount Rent $66,000 Mortgage Instalments N/A Utilities $5,384 Management fees N/A Food $16,000 Household expenses $3,000 Car expenses Replacement car on HP for 54 months $5,850 + $5,896 Insurance premia N/A Domestic helper $8,240 Others Total monthly household expenses $110,370 The wife’s personal expenses 4.2 Personal Item Amount Meals out of home $2,000 Transport *includes parking $800 Clothing / Shoes $4,000 Personal grooming (including haircut and cosmetics) $8,000 Entertainment / presents $1,883 Holiday $3,551 $3,150 $1,426 $5,634 Medical/ Dental $15,522.80 Tax N/A Insurance premia N/A Interim maintenance N/A Contribution to parents N/A Dependent family members N/A Others Pilates Subscriptions Retraining Laptop replacement Credit card interest and bank fees Repayment of H’s inheritance $3,000 $1,688 $10,000 $300 $13,380 $10,000 Total personal expenses $84,334.80 45. In total therefore it seems to that the wife was originally claiming something in the region of HK$195,000 per month to cover both her general and personal expenses (HK$110,370 + HK$84,334.80 = HK$194,704.80). She has rounded this down to HK$190,000 per month for the purposes of this application and because she had deleted the utility expenses as set out in paragraph 32 (subsection c)) above. According to her counsel this is a “modest” increase given that she has received no increase in maintenance at all for the last 12 years, so on a cost-of-living increase basis alone, it should be allowed. It is of note that the court was not provided with the calculations for a cost-of-living increase of the wife’s maintenance. What would be a reasonable amount of maintenance for the wife? General comments 46. Some of the difficulty here is that the wife seems to have great difficulty in managing her own financial affairs. Although I accept that she has always put H’s welfare and her needs first, the fact remains that if one cannot realistically afford to pay HK$40,000 per month in extra tuition for one’s child, then you should not pay that sum. You need to look at other alternatives. Similarly, if your credit cards are maxed out, perhaps it is not sensible to continue to have your beauty treatments undertaken at a 5-star hotel, because this is “where you have always gone”. The wife’s purchases of top end household items and clothes also makes for difficult reading. It is accepted that she enjoyed and should continue to enjoy a comfortable standard of living, which is achievable given the husband’s financial resources. But she has to also learn to either live within those means or to seek her own employment to supplement them. The wife’s claim General expenses 47. As indicated above I accept that the wife should receive her rental in full. I also accept that the husband should be released from the undertaking that he gave with respect to his housing allowance, given his relocation and that the sum of HK$55,000 per month, which is the wife’s current rent, should form part of her maintenance order. I do not accept that a larger sum of HK$66,000 per month should be entertained. With respect to the other items, I will allow the estimated cost for utilities and household expenses. I will allow a reduced sum of HK$5,000 per month for a helper, most probably part time. The estimated cost of food at HK$16,000 per month, is also high given that the wife will be on her own for much of the year. I will allow HK$12,000 per month. In so far as the car is concerned, I will allow HK$5,850 being the cost of running her current car, but I will not allow the request for a replacement car – which is really a request for a capital payment by instalments. Thus, I will allow general expenses rounded down to HK$86,000 per month as follows: General Item Amount Rent $55,000 Mortgage Instalments N/A Utilities $5,384 Management fees N/A Food $12,000 Household expenses $3,000 Car expenses $5,850 Insurance premia N/A Domestic helper $5,000 Others Total monthly household expenses $86,234 48. In so far as the wife’s personal expenses are concerned, given her evidence it seems to me that HK$4,000 per month for clothes is a little on the high side (her evidence was that she only wears black and generally T-shirts and trousers/leggings of a certain brand). I will allow HK$3,000 per month. Personal grooming will be reduced to HK$5,000 per month. (Notice should be taken of the fact that HH Judge Melloy attends the Grand Hyatt hair salon). Her request for a holiday allowance is also very high – she will not be able to travel so frequently if she is retraining/working, as she will need to do. I will allow HK$7,500 per month. This is still HK$90,000 per annum which should allow her to travel to the United States to see H perform and travel inter alia to see her sister in Perth etc. I accept that the wife has some medical issues so will allow this estimate in full. The other requests however will not be entertained in full. In particular, the wife will need to repay H’s inheritance monies from her own endeavours. I will allow a further HK$15,000 per month to cover the wife’s other expenses i.e., for her Pilates classes, subscriptions, retraining and the laptop replacement. I have purposefully not included putting money aside for repayment of the inheritance or the credit card interest and bank fees, as I am anticipating that the wife should be able to repay most of her credit card debt as a result of this judgment. Thus, I will allow the following for the wife’s own expenses: Personal Item Amount Meals out of home $2,000 Transport *includes parking $800 Clothing / Shoes $3,000 Personal grooming (including haircut and cosmetics) $5,000 Entertainment / presents $1,883 Holiday $7,500 Medical/ Dental $15,522.80 Tax N/A Insurance premia N/A Interim maintenance N/A Contribution to parents N/A Dependent family members N/A Others: $15,000 Total personal expenses $50,705.80 In total then this amounts to just under HK$137,000 (i.e., HK$86, 234 + HK$50,705.80 = HK$136, 939.80). In reality this is approximately a HK$15,000 per month increase (i.e., HK$137,000 – HK$122,000 = HK$15,000). H’s maintenance, that was subject to a cost-of-living increase, has risen by a similar amount from HK$54,000 per month to approximately HK$70,800 per month i.e., an increase of approximately HK$17,000 per month. Thus, even on a cost-of-living basis this rise appears to be in the right ball park. In my view the wife is entitled to an actual modest increase in her maintenance, which should be more reflective of a cost-of-living increase. I am not convinced that she is entitled to a rise in maintenance otherwise. I do not accept that she has a case for a rise to HK$190,000 per month. However, I shall also order that her maintenance shall be adjusted annually on the anniversary of this order each year by reference to the consumer price index of Hong Kong. The wife’s earning capacity 49. As I have already said I do not accept that there was any legal obligation on the wife to return to the workforce during this period, although clearly there was some discussion of it as she refers to retraining in yoga and of possibly taking an anatomy/psychology course in her first Form E dated the 11 September 2009 (section 4.4). However, I largely accept that H has done as well as she has, in part, because the wife has devoted herself wholly to supporting her. But going forward this should not be the case, or at least not to the same extent. I am certainly of the view that the mother should work in some capacity with a view to repaying her daughter her inheritance. As I have already said, I accept that this should not form part of her increased maintenance order and I have not included it in the schedule above. The husband says that the wife should be able to earn HK$20,000 per month. I accept that this is an optimistic figure. The wife has not worked for over 22 years, she did not go to university and she does not speak either Cantonese or Mandarin. I accept that she may need to retrain. It also seems to me that it is imperative that she return to the workforce in some capacity and the sooner the better. How much maintenance should the husband now pay for H? Should any part of that maintenance come from the education fund? Should the husband pay H directly? 50. The parties have agreed that the husband should pay maintenance to H directly and as referred to above, they have also already transferred the education fund to H. The real bone of contention relates to what the original intention was with respect to the education fund and whether it should be used to partly maintain H now. The education fund 51. In short, I accept the wife’s case with respect to the education fund namely that the original intention was that it should be regarded mainly as a safety net, to be used in the unfortunate event that the husband lost his job or was, for some other reason unable to pay for H’s educational costs. Later, the parties agreed that the fund could also be used to pay for H’s “intensives”. But now the husband also argues that the fund should be used to meet H’s other day to day expenses. This appears to be relying in part on a clause in order 3 which states that the education fund should be for H until she reaches the age of 18 or ceases full time education or “until the parties written agreement that sufficient funds have been accumulated to fund H’s education”. 52. A couple of points arise from this. Firstly, there is no agreement that there are sufficient funds in the education fund to enable H to finish her undergraduate degree as planned. Secondly, I do not accept that this was the original intention of the parties, as set out in the consent order (see paragraph 2 above and Recital N). Indeed, it is clear to me that on a plain reading of Recital N, that originally the intention was that the education fund was to be relied upon if a) the husband lost his education allowance and b) he did not have the financial resources otherwise to pay for H’s school fees, school bus and other school expenses. It seems to me that school should be interpreted widely to include college or university. In this instance it is not accepted that the husband does not have the financial resources available to him to pay H a reasonable monthly maintenance figure. Thus, I accept as suggested by the wife at paragraph 32 (e) above, that the remaining sum should be used by H to pay for her “intensives”, off campus training and portfolio work. I will also hold the husband to his undertakings at Recital N, together with order 3. Indeed, this aspect seems to be agreed in part as the husband has said that he will pay into the education fund for the next 2 years as originally planned. What are H’s reasonable needs? 53. Some of the difficulty here is that given that H is a pre professional ballet dancer, her needs are somewhat different from those of a standard student. The husband estimates that she will need US$1,000 per month on top of her other costs such as tuition fees etc, which he will meet. He says that this is a reasonable amount, about double what other parents give their children and that H should be encouraged to work in the holidays in order to provide herself with some pocket money otherwise. He doesn’t particularly challenge H’s claimed expenses, but says that if it costs that much then the additional funds should come from the education fund. The wife says that H needs HK$34,500 per month and that the husband should pay this sum to H and leave the education fund intact. 54. H wrote to both parties in April 2021 and set out what she says her reasonable needs are as follows: Expense Amount/month Notes Estimated School fees 2021-22 Tuition US$60,446 Scholarship -$12,500 = US$47,946 + Mandatory Fees + Housing + Mandatory Dining Plan = US$20,595 47,946+20,595=68,541 Total = US$68,541 approx. HK$53,190.16 Split across 10-month payment plan = US$6,854 for 10 months (×2 5-pay payment plans) Or if you want you can pay it in full directly to University of C. These fees aren't finalized yet, for example I haven't received my housing assignment as of yet, so I'm not sure what the fees are for that. The meal plan is the basic one the University makes mandatory (and the food isn't great, at that) School supplies (books and stationery) HK$780 This is approximately what I have been spending Flights to school 2021-22 CX Student Bundle (×2 direct Economy flights) ×2 HKG-LAX round trips HK$2,466 Lump sum = HK$29,600 (2021-22) *Must be paid as a lump sum *Subject to tax at time of booking I will pay – for this in May on my debit card using the Education Account (to be 'reimbursed). Other Transport to/from school University of C/LAX Uber = US$80 × 4 = US$320/year Hong Kong Airport Express = HK$115 × 4 = HK$460 HK$207.95 HK$38.33 This is transport to and from the airport either on the LA side or HK side. Bupa HK$7,165 I know this is already paid, but I have included it so you can see the full picture, so to speak. It is paid annually (October 1) and there is always a % increase for medical inflation. Dental Monthly Invisalign & hygienist appointments/routine checkups ×2/year HK$3,202 Once orthodontics have finished (est. April 2022, this cost will be hygienist appointment and checkups x2/year. Does not cover any fillings/other dental work i.e. x-rays. Holidays ×1 Economy flight to visit family in Perth HK$1,093 Based on Economy HKG-PER fare for December 2021 of HK$13,116 (as of April 2021). I will try and use Air Miles to source a flight to London. Clothing/Shoes Zara, Free People, Brandy Melville, Kookai, Frye, Madewell, Bedstü, Net-A-Porter sales, outlet stores HK$3,500 This is: all other non-dance clothing and shoes whether it be underwear, pajamas, blouses, skirts, swimwear, dresses, gala and fundraising outfits, donor events etc. Personal Allowance HK$7,000 Inc. phone plan, household essentials for dormitory, laundry, bottled water, public transport/local Ubers, infrared saunas, cryotherapy, snacks, eating out, entertainment/gifts, concert/festivals, dance 'performances open yoga/Pilates classes, things from the chemist, and if I'm lucky, saving towards any other trips. Personal Grooming HK$2,500 Inc. haircut, skincare, shampoo and conditioner, waxing, makeup, razors, shower gel, creams, floss, earbuds, cotton wool, Epsom salts, dental hygiene. feminine products. foot health, hairpins, hairspray, manicure Uniform for Dance at University of C Pointe Shoes Gaynor Minden Customized (9 Wide 4 Box Hard Shank Deep Vamp Sculpted Fit) Soft Shoes Bloch Leotards Just A Corpse, Yumiko, Elevé Dancewear Tights Capezio Training-wear Adidas, Nike, Lululemon, APL Inc. sweats/warmup pants training tops, sports bras, trainers (hip hop & dance conditioning) HK$5,902 Pointe Shoes 1,187/pair + 81/pair (ribbons & elastics) Min. 3 pairs a month = HK$3,804 Soft Shoes 300/pair 1 pair a month = HK$300 Leotards HK$907/month Tights HK$183.3/month Training-wear HK$708/month Nutritional & Health training supplements HK$2,800 e.g. E3Live/BrainOn, Protein/ Nutritional powders, Hydration Powders (electrolytes), sports massage (see cryotherapy and infrared in personal allowance) TOTAL** (use Tuition, Bupa and all expenses) HK$89,844* 55. Once H’s school fees are deducted one is left with a balance of just over HK$35,000 per month. Some of the difficulty here is that H also seems to have expensive tastes and there is little sense of her seeking to live within a more standard student budget. Of the amount claimed H’s estimated school fees, including tuition and mandatory fees together with her Bupa costs should be immediately discounted as they are dealt with by some of the husband’s original undertakings. I do have some concerns with respect to housing and food (the mandatory dining plan etc) and I will not accept the rather general proposal put forward by the husband i.e., that this is something that father and daughter can discuss directly at the appropriate time. Consequently, I will further direct that either a more appropriate undertaking is included in the recital of the order by agreement or that in the alternative the parties file a short submission (no longer than 3 pages, 14 font double spaced) within a certain time period, whereupon the maintenance order for H shall be varied to reflect her actual housing and food needs for the next two years. In addition, I will allow the following sums in full, namely funds for her school supplies, flights to school, other transport to and from school, uniform for dance, nutrition and health training supplements. 56. I have some concerns with respect to some of the other sums claimed. For example, given that H’s orthodontic treatment is now finished I will only allow her HK$1,000 per month for dental. I also have some concerns about her request for clothing on top of her uniform for dance at HK$3,500 per month plus personal grooming of HK$2,500 per month, in addition to the suggested personal allowance of US$1,000 per month that the husband has already offered to pay. This totals just under HK$14,000 per month, which is a large sum for a student – even a dancing student. I will allow a total sum of HK$10,000 per month for all of these items. There will be no additional allowance for holidays or flights outside of her return flights to Hong Kong. Items of this nature will need to be paid for by H herself from her own endeavours. In total then I will allow the following: Expense Amount/month Notes School supplies (books and stationery) HK$780 Flights to school 2022 - 24 CX Student Bundle (×2 direct Economy flights) ×2 HKG-LAX round trips HK$2,466 Other Transport to/from school University of C/LAX Uber = US$80 × 4 = US$320/year Hong Kong Airport Express = HK$115 × 4 = HK$460 HK$207.95 HK$38.33 Dental Monthly Invisalign & hygienist appointments/routine checkups ×2/year HK$1,000 Personal Allowance HK$10,000 Uniform for Dance at University of C HK$5,902 Nutritional & Health training supplements HK$2,800 TOTAL HK$23,195 57. Thus, I shall allow H the sum of HK$23,000 per month as opposed to the total sum of US$1,000 per month proposed by the husband and the higher sum proposed by herself. In addition, the husband shall continue to be bound by his undertakings and as offered by him, to continue to pay for H’s tuition fees and other items as set out in paragraph 31 above. As already indicated, I shall also require the payment for H’s housing and food for the next two years to be clarified. Can the husband afford to pay these sums? The husband’s employ 58. There is no doubt that the husband has gone from strength to strength since the divorce and that he is now probably at the pinnacle of his career having recently secured a global COO role in the same media company. The wife sets out his progression in the media and advertising conglomerate in her second affidavit dated the 17 November 2020 as follows: 29. Since our marriage, M's career progression has been as follows:- 2000 - 2002 CEO X Japan 2002 - 2006 CEO X North Asia 2006 - 2010 CEO of Group X North Asia 2010 - 2019 CEO of Group X APAC and Chairman of China 2019 - Present - Global COO, Group X At paragraph 26 of the same affidavit, she also states as follows: 26. M is now Global COO of Group X, part of ABC which is the world's larges advertisement company. In 2019, ABC's reported revenue globally was £13.234bn with an operating profit of £1.561 bn. Group X's figures are not reported separately, however, it is commercially the most valuable part of ABC. In the 2019 ABC annual report, Group X is listed as the \"cash generating unit\" with the greatest \"significant goodwill\" in the ABC portfolio. The husband’s case on his income 59. In his second affidavit dated the 18 January 2021, the husband reiterated inter alia as follows: 50. Despite the base salary being higher in the new role the tax differential and cost of living in the USA versus HK means that my net income is less than in HK . The tax gross to net of about 48% is confirmed based on payslips since November 2020. There is now produced and shown to me marked \"2-MFP-3\" a copy of my payslips since November 2020. 51. My topline fixed income per month in the US is now: HK$ Gross salary 455,000 Less :- Tax at 48% 218,400 ________ 236,600 HK$ Plus :- Allowances 238,000 Less :- Tax at 48% 114,240 _______ 123,760 Plus :- Salary in Lieu of pension 29,000 _______ Total 389,360 ======= 52. In Hong Kong. on my new global contract (effective Nov 1, 2019), my net income, after 16% tax on the fixed income including benefits paid for by my company was HK$500,000 a month. 53. Thus, net to net fixed income is reduced by HK$110 a month or 22% from Hong Kong to New York. 54. In addition, I now have around US$70,000 or HK$550,000 per annum/HK45,000 a month for University fees to pay for H. 55. Annual bonus (as opposed to stock awards) paid in cash is calculated as a % of base salary (× allowances) and is subject to company and personal performance and varies greatly by year. 56. Bonus is paid in the April following the prior calendar year. For 2020 there will be no bonus paid in April 2021 thus next potential bonus payment is April 2022 and again subject to·performance. In the contract, maximum amounts are stated. They are not a benchmark for potential future payment. 57. Also due to COVID, in 2020, senior executives were required to take a salary cut of 20% for the months of May, June and July. I did not seek reduction in payment as a result despite my reduced income. 58. One should note the current depressed state of property markets and outlook in Hong Kong and Korea. The valuations stated by S in Paragraphs 55 and 56 are baseless in reality and massively inaccurate. There is no plan nor sensible reason to liquidate any of these assets at this time. 60. As indicated above, the husband simply did not come up to proof with respect to this aspect of his case. A number of initial points should be noted at this juncture. Firstly, the court is charged with not only considering the husband’s “fixed income” but also with his “variable income”, such as his bonuses together with his other “financial resources”. Further the court is concerned not so much with his financial position prior to relocation, but with his financial position as at the time that he entered into the consent order. According to his Form E dated the 17 August 2009, at that stage he had a fixed income of HK$258,453 per month plus a bonus of HK$56,000 per month (i.e., just under HK$315,000 per month). It is of note that even on the husband’s own case as set out above, his net income has indeed risen since then. 61. As I have said it is the wife’s case that infact the husband’s income is significantly higher than this. In her counsel’s schedule, she states that the husband currently earns approximately HK$1,890,943.07 per month pre-tax as set out below. It should be noted that I was taken to some supporting evidence with respect to these figures during the course of the trial. III. M'S KNOWN INCOME HK$ 1. Regular monthly income (a) Salary US$700,000 per annum (b) Mobility allowance US$366,000 per annum (c) Pension allowance US$44,000 per annum (net) (d) Executive health club allowance US$1,000 per annum (e) Rental income of A Street (f) Rental income of H One HK$65,000 per month, less management fee of HK$8.000 = HK$57.000 HKD 455,000.00 HKD 237,900.00 HKD 46,285.20 HKD 650.00 HKD 30,000.00 HKD 57,000.00 HKD826,835.20 2. Income received on a per annum basis (a) Bonus aka Short-Term Incentive (STIP) HKD3,412,500.00 Divided by 12: HKD284,375.00 3. Stock options (a) Stocks to be vested to R in 2022 (b) Stocks to be vested to R in 2023 (c) Stocks to be vested to R in 2024. 15,766 shares 17,859 shares 15,713 shares HKD 8,260,217.32 HKD 9,356,794.43 HKD 8,232,449.24 Taking the figure for 2023, divided by 12: HKD 779,732.87 Total M's income HKD 1,890,943.07 (Less P's claimed tax rate of 48% at its highest although not accepted given allowances / tax deductibles available) (HKD 907,652.67) Total of M's monthly income, after-tax HKD 983,290.40 62. Even if one accepts, as I do, that the stock options may be regarded as other financial resources more akin to assets than income, and even if one also accepts that the husband’s bonus is variable, it is clear that the husband has more than sufficient income to pay for the wife and H’s reasonable expenses as anticipated at the time of the original consent summons. This is even if he does have to pay tax at 48% on all of the items identified, which as I have already said is not necessarily accepted by the court at face value. Other points raised by the husband 63. The husband also raises a number of other points in support of his application. Firstly, he references his remarriage and the fact that he has a second son who will surely deserve the same financial support as H. As indicated in paragraph 24 above, although the court is charged with looking at the reality of the situation, it is not possible for a litigant to place his second family above his first from a financial perspective as of right. In any event this is not a new situation. The husband remarried in 2011 and had T shortly thereafter. T currently attends a very prestigious school in New York and is living in a luxurious apartment with his parents. I simply do not accept that the husband does not have the financial resources to properly support T going forward. To that end the husband also says that he may be forced out or choose to retire early given that he is now 59 years old. That is true – but it has not happened yet. By the same token the husband may be offered an even more prestigious position – we simply do not know. The court cannot make orders based on possibilities only. Further, it is also of note that the husband’s second wife has a significant earning capacity of her own and although the court’s cannot directly access her financial resources in order to pay the wife and H, one can expect her to contribute towards her own household if the circumstances required it, which may in turn relieve the husband’s own burden. Should either of the maintenance figures be backdated and if so to when? 64. As indicated above it is trite but worth reiterating at this stage that the court has no jurisdiction to order that the wife receive a further lump sum payment. Further, court orders remain in force until they are varied, unless by agreement between the parties otherwise. So, in this instance I am approaching the final order on the premise that the husband has continued to pay maintenance to the wife in the sum of HK$68,000 per month and to the wife for H, in the sum of HK$70,800 per month, even though on both parties’ cases this figure was to be reduced. The husband’s existing undertakings, as set out in the court order, already include reference to school fees, which is this context should also include university or college fees. Thus, I anticipate that the husband has continued to pay for these items directly, in addition to his maintenance obligations. 65. Under the terms of the new proposed order the husband shall pay an additional HK$15,000 per month for the wife’s maintenance. I am concerned that the wife shall have sufficient funds to pay off the majority of her credit card debt prior to the new order coming into effect. I also anticipate her returning to work in order to make up any difference and in order to repay H her grandfather’s inheritance monies. Consequently, I shall make an order that the payment of the wife’s maintenance shall be back dated to the date of the husband’s summons – i.e., June 2020. By the time that this judgment is handed down that will be a period of approximately 26 months. This equates to a further HK$390,000 to be paid to the wife (i.e., HK$15,000 x 26 = HK$390,000). I shall not backdate H’s maintenance order. This may seem a little unfair at first sight, but I am conscious that to do so may plunge the wife into further debt which she is unlikely to be able to recover from. I also hope that the wife has been sensible with any additional funds pending receipt of this judgment. How should the husband’s original undertakings be dealt with? 66. The husband asks to be released from his undertakings given in recitals F, H, J, K, L (in so far as the airticket is concerned only) and N of the court order dated the 8 September 2010. These state as follows: F. AND UPON the Respondent undertaking to the Court and to the Petitioner that he will continue to nominate the Petitioner (even upon his re-marriage) and the child of the family, namely H, a girl, born on 26 th April 2002 (\"H\") as partner/child member of his membership at the American Club to enable them to use the facilities of the same until H reaches the age of 18 years or leaves Hong Kong permanently, whichever is the earlier. … H. AND UPON the Respondent undertaking to the Court and to the Petitioner that: - (1) the Respondent will utilize HK$54,000 per month from the housing allowance offered by his employer to pay for the current rental expenses of HK$60,000 for the Petitioner and H, with the deficit of HK$6,000 per month to be met by the Respondent save that the Petitioner and the Respondent acknowledge and agree the Respondent will deduct a sum of no more than a total HK$2,500 per month from each of the Petitioner's and H's aggregate maintenance (namely no more than a total of HK$5,000 per month) pursuant to paragraphs 1 and 2 below to meet the said deficit and such deduction from the Petitioner's and H's maintenance shall cease if there is no such deficit on the rental expenses; (2) the Respondent will continue to utilize his housing allowance for the benefit the Petitioner until her death or remarriage, whichever is the earlier, and he will continue to utilize his housing allowance for the benefit of H until she attains the age of 18 years, or ceases full-time tertiary education, whichever is the later; (3) in the event that the Petitioner and H move from Hong Kong, the Respondent will use his best endeavours to seek to receive his housing allowance in the form of cash from his employer at that time to meet accommodation expenses of the Petitioner and H; (4) in the event of an increase in the rental of the Petitioner's and H's residence, the Respondent will forthwith request for a correlating increase in his housing allowance from his employer to cover the same and keep Petitioner informed and copied in on all communications with the Respondent's employer. … J. AND UPON the Respondent's undertaking to the Petitioner and to the Court that he will utilize the education allowance offered by his employer to pay for H's school fees, and school bus fees until H reaches the age of 18, or ceases her full-time tertiary education, whichever is the later. Should the Respondent lose his education allowance and does not have the financial resources to pay H's schools fees, school bus fees and all other school expenses before H completes her full-time tertiary education, such expenses will be paid by the education fund as per paragraphs N and 3 below. K. AND UPON the Respondent's undertaking to the Petitioner and to the Court that, other than those provided in paragraph J above he will pay for H's necessary school expenses until H reaches the age of 18, or ceases her full-time tertiary education, whichever is the later provided that such school activities are approved by the Respondent in advance. L. AND UPON the Respondent's undertaking to the Court and to the Petitioner that he will provide full BUPA International medical insurance cover and one return business class ticket a year (London - Hong Kong) for H, until H reaches the age of 18, or ceases her full-time tertiary education I whichever is the later, whether or not he receives these as a benefit of his employment. … N. AND UPON the Petitioner and the Respondent acknowledging and agreeing and undertaking to the Court and each other that they will open a bank account on trust for H for the purpose of maintaining an education fund to be set up pursuant to Paragraph 3 below (“the Education Fund”) no later than 31 st March 2011. The bank account will be operated by the parties jointly and should there be any surplus upon H finishing her full-time tertiary education, such surplus will be paid to H. In the event of the demise of one party, the surviving party shall operate this fund together with the deceased party's nominated guardian provide that the nominated guardian is not the spouse of the deceased party. The education fund is to be utilized for any of H's education expenses in the event the Respondent loses his education allowance and does not have the financial resources to pay for H's school fees, school bus fees and all other school expenses. 67. In so far as these undertakings are concerned, the husband shall be released from the undertakings in Recital F, (American Club) Recital H, (Housing allowance), the second part of Recital L (BUPA and flight to London) which refers to a business class flight to London and Recital K (school expenses). He shall not be released from the undertakings given by him in recital J and N which are partly concerned with the education fund. What order should be made for costs? 68. The wife has been partially successful in her application in that she did obtain a modest increase in her own maintenance payments and the maintenance for H was also varied, when the husband was proposing a significant reduction for herself and a lesser sum for H. The husband’s summons was also dismissed in its entirety and I have also found that he did not make full and frank disclosure of his financial means. In such circumstances it seems to me that the wife should have her costs of and arising out of his summons dated the 12 June 2020 on an indemnity basis from the time that the summons was issued until the husband eventually told the truth on oath, with respect to some aspects of his case, in his affidavit dated the 18 January 2021. After that date he shall pay the wife’s costs on a party and party basis. In both instances costs shall be taxed if not agreed. There shall be certificate for counsel. In so far as the wife’s summons dated the 17 November 2020 is concerned, she shall also be awarded her costs on a party and party basis, such costs to be taxed if not agreed. Again, there shall be certificate for counsel. This order shall be made nisi, to be made absolute in 14 days’ time. Credit shall also be given for the litigation funding provided by the husband to date. Final order 69. Consequently, I shall make an order as follows: 1) With effect from the 25 August 2022, paragraph 1 of the court order dated the 8 September 2010 shall be varied in that the Respondent shall pay the Petitioner maintenance for herself in the sum of HK$137,000 per month, such sum to be paid during the joint lives of the parties, or until the Petitioner’s death or remarriage, whichever is the shorter or until further order. Such maintenance shall be adjusted upwards annually on the anniversary of the date of this order with reference to the consumer price index of Hong Kong. This order shall be backdated to June 2020 and any outstanding sums shall be paid by the Respondent to the Petitioner within the next 14 days. 2) With effect from the 25 August 2022, paragraph 2 of the court order dated the 8 September 2010 concerning periodical payments for the child of the family, H shall be varied down in that the Respondent shall pay directly to H the sum of HK$23,000 per month. These payments shall be made until H completes her full-time education or until further order. They shall continue to be adjusted upwards annually on the anniversary of the date of this order with reference to the consumer price index of Hong Kong. 3) It is further directed that suitable undertakings be included in the order from the husband with respect to payment of H’s housing, dining/meals. In the event that agreement is not possible both parties shall write a short submission to the court within the next 14 days, no longer than 3 pages in length, 14 font and double spaced, whereupon further directions/orders will be made in this respect. 4) The Respondent shall be released from the following undertakings given by him in the court order dated the 8 September 2010 namely the undertakings in recitals F, (the American Club) recital H, (the Housing allowance), the second part of recital L (BUPA and flight to London) which refers to a business class flight to London only and recital K (school expenses). He shall not be released from the undertakings given by him in recitals J and N which are concerned partly with the education fund. 5) There shall be an order nisi to be made absolute in 14 days’ time that the Respondent shall pay the Petitioner’s costs of and arising out of his summons dated the 12 June 2020 on an indemnity basis, from the 12 June 2020 until the 18 January 2021, and costs on a party and party basis thereafter, such costs to be taxed if not agreed. There shall be certificate for counsel. The Respondent shall also pay the costs of and arising out of Petitioner’s summons dated the 17 November 2020 on a party and party basis, to be taxed if not agreed. There shall also be certificate for counsel. Credit shall also to be given to the Respondent for funds paid by him in accordance with the order\\agreement on litigation funding. ( Sharon D MELLOY ) District Judge Mr. Timothy Parker instructed by CRB for the Petitioner Ms. Bonnie Y.K. Cheng instructed by Stevenson Wong & Co for the Respondent Look up this case on Lawcite Noteup",
  "length": 92121,
  "headers_seen": [
    "Introduction",
    "Overview",
    "Background to the marriage",
    "The circumstances surrounding the consent order and since",
    "The consent order dated the 8 September 2010",
    "The issues",
    "The law",
    "Maintenance orders"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkfc/2022/168",
  "query": "warmup",
  "ts": "2025-10-17T10:41:02",
  "ok": true
}