{
  "title": "A FIRM V. MG | [2022] HKCFI 463 | HKLII",
  "court": null,
  "year": 2022,
  "date": "2025-10-05",
  "content": "HKLII Databases Court of First Instance [2022] HKCFI 463 A FIRM V. MG Judgment Information Date 15 Feb, 2022 Action No. HCCT26/2021 Neutral Cit. [2022] HKCFI 463 Parallel Cit. [2022] 3 HKC 113 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCCT26/2021 HCCT26/2021 A FIRM v. MG HCCT 26/2021 [2022] HKCFI 463 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO 26 OF 2021 (Transferred from HCA 1768/2020 pursuant to the Order of the Honourable Madam Justice Mimmie Chan dated 18 th March 2021) ________________________ IN THE MATTER OF an Arbitration Award dated 21 st July 2020 made by the Hong Kong International Arbitration Centre and IN THE MATTER OF Article 34 of the UNCITRAL Model Law on International Commercial Arbitration and IN THE MATTER OF Section 81 and Section 4 of Schedule 2 of the Arbitration Ordinance ( Cap 609 ) ________________________ BETWEEN A FIRM Plaintiff and MG Defendant ________________________ Before: Hon Mimmie Chan J in Chambers Date of Hearing: 25 January 2022 Date of Decision: 16 February 2022 ________________________ D E C I S I O N ________________________ Background 1. These proceedings have been conducted by the Plaintiff in a somewhat haphazard fashion. They were commenced by Writ on 19 October 2020 (“ HCA 1768/2020 ”), with an Endorsement of Claim whereby the Plaintiff seeks the setting aside of an arbitral award of 21 July 2020 (“ Award ”), and for an order that it be free “to apply to the HKIAC to re-arbitrate the dispute” under Article 1.7 of the Retainer Agreement made between the Plaintiff and the Defendant (“ Agreement ”). 2. On 22 December 2020, the Plaintiff realized its mistake and applied ex parte to transfer the proceedings to the Construction and Arbitration List, and for an order that the action do continue as if commenced by Originating Summons (as required under Order 73 rule 1 RHC). As directed by the Court, an inter partes summons was issued on 3 February 2021 for the application (“ Summons ”). 3. The Plaintiff’s application by Summons was granted by an order made by the Court on 18 March 2021. 4. Under Order 73 rule 1, an application under the Arbitration Ordinance (“ Ordinance ”) must be made by originating summons. Under Order 73 rule 5 (4), for an application to set aside an arbitral award under section 81 of the Ordinance, the originating summons “must” state the grounds of the application, and if the application is founded on evidence by affidavit, a copy of every affidavit intended to be used “must” be served with the originating summons. 5. The Originating Summons relied upon by the Plaintiff stated that the Award should be set aside on the ground of “serious irregularity pursuant to section 81 of the Arbitration Ordinance and section 4 of Schedule 2” to the Ordinance. It is trite, that section 81 of the Ordinance which adopts Article 34 of the Model Law sets out the exclusive recourse against an arbitral award. Section 81 does not have a general ground of an award being set aside for “serious irregularity”, and the Plaintiff has not set out in the Originating Summons any matter which may comprise any ground for setting aside the Award as provided for in Article 34 (2). 6. Under section 4 of Schedule 2 to the Ordinance, an award may be challenged on the ground of serious irregularity affecting the tribunal, the arbitral proceedings or the award, if Schedule 2 applies to the arbitration agreement between the parties. The arbitration agreement relied upon by the Plaintiff in this case is contained in the Agreement dated 10 December 2015. There is no evidence before the Court, and the Plaintiff does not purport to claim, that any part of Schedule 2 applies to the arbitration agreement, whether by express provision or by virtue of section 100 of the Ordinance. 7. Counsel for the Plaintiff therefore was correct in abandoning the Plaintiff’s claims of serious irregularity under section 4 of Schedule 2. 8. The Endorsement of Claim never specified the ground for the setting aside of the Award. The Originating Summons referred only to “serious irregularity” pursuant to section 81, without even stating the matter alleged to be the “serious irregularity” which may constitute a valid ground under Article 34 (2), be it the lack of proper notice of the arbitral proceedings, the decision containing matters beyond the scope of the submission to arbitration, or alleged irregularity in the composition of the tribunal or the arbitral procedure. Simply referring to section 81 of the Ordinance would not be sufficient to satisfy the requirement of Order 73 rule 5 (4) (a). 9. The affidavit of David Buxbaum (“ DB ”) was sworn on 24 June 2021 to support the setting aside application made by the Originating Summons. That referred to factual matters sought to be relied upon by the Plaintiff, including the fact that the arbitrator had failed to conduct the arbitral proceedings in accordance with the procedure agreed by the parties, in permitting a third party to participate in the proceedings without the authority, knowledge or consent of the Plaintiff. Other matters complained of, that there were errors of law in the award, that the arbitrator did not make rulings according to the facts and the Mainland law, did not apply Mainland law and lacked jurisdiction, and that the Defendant had been allowed additional time and opportunity to file late answers etc, either disclose no viable ground for setting aside, or was unsubstantiated. 10. However, DB’s affidavit was only filed on 28 June 2021, after the Writ of 19 October 2020, the Summons of 3 February 2021, and the date of the order made on the Summons, of 18 March 2021. 11. Strictly, the Plaintiff failed in compliance with Order 73 rule 5 (4), and its application can be struck out and dismissed as an abuse of process ( Free Form Construction Co Ltd v Shinryo (Hong Kong) Ltd [2008] HKEC 643 ; X v Jemmy Chen [2020] HKCFI 286 ). 12. In order to deal with the substance of the dispute, the Court nevertheless heard the submissions of the Plaintiff on the merits of the setting aside application. After having considered these submissions, this Court must conclude that no ground has been established. The following sets out the reasons for such conclusion. Irregularity complained of 13. The only alleged irregularity pursued by Counsel at the hearing is that the arbitrator had permitted an unknown third party to assist the Defendant in the arbitral proceedings, such that the unknown third party had participated in the arbitration behind the scenes, in contravention of Article 5 of the 2013 UNCITRAL Arbitration Rules (“ Article 5 ”). It was emphasized for the Plaintiff that the Defendant had failed in the arbitration to disclose the name of his legal representative or any party assisting him or conducting the arbitration on his behalf. 14. Article 5 states: “ Each party may be represented or assisted by persons chosen by it. The names and addresses of such persons must be communicated to all parties and to the arbitral tribunal. Such communication must specify whether the appointment is being made for purposes of representation or assistance. Where a person is to act as a representative of a party, the arbitral tribunal, on its own initiative or at the request of any party, may at any time require proof of authority granted to the representative in such a form as the arbitral tribunal may determine.” 15. The Plaintiff claims that there was strong evidence showing that the Defendant had been assisted throughout the arbitration by a third party, whom the Plaintiff believed to be a Chinese lawyer, Zhang, previously employed by the Plaintiff at its Guangzhou office, and who had been assigned to handle one of the cases of the Defendant. In support of such claim and belief, the Plaintiff had referred to the fact that the Defendant was an American resident in the USA, who was not familiar with Chinese law, but communications in the arbitration had been sent to a Chinese email provider, instead of to the Defendant’s own email address, and that submissions made by the Defendant in the arbitration contained detailed and professional legal analysis on Mainland law. The Plaintiff pointed out that the Defendant had, in his Statement of Rejoinder served in the arbitration, referred to a case involving Anderson & Anderson LLP, the files on which were at the Guangzhou office of the Plaintiff, and which would not have been known to the Defendant but for the assistance and involvement of Zhang. 16. This had to be considered in the context of the dispute in the arbitration, which concerned the Plaintiff’s claim against its client, the Defendant, for legal fees payable under the Agreement, in respect of professional services rendered by the Plaintiff on the Mainland for the Defendant. The Defendant disputed the validity of the Agreement, and the capacity of the Plaintiff to sue for the fees under the Agreement, on the basis that the claimant in the arbitration was not in fact and law the party named in the Agreement. 17. The arbitrator described the identity of the claimant, and the other associated entities, at paragraphs 93 to 97 of the Award, as follows: “93． On the question of its legal identity, the Claimant says that it is an integrated organization, composed of a number of legal entities doing business as Anderson & Anderson LLP (or a close variant of that name). While billings for a particular service may be received by one entity, it is common for several entities to provide services to its clients. It also frequently engages other persons to assist in providing services to its clients. 94. Despite calling itself an ‘integrated organization’, the Claimant appears to accept that the ‘Anderson group’ is not itself a separate legal entity and cannot enter into contracts. In this case, therefore, the Claimant says that the entity which entered into the Retainer Agreement (and which is the Claimant in these proceedings) is the Anderson Guangzhou entity, a registered corporation in Guangzhou whose Chinese name is 安与恩(广州)咨询有限公司 and whose legal representative is Ng Loi Ping (in Cantonese) or Wu Lei Ping (in Mandarin). 95. The direct English translation of 安与恩(广州)咨询有限公司is Anderson & Anderson (Guangzhou) Consultation Co., Limited. This is the English name which is shown on the TianYanCha company database, and is consistent with the Claimant’s case that the Anderson group registered consultancies in Guangzhou, Shanghai and Changzhou because it was unable to register limited liability partnerships under the name ‘Anderson & Anderson LLP’. The Claimant also says that it set up an office in Chengdu and that the ‘ office of a company with foreign investment does not need to register with the company registration authority ’. It is not clear whether the Chengdu office was set up under the Anderson Guangzhou entity, or one of the other Anderson entities registered in Mainland China, but this does not matter for the purposes of these proceedings. 96. In its Statement of Reply, the Claimant refers to 安与恩(广州)咨询有限公司by the English name Anderson & Anderson Guangzhou LLP (not Anderson & Anderson (Guangzhou) Consultation Co., Limited). In support, it exhibited a copy of the Anderson Guangzhou entity’s official corporate seal registered with the PRC Public Security Bureau and bank account details. A copy of 安与恩(广州)咨询有限公司’s official corporate seal is shown below (the name in Chinese – written in simplified Chinese as used in the Mainland – matches the Chinese name shown above). 97. It is important to note, however, that this seal is not the seal that was used to execute the Retainer Agreement. The seal that was used to execute the Retainer Agreement is different, and shown below. Consistent with the name used in the Retainer Agreement, the English name on this seal is Anderson & Anderson LLP (relevantly, without the word ‘Guangzhou’). The Chinese characters (written in traditional Chinese as used in Hong Kong) translate to ‘Anderson & Anderson Offices’. This reflects the Chinese name for the Anderson group, as shown on the Anderson group letterhead used by the Claimant for correspondence in these proceedings. It seems likely therefore that this is a generic chop used to identify the Anderson group (and not a specific Anderson legal entity). At the very least, it is not the official corporate seal of the Anderson Guangzhou entity.” 18. In gist, the dispute and essential issue for determination in the arbitration was whether the claimant in the arbitration, which referred to itself as actually a registered consulting company in Guangzhou, whose Chinese name is 安與恩(廣州)咨詢有限公司 (referred to in the Award as the “Anderson Guangzhou entity”), was the same entity which signed the Agreement in the name of “Anderson & Anderson LLP”. 19. The Defendant’s case in the arbitration was that the Anderson Guangzhou entity said to be the claimant in the arbitration was a separate entity and different to Anderson & Anderson LLP, which was named and signed as a party to the Agreement, and that Anderson & Anderson LLP did not exist as a registered entity in Guangzhou on the Mainland. 20. On the evidence adduced before the tribunal, the arbitrator found that the Agreement was entered into by an entity in the name of Anderson & Anderson LLP, was executed by DB as managing partner for Anderson & Anderson LLP, and sealed with the chop of Anderson & Anderson LLP. DB was not the legal representative of the Anderson Guangzhou entity, and there was no evidence established to the satisfaction of the arbitrator that DB was authorized by the Anderson Guangzhou entity to sign the Agreement on its behalf. There was no evidence that the Anderson Guangzhou entity had ever used the name “Anderson & Anderson LLP”, as it had been referred to by totally different names (of Anderson & Anderson (Guangzhou) Consultation Co Ltd or Anderson & Anderson Guangzhou LLP). 21. Accordingly, the arbitrator found that it was not satisfied that the Anderson Guangzhou entity was the contracting party to the Agreement to be entitled to commence the arbitration, and the Plaintiff’s claims under the Agreement were dismissed. 22. There is no challenge to the arbitrator’s ruling on her lack of jurisdiction. Any claim that she had made any error of law, or in relation to her findings of fact and on the evidence, cannot be the basis of the Plaintiff’s challenge to the Award, and none has been pursued by Counsel. 23. The focus is entirely on whether there was failure on the part of the arbitrator to follow the agreed procedure for the Arbitration, and the alleged breach of Article 5. Breach of Article 5? 24. It was pointed out that the breach of Article 5, and the alleged irregularity in procedure, had an effect on the outcome of the arbitration such as to cause prejudice to the Plaintiff. If the Defendant had been compelled to disclose the fact that he had been assisted in his defence by a lawyer who had been employed by the Plaintiff, who was familiar with the operations of the Anderson Guangzhou entity, its relationship with Anderson & Anderson LLP, the identity of Anderson & Anderson LLP and its existence or otherwise on the Mainland, the Plaintiff would have objected to the lawyer’s participation in the arbitration or his assistance to the Defendant, on the basis of the lawyer’s breach of his duties of confidentiality owed to Anderson & Anderson LLP / the Anderson Guangzhou entity, and on the basis of his conflict of interests, which might have prevented the Defendant’s use of the Plaintiff’s confidential information, and would consequently have affected the outcome of the ruling made by the arbitrator, that the Anderson Guangzhou entity was different to and distinct from Anderson & Anderson LLP, and was not a party to the Agreement. 25. Notwithstanding the objections and complaints now made by the Plaintiff in these proceedings, there is no evidence whatsoever, and Counsel for the Plaintiff accepts, that the Plaintiff had never made any application to the tribunal for the Defendant’s disclosure of the identity of the third party whom the Plaintiff had believed was assisting and advising the Defendant in the arbitration. Nor is there evidence of any application by the Plaintiff to the tribunal, either to remove Zhang or any other party said to have been participating in or offering unlawful assistance to the Defendant, or to prevent the use by the Defendant of any confidential information belonging to the Plaintiff, and/or unlawfully obtained by the Defendant if that was the Plaintiff’s case. 26. There is an assertion made by the Plaintiff, that it had raised “many objections” to the irregularity, but that the arbitrator had ignored the Plaintiff’s objections and had indulged the third party to join the arbitration proceedings. However, the only evidence referred to in support is a letter dated 4 July 2019 from the Plaintiff to the HKIAC Secretariat (“ 4/7 Letter ”). In that letter, the Plaintiff made arguments against the Defendant’s claim as to the lack of legal status of the Plaintiff, stating that the internal workings of Anderson & Anderson LLP, and the relationship between the different entities, were irrelevant until the Defendant submitted his defence. The Plaintiff then stated in the 4/7 Letter: “(Plaintiff) also points out that the (Defendant’s) letters of 8 th , 9 th , 10 th and 16 th of May were obviously not written by a native English speaker, whereas (Defendant) is one. Yet (Defendant’s) position is that any communication with HKIAC not from Anderson & Anderson’s Guangzhou offices somehow constitutes illegal interference by third parties in the arbitration.” The letter also pointed out that the Plaintiff had reason to believe that the Defendant’s email address was not used directly by him, and that the email address was that of a Chinese email provider, while the Defendant is an American citizen and resident. 27. The 4/7 Letter predated the appointment of the arbitrator, and cannot be viewed as an application to the arbitrator, or the Secretariat, to order disclosure by the Defendant as to the persons representing or assisting him, or to require proof of authority of any representative of the Defendant. Nor is the 4/7 Letter a complaint as to the lack of compliance with Article 5, or as to any irregularity in the procedure of the arbitration. No application was made to the arbitrator herself, after her appointment in the arbitration. 28. The Plaintiff was only able to refer to its Statement of Sur-Rejoinder served in the arbitration and dated 26 February 2020. There, the Plaintiff stated that “It is likely, that (the Defendant) and lawyer (Zhang) entered into a new agreement where (Zhang) took over the (Defendant’s) cases in Shenzhen at a cheaper price than that owed to the (Plaintiff).” The Plaintiff also referred in the Sur-Rejoinder to Zhang being unethical, of his having wrongfully used confidential information of the Plaintiff, and of Zhang having offered to act for the Plaintiff’s clients at cheaper rates. 29. The arbitrator may have been made aware of the Defendant’s claims as to the involvement of Zhang, but in the absence of any application made to the arbitrator for disclosure to be made by the Defendant as to whether he was being assisted or represented by a third party, or for the expunging of any evidence sought to be relied upon by the Defendant, the findings made by the arbitrator on the state of the evidence and the pleadings remained findings on facts and law made on the parties’ submissions, which cannot be challenged under the guise of a setting aside application under Article 34 (2) (a) (iv). For an arbitral award to be set aside, the conduct complained of must be serious, even egregious, to be an error which has undermined due process ( Grand Pacific Holdings Ltd v Pacific China Holdings Ltd (in Liq) (No 1) [2012] 4 HKLRD 1 (CA). Where there is an alleged non-compliance with the rules applicable to the arbitration, a party should make prompt objection to the tribunal, and not keep the matter up its sleeve, particularly when the irregularity might be cured ( Hebei Import & Export Corp v Polytek Engineering Co Ltd (1999) 2 HKCFAR 111 ). 30. In this case, any claim of egregious defect in the process cannot be allowed when the arbitrator was not even given the opportunity, in an application properly made concerning the alleged defect, to consider, cure and rectify what the Plaintiff complains as being a defect and irregularity, by virtue of the breach of Article 5. Disposition 31. The Plaintiff’s application to set aside the Award on the ground that the arbitral procedure was not in accordance with the agreement of the parties is dismissed, for the above reasons. The Plaintiff has not furnished proof of the existence of any ground set out in Article 34 (2). 32. The order nisi is that the costs of the action (including any costs reserved) are to be borne and paid by the Plaintiff on indemnity basis. (Mimmie Chan) Judge of the Court of First Instance High Court Ms Clare Leung, instructed by Chin & Associates, for the plaintiff The defendant was not represented and did not appear Look up this case on Lawcite Noteup",
  "length": 21334,
  "headers_seen": [
    "Background",
    "Irregularity complained of",
    "Breach of Article 5?",
    "Disposition"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2022/463",
  "query": "Model Law",
  "ts": "2025-10-16T10:53:40",
  "ok": true
}