{
  "title": "MAEDA KENSETSU KOGYO KABUSHIKI KAISHA ALSO KNOWN AS MAEDA CORPORATION AND ANOTHER V. BAUER HONG KONG LTD | [2020] HKCA 768 | HKLII",
  "court": null,
  "year": 2020,
  "date": null,
  "content": "HKLII Databases Court of Appeal [2020] HKCA 768 MAEDA KENSETSU KOGYO KABUSHIKI KAISHA ALSO KNOWN AS MAEDA CORPORATION AND ANOTHER V. BAUER HONG KONG LTD CACV113/2019 MAEDA KENSETSU KOGYO KABUSHIKI KAISHA ALSO KNOWN AS MAEDA CORPORATION AND AND ANOTHER V. BAUER HONG KONG LTD CACV122/2019 Collapse Titles Judgment Information Date 17 Sep, 2020 Action No. CACV113/2019 CACV122/2019 Neutral Cit. [2020] HKCA 768 Download MS Word Judgment Reading Options Translation Toggle Highlight Appeal History CACV113/2019 CACV122/2019 CACV113A/2019 MAEDA KENSETSU KOGYO KABUSHIKI KAISHA also known as MAEDA CORPORATION AND ANOTHER v. BAUER HONG KONG LTD CACV 113 & 122/2019 (Heard together) [2020] HKCA 768 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF APPEAL CIVIL APPEAL NOS 113 OF 2019 AND 122 OF 2019 (ON APPEAL FROM HCCT NO 35 OF 2016) ________________________ IN THE MATTER of the Arbitration Ordinance , Cap 609 and IN THE MATTER of an Arbitration ________________________ BETWEEN MAEDA KENSETSU KOGYO KABUSHIKI KAISHA also known as MAEDA CORPORATION 1 st Plaintiff (1 st Respondent in the Arbitration) CHINA STATE CONSTRUCTION ENGINEERING (HONG KONG) LIMITED 2 nd Plaintiff (2 nd Respondent in the Arbitration) (together as “ the Plaintiffs ”) and BAUER HONG KONG LIMITED Defendant (Claimant in the Arbitration) ________________________ (Heard together) Before: Hon Kwan VP, Cheung JA and Barma JA in Court Dates of Written Submissions: 13 and 27 May, 3 and 8 June 2020 Date of Judgment: 18 September 2020 ________________________ J U D G M E N T ________________________ Hon Kwan VP (giving the Judgment of the Court): Introduction 1. On 18 March 2020, we handed down our judgment in two appeals which were heard together (“CA Judgment”). Save otherwise stated, we will adopt the same terms and expressions in this judgment. 2. The appeals were from the judgment of Anthony Chan J on 18 May 2018 (“CFI Judgment”) in respect of three questions of law arising out of Award (1) in an arbitration between the JV and Bauer, pursuant to the Arbitration Ordinance , Cap 609 , Schedule 2, section 5(1) [1] . The questions concern the proper interpretation of contractual Measurement Rules (“MRs”), M12A to M12G, for the measurement and payment of the excavation of diaphragm wall (“D-wall”) panels in the construction of the Hong Kong to Guangzhou Express Rail Link (“XRL”). The JV was the main contractor employed by the Mass Transit Railway Corporation Limited (“MTRCL”) under Contracts 823A and 823B and the JV sub-contracted the D-wall works to Bauer. How the questions are to be answered affects Bauer’s entitlement to be paid for the excavation of one type of materials, namely, “Toe in to Rock” (“TITR”). 3. In the CA Judgment, we decided in favour of the JV in respect of all three questions, which are as follows: (1) Whether (a) the “Founding levels determined by Engineer” in the legend for Diagram C1 in M12A should correctly say “Bedrock level”; and (b) “Theoretical bedrock lines” in the 2 nd paragraph of M12D should be described as “straight lines joining the successive theoretical bedrock levels” instead of “straight lines joining the successive theoretical founding levels” as stated. The judge disagreed with the arbitrator and answered this question in the negative. We upheld the judge’s determination and dismissed Bauer’s appeal against this in CACV 122/2019 [2] . (2) Whether the definition of “measureable core” in M12C should apply to M12D. The judge agreed with the arbitrator and answered this question in the negative. We held that it should be answered in the affirmative and allowed the JV’s appeal in CACV 113/2019 [3] . (3) Whether “Bedrock” in the 3 rd paragraph of M12D should include category 1(d) material. The judge disagreed with the arbitrator and answered this in the negative. We upheld the judge’s determination and dismissed Bauer’s appeal against this in CACV 122/2019 [4] . 4. We do not propose to summarise the reasons for decision in the CA Judgment. The notice of motion 5. Bauer issued an identical notice of motion in each appeal on 29 April 2020 seeking leave to appeal to the Court of Final Appeal contending that questions of great general or public importance are involved in the intended appeal as set out in paragraphs 1(1) to (5) of the notice of motion. Bauer also invokes the “or otherwise” limb on the grounds set out in paragraphs 2(1) to (4) of the notice of motion. 6. In gist, the questions said to be of great general or public importance in paragraph 1 may be stated as follows: (1) what is the proper construction of M12A to M12G; (2) whether the proper construction of M12A to M12G is a mixed question of fact and law; (3) what is the proper approach to the construction of M12A to M12G where the construction involved much factual and technical evidence and the MRs were poorly drafted, and whose meaning had been determined by an experienced and well qualified arbitrator; (4) whether the CA Judgment in respect of “Ground 2” contradicts standard engineering and construction practice in Hong Kong [5] and the objectives of M12A to M12G [6] , and whether the Court of Appeal was entitled to make its decision where the arbitrator had made technical findings of fact in dismissing the JV’s construction of M12A to M12G; and (5) what is the proper approach to the construction of a commercial contract in having regard to business common sense and commercial consequences. Question in 1(1) 7. Bauer submitted that the judgment of DHCJ Lee on 7 April 2017 established that the questions in respect of which leave was granted to appeal to the Court of First Instance involve questions of great general or public importance. This is incorrect. The threshold for granting leave to appeal under section 6(4)(c)(ii) in Schedule 2 of the Arbitration Ordinance is that “the question is one of general importance and the decision of the arbitral tribunal is at least open to serious doubt”. For leave to appeal to the Court of Final Appeal, the question involved must be of great general or public importance. 8. Bauer also made the point that the questions of law concerned “the interpretation of a standard contract provision” and that the MRs are “standard provisions which have been used generally on The MTR Express Rail Link and other project contracts, most of which have yet to close their final accounts. The decision on the interpretation of these rules is therefore a matter of general importance.”, quoting from the originating summons issued by the JV for leave to appeal to the Court of First Instance [7] . These assertions are relevant to the contention that the questions raised for determination in the High Court are of “general importance”, and do not establish further that they are of great general or public importance. As pointed out by the JV, the evidence on the leave application before DHCJ Lee showed that the MRs, with some changes for some contracts, were adopted as standard for the XRL civil works contracts and for two West Island line contracts, but there were material differences in the wording on Diagram C1 between Contract 823B and four other XRL civil works contracts and the West Island line contracts were let on a mixture of lump sum and target cost bases, neither of which in general would be subject to re-measurement using the MRs. 9. We are not persuaded that issues of construction regarding the MRs for Contract 823B would give rise to questions of great general or public importance as contended in 1(1). Questions in 1(2) and (3) 10. The questions raised in paragraph 1(2) and (3) may be considered together. The propositions advanced by Bauer in respect of these questions may be stated as follows: (1) The questions of law that were referred to the Court of First Instance for determination should be regarded as mixed questions of fact and law, because the surrounding circumstances must be taken into consideration as the factual matrix in construing the MRs. (2) In light of (1), the standard of review by the court of a decision in a commercial arbitration context is almost always reasonableness, not correctness, unless the question is one that would attract the correctness standard [8] . Contractual interpretation is generally a question of fact that can be appealed only if shown to be outside of the range of rational solutions [9] . And if there is a mixed question of law and fact, an error in approach is not decisive if the arbitrator’s decision was within the permissible range of solutions open to him [10] . (3) Further in light of (1), a court should be particularly careful not to substitute its decision for that of the arbitrator chosen by the parties and should defer to the arbitrator’s expertise [11] . 11. Bauer submitted that the position in Hong Kong is unclear and clarification from the Court of Final Appeal is needed as to (1) whether the construction of a contract should be approached as a question of law or a mixed question of law and fact; (2) whether the approach as described concerning the standard of review should constitute the policy in Hong Kong; and (3) the extent to which the court should defer to the arbitrator’s expertise. 12. It does not appear to us that clarification is required from the Court of Final Appeal on the matters raised. 13. Leave to appeal to the Court of First Instance was granted pursuant to Schedule 2, section 5 (1) of the Arbitration Ordinance on “question(s) of law” arising out of Award (1). The leave decision of DHCJ Lee was affirmed by the Court of Appeal in HCMP 1342/2017. In seeking to overturn the leave decision, Bauer did not appear to have contended that the questions of contractual interpretation raised by the JV are not questions of law. 14. Before the Court of Appeal, Bauer made submissions regarding the proper approach of the court when faced with a mixed question of fact and law. They were addressed in the CA Judgment at §§31 to 34. We have these additional observations regarding the further submissions and new authorities of Bauer not cited earlier. 15. Questions of contractual construction are always treated as questions of law in English cases [12] and the position is the same in Hong Kong [13] . As to factual matrix deployed in the construction of the contract and the degree of deference to be accorded to the arbitrator’s decision, useful guidance had been given in a number of cases, such as the following: “For my part, like the learned Judge, I am most reluctant to reverse or differ from a trade tribunal. Nevertheless, the issue is one of construction and thus of law. The arbitrator’s finding of fact is part of the contractual matrix and a very important part, but it is no more than that. There is no suggestion that the process of shipment under an f.o.b contract for sugar or indeed contracts for the sale of sugar generally are in any relevant respect different from contracts for the sale of some other soft commodity. All that is said is that those engaged in the sugar trade find strict punctuality difficult, which may well be true of other trades not to mention other individuals, and that in practice they adopt a more relaxed attitude. This seems to me to be quite insufficient to displace the construction which would usually be placed upon a term involving inter-dependent obligations in relation to the time for loading, reinforced, as it is in the present case, by the use of the imperative words, “at latest”.” ( Gill & Duffus SA v Societe Pour L’exportation Des Sucres SA [1986] 1 Lloyd’s Rep 322 at 325, per Sir John Donaldson, MR) “I should be very slow to differ from a trade tribunal on the meaning reasonably to be given to telex exchanges of the sort in issue here. Ultimately, of course, the construction of any written instrument is a question of law on which the Court is entitled and bound to rule, but the significance of a meaning attributed by the reasonable non-lawyer varies widely from instrument to instrument and according to the circumstances of the case. Here, one is dealing with communications by trader to trader, in the context of an unexpected and fast moving situation. A trade tribunal brings to the task of interpretation certain insights denied (to a greater or lesser extent) to the Court: an informed appreciation of the commercial situation as it unfolded, seen through the eyes of a trader; an understanding of the hopes and fears and pressures which moved traders at the time; an awareness of the extent to which, at the time, the future course of events appeared obscure and unpredictable; a knowledge of the language which one trader habitually uses to another. So, in a case such as this the court’s task is not one of pure construction and I should be reluctant to differ from the board unless it appeared that the board’s construction was fairly and plainly untenable.” ( Andre et Cie v Cook Industries Inc [1986] 2 Lloyd’s Rep 200 at 204, per Bingham J) “1. The court should read an arbitral award as a whole in a fair and reasonable way. The court should not engage in minute textual analysis. 2. Where the arbitrator's experience assists him in determining a question of law, such as the interpretation of contractual documents or correspondence passing between members of his own trade or industry, the court will accord some deference to the arbitrator's decision on that question. The court will only reverse that decision if it is satisfied that the arbitrator, despite the benefit of his relevant experience, has come to the wrong answer.” ( Kershaw Mechanical Services Ltd v Kendrick Construction Ltd [2006] EWHC 727 (TCC) at §57, per Jackson J) 16. We do not regard the citation of authorities in Canada and the US helpful in this regard as those cases were decided on the basis of different legislation and practice. The standards of review in the Canadian and US cases are not relevant in Hong Kong. The JV made a valid point it remains unexplained why it is said there is much needed guidance in Hong Kong on the limited grounds in issue dealt with on appeal in the High Court. Question in 1(4) 17. Bauer contended that the CA Judgment in respect of “Ground 2” equates the definition of rock in M12C with bedrock for determining founding levels. This is not so. The decision in respect of “Ground 2” (whether the definition of “measureable core” in M12C should apply to M12D) did not deal with the determination of actual founding levels. It deals with the construction of the provisions relating to the measurement of TITR for payment purpose. 18. Bauer submitted that the decision in respect of “Ground 2” contravenes those parts of the publications cited on standard engineering and construction practice in Hong Kong relating to the determination of the actual founding level. The engineering criteria requiring drillholes to extend at least 5 m into Grade III or better rock with a total core recovery of not less than 85% were raised by Bauer and discussed in the CFI Judgment at §§69 to 71 and in the CA Judgment at §§64 to 70. As mentioned, the decision is not concerned with the determination of actual founding levels. Further, it is not apparent how the decision relating to the measurement of TITR for payment purpose could contravene standard engineering and construction practice. 19. As for the objectives stated in CESMM3, they have been taken into consideration in the construction exercise [14] . The extracts in the GBR were not addressed in the CA Judgment [15] , we do not think they would add anything of significance to the discussion [16] . Bauer prayed in aid the comments of Lord Bridge in Mitsui Construction Co Ltd v The Attorney General of Hong Kong (1986) 33 BLR 7 at 14 to 15 on reducing the large element of wagering inherent in the contract, but those comments were made in relation to re-rating provisions in a contract and not with reference to GBRs. 20. In the question formulated in paragraph 1(4)(b), Bauer quoted the statement of the arbitrator in paragraph 263 of the Second Interim Award (Corrected), which was published 19 months after Award (1) and is not in relation to payment entitlement under the MRs. It does not appear to us that this statement is of significance to the construction issues arising in Award (1). 21. We do not think Bauer has identified specifically what are the technical findings of fact made by the arbitrator on the extensive factual and technical evidence which are said to be relevant to the construction of the limited grounds in issue relating to the MRs. Question in 1(5) 22. The CFI Judgment dealt with the submissions relating to this question at §§25 to 26 and the CA Judgment at §§30 and 34. Both judgments rejected the JV’s submission there has to be two possible constructions before the court can resort to business common sense to reject one of the constructions as being unreasonable. Both are of the view there is no hard and fast rule there must be two possible constructions. In any event, there are two possible constructions of those parts of the MRs that are in issue. 23. Bauer submitted that despite the UK Supreme Court had answered the question in 1(5)(a) “emphatically in the affirmative” [17] in that it is not necessary to have at least two available competing or rival constructions before a court is to have regard to business common sense and commercial consequences, there are no Hong Kong authorities which provide a definitive answer to the question in 1(5)(a) and there is no Hong Kong authority which supports the proposition in the CFI Judgment and the CA Judgment as stated in the question in 1(5)(b) that the court can and should take a holistic view of the relevant circumstances and the document to be construed and be guided by the authorities and sound common sense. Hence, a clarificatory decision from the Court of Final Appeal is warranted and required on these questions. 24. We do not think the decisions in Hong Kong are confusing or that a decision from the Court of Final Appeal is required in these circumstances. 25. For the reasons as stated above, we decline to exercise our discretion to grant leave to appeal on any of the questions raised in paragraph 1 of the notice of motion. The “or otherwise” limb 26. The grounds for invoking the “or otherwise” limb as set out in paragraph 2 of the notice of motion are: (1) the intended appeal involves questions of great general or public importance; (2) it was found in the CA Judgment [18] that “Grounds 1, 2 and 3” were related and that the decision on these grounds were likely to have significant bearing on the payment to Bauer under the sub-contract [19] ; (3) the Court of Final Appeal should determine the extent to which the courts should be prepared to intervene in arbitrator’s decisions involving factual and technical matters in light of the importance of Hong Kong as a top seat of arbitration and the pro-arbitration approach of the courts; (4) whether, in construing a commercial contract and applying Schedule 2 section 5 (3) of the Arbitration Ordinance [20] , it is appropriate for the court to have regard to (a) facts contended for by one of the parties as if they were findings of fact by the arbitrator and/or (b) facts and submissions contrary to those contended for and advanced before the arbitrator. 27. The discretion to grant leave to appeal on the “or otherwise” limb is a residual discretion and as such is not to be exercised lightly [21] . It is well established that leave should be granted on this basis only in exceptional circumstances [22] . There is also the usual practice of the Court of Appeal of not granting leave on this basis save in exceptional circumstances and leaving it to the Appeal Committee of the Court of Final Appeal to decide whether the intended appeal is appropriate to be heard by them [23] . We do not think there is anything exceptional in this instance to justify a departure from the practice. 28. We only wish to make these observations regarding the question raised in paragraph 2(4). 29. We do not accept that the statements in §66 of the CA Judgment about the RQD [24] are “diametrically opposed” to the arbitrator’s finding in Award (1) §§507 and 508. As rightly pointed out by the JV, what was said in §66 is a matter of common sense from the definition of RQD in GeoGuide 3 and the undisputed fact that RQD was a requirement in the MRs in respect of a number of items of excavation in rock. 30. As for §51 of the CA Judgment which is to the effect that the construction contended for by Bauer on the question in “Ground 2” (whether the definition of “measureable core” in M12C should apply to M12D) “would make the whole scheme unworkable”, this is mischaracterised by Bauer as a finding of fact by this court. It is merely part of the thinking process and analysis in the construction exercise. 31. Bauer pointed to “additional factual contentions” set out in Attachments A and C of the JV’s submissions before A Chan J in March 2018, which have been adopted in the CA Judgment and reproduced at §5 and Annex II and complained that they were not before the arbitrator and were not the subject of findings of fact in Award (1). This complaint has no substance. The matters covered are background information to explain technical matters to the court. No objection was taken to the materials relied on before A Chan J or before us. As recorded in the CFI Judgment [25] , “apart from matters of emphasis, there is no disagreement over the material.” 32. It was submitted by Bauer that the skeleton arguments of the parties on appeal raised an issue as to whether the JV’s construction required material of RQD ≥ 30 to be evident at the bottom of the drill hole, that this issue was determined in the JV’s favour in the CA Judgment at §68 and was contrary to the evidence of JV’s quantum expert in the arbitration. This is not correct. The issue as stated was not raised in the parties’ skeleton, nor was it determined in the JV’s favour by this court. 33. Lastly, Bauer contended there is a finding in the CA Judgment that category 1(c) rock would not comprise bedrock and this is contrary to the parties’ common understanding and position before the arbitrator. The CA Judgment did not make such a finding. Conclusion and orders 34. We decline to give leave to appeal to the Court of Final Appeal. The notice of motion is dismissed. 35. Costs of the application should follow the event. We order Bauer to pay the JV’s costs of this application. Having considered the statement of costs for summary assessment of the JV, we assess the costs awarded to the JV at $531,102.20. (Susan Kwan) (Peter Cheung) (Aarif Barma) Vice President Justice of Appeal Justice of Appeal Mr Peter Clayton SC, instructed by Pinsent Masons, for the 1 st and 2 nd Plaintiffs (Appellants in CACV 113/2019; Respondents in CACV 122/2019) Mr Ian Pennicott SC and Mr James Niehorster, instructed by Bryan Cave Leighton Paisner LLP, for the Defendant (Respondent in CACV 113/2019; Appellant in CACV 122/2019) [1] Leave to appeal to the Court of First Instance against Award (1) was granted in the judgment of Deputy High Court Judge Lee on 7 April 2017. DHCJ Lee refused to grant leave to appeal to Bauer against his leave decision. Bauer’s renewed application for leave to appeal was refused by the Court of Appeal (Lam VP and M Chan J) in HCMP 1342/2017 on 24 August 2017 on the basis that section 6(4)(c)(ii) in Schedule 2 is satisfied (the question is one of general importance and the decision of the arbitral tribunal is at least open to serious doubt), see reasons for judgment on 4 September 2017 at §§18 to 20. [2] CA Judgment, under “Ground 1”, §§35 to 46 [3] CA Judgment, under “Ground 2”, §§47 to 71 [4] CA Judgment, under “Ground 3”, §§72 to 80 [5] Being GEO Publication No 1/2006 “Foundation Design and Construction”, para 2.4.1; Code of Practice for Foundations 2004, Table 2.1; GeoGuide 3, Table 4; and M & W (Material & Workmanship) Specification of MTRCL, section 19.45 and sections 24.2(15) and (16) [6] The objectives include those stated in CESMM3 (Civil Engineering Standard Method of Measurement (3 rd ed)), paras 2.4 and 2.5; Contract 823B Particular Specification P3.2.2; and Contract 823B GBR (Geotechnical Baseline Reports) of MTRCL, sections 7.2 and 7.4 [7] Originating summons issued on 21 July 2016, Grounds of Application and Appeal, §§1 and 5.1. See also judgment of DHCJ Lee on 7 April 2017, §35. [8] Citing decisions of the Supreme Court of Canada in Sattva Capital Corp v Creston Moly Corp (2014) SCC 53 at §§75, 106; Teal Cedar Products Ltd v British Columbia [2017] SCJ 32 at §§1, 3, 4, 74 to 79. [9] Citing the decision of the Appellate Court of Connecticut in Metropolitan District Commission v American Federation of State, County and Municipal Employees Council (1994) 647 A2d 755 at [5, 6]. [10] The Mathew [1990] 2 Lloyd’s Rep 323 at 326 cols 1 & 2; The Wenjiang (No 2) [1983] 1 Lloyd’s Rep 400 at 408 col 1 [11] Reliance Industries Ltd v Enron Oil and Gas India Ltd & Anr [2002] 1 All ER (Comm) 59 at §§40, 41 (based on differently worded legislation in section 69(3)(d) of the Arbitration Act 1996); Kershaw Mechanical Services Ltd v Kendrick Construction Ltd [2006] EWHC 727 (TCC) at §57(2) [12] The Nema [1982] AC 724 at 736F; Bunge Corp v Tradax Export SA [1980] 1 Lloyd’s Rep 294 at 303 col 2; The Troll Park [1988] 1 Lloyd’s Rep 55 at 57 col 1; see the summary given in Davidson: Arbitration (2 nd ed) §19.34 [13] Swire Properties Ltd & Ors v Secretary for Justice (2003) 6 HKCFAR 236 at §29 [14] CA Judgment, §§15, 36(1) [15] Section 7.4 of the GBR, although quoted in the Notice of Appeal of Bauer in CACV 122/2019 at §7(iv), was not mentioned in its written submissions in the two appeals. The relevant discussion in the CA Judgment at §§67 and 70 did not refer to the GBR. [16] GBRs are made available to tenderers and set baselines from which, if ground conditions are different than envisaged in the GBRs, a separate claim may be made. We are given to understand by the JV that Bauer made separate claims in the arbitration relying on GBR due to ground conditions. These separate claims have nothing to do with the claim for payment in respect of TITR or the MRs. [17] Citing In re Sigma Finance Corporation [2009] UKSC 2 at §12; Rainy Sky SA v Kookmin Bank [2011] UKSC 50 at §§21 and 23; Arnold v Britton [2015] UKSC 36 at §§76 and 77; Wood v Capita Insurance Services Ltd [2017] UKSC 24 at §§12 and 13. Bauer also cited Canadian and Australian authorities which would support the JV’s contrary submission that had been rejected in the CFI and CA Judgments. [18] §§26 and 28 [19] The parties’ quantum experts agree that the difference between the arbitrator’s decision and the CA Judgment is in the region of $78 million excluding interest. Bauer has emphasised that the decision on “Ground 2” accounts for the lion’s share of the monetary difference in the amount of $49 million odd. [20] This provides: “The Court must decide the question of law which is the subject of the appeal on the basis of the findings of fact in the award.” [21] The Joint and Several Provisional Liquidators of China Medical Technologies, Inc v Samson Tsang Tak Yung (2020) 23 HKCFAR 145 at §11 [22] Chao Keh Lung v Don Xia (2004) 7 HKCFAR 260 at 263; Ho Sin Ying v Chan Yui Ling & Anr, CACV 221/2013, 14 November 2014, at §11 [23] Telings International Hong Kong Ltd v John Ho & Ors, CACV 10/2010,2 March 2011, at §11; MGA Entertainment Inc. v Toys & Trends (Hong Kong) Ltd & Ors , CACV 104/2011, 22 October 2012, at §13; Lau Cho Kun v Lau Siang Kok Lionel , CACV 212/2012, 16 October 2013, at §17; XY, LLC v Jesse Zhu & Ors , CACV 11/2016, 29 March 2017 at §27; Asian Well Technologies Ltd v Lee Yee Man & Ors [2020] HKCA 521 at §3 [24] §§66 [25] §15 and footnote 2 Look up this case on Lawcite Noteup",
  "length": 27865,
  "headers_seen": [
    "Introduction",
    "The notice of motion",
    "Question in 1(1)",
    "Questions in 1(2) and (3)",
    "Question in 1(4)",
    "Question in 1(5)",
    "The “or otherwise” limb",
    "Conclusion and orders"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkca/2020/768",
  "query": "seat of arbitration",
  "ts": "2025-10-16T10:49:53",
  "ok": true
}