{
  "title": "WONG CHUN KWONG AND ANOTHER V. WONG HON TOO AND OTHERS | [1995] HKCFI 33 | HKLII",
  "court": null,
  "year": 1995,
  "date": null,
  "content": "HKLII Databases Court of First Instance [1995] HKCFI 33 WONG CHUN KWONG AND ANOTHER V. WONG HON TOO AND OTHERS Judgment Information Date 12 Mar, 1995 Action No. HCA7353/1993 Neutral Cit. [1995] HKCFI 33 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCA7353/1993 HCA007353/1993 WONG CHUN KWONG and Another v. WONG HON TOO and Others HCA007353/1993 1993, No.A7353 IN THE SUPREME COURT OF HONG KONG HIGH COURT ____________ BETWEEN WONG CHUN KWONG CHAN SUET NGAI 1st Plaintiff 2nd Plaintiff AND WONG HON TOO WONG CHUN MO LAI YU WAI CHENG CHUN NGOK 1st Defendant 2nd Defendant 3rd Defendant 4th Defendant ____________ Coram: Master Cannon in Court Date of hearing: 22nd February 1995 Date of Assessment of Damages: 13 March 1995 ___________________________ ASSESSMENT OF DAMAGES ______________________ 1. This assessment of damages arises out of a judgment dated 8th September l993, against the third defendant, ordering vacant possession of the premises, and further ordering that the defendants pay the plaintiffs:- (i) arrears of rent and rates in the sum of $76,63l.l8.00; (ii) mesne profits at the rate of $53,000.00 per month from lst August l993 until vacant possession is delivered up; (iii) damages to be assessed; and, (iv) costs. 2. Notice of appointment of assessment of damages was filed on 7th July, l994, with the date for assessment fixed for 29th September, l994. 3. By hearsay notice dated l7th September, l994, the plaintiff listed eight documents, including a valuation report of Francis Lau & Co. (Surveyors) Ltd.. No counter notice was filed by the third defendant. 4. Wong chung wong for the plaintiff gave evidence at the assessment of damages. The premises were delivered to the plaintiffs on l6th June, l994. After vacant possession had been given, the plaintiff arranged for the valuation report to be carried out in respect of the open market rental value of the property. 5. The third defendant Lai yu wai appeared in person at the assessment of damages on 29th September and cross examined the plaintiff. 6. At the resumed hearing on l3th December, l994, the third defendant was represented. At that hearing, the plaintiff made the following concessions: (i) the plaintiff abandoned the claim for a cleaning fee of $2,000.00; (ii) the plaintiff agreed to accept reinstatement costs of $25,000, instead of $49,000.00; (iii) the plaintiff accepted that the date of delivery of vacant possession was l0th June, l994, instead of l6th June, l994. At the resumed hearing on 22nd February, l995, counsel addressed the court. 7. With the concessions made by the plaintiff, the only issue between the parties was the construction of paragraph 2(b) of the judgment which reads \"mesne profits at the rate of $53,000.00 per month from the lst of August l993 until vacant possession of the said premises is delivered up.\" The third defendant submitted that the terms of the judgment precluded the plaintiff from seeking damages for mesne profits on the basis of the open market rental value of $l06,000.00 per month from l/8/93 to 3l/l/94, and the open market rental value of $lll,000.00 per month from l/2/94 to l0/6/94, as set out in the valuation report. 8. Counsel for the plaintiff referred to Hill and Redman's Law of Landlord and Tenant at page A lll4, note 6, states:- \"Where the rent represents the fair value of the premises mesne profits are assessed at the amount thereof; where the real value exceeds the rent then mesne profits are assessed at the higher figure ( Clifton Securities Ltd. v. Huntley (l 948) 2 All ER 283 ).\" 9. A reading of this case shows that in November l946, the plaintiffs brought an action claiming possession and mesne profits. The action was heard on 13th January, 1947, and Henn Collins J. gave judgment for possession forthwith and for mesne profits at the rate of GBP l50 a year up to date. A stay of execution pending appeal on the validity of the notice to quit was granted and the tenants did not give up possession. In May l947 the Court of Appeal affirmed the decision of the court below, and the plaintiffs brought an action for mesne profits. Denning J. in his judgment said:- \"The claim in this action is for mesne profits from l3 January, l947 - which was the date up to which Henn Collins J. had given mesne profits - until the date when the defendants quitted in July, l947. At what rate are the mesne profits to be assessed? When the rent represents the fair value of the premises, mesne profits are assessed at the amount of the rent, but, if the real value is higher than the rent, then the mesne profits must be assessed at the higher value.\" 10. Counsel also referred to Malcolm Merry's Hong Kong Tenancy Law (2nd Ed.) at page l56 where it is noted that:- \"However, a trespasser does not enjoy the land free of charge, he has no right to be there and must pay damages or mesne profits.\" \"These damages are assessed by reference to the value of the land, for that is the value which the landlord loses during the period of illegal occupation. Mesne profits are therefore usually the equivalent of the market rent of the premises. When the damages are assessed, the landlord, or the occupier, can call evidence from a valuer as to the market rent so as to help the court in its assessment.\" 11. While these excerpts, and the case referred to, provide some helpful guidelines for the assessment of damages in tenancy cases, they are not on the point taken by the third defendant that the form of the judgment is final and precludes an assessment of damages. 12. I accept the third defendant's submission on this issue. I am satisfied that the form of the judgment is final with the specific reference to the sum of $53,000.00 per month. This issue cannot now be re-visited as an assessment of damages. The form of judgment precludes any claim for damages based on the open market rental value from lst August, l993, until delivery up of vacant possession. 13. Counsel for the third defendant submitted that if I were to find against him on the form of the judgment, then damages should be assessed on the monthly rental provided for in the renewal clause. The renewal clause provides for a right of renewal for a further term of two years from the expiration of the term at a new monthly rental of $63,600.00 (exclusive of rates), on the giving notice in writing not more than six months or less than three months before the expiration of the term. Since I have accepted that this is a final judgment, it is not necessary for me to come to any conclusion on this second point. However, for the sake of completeness, if I were required to reach a conclusion on this point, I would take the view that the defendants had not exercised the right of renewal and were in fact illegally occupying the property, and on an assessment of damages the open market rental value would be the appropriate basis for such an assessment and not the monthly rental in the renewal clause. 14. In consequence of my findings, I am satisfied that the plaintiff is entitled to an award of damages in the following sums - 1. arrears of rates for the the period l/l0/93 to l0/6/94, and management fees for the period l/l/94 to l0/6/94 $ 34,748.70 2. reinstatement costs $ 25,000.00 Total: $59,748.70 Accordingly, I make an award of damages in the sum of $59,748.70. 15. The sums due under the final judgment, minus the deposit held by the plaintiff, will need to be added to this award of damages in the sum of $59,748.70, as follows:- 3. arrears of rent and rates $ 76,63l.l8 4. mesne profits at the rate of $53,000 per month from l/8/93 until l0/6/94, being the date vacant possession was delivered up $547,667.00 5. less deposit ($l06,000.00) Total: $578,046.88 16. Provided my arithmetic is accurate, the sum of $578,046.88 is owed by the defendant to the plaintiff under the judgment dated 8th September, l993. 17. Costs of the action have been provided for in the judgment, and I make a costs order nisi, to be made absolute in 2l days, under the provisions of Order 42 r.5B, providing that costs of the assessment be to the plaintiff. 18. ........................... L. Cannon (Master) Representation: Mr. C.K. Wong instructed by Messrs. Charles Yeung Clement Lam & Co. for the Plaintiffs Mr. W.K. Lo instructed by Messrs. Lam, Lee & Lai for the Defendants Look up this case on Lawcite Noteup",
  "length": 8377,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/1995/33",
  "query": "mesne profits",
  "ts": "2025-10-16T12:11:16",
  "ok": true
}