{
  "title": "LJ V. LWHH | [2003] HKCA 247 | HKLII",
  "court": null,
  "year": 2003,
  "date": null,
  "content": "HKLII Databases Court of Appeal [2003] HKCA 247 LJ V. LWHH Judgment Information Date 30 Jul, 2003 Action No. CACV129/2003 Neutral Cit. [2003] HKCA 247 Parallel Cit. [2003] 3 HKC 455 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History CACV129/2003 CACV000129/2003 LJ v. LWHH CACV000129/2003 CACV 129/2003 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF APPEAL CIVIL APPEAL NO. 129 OF 2003 (ON APPEAL FROM FCMC NO 2995/2003) ------------------------------ BETWEEN: LJ Petitioner AND LWHH Respondent Coram: Hon Yeung and Yuen JJA in Court Date of hearing: 24 July 2003 Date of Judgment: 31 July 2003 ---------------- JUDGMENT ---------------- Hon Yuen JA (giving the judgment of the Court): 1. This is an appeal by the Petitioner (who will be referred to as \"the wife\") from the order of Deputy Judge Woodcock in the District Court made on 28 April 2003 whereby she ordered that the Respondent (who will be referred to as \"the husband\") pay the wife maintenance pending suit in the sum of $4,500 a month for the period from 17 March 2003 to 1 May 2003, and in the sum of $3,000 a month thereafter pending further order. The deputy judge also made no order as to costs in the application and costs reserved. Issues 2. The issues raised in the appeal were whether the deputy judge fell into error of principle in (a) taking into account, at the maintenance pending suit stage, the wife's earning capacity, and (b) assessing the wife's needs in effect on the basis of what she would reasonably need to live in Shanghai, rather than what she would reasonably need to live in Hong Kong. Background 3. The background of the matter is briefly, as follows. The parties were married on the Mainland in May 1997. The husband, a Hong Kong and U.S. permanent resident, is now 38 years old and is a manager of an American software company. The wife, a native of Shanghai and previously a PRC citizen, is now 27 years old and last worked as a saleslady on the Mainland 6-7 years ago. There are no children. 4. The parties met in Zhongshan in 1996 and lived together for 6 months before getting married. The wife stopped working at this time. 5. After the marriage, the parties lived in Shenzhen for about 6 months. The husband's employment required him to travel frequently. About 6 months after the marriage, the wife returned to Shanghai where she lived with her parents in a 700 sq ft apartment bought with funds the husband gave her mother. 6. The wife applied to live in Hong Kong permanently and the husband assisted her with the application. During the period from March 1998 to September 2001, the wife came to Hong Kong 4 times to visit the husband on 2-way permits. The husband was living (as he is now) with his mother and a domestic helper in a 1,000 sq ft flat in Jaffee Road. The husband also visited the wife twice in Shanghai. They kept in contact via e-mail and the telephone. 7. The husband maintained the wife, although there is a dispute now between the parties as to how much she was given. Be that as it may, she says she maintained an \"above average\" standard of living in Shanghai with what the husband gave her and she never resumed working. 8. The wife has alleged that during her visit to Hong Kong in September 2001, she began suspecting that the husband had a girlfriend. This has been denied by the husband but relations between them became strained during the visit. 9. In any event, in April 2002, the husband applied for a divorce in the Shanghai court on the ground that the marriage had broken down. This was contested by the wife who claimed that the relationship between the parties had not broken down and that she hoped to save the marriage. The Shanghai court dismissed the husband's application for divorce. The husband appealed, but the appeal was dismissed in September 2002. 10. Starting from May 2002, the husband had stopped giving the wife maintenance, he says on the advice of his lawyers in Shanghai. 11. The wife eventually obtained a 1-way permit to live in Hong Kong and came to Hong Kong in November 2002. Prior to this, she had not notified the husband as she did not want him to jeopardize her arrival, as he had notified the emigration authorities on the Mainland of the divorce proceedings. 12. After completing the formalities required in Hong Kong, she met with the husband in December 2002, when her attempts at reconciliation and obtaining maintenance failed. The husband left Hong Kong and his mother asked the wife to move out of the Jaffee Road premises. 13. The wife has since stayed with friends in Quarry Bay. She filed a petition for divorce and made the present application for maintenance pending suit in March 2003. 14. She says she intends to settle in Hong Kong but cannot continue to stay with her friends for long, as they have a young child and need more room. She intends to rent a 500 sq ft 2-bedroom flat in Quarry Bay and has sought a sum of $35,000 for furnishings, appliances and rental and utility deposits, and monthly maintenance at $19,000. She says she has exhausted all her money and that she has had to borrow money from family and friends. 15. The husband makes between $56,000 and $60,000 a month, depending on whether his income was paid every 14 days or every half-month. According to his affirmation, he has expenses of up to $53,200 every month. The deputy judge's judgment 16. In ordering the husband to pay $3,000 a month to the wife as maintenance pending suit, the deputy judge took into consideration the wife's age (27), that she was educated enough to find employment (she finished secondary school on the Mainland), has had employment and has earning capacity. 17. The deputy judge also considered as \"very relevant\" the fact that the husband had filed for divorce in Shanghai in April 2002, yet the wife still chose to come to Hong Kong in November 2002. The deputy judge took the view that the wife's decision to come to Hong Kong and the expense incurred in living here should not be a consideration in maintenance pending suit, because she had accommodation available to her in Shanghai and the cost of living here is higher than in Shanghai. 18. As noted above, the issues discussed on appeal were whether the deputy judge erred in principle in (a) taking into account, at this stage, the wife's earning capacity, and (b) assessing maintenance pending suit without taking into consideration her reasonable needs for living in Hong Kong. Earning capacity 19. Counsel for the wife submitted that the earning capacity of the parties should not be taken into account at all when considering maintenance pending suit, which by its nature requires the court to take a broad brush approach without making detailed investigations into the circumstances of the parties. Those detailed investigations would be made at the application for ancillary relief. 20. Counsel referred to the Court of Appeal's decision in V v V (unrep) Civil Appeal No.200 of 1980. In that case, the Court of Appeal considered the question \"what, if any, part at the stage of maintenance pending suit does the earning capacity of the parties play?\" In answering that question, the Court of Appeal held that at this stage, the court was not to apply the provisions of s.7 Matrimonial Proceedings and Property Ordinance . Section 7(1) refers specifically to s.4 and s.6 only. By necessary implication, s.3 (the provision for maintenance pending suit) was excluded. 21. V v V has been followed in some first instance decisions in the High Court ( Miller v Miller [1985] 1 HKC 595 ), as it is of course binding authority. 22. Counsel for the husband has however relied on F v F (1983) 4 FLR 382 where Balcombe J, after considering similar statutory provisions in the Matrimonial Causes Act, held that on an application for maintenance pending suit, the court should take into account the income and earning capacity of the parties. That was conceded by counsel for the wife in that case, but the judge went further and held that he could see no possible reason why other matters which happened to be listed in s.25 MCA (s.7 MPPO) should not also be considered in an application for maintenance pending suit. 23. In our judgment, there is no rule that the parties' earning capacity can never be considered in an application for maintenance pending suit. That was not the decision in V v V . Even though the Court of Appeal held that s.7 did not apply in its entirety to an application for maintenance pending suit, it went on to say: \"it is , of course clear that, if a respondent voids himself of all income investing everything in capital assets for the purpose of showing no income and thereby defeating a claim such as this, no court would allow such a respondent to sit back and say in effect 'no income therefore there can be no award of maintenance pending suit'.\" 24. In other words, a judge hearing an application for maintenance pending suit would not, by nature of the application, consider the parties' long-term prospects, but he does not shut his eyes to obvious short-term prospects either. To take an example, if either the applicant (or the respondent) to an application for maintenance pending suit were to give up a job, so that she (or he) has no income, so as to increase her need for maintenance pending suit (or to defeat such an application), a judge would be clearly entitled to take her (or his) earning capacity into account. 25. However, in our view, what a judge should not do, at this stage, is to consider earning capacity in circumstances which are less obvious. In the present case, the wife has not worked for the past 6-7 years, since she started living with the husband. She is a new immigrant and speaks no English. Her former employment was as a saleslady on the Mainland and she has no skills. With the present state of unemployment in Hong Kong, it is by no means clear that she can easily find suitable employment. 26. Accordingly, whilst we do not agree with the submission by counsel for the wife that the court should never take the parties' earning capacity into account in an application for maintenance pending suit, we have to say that in this case, the deputy judge fell into error in taking it into account when there was no evidence that a suitable job was available for the wife and she had refused it. Different considerations would of course apply at an application for ancillary relief. Reasonable needs in Hong Kong 27. The deputy judge also made her view quite clear that her order of $3,000 a month was on the basis that the wife had accommodation available in Shanghai and that the cost of living there was lower than that in Hong Kong. In other words, the deputy judge was assessing the wife's needs on the basis of what she would reasonably need to live in Shanghai, rather than what she would reasonably need to live in Hong Kong. 28. In our view, the court should not, at the maintenance pending suit stage, have attempted to resolve the controversy whether the wife should have come to settle in Hong Kong after the husband had applied (unsuccessfully) to divorce her in Shanghai, or whether she should have returned to Shanghai after her attempt to reconcile with him here failed. Those are issues which will require detailed consideration of all the circumstances, involving cross-examination of the parties, at a later stage of the divorce proceedings. 29. It has been conceded that the wife is lawfully in Hong Kong and that she has locus standi to bring the present application. Her stated intention to stay here (at least for the time being) has not been disputed. The court should therefore consider her reasonable needs in Hong Kong, not her reasonable needs in Shanghai. In this respect, we have to say the deputy judge fell into error of principle. It is therefore necessary for this court to consider the wife's reasonable needs afresh. 30. On appeal, counsel for the husband submitted that the wife could live in Hong Kong on $3,000 a month as that was what persons on public assistance received. There was no evidence of this, but quite apart from that, it would be unjustified to require the wife to relegate her living standards to a much lower level than that which she had been enjoying during her marriage, albeit in Shanghai. 31. At an application for maintenance pending suit, the court has to balance the reasonable needs of the applicant against the respondent's ability to pay for them. In the present case, the applicant's request for $35,000 to set up home in a 500 sq ft 2-bedroom flat in the better developments in Quarry Bay and $19,000 a month seems to us to be a little extravagant. 32. There is no reason for her to live in Quarry Bay save to be close to her friends. Since she does not work, there is no reason why she should not stay in a flat in one of the better developments in the New Territories, from which she could travel into town to see her friends or her lawyers occasionally. Whilst it is true that when she visited her husband in the past, they stayed in a 1,000 sq ft flat in Jaffee Road, it has to be noted that that was a flat which they had to share with his mother. 33. Further, we do not see a pressing need to purchase appliances such as a washing machine or a DVD machine. At this stage, there is no reason, for example, why she could not send out her washing, or rent a television set. Claims of $3,000 a month for clothing and shoes, cosmetics and hair, and $2,000 a month for entertainment, presents and holidays also seem to be over-generous. 34. At the other end, we also find it a little over-generous for the husband to claim that he has expenses of $53,200 a month. For example, he claims to spend $5,000 a month for clothing, haircut and shoes, and $4,000 a month for his mobile phone charges, figures which appear a little unrealistic, the cost of living having gone down in Hong Kong. 35. Adopting a broad brush approach at this stage, balancing the wife's reasonable needs against the husband's ability to pay for them, we consider the appropriate order for maintenance pending suit to be $10,000 a month. It would be for the wife to use it as she considers best, whether to rent furnished accommodation, or to rent vacant premises and then to rent furniture and appliances herself. We do not consider it appropriate at this stage to order a separate sum for her to purchase items to set up a home. Order 36. Accordingly, we would allow the appeal, set aside the deputy judge's orders and order that the Respondent forthwith pay the Petitioner maintenance pending suit in the sum of $10,000 a month from 17 March 2003 to the date of this judgment, and from 1 August 2003 at $10,000 a month on the 1st day of each month until further order. The payments are to be made directly into the Petitioner's bank account. 37. As for costs, in light of the unreasonably low figure offered by the husband only 2 days before the hearing before the deputy judge, we order that the husband pay the wife's costs below with certificate for counsel, to be taxed if not agreed. As for the costs of the appeal, we would make an order nisi to the same effect. (WALLY YEUNG) (MARIA YUEN) Justice of Appeal Justice of Appeal Representation: Miss Candy E Fong instructed by Wong & Poon for the Petitioner Miss Vivian Chih instructed by CY Chan & Co for the Respondent Look up this case on Lawcite Noteup",
  "length": 15419,
  "headers_seen": [
    "Issues",
    "Background",
    "The deputy judge's judgment",
    "Earning capacity",
    "Reasonable needs in Hong Kong",
    "Order"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkca/2003/247",
  "query": "maintenance pending suit",
  "ts": "2025-10-16T12:10:50",
  "ok": true
}