{
  "title": "HKSAR V. WONG WING KIN | [2023] HKCFI 940 | HKLII",
  "court": null,
  "year": 2023,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2023] HKCFI 940 HKSAR V. WONG WING KIN Judgment Information Date 22 Mar, 2023 Action No. HCCC286/2020 Neutral Cit. [2023] HKCFI 940 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCCC286/2020 HCCC286/2020 HKSAR v. WONG WING KIN HCCC 286/2020 HCCC 287/2020 [2023] HKCFI 940 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CRIMINAL CASE NO 286 AND 287 OF 2022 ________________________ HKSAR v Wong Wing-kin (HCCC 286/2020) Li Tsz-kin (HCCC 287/2020) ________________________ Before: DHCJ Eric Kwok, SC Date: 23 March 2023 at 2.56 pm Present: Mr Andrew Raffell, on fiat, for HKSAR Ms Vivian W M Wong, instructed by Anthony Kwan & Co, for the accused in HCCC 286/2020 Mr Kwan Tong-lee, instructed by Cheung, Yeung & Lee, Solicitors, assigned by DLA, for the accused in HCCC 287/2020 Offence: Trafficking in a dangerous drug (販運危險藥物) (HCCC 286 and 287/2020) ________________________ Transcript of the Audio Recording of the Sentence in the above Case ________________________ COURT: This is the sentence in HCCC 286 and 287/2020. The defendant in HCCC 287/2020, Mr Li Tsz-kin, pleaded guilty to a count of trafficking in dangerous drugs at the committal stage, and was committed to the Court of First Instance for sentence. The defendant in HCCC 286/2020, Mr Wong Wing-kin, was found guilty by jury after a contested trial. The count faced by both defendants is the same, namely, between 25 April 2019 to 26 April 2019 in Hong Kong, unlawfully trafficked in 60.85 kilogrammes of a solid containing 51.17 kilogrammes of cocaine. The facts put shortly are as follows: The defendants conveyed, among other things, the drugs from a flat in Ma On Shan to another flat in Tsuen Wan in the early hours of the morning on 25 April 2019. On the next day in the evening, they went to Tsuen Wan again. Mr Li went up to the flat and retrieved the bag of drugs while Mr Wong was on board a van parked in the car park of the building. Mr Li was stopped by police when he came out of the flat with, among other things, the bag of drugs he retrieved from the flat. Mr Li was arrested and taken back into the flat wherein, among other things, 38 bags of drugs were found. At the same time, Mr Wong was arrested in the car park. All 39 bags of drugs were sent for examination and certified to be solid weighing 60.85 kilogrammes containing 51.17 kilogrammes of cocaine. The estimated street value is over HK$66 million. Background of the Defendants Mr Li was born in October 1984. He is now 38 years old. He has attained up to Form 3 education and was working as a driver for delivering goods. I am told he earned around $16,000 to $17,000 a month. He is single. He had a previous conviction for simple possession of dangerous drugs in 2009 and was fined $2,000. He ran into trouble again in 2014 and was convicted of various offences associated with driving vehicles. Mr Wong similarly is 38 years old. He had attained up to Form 5 education. He is also in the transport work. He had one previous conviction for drunk driving and was put on a community service order. He is married with two children. Both are studying. And I am instructed he made about $20,000 a month. In Herry Jane Yusuph [2021] 1 HKLRD 290 , the Court of Appeal made a point that personal circumstances were of far less importance than denunciation, deterrence and punishment in cases of trafficking in dangerous drugs. And for these reasons, consistence was very important. Earlier, in the case of Abdallah [2009] 2 HKLRD 437 , the Court of Appeal has said: “...given the grievousness of the offence, meaningful mitigation, apart from a plea of guilty, was rarely available.” In Yusuph , the Court of Appeal also made a point that a defendant’s true role was often obscured and not all couriers and storekeepers might be as culpable as each other even though trafficking in the same quantity. The Court of Appeal in Yusuph has suggested a six-step approach to sentencing for offences of trafficking in dangerous drugs. The first step is to identify relevant guidelines. In Abdallah , the Court of Appeal reviewed the guideline laid down in Lau Tak Ming [1990] 2 HKLR 370 . In Lau Tak Ming , a guideline was set at a maximum amount up to 600 grammes of heroin. The Court of Appeal in Abdallah laid down guidelines for quantities above 600 grammes. For quantities between 600 to 1.2 kilogrammes, 20 to 23 years. 1.2 kilogrammes to 4 kilogrammes, 23 to 26 years. 4 kilogrammes to 15 kilogrammes, 26 to 30 years. And for quantities over 15 kilogrammes, it will be at the sentencer’s discretion, bearing in mind the maximum sentence is one of life imprisonment. The Court of Appeal in Sin Chung Kin [2013] 1 HKLRD 627 said: “Although it is not possible to enhance the starting point proportionally, a reasonable and logical approach must be that the larger the quantity of the drugs is, the more severe the sentence will be.” The next step was an assessment of the defendant’s role and culpability based upon the evidence. First of all, I am of the view that both defendants are in the first category, namely, courier or storekeeper. As I said earlier, the Court of Appeal had already said not all couriers and storekeepers might be as culpable as each other. Although there are evidence suggesting that Mr Wong took a leading role, I would not, on the evidence before me, differentiate their roles and I am of the view that they are equally culpable. Guided by these steps and in the circumstances of this case, I adopt a starting point of 34 years’ imprisonment. There is no mitigating factors in Wong’s case. As to Mr Li, not only did he plead guilty at the earliest opportunity, but also assisted the authorities by giving evidence against his accomplice. I will give him a 50 percent discount. The last step suggested in Yusuph was to observe the sentence passed to ensure that it was fair, just and balanced in all the circumstances of the offence and the offender. Having done that, I am satisfied that no more adjustment from the starting point is needed. Mr Li, please stand up. I sentence you to a term of imprisonment for 17 years. Mr Wong, please stand up. I sentence you to a term of imprisonment of 34 years. Look up this case on Lawcite Noteup",
  "length": 6321,
  "headers_seen": [
    "Background of the Defendants"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2023/940",
  "query": "drunk driving",
  "ts": "2025-10-17T10:42:17",
  "ok": true
}