{
  "title": "NICO CONSTANTIJN ANTONIUS SAMARA V. STIVE JEAN PAUL DAN ALSO KNOWN AS STEVE JEAN PAUL DAN, STIVE JEAN PAUL DAN AND STEVE JEAN PAUL DAN | [2018] HKCFI 1022 | HKLII",
  "court": null,
  "year": 2018,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2018] HKCFI 1022 NICO CONSTANTIJN ANTONIUS SAMARA V. STIVE JEAN PAUL DAN ALSO KNOWN AS STEVE JEAN PAUL DAN, STIVE JEAN PAUL DAN AND STEVE JEAN PAUL DAN Judgment Information Date 14 May, 2018 Action No. HCA902/2018 Neutral Cit. [2018] HKCFI 1022 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCA902/2018 HCA902/2018 NICO CONSTANTIJN ANTONIUS SAMARA v. STIVE JEAN PAUL DAN also known as STEVE JEAN PAUL DAN, STIVE JEAN PAUL DAN and STEVE JEAN PAUL DAN HCA 902/2018 [2018] HKCFI 1022 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE ACTION NO 902 OF 2018 _________ BETWEEN NICO CONSTANTIJN ANTONIUS SAMARA Plaintiff and STIVE JEAN-PAUL DAN also known as STEVE JEAN-PAUL DAN, STIVE JEAN PAUL DAN and STEVE JEAN PAUL DAN Defendant _________ Before: Madam Recorder Yvonne Cheng SC in Chambers Date of Hearing: 27 April 2018 Date of Decision: 27 April 2018 Date of Reasons for Decision: 15 May 2018 ___________________________ REASONS FOR DECISION ___________________________ THE APPLICATIONS 1. There were before me the following summonses dated 24 April 2018: (1) an application to continue the order granted by D’Almada Remedios J on 20 April 2018 on an ex parte basis, for (1) a Mareva injunction, preventing the Defendant from removing assets from Hong Kong up to the value of US$2,597,639 (“ the Injunction Order ”) and (2) leave to serve the writ and other documents in these proceedings out of the jurisdiction (“ the Continuation Summons ”), and (2) an application for an order to inspect and take copies of certain records kept by Citibank (Hong Kong) Limited, and for an order that the Defendant or Gatecoin Limited disclose and provide copies of certain information and documents to the Plaintiff (“ the Discovery Summons ”). 2. At the hearing, the Defendant was represented by Ms Janine Cheung of counsel. I was informed that the Defendant had only been served in the afternoon of the day before with the papers used at the ex parte hearing (with the exception of a draft of the order applied for) and the Injunction Order, and that Ms Cheung had just been instructed in the evening. She was instructed to apply for an immediate discharge of the Injunction onthe grounds of material non-disclosure. Mr Adonis Cheung, counsel for the Plaintiff, objected to the application proceeding today on the grounds that the application could only be made to the judge who had heard the ex parte application, relying on note 29/1/72 in Hong Kong Civil Procedure 2018 . Ms Cheung referred to note 29/1/34 for the submission that an application to discharge could be dealt with in the course of a hearing for continuation of an ex parte interim injunction, and if it appeared that the interim order had been obtained irregularly by suppression of facts, the court could discharge the ex parte order without cross-notice of the motion for that purpose. 3. The authority cited in note 29/1/72 is not authority for the proposition that an application for setting aside a Mareva injunction can only be made to the judge who granted the ex parte order. I therefore acceded to Ms Cheung’s application to hear the Defendant’s application for discharge as well. BACKGROUND 4. The Plaintiff made an affirmation dated 20 April 2018 (“the Plaintiff’s 1 st Affirmation”) in support of his ex parte application. He is a citizen of the Kingdom of Netherlands living in Curaçao. He says that he had 1,000 bitcoins (“ the Bitcoins ”) and came to Hong Kong during part of June 2017 so that the Defendant could help sell the Bitcoins for him, for a 3% commission. 5. As the Plaintiff (being a non-resident) could not open a Hong Kong bank account to handle the sale proceeds, he agreed that they should be deposited into the Defendant’s account in Hong Kong with Citibank, from whence the funds would be transferred to the Plaintiff’s bank account in Germany. The Defendant gave the Plaintiff access to the Citibank account by providing him with the login details and security token. The Plaintiff could then make transfers of funds to his account in Germany. 6. The Plaintiff says that between June and September 2017 some of the Bitcoins were traded. A main way in which this was done was through the Defendant’s nominated bitcoin wallet at Gatecoin. The Plaintiff transferred some bitcoins from his personal bitcoin wallets into the Defendant’s bitcoin wallet at Gatecoin so that they could be traded by the Defendant. The agreed arrangement was that the proceeds of sale would be transferred to the Citibank account. 7. The Plaintiff says that the total amount payable by the Defendant to him for the trading of the Bitcoins was US$3,118,139. Between 3 July 2017 and 6th September 2017, the Plaintiff transferred US$520,500 from the Defendant’s Citibank account to his bank account in Germany. 8. The Plaintiff says that from around 14 September 2017, he noticed that the money in the Citibank account had been placed on time deposits and could not be transferred. From around the beginning of November 2017, the Plaintiff has been unable to gain online access to the account at all. The Plaintiff says that the Defendant therefore owes him US$2,597,639. 9. The Plaintiff says that he has not been able to locate or communicate with the Defendant since 27 or 28 October 2017. 10. In February 2018, the Plaintiff contacted Gatecoin to notify it of his concerns regarding the Defendant and to ask that Gatecoin block the Defendant from accessing his Gatecoin account. On 23 February 2018, the Plaintiff was informed by Aurelien Menant, the CEO of Gatecoin, that 40 bitcoins remained in the Defendant’s Gatecoin wallet. Mr Menant agreed to block the Defendant from withdrawing the bitcoins from the wallet, but said that he would need a legal basis to block the account for any extended period of time. 11. On 23 April 2018 (after the Injunction Order was obtained) the Plaintiff issued a writ seeking damages for various causes of action, including fraud, conversion, unjust enrichment, and constructive trust. THE DEFENDANT’S POSITION 12. The Defendant applied to discharge the Injunction Order on thebasis that the application had been “wholly unmeritorious” and an “egregious abuse of process”, as both the Defendant’s Citibank account and Gatecoin account have both been locked since February 2018, there was therefore noneed for protection against dissipation, no urgency or secrecy which justifiedthe application for ex parte relief, and material non-disclosure of the position regarding the Citibank account. 13. Ms Cheung pointed out that on the Plaintiff’s own case, the Plaintiff was suspicious about the Defendant as early as September 2017 and was unable to access the Citibank account by 1 November 2017, which if true should already have been great cause for alarm. But no action was taken until April 2018 to apply for the Injunction Order and issue a writ. 14. Ms Cheung referred to a number of emails which had been exhibited to the Plaintiff’s 1 st Affirmation used at the ex parte hearing (although no attention had been drawn in the text of the affirmation or the skeleton at the ex parte hearing to the contents of the emails): (1) In his email of 22 February 2018 (at 6:23 pm) to Mr Menant of Gatecoin, the Plaintiff indicated that he would be going to Hong Kong (“hopefully next week”) to file a report with the Hong Kong police. He asked for a contact for the police cybercrime unit. In the same email, he said that he had made a report to Citibank, “and his account is blocked now”. (2) In a further email of the same day (at 11:31 pm) to Mr Menant, he said: “ I think steve knows by now i contacted authorities and his bank. By the way, citibank reacted very professionally as well and started an investigation immediately and I think they blocked his bank account already.” (3) Mr Menant replied on the same day (at 11:33 pm), saying: “ He has 40 btc on gatecoin. We can lock his account if you want.” (4) In another email of the same date (at 22:54) Mr Menant said: “ Do not worry, we wont tell anything to stive. Yet we should close his account, so please move forward quickly.” He also said: “ You can report it to the cybercrime unit online, but in our experience, it goes no where. What you have to do is to go to the police station and file a report, that will be later escalated to the cybercrime unit (like a few weeks later …).” He then gave an email address for a contact at the police cybercrime unit. (5) On 7 March 2018 at 14:35, Mr Menant sent an email to the Plaintiff, asking for an update on his claim, and saying: “ Stive is trying to withdraw his funds, adn we wont be able to block them for ever.” (6) On 9 March at 5:22 pm, the Plaintiff sent an email to Mr Menant, saying that he had filed a report (presumably with the Hong Kong police). The email was apparently sent from Hong Kong, as the Plaintiff said “I am still in Hong kong for about a week.” (7) On 14 March 2018 at 1:08 pm, the Plaintiff sent an email to Mr Menant: “ Update: i hired the law firm you advised me to. It’s a complex case which need some time. How much time are you willing to give me regarding the 40btc on Steves account? ‌… Ben and gary told me that either we have to file an injunction to Steve or the police has to order gatecoin to block the Bitcoin of steve …” (8) On 11 April at 11:42 pm, Mr Menant told the Plaintiff that he was: “ adding will in the loop as he is the one dealing with stive, as well as brad and mick, respectively our COO and CFO. i think we can keep holding them for the next 2 weeks, but please try to put pressure to have it done next week, that would make things easier for us.” (9) On the same day at 8:59 pm, Mr Menant wrote to the Plaintiff: “ how is it going? Stive keeps asking his btc, so I am going to have to release them at some point, unless I m told by a legitimate authority to freeze them.” (10) On 12 April at 9:07 am, the Plaintiff wrote to Mr Menant, saying: “ the 18th I have an appointment with the police again. ‌… My lawyers are working on a Mareva injunction. But the goal is that by next week the police will give the order to freeze all steve’s assets. I ask you for another two weeks, and probably the end of next week I think the police will order to freeze the assets, depending on how fast they act.” 15. Ms Cheung also submitted that the Plaintiff’s 1 st Affirmation consisted largely of assertions unsupported by any documentary evidence, and assertions based on hearsay from the Defendant’s assistant Mr Astudillo. As an example, the affirmation sought to paint a picture of the Defendant having disappeared since October 2017, in support of his case that he had been a victim of fraud and that there was a risk that the Defendant would dissipate his assets. In paragraph 88, he said that since 27 or 28 October 2017, he had been unable to locate or communicate with the Defendant. AsMs Cheung points out, no documentary evidence of unsuccessful attempts tocommunicate with the Defendant or ask for the alleged outstanding amounts(for example via email) has been produced. In fact the Plaintiff’s exchangeof emails with Gatecoin show that the Plaintiff was well aware that Gatecoin was in touch with the Defendant, but it does not appear that the Plaintiff sought to get in touch with the Defendant via Gatecoin. No justification for proceeding ex parte 16. The email correspondence between the Plaintiff and Mr Menantshows that there was no urgency which justified the making of an application on an ex parte basis after court hours on Friday 20 April 2018 and when not even a writ had been issued yet. The Plaintiff had already persuaded both Citibank and Gatecoin to block the Defendant’s accounts since some time in February 2018. 17. In particular in relation to Citibank, there was no suggestion that Citibank was about to release funds to the Defendant. Yet the Plaintiff’s skeleton in support of the ex parte injunction had stated that the Injunction Order was needed as the Defendant might move the funds in the Citibank account if the Court did not grant an injunction. 18. Insofar as the Plaintiff was seeking an order in response to Gatecoin’s request that the Plaintiff do so, there is no reason why the Plaintiff could not have taken out a summons to seek an injunction in the usual way. Furthermore, any “urgency” was entirely self-induced, since Gatecoin had been voluntarily freezing the Defendant’s account since about 22 February 2018, so that if the Plaintiff had wanted to seek a legal underpinning for this action he could have done so much earlier than 20 April 2018. Indeed, even in his email of 22 February 2018, Mr Menant had already asked the Plaintiff to “move forward quickly”, and in his email of 7 March 2018, Mr Menant had warned the Plaintiff that the Defendant wanted to withdraw his funds and they could not be blocked “for ever”. 19. Mr Cheung said that the reason why the application for the Injunction was not made earlier was because the Plaintiff only met the police for the first time on 18 April 2018. The police said that they needed time to investigate the matter. It was only at that point that the Plaintiff took the view that he should “seriously” apply to the court for an injunction. However, the Plaintiff had apparently come to Hong Kong in March and engaged solicitors by mid-March, and he had already been advised in February by Mr Menant that a police investigation would take time. It is difficult to see why the police interview of 18 April 2018 suddenly created the urgent need for injunctive relief. 20. As regards secrecy, Mr Cheung said that as the Defendant was a fraudster, the application had to be made in secret. The Defendant might also have other assets other than the Citibank and Gatecoin accounts. Ms Cheung submitted that there was no need for secrecy when the Defendant’s accounts with Citibank and Gatecoin had already been blocked, and when the Plaintiff was in effect only targeting these two accounts. 21. I note that the Plaintiff had as early as 22 February 2018 expressed the belief that the Defendant by that time already knew that the Plaintiff had contacted the authorities and his bank. Had the Defendant wished to take steps to frustrate legal action by the Plaintiff, he would have had plenty of opportunity to do so prior to the ex parte application made almost two months later on 20 April 2018. 22. Ms Cheung submitted that the Plaintiff’s ex parte application was an abuse of process and should be discharged on that basis alone. 23. In SCC Venture VI Holdco G, Ltd v Zhao Chang Peng , unreported, HCMP 2770/2017, [2018] HKCFI 819 , 24 April 2018, Deputy High Court Judge R Ismail SC said: “ 50. There was no dispute between the parties in respect of the applicable principles as to the use of the ex parte procedure. Natural justice requires all parties to be heard save in the most exceptional circumstances, where extreme secrecy or urgency so requires. See Slik Hong Kong Co Ltd v Gerald Rhoslyn HCA 1424/2005 (unreported, 25 July 2005, Johnson Lam J (as he then was)). 51. In Slik , Johnson Lam J helpfully referred to a number of relevant authorities including the following: (a) ‘ … ex parte orders are only made ‘where the situation is of such extreme urgency that there is literally no time to warn the defendant of what is proposed or where the purpose of the injunction will or may be frustrated if the defendant is informed of what is proposed or where the defendants simply cannot be found’ …’ per Ma J (as he then was) in Brand, Farrar Buxbaum v Samuel-‌Rozenbaum Diamond HCA 5191/1998 (unreported, 8 May 2002), citing the unreported English Court of Appeal decision in TRP Limited v Thorley , 13 July 1993. (b) ‘ Even if there is genuine urgency, the proper course is for the claimant to take out an inter partes application, if necessary with time abridged, or if that was somehow not possible, to make an ex parte application on notice to the plaintiff.’ per Ma J in Brand, Farrar Buxbaum . (c) ‘ For an ex parte application for an injunction to be [justified] on the grounds of urgency it must be so urgent [that] you cannot give even five minutes warning to the other side. Here, solicitors were instructed for the Defendants …. The Plaintiffs’ solicitors well knew it. … There was no justification for not even making a telephone call or sending a fax ….” per Rogers J (as he then was) in Seapower Resources International Ltd v Lau Pak Shing HCA 10715/1993 (unreported, 15 December 1993). … 58.I have had regard to Yifung Developments Ltd v Liu Chi Keung Ricky [2014] 4 HKLRD 483 at 491 where an order improperly obtained ex parte was set aside on that ground alone,following the guidance in Luck Continent Ltd v Leonora Yung CACV 42/2010 (unreported, 22 October 2010).Mr Wong did not seek to argue that it would be inappropriate to set aside the order if the ex parte procedure used was inappropriate as claimed.” 24. I agree with Ms Cheung that there was no urgency which couldhave justified the seeking of the Injunction on an urgent ex parte basis. The Gatecoin and Citibank accounts were already frozen. At most, it could be said that Gatecoin was urging the Plaintiff to obtain an order, but not to the extent of requiring an ex parte urgent application, and in any event, such “urgency” arose from the Plaintiff’s own lack of action since February 2018. 25. As regards secrecy, on the facts of the present case the Plaintiff himself believed that the Defendant had already been aware for some time that the Plaintiff had notified the authorities and his bank, and that his Gatecoin (and presumably Citibank) account had been frozen. The usual reason for proceeding in secret—to avoid forewarning a suspected fraudster who might dissipate his assets—was not made out. 26. I therefore accept Ms Cheung’s submission that the Injunction Order should be discharged on the basis that it should not have been obtained on an urgent ex parte basis. Material non-disclosure 27. Ms Cheung further submitted that there had been material non- disclosure of the fact that the Citibank and Gatecoin accounts had in fact been frozen since February 2018 and that there was therefore no purpose to the Mareva at all. 28. The Plaintiff did in fact refer to the fact of the Gatecoin account having been frozen in the Plaintiff’s 1 st Affirmation. There was however no reference to the fact of the Citibank account having been frozen. 29. Ms Cheung referred to note 29/1/51 in Hong Kong Civil Procedure 2018 for the submission that in considering whether to discharge an ex parte injunction for non-disclosure, regard should be had not only to the merits of the substantive case but to the conduct of the party who has abused the process of the court. She submitted that the Plaintiff knew only of the Gatecoin and Citibank accounts, so that it was material to have told the court that in fact, both of them had been frozen. The Plaintiff however did not draw attention to the status of the Citibank account having been frozen from at least around 22 February 2018 and instead, said in the Plaintiff’s 1 st Affirmation (at paragraph 98) that he was unable to monitor activity in the account, that Mr Astudillo had informed him in February 2018 that a significant sum of money was held in the account, and that it was his (the Plaintiff’s) belief that the Defendant had transferred out US$200,000 from the account on 2 February 2018 to pay for a property in Columbia. The Plaintiff’s skeleton at the ex parte hearing further made the submission that the Injunction Order was needed as the Defendant might otherwise move the funds in the Citibank account. 30. Ms Cheung submitted that the Injunction Order was a nuclear weapon, having been used to freeze US$2,597,639 in each bank account which the Defendant might have in Hong Kong. 31. Mr Cheung accepted that the freezing of the Citibank account had not been disclosed at the ex parte application, but submitted that it was not a case of intentional concealment of facts. He explained that whilst the Plaintiff knew of the Citibank account, he needed to seek injunctive relief beyond that account, as he did not know how much was in the Citibank account. 32. In my view, it would have been material for the Court to know that the Citibank account had been frozen. (Indeed even at the hearing, there was no suggestion that Citibank would release any funds to the Defendant if no order were granted.) It is an unusual feature of this case that the main accounts which the Plaintiff was seeking to target with the Injunction Order —which were also the very accounts into which the Plaintiff says that some of his Bitcoins and the proceeds of sale of his other Bitcoins were deposited —had in fact already been frozen independently of any court order. 33. Given that there was apparently a substantial level of funds in the Citibank account, and given that this (and the Gatecoin account) were the primary assets which the Plaintiff was targeting, it seems unlikely that in the absence of further information, the Court would have made a general freezing order for the full amount of the amount claimed by the Plaintiff over each and every asset of the Defendant, and an order mandating the Defendant to disclose all of his assets of a value over $50,000 or more in Hong Kong. 34. I would discharge the Injunction on this basis also. THE PLAINTIFF’S APPLICATION FOR REGRANT OF THE INJUNCTION 35. Upon questioning from the Court, initially, Mr Cheung said that he would have to take instructions as to whether to apply for a regrant of the Injunction. Subsequently he indicated that he would, after all, apply for a regrant. 36. The Deffendant objected to the regrant on the basis that there was no evidence of the Plaintiff’s ability to make good his undertaking for damages, and no offer of fortification. The Plaintiff had no assets in Hong Kong and was living in Curaçao. He had made very serious allegations against the Defendant, unsupported by documentary evidence, not only in these proceedings but to a third party, Gatecoin, which allegations were vigorously denied by the Defendant. 37. In the Plaintiff’s 1 st Affirmation, the Plaintiff said that he was financially sound to meet his undertaking as to damages. He had not however adduced any evidence of his financial ability. When asked about this, Mr Cheung said that he had brought to court a bank statement of the Plaintiff, but the Plaintiff was unwilling to disclose information about himself to the Defendant. Mr Cheung was willing to show the statement to the Court, but not to Ms Cheung save on the basis that the information not be passed on to the Defendant. Ms Cheung objected to disclosure on this basis and declined to see it. 38. In Sun Yan v Superb Jade Ltd , unreported, HCA 813/2014, 23 October 2015, To J said at [11]: “ The legal principles applicable to fortification are well settled. The court has a general power to order fortification where it appears just and proper to protect the defendant by making such an order. Usually, merit of the parties’ case is not a necessary consideration. However, if the plaintiff has a strong case, it maynot appear just and proper to make the protection available to the defendant. The burden of showing the need for fortification and the appropriate quantum falls on the defendant seeking fortification. He must show the likelihood of a significant loss arising as a result of the injunction, and demonstrate why he believes the plaintiff will be unable to make good that loss. The court will approach these issues by taking a broad view of the evidence, usually without the need of a detailed enquiry. Whilst there is no obligation on the plaintiff to give full and frankdisclosure of his own financial means, circumstances might arisewhere the absence of financial disclosure by a plaintiff might entitle adverse inference as to his ability to meet his cross-undertaking in damages to be drawn .” ( Emphasis added .) 39. Whilst the court, when faced with an application made ex parte, put on the basis that injunctive relief is urgently needed, may be satisfied with seeing a bank statement from the applicant on an informal basis, it is unsatisfactory that on this inter partes application, the Plaintiff is unwilling to give any information to the Defendant about his financial means, such that the Defendant cannot meaningfully address the issue, or to put forward some other means of demonstrating that his undertaking is one of substance. 40. In the circumstances, I am not satisfied that the undertaking from the Plaintiff, who lives in Curaçao, has no assets in Hong Kong, and has no connection to Hong Kong save for the fact that he came to Hong Kong to sell his bitcoins, is a meaningful one. 41. The principles governing the court’s discretion as to whether to re-grant an interlocutory injunction where it is discharged for material non-disclosure are summarised in note 29/1/51 of Hong Kong Civil Procedure 2018 : “ Where there has been non-disclosure of material facts at the ex parte application for a Mareva injunction, but full disclosure is made at the hearing inter partes , the court has a discretion to continue the ex parte injunction or to discharge it and immediately re-grant substantially the same injunction, Cheung Kam Wah v. Cheung Hon Wah [2005] 1 H.K.C. 136. The court’s jurisdictionto re-grant an injunction despite the applicant’s breach of his duty to make full and frank disclosure should be exercised sparingly. The court should assess the degree and extent of the culpability with regard to non-disclosure and the importance and significanceto the outcome of the application for an injunction of the matters which were not disclosed to the court. The failure to draw the court’s attention to the principles governing the ex parte application and the lack of exceptional circumstances for the applicant not to give any notice to the other party amounts to serious non-disclosure and may warrant discharge of the relevant injunction. … Factors the court will have regard to include: (i) whether the non-disclosure was innocent or deliberate …; (ii) the excuse or reason for such material non-disclosure; (iii) if, had the full disclosure been made at the ex parte application, theinjunction could properly have been granted …; and (iv) whether the party guilty of the non-disclosure is deserving of a locus poenitentiae …. However, if there is non-disclosure by an applicant for a Mareva injunction which is the result of a suppression of material facts, the practice of the courts is to discharge the order without further going into the merits ….” 42. In the present case, there were no exceptional reasons justifying the way in which the Injunction—a draconian form of relief—was sought and obtained. The Plaintiff represented to D’Almada Remedios J that the matter was so urgent that it justified an application out of court hours and even before the issue of proceedings, when in fact the Plaintiff had frozen the Gatecoin and Citibank accounts since February, the Plaintiff’s belief was that the Defendant had been aware since February that the Plaintiff had already reported him to the authorities and the bank, and the Plaintiff had engaged lawyers since mid-March and were preparing an application by at least 12 April 2018. Even if there was not any intention to mislead the court, the approach to the application demonstrated scant regard for the requirements for an ex parte application. 43. Given these matters and the Plaintiff’s failure to offer a meaningful undertaking, I declined to regrant the Injunction Order. THE DISCOVERY SUMMONS 44. The Defendant has asked for time to file evidence in relation to this summons, which was not opposed by the Plaintiff. I gave directions for the further conduct of the summons. COSTS 45. I ordered that the costs of today be to the Defendant on an indemnity basis, to be taxed if not agreed. (Yvonne Cheng SC) Recorder of the High Court Mr Adonis Cheung, instructed by Hom & Associates, for the Plaintiff Miss Janine Cheung, instructed by Boase Cohen & Collins, for the Defendant Look up this case on Lawcite Noteup",
  "length": 28250,
  "headers_seen": [
    "THE APPLICATIONS",
    "BACKGROUND",
    "THE DEFENDANT’S POSITION",
    "No justification for proceeding ex parte",
    "Material non-disclosure",
    "THE PLAINTIFF’S APPLICATION FOR REGRANT OF THE INJUNCTION",
    "THE DISCOVERY SUMMONS",
    "COSTS"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2018/1022",
  "query": "cybercrime",
  "ts": "2025-10-17T10:44:29",
  "ok": true
}