{
  "title": "SUN HUNG KAI CREDIT LTD V. WONG PO LING | [2020] HKCFI 2422 | HKLII",
  "court": null,
  "year": 2020,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2020] HKCFI 2422 SUN HUNG KAI CREDIT LTD V. WONG PO LING Judgment Information Date 21 Sep, 2020 Action No. HCA2282/2018 Neutral Cit. [2020] HKCFI 2422 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCA2282/2018 HCA2282A/2018 SUN HUNG KAI CREDIT LTD v. WONG PO LING HCA 2282/2018 [2020] HKCFI 2422 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE ACTION NO 2282 OF 2018 ______________ BETWEEN SUN HUNG KAI CREDIT LIMITED Plaintiff and WONG PO LING Defendant ______________ Before: Deputy High Court Judge To in Chambers Date of Decision: 11 August 2020 Date of Reasons for Decision: 22 September 2020 _______________________ REASONS FOR DECISION _______________________ Introduction 1. This is the Defendant’s appeal against the order of Master Hui dated 10 July 2019, dismissing her summons for stay of execution of the possession order, pursuant to Order 58 rule 1 of the Rules of the High Court . 2. The Plaintiff is a licensed money lender. The Defendant is the Plaintiff’s customer and borrower and the registered owner of a property in St Louis Mansion, in No. 20 Macdonnel Road (the “Property”). She executed a second mortgage over the Property in favour of the Plaintiff (the “Second Mortgage”) and a loan agreement (the “Loan Agreement”) for a personal loan of $1.5 million (the “Loan”). 3. The Defendant defaulted in making instalment payments. On 28 September 2018, the Plaintiff commenced mortgage action against her seeking possession of the Property and repayment of the Loan under the Second Mortgage and the Loan Agreement, pursuant to Order 83A and Order 88 of the Rules of the High Court . A defence was filed by the Defendant but was struck out pursuant to the Order of Master Lui dated 12 June 2019. On 3 September 2019, the Plaintiff took out an inter partes summons seeking default judgment against her. 4. At the adjourned hearing of the inter partes summons on 24 October 2019 before Master Yip, the only ground in opposition advanced by the Defendant was her father’s wrongfully enforcing a judgment against her in relation to some other properties. After the Master had explained to her that her ground in opposition was without merits, the Defendant asked for time to deliver vacant possession of the Property. She was granted 42 days instead of the usual 28 days upon service of the order. 5. On 5 November 2019, the Defendant filed a notice of appeal against the order of Master Yip seeking, inter alia , that “the vacant possession order be set aside/suspended or stayed executed”. Her appeal was dismissed by K Yeung J on 23 January 2020. 6. Pursuant to the possession order made by Master Yip, the Plaintiff issued a Writ of Possession and Fieri Combined on 5 June 2020. A notice to quit was also posted up at the Property with the assistance of the bailiff on 26 June 2020. 7. On 3 July 2000, the Defendant took out a summons seeking “the vacant possession of the Property be stayed for three months in preparation for settlement and cost saving”. That summons was dismissed by Master Hui on 10 July 2019. The Defendant now seeks to appeal the aforesaid order of Master Hui. Legal principles applicable to mortgage action 8. Unless the mortgage deed provides otherwise, the ordinary rule applicable to a mortgage action under Order 88 is that a mortgagee is entitled as of right to possession of the mortgaged property, and the court has no power to adjourn an application for possession or to make a suspended order, except for a short adjournment to afford the borrower a chance of paying off the mortgage in full: see Hong Kong Civil Procedure 2020 [1] . This exception could only be invoked if there is a reasonable prospect that such payment is forthcoming. Discussion 9. The relief sought in this appeal is the same as that sought in the previous appeal against the order of Master Yip dismissed by K Yeung J on 23 January 2020. The present appeal is a blatant impeachment of the judgment and order made by K Yeung J on precisely the same subject matter, when the time for appealing the said judgment to the Court of Appeal has expired. The Defendant’s action in applying for stay before Master Hui when the Plaintiff was in the course of executing the possession order by issuing the Writ of Possession as well as in appealing the order of Master Hui were obviously taken for the purpose of delaying the Plaintiff from obtaining possession of the Property, which it is entitled to pursuant to the order of Master Yip which had been upheld by K Yeung J on appeal. It is the fruit of its litigation. Those actions are clear abuses of the legal process of the court. On this ground alone, her appeal ought to be dismissed. 10. The judgment debt is $1,640,232.29 plus interest accruing at the rate of 16.5% per annum since 29 September 2018 and costs. Except for two payments made on 14 and 22 July 2020 in partial satisfaction of the judgment debt, the Defendant failed to make any payments to diminish the outstanding balance of judgment debt. 11. In her second affirmation filed in support of this appeal on 3 July 2020, the Defendant repeated what she told K Yeung J at the previous appeal. She referred to her application to The Bank of East Asia for refinancing in May 2020. That was three months ago. Obviously, no refinancing has been approved. 12. In her third affirmation filed on 23 July 2020, the Defendant said she was awaiting approval of a loan in an amount of $1 million and that she will settle the balance with income from her business as soon as overdue remittances arrive within this period of time. That was a month ago. The refinancing has not yet been approved. She put the blame on the coronavirus epidemic. Even if her application were approved, she would still be short of more than $600,000 to settle the judgment debt. She would still have to wait for the uncertainty of the arrival of the remittances. They never arrived. There is no prospect if they ever will, not to mention that there is no evidence to support such pending remittances. 13. Ten months have lapsed since the possession order of Master Yip. Time has shown that the Defendant has no ability to pay the judgment debt. There is also no prospect that it would be paid within any short time. There is no reason why the ordinary rule in mortgage actions should not apply. There is absolutely no merit in this appeal. Conclusion 14. The appeal is an obvious abuse of legal process. Besides, the Plaintiff has clearly demonstrated her lack of means to pay the judgment debt. For these reasons, the appeal is dismissed with costs on indemnity basis as provided for by clause 22(ii) of the Second Mortgage. I summarily assessed the costs of this Appeal in the sum of $19,000. ( Anthony To ) Deputy High Court Judge Mr. Lau of Messrs. Foo & Li, Solicitors, for the Plaintiff The Defendant appeared in person [1] Vol 1, §88/5/11 Look up this case on Lawcite Noteup",
  "length": 7002,
  "headers_seen": [
    "Introduction",
    "Legal principles applicable to mortgage action",
    "Discussion",
    "Conclusion"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2020/2422",
  "query": "possession order",
  "ts": "2025-10-17T10:41:42",
  "ok": true
}