{
  "title": "LUCKY-GOLDSTAR INTERNATIONAL(H.K.) LTD. V. NG MOO KEE ENGINEERING LTD. | [1993] HKCFI 14 | HKLII",
  "court": null,
  "year": 1993,
  "date": null,
  "content": "HKLII Databases Court of First Instance [1993] HKCFI 14 LUCKY-GOLDSTAR INTERNATIONAL(H.K.) LTD. V. NG MOO KEE ENGINEERING LTD. Judgment Information Date 4 May, 1993 Action No. HCA94/1993 Neutral Cit. [1993] HKCFI 14 Parallel Cit. [1993] 1 HKC 404 Download MS Word Judgment Reading Options Translation Toggle Highlight Case History HCA94/1993 HCA94/1993 Lucky-Goldstar International(H.K.) Ltd. v. Ng Moo Kee Engineering Ltd. HCA000094/1993 1993 No. A94 IN THE SUPREME COURT OF HONG KONG HIGH COURT ______________ BETWEEN Lucky-Goldstar International(H.K.) Limited Plaintiff AND Ng Moo Kee Engineering Limited Defendant ______________ Coram: The Hon. Mr Justice Kaplan in Chambers Date of hearing: 22 April 1993 Date of handing down judgment: 5 May 1993 __________________________ C O R R I G E N D U M _____________________ The two sentences at page 2, lines E-G of the judgment should read as follows : \"This arbitration is international because although both parties to the arbitration agreement have their place of business in the same State, it will soon become apparent that they have agreed that the place of arbitration is to be outside that State.\" Dated this 10th day of May, 1993. (T.F.Lo) Clerk to Hon. Kaplan, J. The Judge has authorised publication of this Judgment 1993 No. A94 IN THE SUPREME COURT OF HONG KONG HIGH COURT ______________ BETWEEN Lucky-Goldstar International (H.K.) Limited Plaintiff AND Ng Moo Kee Engineering Limited Defendant ______________ Coram: The Hon. Mr. Justice Kaplan in Chambers Date of hearings: 22 April 1993 Date of handing down judgment: 5 May 1993 ___________________ H E A D N O T E _______________ Arbitration - International - Arbitration Agreement refers to rules of non- existent arbitration association - application for a stay under Article 8 of Model Law - whether arbitration agreement is \"null and void, inoperative or incapable of being performed\". _______________ J U D G M E N T _______________ 1. I have before me an application for a stay of these proceedings pursuant to the provisions of Article 8 of the Model Law. 2. Both Plaintiff and Defendant are Hong Kong companies having their place of business in Hong Kong. The Plaintiff is a subsidiary of the well-known Korean Company which trades under the name of 'Lucky Goldstar'. This arbitration is international because both parties to the arbitration agreement have their place of business in the same State. It will soon become apparent that they have agreed that the place of arbitration is to be outside that State. 3. By a written agreement dated 3rd December 1990, the Plaintiffs sold to the Defendants 5 sets of elevators. The contract contained the following dispute resolution clause: \" Claims : Any claims by Buyer of whatever nature arising under this contract shall be made by cable within thirty (30) days after arrival of the merchandise at the destination specified in the bills of lading. Full particulars of such claim shall be made in writing and forwarded by registered mail to Seller within fifteen (15) days after cabling. Buyer must submit with such particulars sworn surveyors reports when the quality or quantity of merchandise delivered is in dispute. Any dispute or difference arising out of or relating to this contract, or the breach thereof which cannot be settled amicably without under delay by the interested parties shall be arbitrated in the 3RD COUNTRY, under the rule of the 3RD COUNTRY and in accordance with the rules of procedure of the International Commercial Arbitration Association. The award shall be final and binding upon both parties.\" 4. The Defendants seek to rely on this arbitration agreement and thus they seek a stay of these proceedings under Article 8 of the Model Law which provides as follows: \"(1) A Court before which an action is brought in a matter which is the subject of an arbitration agreement shall, if a party so requests not later than when submitting his first statement on the substance of the dispute, referred parties to arbitration unless it finds that the agreement is null and void, inoperative or incapable of being performed.\" 5. The parties appear to agree that the phrase \"3rd Country\" which appears in the arbitration clause means any country other than Hong Kong and probably Korea. No evidence was put in as to what was intended by the use of this phrase. For all I know it might have been intended to convey to the parties using this clause that a specific 3rd Country had to be inserted where those words appeared. Be that as it may, the conditions of this contract were the standard terms and conditions used by the Plaintiffs Korean Head Office with the deletion of the word 'Korea' which was replaced by the words \"3rd Country\". 6. It is also common ground between the parties that the International Commercial Arbitration Association referred to in the arbitration clause is a non-existent organisation. No useful purpose can be served by speculating as to what was actually intended by the use of these words. 7. Mr. Whitehead, who appeared for the Plaintiffs, valiantly attempted to argue that there was no binding arbitration agreement on the grounds that a common mistake had been made. He submitted that when the parties have agreed to undertake arbitration only in certain circumstances, and according to certain rules and those rules turn out to be non-existent, the consent to arbitration is therefore nullified. He relied on Bell v. Lever Bros . [1932] A.C. 161 @217 and Treitel's Law of Contract, 8th ed. pp 249-261. 8. I cannot accept this argument. It is perfectly clear that the parties, by this clause, intended to arbitrate any disputes that might arise under this contract. This agreement is not nullified because they chose the rules of a non-existent organisation. It must be noted that the clause refers to arbitration in a 3rd Country \"under the rule of the 3rd Country and in accordance with the rules of procedure of ....\". The word 'rule' must mean 'law'. As there are no rules of this non-existent organisation the arbitration has to be conducted under the law of the 3rd Country chosen by the Plaintiff. In this regard they are in the fortunate position of being able to choose a country whose law and practice of arbitration is acceptable to them and no doubt they will also take into account whether that country has ratified the New York Convention. 9. I do not, and cannot, accept that this agreement to arbitrate is nullified in the manner suggested. 10. Mr. Whitehead next turns to the words used in Article 8 of the Model Law and attempts to argue that this arbitration agreement is \"... inoperative or incapable of being performed\". He says this because it will be impossible to arbitrate under the rules of the International Commercial Arbitration Association. 11. The phrase \"inoperative or incapable of being performed\" was taken from the New York Convention of 1958 and no authority on this phrase was cited to me. 12. Professor Albert Jan van den Berg in his book on The New York Arbitration Convention 1958 in dealing with the word \"inoperative\" stated at p.158: \"The word 'inoperative' can be deemed to cover those cases where the arbitration agreement has ceased to have effect. The ceasing of effect to the arbitration agreement may occur for a variety of reasons. One reason may be that the parties have implicitly or explicitly revoked the agreement to arbitrate. Another may be that the same dispute between the same parties has already been decided in arbitration or court proceedings (principles of res judicata ....)\" 13. He goes on to give other examples as for instance where the award has been set aside or there is stalemate in the voting of the arbitrators or the award has not been rendered within the prescribed time limit. Further he suggests that a settlement reached before the commencement of arbitration may have the effect of rendering the arbitration agreement inoperative, although he notes an American decision which left this issue to the arbitrators. 14. As to the phrase \"incapable of being performed\", Professor van den Berg is of the view that this would seem to apply to a case where the arbitration cannot be effectively set in motion. The clause may be too vague or perhaps other terms in the contract contradict the parties' intention to arbitrate. He suggests that if an arbitrator specifically named in the arbitration agreement refuses to act or if an appointing authority refuses to appoint, it might be concluded that the arbitration agreement is \"incapable of being performed\". However, that would only apply if the curial law of the state where the arbitration was taking place had no provision equivalent to ss.9 and 12 of the Arbitration Ordinance and Article 11 of the Model Law. 15. I also note that in Gatoil International v. National Iranian Oil Company (p.587 Vol. XVII Yearbook of Commercial Arbitration) Gatehouse J. granted a stay and refused to hold that the arbitration clause was null and void, inoperative, or incapable of being performed in circumstances where the default appointer named in the clause did not exist. 16. Having considered all of Mr. Whitehead's arguments, I cannot see how it can be said that this arbitration clause is \"inoperative or incapable of being performed\". True, it is, that there will be no arbitration under the rules of the International Commercial Arbitration Association, but there will be an arbitration under the law of the place of arbitration chosen by the Plaintiffs and they have a very wide choice indeed. The parties have made their intention to arbitrate perfectly plain in this clause. If the use only of the word 'arbitration' is sufficient to create a binding arbitration agreement then, a fortiori, this clause. (See Hobbs Padgett & Co. (Reinsurance) Ltd. v. J.C. Kirkland Ltd. (1969) 2 Lloyds Rep. 5347 @ 549. 17. I believe that the correct approach in this case is to satisfy myself that the parties have clearly expressed the intention to arbitrate any dispute which may arise under this contract. I am so satisfied. I am also satisfied that they have chosen the law of the place of arbitration to govern the arbitration even though that place has not yet been chosen by the Plaintiffs. As to the reference to the non-existent arbitration institution and rules, I believe that the correct approach is simply to ignore it. I can give no effect to it and I reject all reference to it so as to be able to give effect to the clear intention of the parties. (See para. 832 26th ed. Chitty on Contracts). 18. I further reject Mr. Whitehead's submission that both parties only agreed to arbitrate if it was to be under these non-existent rules. I fail to see how it can be argued that either party could have placed any importance on a non-existent set of rules. The Defendants would seem to have had no choice but to accept the Plaintiffs' standard terms and conditions and they can be forgiven for thinking that an organisation as large as Lucky-Goldstar knew what they were talking about. 19. Mr.Whitehead submits that I cannot salvage this arbitration agreement by ignoring reference to the non-existent organisation, because the seat of this arbitration is going to be outside Hong Kong and thus only Articles 8 and 9 of the Model Law apply. However, he did concede that I could and, indeed, had to construe this agreement, and that is all I believe I am doing using canons of construction applied by the law of the State exercising jurisdiction under Article 8. 20. Having decided that this arbitration agreement is not 'null and void inoperative or incapable of being performed', I have no choice under Article 8 but to stay these proceedings which I accordingly do. 21. Before parting with this case, I would like to add the following. This is not the first case with which I have had to deal where the arbitration clause has left something to be desired. Many contract drafters seem to have difficulty in the fairly simple task of drafting an arbitration clause or even replicating a standard form clause. Arbitral institutions and associations go to the trouble of drafting standard form arbitration clauses and disseminating them for the benefit of users, yet in far too high a percentage of cases something goes wrong. The former Secretary General of the ICC told an audience in Hong Kong a few years ago that only in a very small number of cases which came to the ICC, did the parties manage to replicate accurately in their contract the standard ICC Clause. A badly drafted clause leads to disputes and wasted costs, both of which are anathema to the arbitral process. In many cases in this region, I imagine the problem is caused by contract drafters not drafting in their native tongue and this problem is appreciated. However, anything that can be done to ensure that arbitration clauses are clear, meaningful and effective would enhance the arbitration process quite considerably. It would be salutary for contract drafters to read Benjamin Davis' excellent article on pathological arbitration clauses which appears in Arbitration International - Vol. 7 No.4 1991. 22. Since drafting this judgment my attention has been drawn to a decision from New York which is of interest to the matters raised in this application. 23. In Laboratories Grossman v. Forest Laboratories 295 New York Supp. 2nd series 756, the parties agreed to arbitrate under the rules of a non- existent organisation. Each party deposed to different intentions and the Supreme Court of New York ordered a hearing to determine the parties true intent. If their true intent was not to arbitrate under the rules of the organisation put forward by the Respondent then the Court had to determine, \"whether the dominant purpose of the agreement was to settle disputes by arbitration, rather than the instrumentality through which arbitration should be effected .... In such event, there being no viable organisation named in the agreement through which arbitration may be had, the court may direct arbitration before such tribunal as it may determine would be the most appropriate in the circumstances.\" 24. I think that this is a useful test and when applied to the facts before me, I have no doubt that the parties dominant intention was to settle disputes by arbitration rather than the instrumentality through which arbitration was to be conducted. This is clear from the fact that the organisation referred to was non-existent and further, unlike in the case cited, neither party deposed to intending any specific alternate arbitral institution. 25. I did not call for further argument on this case as I had already decided the matter on the material presented to me and this case only reinforced my conclusion. 26. I therefore grant the stay sought by the Defendants and I make an order that the Plaintiffs do pay the Defendants costs of these proceedings. (Neil Kaplan) Judge of the High Court Representation: Mr. Robert Whitehead inst'd by Yiu Lai & Li for the Plaintiff Mr. Andrew Cheung inst'd by Shaw, Ng & Ma for the Defendant Look up this case on Lawcite Noteup",
  "length": 15093,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/1993/14",
  "query": "arbitration",
  "ts": "2025-10-14T11:20:53",
  "ok": true
}