{
  "title": "JUICY COUTURE, INC. V. BELLA INTERNATIONAL LTD T/A JUICY GIRL AND OTHERS | [2009] HKCFI 1135 | HKLII",
  "court": null,
  "year": 2009,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2009] HKCFI 1135 JUICY COUTURE, INC. V. BELLA INTERNATIONAL LTD T/A JUICY GIRL AND OTHERS Judgment Information Date 3 Dec, 2009 Action No. HCA1764/2008 Neutral Cit. [2009] HKCFI 1135 Download MS Word Judgment Reading Options Translation Toggle Highlight Appeal History HCA1764/2008 HCA001764/2008 JUICY COUTURE, INC. v. BELLA INTERNATIONAL LTD t/a JUICY GIRL AND OTHERS HCA1764/2008 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE ACTION NO. 1764 OF 2008 ------------------------- BETWEEN JUICY COUTURE, INC. Plaintiffs and BELLA INTERNATIONAL LIMITED trading as JUICY GIRL 1 st Defendant YANG CHING PING, JESSICA (楊青萍) 2 nd Defendant SUEN LUI (孫磊) 3 rd Defendant ------------------------- Before : Hon Yam J in Chambers Date of Hearing : 13 November 2009 Date of Judgment : 13 November 2009 Date of Handing Down Reasons for Judgment : 4 December 2009 ------------------------------------------------------ REASONS FOR JUDGMENT ------------------------------------------------------ 1. On the date of the hearing I granted an interlocutory injunction at the request of the 1 st defendant herein to restrain the plaintiff from proceeding further with the arbitration proceedings arising out of the Complaint filed by the plaintiff against the 1 st defendant on 11 September 2009 with the Hong Kong International Arbitration Centre (“HKIAC”) in respect of the domain name “juicygirl.com.hk”. The following are my reasons therefor. Background 2. On 17 September 2008 the plaintiff commenced the present action against the defendants for trademark infringement and passing off, claiming that it is and was the registrar, proprietor of the marks : “Juicy”, “Juicy Couture”, “Juicy Girl” and “Juicy Jeans” which have been registered in Hong Kong (“the Registered Marks”). The plaintiff also claimed that it has rights at common law in, inter alia , the Registered Marks through their reputation and goodwill as allegedly acquired therein in Hong Kong through their marketing, promotion and sale of these products since July 2000. 3. It was further complained by the plaintiff against the defendants’ use of the “juicylicious.us” and “juicygirl.us” domain names and the plaintiff seeks relief in the form of negative injunctions and an order that the defendants do take all necessary steps to “cancel” these domain name registrations. 4. The defendants’ main defence is that the 1 st defendant has started to make use of the “Juicy Girl” marks complained of from 1998, i.e. before the plaintiff started to use or register the Registered Marks in Hong Kong. Accordingly the 1 st defendant has acquired its own independent goodwill and reputation in the name and mark “Juicy Girl”. 5. Nearly a year afterwards the plaintiff, on 11 September 2009, filed the complaint to the HKIAC regarding the 1 st defendant’s registration of the domain name “juicygirl.com.hk” (“Disputed Domain Name”) which was registered with the Hong Kong Domain Name Registration Company Limited (“HKDNR”) since 9 February 2009 (“the Complaint”). When a complaint has been lodged with the HKDNR, the matter will be referred to the HKIAC for resolution under the Domain Name Dispute Resolution Policy. In this respect a complainant must establish the following requirements under para. 4(a)(i) to (iii) of the Domain Name Dispute Resolution Policy as follows : “(i) the Domain Name complained of is identical or confusingly similar to a trademark or service mark in Hong Kong in which the Complainant has rights; (ii) the registered owner of the Domain Name has no rights or legitimate interests in respect of the Domain Name; and (iii) the Domain Name has been registered and is being used in bad faith.” 6. Since then the defendants’ solicitors have written to the HKIAC and the plaintiff’s solicitors requesting a stay of the arbitration proceedings or an extension of time for the 1 st defendant to file its response until after the determination of the present action. However the plaintiff has refused to agree to such a course of action and the 1 st defendant accordingly applied for an injunction to stay the arbitration proceedings. 7. The grounds in support of the complainant’s complaint against the 1 st defendant’s registration of the Disputed Domain Name are set out in sections 6 and 7 of the Complaint Form. In essence the plaintiff is claiming that the trade marks in question are the Registered Marks owned by the plaintiff as aforesaid. 8. Further, section 7 of the Complaint Form, in respect of “the factual and legal grounds on which complaint is made”, essentially reproduced what is pleaded in the Amended Statement of Claim. 9. Accordingly the basis for the Complaint in the arbitration proceedings and the basis of the claims in the present action all emanate from the same set of facts and give rise to the same issue. 10. The plaintiff’s solicitors, by their letter dated 12 October 2009, said : “… some of the facts relied in support of the claims for the respective proceedings are the same, …” and “… the findings of facts and evidence involved in the Action are much more complicated than those in the [arbitration proceedings]. …” 11. Thus the 1 st defendant’s solicitors submitted that the issues to be decided in both the present action and the arbitration proceedings are effectively the same, and any alleged distinctions sought to be drawn by the plaintiff are purely semantic. 12. The comparison of those facts pleaded in section 7 of the Complaint in the arbitration proceedings in support of the three requirements has to prove in the arbitration proceedings and the pleadings in this action are identical as follows : (a) The Disputed Domain Name is identical or confusingly similar to a trademark or service mark in Hong Kong in which the Complainant has rights : under paras. 1 to 12 of section 7 of the Complaint and paras. 1 to 13 of the Amended Statement of Claim. (b) The respondent has no rights or legitimate interests in respect of the Disputed Domain Name : under paras. 13 and 14 of section 7 in the Complaint in which the plaintiff seeks to contend that it has prior rights due to its alleged earlier use since 2001 and the defence in para. 17(ix), (xvii) to (xxi) in which the plaintiff contends that the 1 st defendant started to make use of the “Juicy Girl” marks complained of from 1998 before the plaintiff’s use or registered trademarks. The 1 st defendant has accordingly acquired its own independent goodwill and reputation in the name and mark “Juicy Girl”. (c) The Disputed Domain Name has been registered and is being used in bad faith : under paras. 15 and 16 of section 7 of the Complaint and the Amended Statement of Claim, paras. 18 and 20. 13. Further, staying of the arbitration proceedings will not cause any injustice to the plaintiff, as submitted by the 1 st defendant for the following reasons : (a) If the plaintiff’s claims in the present action are determined in favour of the plaintiff, by reason of the injunction sought by the plaintiff, the 1 st defendant will in any event be restrained from making use of the Disputed Domain Name. (b) The plaintiff could have and can still apply to further amend their Amended Statement of Claim to expressly plead a complaint about the Disputed Domain Name. The defendants have indicated that if such an amendment is sought, it will not be opposed. (c) The 1 st defendant has also expressly indicated that should the plaintiff’s claims in the present action be ultimately resolved in the plaintiff’s favour, the 1 st defendant will voluntarily request the cancellation or the surrender of the Disputed Domain Name. (d) Even if the determination of the plaintiff’s claims in this action would not effectively also determine the plaintiff’s complaint in the arbitration proceedings, the determination of the plaintiff’s claims in this action would result in all or practically all of the factual issues in the arbitration proceedings. This will leave only very limited, if any, issues to be determined by the arbitration proceedings which can then be very quickly disposed of at minimal costs to the parties. 14. In the end, should the arbitration proceedings continue, it will be oppressive and vexatious to the 1 st defendant in both the present action and the arbitration proceedings as both of them would boil down to the same common intellectual right issue, i.e. trademark and passing off. 15. Further still, the court in the action will also be adjudicating on two other domain names comprising “Juicy Girl” and “Juicy” namely, “juicygirl.us” and “juicylicious.us” in additional to the one in the arbitration, namely “jucygirl.com.hk”. Thus the court is clearly in a better position to deal with the plaintiff’s complaint relating to the Disputed Domain Name. 16. Otherwise if the arbitration proceedings are not stayed, there is a real danger that the concurrent overlapping proceedings may lead to different tribunals reaching different conclusions on the same facts. 17. In the end, to allow the arbitration proceedings to continue will result in a highly undesirable and unnecessary duplication of costs for both parties. 18. Another additional matter is that the HKIAC, by a letter dated 20 October 2009, has indicated to both parties that it will abide by any order made by this court between the plaintiff and the 1 st defendant in relation to the arbitration proceedings. This letter was written by the HKIAC when it came to its attention that the plaintiff and the 1 st defendant had been unable to resolve on how they would proceed in the arbitration proceedings. Apparently the HKIAC is hoping that this court will exercise its discretion to control the present existence of concurrent overlapping proceedings. 19. Legally, I think it is common ground between the parties, the court has a residual jurisdiction to control arbitration proceedings and in particular to stay certain proceedings. The power to restrain the continuance of arbitration proceedings will be exercised if : (a) no injustice would cause to the claimant in the arbitration; and (b) the applicant for a stay satisfies the court that the continuance of the arbitration will be oppressive, vexatious or an abuse of the process. Conclusion 20. For the aforesaid reasons I have granted the 1 st defendant’s application to stay the arbitration proceedings in terms of its summons dated 27 October 2009 with costs to the 1 st defendant. (D. Yam) Judge of the Court of First Instance High Court Mr Felix Pao, instructed by Messrs Wilkinson & Grist, for the Plaintiff Mr John Yan, SC and Miss Man Yu Wing, instructed by Messrs Benny Kong & Yeung, for the 1 st Defendant Appeal by the Plaintiff to Court of Appeal dismissed. Please refer to CACV19/2010 dated 26 March 2010 Look up this case on Lawcite Noteup",
  "length": 10849,
  "headers_seen": [
    "Background",
    "Conclusion"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2009/1135",
  "query": "domain name",
  "ts": "2025-10-17T10:43:45",
  "ok": true
}