{
  "title": "ASTRO NUSANTARA INTERNATIONAL B V AND OTHERS V. PT AYUNDA PRIMA MITRA AND OTHERS | [2014] HKCFI 136 | HKLII",
  "court": null,
  "year": 2014,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2014] HKCFI 136 ASTRO NUSANTARA INTERNATIONAL B V AND OTHERS V. PT AYUNDA PRIMA MITRA AND OTHERS Judgment Information Date 23 Jan, 2014 Action No. HCCT45/2010 Neutral Cit. [2014] HKCFI 136 Download MS Word Judgment Reading Options Translation Toggle Highlight Appeal History HCCT45/2010 HCCT45F/2010 ASTRO NUSANTARA INTERNATIONAL B V AND OTHERS v. PT AYUNDA PRIMA MITRA AND OTHERS HCCT 45/2010 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE CONSTRUCTION AND ARBITRATION PROCEEDINGS NO 45 OF 2010 ____________ BETWEEN (1)ASTRO NUSANTARA INTERNATIONAL B V Applicants/ Claimants in the Arbitration Judgment Creditors (2)ASTRO NUSANTARA HOLDINGS B V (3)ASTRO MULTIMEDIA CORPORATION N V (4)ASTRO MULTIMEDIA NV (5)ASTRO OVERSEAS LIMITED (formerly known as AAAN (Bermuda) Limited) (6)ASTRO ALL ASIA NETWORKS LIMITED (formerly known as ASTRO ALL ASIA NETWORKS PLC) (7)MEASAT BROADCAST NETWORK SYSTEMS SDN BHD (8) ALL ASIA MULTIMEDIA NETWORKS FZ-LLC and (1) PT AYUNDA PRIMA MITRA Defendants/ Respondents in Arbitration Judgment Debtors (2) PT FIRST MEDIA TBK (formerly known as PT BROADBAND MULTIMEDIA TBK) (3) PT DIRECT VISION and ACROSSASIA LIMITED Garnishee ____________ Before: Hon Mimmie Chan J in Chambers Dates of Hearing: 23 & 24 January 2014 Date of Decision: 24 January 2014 ____________ D E C I S I O N _____________ 1. I will be brief in my decision on this matter which, in my view, has already taken up too much time. 2. The issue for my determination is whether, pursuant to O 45 r 11 RHC, I should order a stay of execution of the Garnishee Order Absolute made by DHCJ Mayo on 31 October 2013, on the ground of matters which have occurred since the date of the Garnishee Order such that it is just so to order a stay, or that under O 45 r 1 there are special circumstances which render it inexpedient to enforce the Garnishee Order. 3. The Garnishee Order Absolute of 31 October 2013 was made on the basis of a judgment of the Hong Kong court entered on 9 December 2010 (“ Hong Kong Judgment ”) enforcing 5 Arbitration awards (“ Awards ”) made in the Singapore International Arbitration Centre (“ SIAC ”), whereby a total sum of HK$2.3 billion is payable by the 2 nd Judgment Debtor (“ FM ”) to the 6 th to 8 th Applicants (who are for convenience referred to collectively as “ Astro ”). The Garnishee Order is for the Garnishee’s payment of a sum of US$44 million to Astro. 4. On 31 October 2013, in fact on the same day as the Garnishee Order Absolute was handed down in Hong Kong, the Singapore Court of Appeal held that under Singapore law, there was no arbitration agreement between Astro and FM, the debtor under the Awards, and that the Tribunal had no power under the SIAC Rules to join into the arbitration third parties such as Astro who are not parties to any arbitration agreement with FM. The Singapore Court of Appeal accordingly refused leave to enforce the Awards against FM. 5. In a case where enforcement of an award is challenged on the basis of disputes as to the procedure of the arbitration, the composition or powers of the arbitral tribunal, and the validity of an arbitration agreement, under the rules and laws of the place where the arbitration took place, the decision of the supervisory court in the seat of arbitration is very relevant (as the CA in Gao Haiyan v Keeneye Holdings Ltd [2012] 1 HKLRD 627 ) has recognised). “Due weight” should be given to the decision of that court whether or not to set aside the award, or to refuse enforcement of the award. 6. In this case, the existence, validity or otherwise of the arbitration agreement and the power of the Arbitration Tribunal to join parties to the arbitration are governed by Singapore law. The Singapore court has, since the hearing of the Garnishee proceedings, refused enforcement of the Awards on the basis that there is no valid arbitration agreement under which the Awards were made, and that the Tribunal has no power to join Astro in the arbitration. This is and will be a key factor to be considered by the Hong Kong court in its determination of whether to set aside the Hong Kong Judgment and refuse enforcement of the Awards against FM and any of the respondents here. If there is no judgment debt to form the basis of the Garnishee Order, injustice will result if the debtor and the garnishee should have to make payment of the debt, and later find themselves in the position of being unable to recover the debt from Astro which is not resident in Hong Kong. The only part of the Awards not affected by the decision of the Singapore Court of Appeal involves 3 sums which have now been paid by FM. 7. FM’s delay in its application to set aside the Hong Kong Judgment and the orders granting leave to enforce the Awards, its failure to set aside the original Awards in Singapore before the enforcement proceedings in Singapore, whether it is estopped from challenging enforcement of the Awards in Hong Kong, and whether the Hong Kong Court will exercise its discretion to enforce the Awards here notwithstanding the decision of the Singapore Court of Appeal, are no doubt matters to be argued on the merits of FM’s application to set aside the Hong Kong Judgment when it is heard, upon the lifting of the stay of the proceedings pending the determination of the Singapore Court on Appeal. It suffices for me to say at this stage that FM has good prospects of success in its application to set aside. 8. In all the circumstances of this case, I consider that with the material event of the handing down of the decision of the Singapore Court of Appeal on 31 October 2013, it is just to stay execution on the Garnishee Order Absolute. The fair order for costs of the stay should in my view be in the cause of the application to set aside the Hong Kong Judgment, and I will so order (with certificate for counsel). 9. In relation to Astro’s application, made out of time by 3 weeks, for variation of the costs order nisi made by DHCJ Mayo on 31 October 2013, there is no good reason why it had failed to make the application within the limit of 14 days of the decision. No “clarification” of the costs order was or is required, which is clear on its face that no indemnity basis is mentioned or included. There is nothing complex in an application to vary a costs order nisi. Clarification of the terms of the Garnishee Order itself, the drawing up of the Garnishee Order and any appeal against the Garnishee Order all have nothing to do with the variation of the costs order nisi and cannot explain the delay in the application for variation. 10. I am not satisfied that extension of time should be given to Astro. 11. Nor am I satisfied on the merits that the order nisi should be varied. If the factors highlighted by Astro as justifying an order for costs on an indemnity basis were as significant as Astro argues, then they should have featured in the learned Judge’s consideration of the costs order nisi made, when the matter was fresh in his mind. It is clear that he did not order costs on an indemnity basis, notwithstanding the conduct to which he referred in the Decision. Being the trial judge who heard and saw the witnesses, the evidence and the submissions made by the parties in the course of the 10 day hearing, DHCJ Mayo was the best person to have decided on whether costs on an indemnity basis should be ordered. I accept that this is not an appeal against the costs order of the trial judge, but he did not order costs on an indemnity basis, and I am not persuaded, even after hearing further submissions, that the costs order nisi should be varied. The application for variation is accordingly dismissed, with costs and certificate for counsel. 12. The only variation will be in respect of the reserved costs, as agreed by the parties. (Mimmie Chan) Judge of the Court of First Instance High Court Mr Clifford Smith SC, instructed by Clifford Chance, for the judgment creditors Mr Mark Strachan SC and Mr Jeffrey Chau, instructed by Stephenson Harwood, for the 2 nd judgment debtor Mr Horace Wong, SC and Mr Liu Man Kin, instructed by Reed Smith Richards Butler, for the garnishee Look up this case on Lawcite Noteup",
  "length": 8226,
  "headers_seen": [],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2014/136",
  "query": "seat of arbitration",
  "ts": "2025-10-16T10:49:18",
  "ok": true
}