{
  "title": "TANG MOON LAM, THE PERSON APPOINTED TO REPRESENT THE ESTATE OF TANG SHAU KI, DECEASED (BY ORDER DATED 25 JUNE 2014) V. TANG YING YEUNG | [2019] HKCA 1102 | HKLII",
  "court": null,
  "year": 2014,
  "date": "2025-10-01",
  "content": "HKLII Databases Court of Appeal [2019] HKCA 1102 TANG MOON LAM, THE PERSON APPOINTED TO REPRESENT THE ESTATE OF TANG SHAU KI, DECEASED (BY ORDER DATED 25 JUNE 2014) V. TANG YING YEUNG Judgment Information Date 1 Oct, 2019 Action No. CACV216/2018 Neutral Cit. [2019] HKCA 1102 Parallel Cit. [2019] 5 HKLRD 556 Download MS Word Judgment Reading Options Translation Toggle Highlight Appeal History CACV216/2018 CACV216/2018 TANG MOON LAM, the person appointed to represent the estate of TANG SHAU KI, deceased (by Order dated 25 June 2014) v. TANG YING YEUNG CACV 216/2018 [2019] HKCA 1102 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF APPEAL CIVIL APPEAL NO 216 OF 2018 (ON APPEAL FROM HCA NO 1055 OF 2014) ____________________ BETWEEN TANG MOON LAM (鄧滿林), the person appointed to Plaintiff represent the estate of TANG SHAU KI (鄧壽祺), deceased (by Order dated 25 June 2014) and TANG YING YEUNG (鄧英揚) Defendant ____________________ Before: Hon Lam Acting CJHC, Au JA and G Lam J in Court Date of Hearing: 25 September 2019 Date of Judgment: 25 September 2019 Date of Reasons for Judgment: 2 October 2019 ___________________________________ REASONS FOR JUDGMENT ___________________________________ Hon G Lam J (giving the reasons for judgment of the Court): Introduction 1. This is an appeal from the judgment of B Chu J (“ Judge ”) in relation to a piece of land in Wing Lung Wai Village (永隆圍) in Yuen Long. The land is known as Wing Lung Wai Lot No 1 in DD 109, Yuen Long, with the exception of a small part which is occupied by the entrance to Wing Lung Wai. For convenience, the disputed land will simply be called “Lot 1” below, ignoring the small part taken up by the village entrance. 2. The contest is between the plaintiff, who is the representative of the estate of the deceased registered owner of Lot 1, and the defendant, who claimed to have been in adverse possession of Lot 1. The Judge gave judgment in the plaintiff’s favour in May 2018, after trial, ordering the defendant to deliver up vacant possession, to demolish the house erected thereon, and to pay mesne profits to the plaintiff. The defendant appealed to this court. After hearing the submissions made on behalf of the defendant, we dismissed the appeal save as to the point on mesne profits which was conceded by the plaintiff, and ordered the defendant to pay the costs of the appeal with a certificate for two counsel, with reasons to be handed down. These are our reasons. Background 3. Wing Lung Wai Village is a walled village in the New Territories established by a Tso Tong founded by members of Tang Ching Lok Tso (鄧清樂祖). The descendants of Tang Ching Lok branched into three Tsos, which the Judge called the 1 st Branch, 2 nd Branch and 3 rd Branch respectively. 4. The registered owner of Lot 1 has since 24 October 1914 been Tang Shau Ki (鄧壽祺), a descendant of the 1 st Branch with no son himself but two daughters, one of whom was Tang Mui (鄧妹). Tang Mui and her family used to live in the old house standing on Lot 1 (“ Old House ”) until they moved out of Wing Lung Wai. Tang Shau Ki had a brother called Tang Chun Sau (鄧春壽), who had one son, Tang Tat Yi (鄧達儀), who in turn also had one son, Tang Poon Lap (鄧本立), who was the plaintiff’s father. Tang Shau Ki was thus the great-great-uncle (太叔公) of the plaintiff. 5. After the plaintiff’s grandparents died, the plaintiff’s father was taken into the Mainland by his paternal grandmother in 1945/46, where he grew up, but he came back to live in Hong Kong in February 1985. In March 1986 he became registered in the District Office of Yuen Long as the successor to the properties in Wing Lung Wai registered in the name of Tang Tat Yi. There was for some time a dispute over his status as a successor but it was put beyond doubt by the judgment of Yam J in an action brought by the plaintiff’s father in HCA 761/1996. 6. The defendant is a descendant of the 2 nd Branch. He worked in the Netherlands as a cook from the 1970s until 2006 when he retired. He had apparently entered into an agreement to purchase Lot No 2 in DD 109 (“ Lot 2 ”), which has an area of about 350 ft 2 and adjoins Lot 1, from the daughter of the deceased registered owner of Lot 2, as evidenced by a note dated 12 December 1985. It is not in dispute that the defendant was subsequently registered as the owner of Lot 2 on 4 December 1997. 7. The defendant claimed that he and/or his father started using Lot 2 in 1985 but because it was small in size, and the Old House on the adjoining Lot 1 was vacant and dilapidated, he and/or his father began to occupy Lot 1 and to use it together with Lot 2. It was said that he continued to be in possession of the Old House until it was demolished. 8. In around January or February 2008, the defendant caused the Old House and certain brick walls on Lot 1 to be demolished. In addition, Lot 2 and a number of other neighbouring lots (namely, Lot Nos 3, 4, 6, 7, 64-67 and 82-83) were also cleared of the structures erected on them. The ground was paved with cement and an open space, like a small village square, was formed as a result. 9. In February 2012, the defendant engaged workers to construct a new house straddling Lot 1 and Lot 2 (“ New House ”) and a new wall enclosing both pieces of land. Despite the plaintiff’s opposition, the New House was completed near the end of 2012. It had, however, been constructed without the requisite approval from the Government, and an order had since been issued by the Building Authority under s 24(1) of the Buildings Ordinance (Cap 123) requiring the demolition of the New House, although the order has not yet been complied with. 10. On 12 June 2014, the plaintiff instituted the action below by writ of summons against the defendant claiming, inter alia , possession of Lot 1. [1] 11. In his Defence and Counterclaim filed on 6 January 2015, [2] the defendant claimed that he had been in adverse possession of Lot 1 for over 20 years since 1985. He sought a declaration that he had acquired a good title to Lot 1 by adverse possession and that Tang Shau Ki’s and/or the plaintiff’s title to Lot 1 had been extinguished under s 17 of the Limitation Ordinance (Cap 347) (“ Ordinance ”). 12. The aerial photographs and expert evidence show that two structures, labelled “S2” and “S3”, could be seen on Lot 1 in January 1981. By 27 July 1982, S2 had collapsed or been demolished while S3 remained. By 23 June 1985, the roof of S3 had been renovated. By 16 July 1991, a structure “S4” had been erected at the location of S2. S3 and S4 had remained relatively unchanged since, until they were demolished in 2008. The Judge’s decision 13. The Judge divided her analysis of the defendant’s case of factual possession of Lot 1 into four periods of time: (a) from 1985 to 16 July 1991; [3] (b) from 16 July 1991 to 2007; (c) from 2008 to 2012; and (d) from 2012 to the trial. Her conclusions may be summarised as follows: (1) As to the period from 1985 to 16 July 1991: The Judge found that there was no sufficient evidence that the defendant was in occupation or possession of the Old House or Lot 1 in 1986 or indeed prior to about 1990. More likely than not, however, in about 1990, the defendant or his father built a new north wall in Lot 1 and replaced the windows of the Old House, and the defendant caused the S2 area to be roofed over to become S4 at some time prior to 16 July 1991. As such, the defendant’s occupation or possession of Lot 1 commenced in about 1990. [4] (2) The Judge accepted that the defendant continued to be in occupation or possession of Lot 1 during the period from 16 July 1991 to 2007. [5] (3) For the period from January or February 2008 to 2012, the Judge found that, after the clearing of the buildings that used to stand on the relevant parcels of land, there was no restriction on the villagers carrying out occasional recreational activities on the paved vacant site (which included Lot 1 and other lots including Government lots [6] ), although use for specific or official purposes or large-scale functions would probably require the permission of the Village Representative. [7] There was no sign, notice or fence to prevent villagers from walking over the square freely. The Judge concluded that the defendant had not shown that he maintained exclusive possession over Lot 1 during this period, and therefore found that his possession of Lot 1 was interrupted and discontinued for 4 years from January or February 2008 to about January 2012. [8] (4) During the period from January 2012 to the trial, the defendant was in possession of Lot 1 again. 14. The Judge found that, on the basis that his possession only commenced in about 1990, the defendant had only been in possession of Lot 1 for 17 or 18 years up to 2008 when his exclusive possession ended (until he came into possession again in January 2012). Accordingly, since by virtue of s 38A of the Ordinance the limitation period was 20 years where the cause of action accrued before 1 July 1991, the defendant’s claim for adverse possession failed. 15. Entering judgment for the plaintiff, the Judge ordered the defendant to deliver up vacant possession of Lot 1 to the plaintiff, to demolish the New House, and to pay the plaintiff mesne profits to be assessed. The defendant’s counterclaim was dismissed. The appeal 16. Three grounds have been advanced by the defendant for the appeal. (1) By Ground 1, the defendant contends that the Judge erred in concluding (at [103] of the Judge’s judgment (“ Judgment ”)) that she was not satisfied that the roof of S3 seen in the aerial photograph of 23 June 1985 had been renovated by the defendant and/or his father. (2) By Ground 2, the defendant contends that on the proper construction of ss 7, 17 and 38A, the plaintiff’s title to Lot 1 was extinguished after 12 years from 1 July 1991, ie by 1 July 2003. (3) By Ground 3, the defendant says that the Judge erred in ordering payment of mesne profits to be assessed when there had been no order for split trial and the plaintiff had adduced no evidence on the quantum of mesne profits. [9] 17. In response, the plaintiff opposes the first two grounds but does not oppose Ground 3, accepting that an award of nominal damages should be substituted for the order for mesne profits. 18. In addition, the plaintiff, by respondent’s notice, contends that even if the defendant had already been in adverse possession for the applicable limitation period prior to 2008, the judgment below should still be affirmed because, since the defendant had abandoned possession, his title which is rooted in possession is destroyed. [10] 19. In counter response, the defendant submits that once a squatter has completed the necessary period of adverse possession, the owner’s title is extinguished. The squatter acquires a title that is good against the whole world, except those who can prove a better title. The squatter’s possessory title is not lost merely because he goes out of possession, unless another squatter acquires title against him by adverse possession. [11] The defendant further contends that while the Judge held that his exclusive possession was interrupted and discontinued in 2008, that was not the same as a finding that he had abandoned his possessory title. Ground 1 20. It is common ground that a comparison between the aerial photographs of 27 July 1982 and 23 June 1985 respectively shows that the roof of S3 had been renovated between these dates. In [103] of her judgment, the Judge stated: “ In any event, although the 23.06.85 Aerial Photograph showed that by then the roof of S3 had been renovated when compared to the 27.07.82 Aerial Photograph, the renovation could have taken place any time between those 3 years between July 1982 to June 1985. It was not exactly clear when Tang Mui moved out although P had said by 1982 she had moved. However, the burden was on D to prove that he started occupying the Old House/Lot 1 in early 1985. As there were inconsistences in D’s evidence, I am not satisfied that the roof of S3 seen in the 23.06.85 Aerial Photograph was renovated by D and/or his father, or that D had started to occupy/possess Lot 1 in March/April 1985 or in early 1985.” 21. The defendant argues that since Tang Mui, who had lived in the Old House, had on the plaintiff’s evidence already moved out of Lot 1 by 1982, it was very unlikely that she would have renovated the roof of S3, and because the plaintiff did not put forward any evidence as to who else could have renovated it, it was more likely than not that it was the defendant and his father who had done so. 22. In our view, the Judge had ample basis to reject the defendant’s evidence that he and his father renovated the roof of S3. The defendant’s witness statement originally claimed that it was at the end of 1985, after the note dated 12 December 1985 relating to the transfer of Lot 2, that his family began to use Lot 2 and to possess Lot 1, and that it was at the end of 1985 or beginning of 1986 that he and his father renovated the roof of the Old House. The defendant amended his witness statement at trial by removing these references to dates. The Judge considered that the defendant had changed his case after seeing the aerial photographs. She also noted that the defendant’s claim at trial that he had spent 9 months in Hong Kong during 1985 was not only nowhere mentioned in his witness statement but was also contrary to his evidence that he only returned to Wing Lung Wai once every 2 to 3 years and each time for about 1 or 2 months. There is no basis to impugn the Judge’s assessment of the credibility of the defendant’s evidence. 23. We recognise that the rejection of the defendant’s evidence does not in itself prove the opposite. But in the absence of credible positive evidence, we do not think that the Judge’s conclusion that she was not satisfied the roof of S3 had been renovated by the defendant and/or his father prior to 23 June 1985 could be faulted. First, the Judge made no finding as to when Tang Mui vacated the Old House, saying it was “not exactly clear” when she moved out and thus refusing to rule out that her family could have been responsible for the renovation, which could have taken place at any time between 27 July 1982 and 23 June 1985. Secondly, the plaintiff had no onus to disprove the defendant’s assertion that the defendant and his father carried out the renovation. No inference could be drawn from the fact that the plaintiff did not assert any alternative possibilities, especially since the defendant only changed his case at trial as regards the date when he carried out the renovation. Thirdly, the Judge was sceptical and did not accept that the defendant was in Hong Kong between March and December 1985. This militated against the possibility that the defendant did the renovation. Fourthly, the Judge did not think that the defendant had any urgent need to occupy or use Lot 1 or Lot 2 or would have started occupying or using them before obtaining a written transfer of Lot 2, which he did only on 12 December 1985. [12] Fifthly, the Judge likewise was not persuaded that the defendant’s father needed to use Lot 1 at that time. [13] In these circumstances, the defendant has signally failed to show that the Judge’s conclusion on this question of primary fact was erroneous, let alone that it was “plainly wrong”. 24. The burden of proof was on the defendant. On the basis of the materials before her, the Judge was in our view entitled to conclude that she was not satisfied that the renovation to the roof of S3 that had been done between July 1982 and June 1985 was in fact carried out by the defendant and/or his father. Ground 1 must therefore be rejected. 25. In any event, even if Lot 1 had in fact been used by the defendant’s father for storage or as a place to rest or for growing plants as alleged by the defendant, it seems to us highly doubtful if the Judge would have accepted that such use amounted to sufficient exclusive possession. Ground 2 26. The provisions in the Ordinance relied upon by the defendant are as follows: “ 7. Limitation of actions to recover land … (2) No action shall be brought by any other person [14] to recover any land after the expiration of 12 years from the date on which the right of action accrued to him or, if it first accrued to some person through whom he claims, to that person … 17. Extinction of title after expiration of period Subject to the provisions of section 10, at the expiration of the period prescribed by this Ordinance for any person to bring an action to recover land (including a redemption action), the title of that person to the land shall be extinguished. … 38A. Transitional provisions relating to 1991 amendments (1) The time for bringing proceedings in respect of a cause of action— (a) to recover any land; (b) to redeem mortgaged land; (c) to recover any principal sum of money secured by a mortgage or other charge on property, or to recover proceeds of the sale of land; or (d) to foreclose on mortgaged personal property, which accrued before 1 July 1991 shall, if it has not then already expired, expire at the time when it would have expired apart from the provisions of the Limitation (Amendment) Ordinance 1991 (31 of 1991). …” 27. The defendant’s argument, advanced by Mr Johannes Chan SC (who did not appear below) in this court, is essentially this. The limitation period in s 7(2) was changed by the 1991 amendment to 12 years. There is a public interest in preventing land, a scarce resource in Hong Kong, from being left abandoned for an extended period of time: Harvest Good Development Ltd v Secretary for Justice & Others (unrep, HCAL 32/2006, 16 July 2007), at [187]-[188]. Twelve years is what the Legislature decided to be the appropriate limitation period immediately as from 1 July 1991 as a matter of public policy. Section 38A(1) should be construed in the light of such objective. If an owner allows his land to remain in adverse possession for a period of time that includes 12 years counting from 1 July 1991, s 7(2) will operate to bar his claim. The transitional provision is not intended to create two parallel regimes lasting almost forever with two different limitation periods. The old limitation period of 20 years applies only if the period of adverse possession relied upon by the squatter includes a period before 1 July 1991. Thus construed, he submits that ss 7(2) and 38A(1) mean that a squatter who has been in continuous possession for 12 years wholly after 1 July 1991 does not need to rely on any period of possession before 1 July 1991, and the applicable limitation period for an action against him under s 7(2) is accordingly 12 years. 28. Mr Chan further explains his submission with reference to several scenarios: (1) The squatter had been in possession for more than 12 years but less than 20 years before 1 July 1991 — Mr Chan accepts that the limitation period should be 20 years. (2) The squatter had been in possession between 8 and 12 years, say 11 years, before 1 July 1991. In such a case Mr Chan also accepts that the squatter needs another 9 years from July 1991 to complete 20 years of adverse possession. (3) The squatter had been in possession for less than 8 years (eg 5 years) before 1 July 1991. In this case Mr Chan submits that the squatter needs only to have possession for 12 years (and not 15 years) from 1 July 1991, because the new limitation period of 12 years applies. 29. Mr Chan also submits that a contrary interpretation of s 38A(1) would lead to anomalous and artificial results. A squatter often relies on a multitude of acts and conduct undertaken at different points in time over a lengthy course of events to support his case of adverse possession. The actual commencement date of sufficient factual possession, as ultimately found by the court, may quite fortuitously lie before or after July 1991, as (he implicitly submits) in the present case. Adopting a literal interpretation would mean very different results would be imposed on cases with minute and fortuitous differences. Take Squatter A who entered into adverse possession of a piece of land on 30 June 1991. He would have to continue for 20 years, until 29 June 2011, to complete the necessary period of adverse possession; but Squatter B, who entered into adverse possession of another piece of land two days later, on 2 July 1991, would have passed the limitation period at the end of 1 July 2003, almost 8 years sooner than Squatter A. 30. The fundamental difficulty with the defendant’s construction is, however, that it is not what the statute says. Nor has Mr Chan been able to specify how the meaning he contends for can be accommodated into the language of the statute. As a matter of construction, it seems to us that the meaning of s 38A is perfectly plain. Before 1991, s 7(2) provided that no action shall be brought by any person [15] to recover any land after the expiration of 20 years from the date on which the right of action accrued to him. The amendment introduced by the Limitation (Amendment) Ordinance 1991 simply substituted “12” for “20”. Section 38A(1), the transitional provision, takes the date when the cause of action accrued as the pivotal point: time for bringing an action to recover land shall remain to be 20 years if the cause of action accrued before 1 July 1991, but 12 years if it accrued on or after 1 July 1991. 31. The meaning of accrual in this context is clear. The Ordinance makes provision not only for when the cause of action is barred, but also (in ss 8 to 13) as to when it is to be treated as having accrued. Section 8(1) provides: “ Where the person bringing an action to recover land, or some person through whom he claims, has been in possession thereof, and has while entitled thereto been dispossessed or discontinued his possession, the right of action shall be deemed to have accrued on the date of the dispossession or discontinuance.” 32. Section 13(1) provides: “ No right of action to recover land shall be deemed to accrue unless the land is in the possession of some person in whose favour the period of limitation can run (hereafter in this section referred to as adverse possession) and where under the foregoing provisions of this Ordinance any such right of action is deemed to accrue on a certain date and no person is in adverse possession on that date, the right of action shall not be deemed to accrue unless and until adverse possession is taken of the land.” 33. In the present case, it is plain that the date when the plaintiff’s cause of action against the defendant accrued was when the defendant’s adverse possession of Lot 1 began, which the Judge found to be about 1990 and before 1 July 1991. 34. On the plain wording of s 38A and on the findings of the Judge, given that the plaintiff’s cause of action had accrued before 1 July 1991 and time had not by then already expired, the limitation period would expire at the time when it would have expired apart from the provisions of the Limitation (Amendment) Ordinance 1991, ie 20 years from 1990. 35. Essentially, the construction contended for by the defendant means that for causes of action with a remaining period of limitation of more than 12 years to run post-1 July 1991, they would now be treated as if they had accrued on 1 July 1991, so that the new 12 years’ limitation period would apply to them. But if the Legislature had intended to mean what the defendant suggests, it would have been easy for it to stipulate to that effect. Instead, the Legislature has chosen to enact a simple transitional provision in s 38A(1) which focuses upon the actual date of accrual of cause of action. Contrary to the defendant’s position, where the transitional provision is in issue, it is necessary to inquire into when the adverse possession began. 36. The so-called anomaly disappears, as submitted by Mr Miu for the plaintiff, when the matter is examined from the point of view of the owner. An owner has a right in law to bring an action to recover his land from a squatter. The Ordinance imposes a restriction on that right, by barring any action and extinguishing his title after a specified period of time. For a cause of action that had accrued prior to 1 July 1991, the owner had a right to bring an action to recover his land within 20 years. The 1991 amendment reduces the limitation period henceforth to 12 years. The transitional provision in s 38A(1), understood in its ordinary meaning, makes clear that the reduction has no retroactive effect, ie the amendment does not curtail the right of an owner to pursue an accrued cause of action within the period of time he has under the original legislation. 37. Further, there is no absurdity arising from disparity of treatment of squatters in different situations. Where a squatter began possession less than 8 years before July 1991 (as in the present case), he did so with the knowledge that 20 years was the applicable limitation period, and could hardly complain when that limitation period was applied in his case. In the hypothetical example posited by Mr Chan and mentioned in [29] above, there would be nothing in principle to prevent Squatter A from discontinuing his previous adverse possession on 30 June 1991 and then, after 2 days, entering into adverse possession of the same land on 2 July 1991. There would be a fresh cause of action that accrued on 2 July 1991 for which the limitation period would be 12 years. 38. Mr Chan relies on a dictum of Cheung JA in Yu Siu Cheuk v Realray Investments Ltd (unrep, CACV 181/2009, 10 November 2009) at [29] as providing support for his argument: “ At the hearing before us, I raised the issue whether the plaintiff could also rely on 12 years’ adverse possession to defeat the title of the defendant. In the statement of claim the plaintiff has certainly pleaded that he has been in adverse possession of the property in excess of 20 years and also ‘in excess of 12 years’ before the commencement of the action. It is true that for the purpose of deciding whether a 20 years’ or 12 years’ limitation period will apply, the plaintiff has said that he has entered prior to the cutoff date of 1991 and hence has to establish a 20 years’ adverse possession. But if the objective evidence shows that adverse possession only began at a much later day but is long enough to cover a period of 12 years prior to the commencement of the action (namely in February 1995), I cannot see any reason why the plaintiff is not entitled to rely also on the shorter period to establish his claim.” 39. Properly read, this passage does not, in our view, support the defendant’s argument. In that case, the squatter-plaintiff pleaded that he entered into adverse possession of the land in question in 1979. Both parties proceeded on the basis that the applicable period of limitation was therefore 20 years. The Recorder who tried the case considered that once the plaintiff failed to establish that he entered into possession in 1979, that was the end of his case and it was unnecessary to determine whether he had otherwise been in continuous possession for 20 years prior to the date of his writ, viz , 7 February 2007. The Court of Appeal held that the Recorder had taken too narrow a view of the plaintiff’s case, and that even though the plaintiff failed to prove commencement of possession in 1979, it was necessary to consider whether there had subsequently been the requisite period of continuous possession. In the result, they allowed the appeal and ordered a re-trial. 40. On the question whether the limitation period was 12 years or 20 years, because the writ was issued in February 2007 in that case, if adverse possession had begun after 1 July 1991 but before February 1995, the limitation period would have been 12 years and would have expired by the time of the writ. In referring in the above passage to the scenario where “the objective evidence shows that adverse possession only began at a much later day”, it seems to us quite probable that Cheung JA was referring to the situation where adverse possession began after 1 July 1991 but before February 1995. Moreover, the phrase “adverse possession only began at a much later day” shows that his Lordship very much had in mind the time when the cause of action “accrued” in the context of s 38A(1) which he had set out earlier at [9] of his judgment. On this reading, the passage is entirely consistent with what we consider to be the proper construction of s 38A(1) and inconsistent with the defendant’s construction. 41. At the very least, it is clear that the Court of Appeal there heard no relevant argument on the construction of s 38A(1) and could not have intended to hold positively that the 12 years’ limitation period applied even where the adverse possession relied upon had begun before 1 July 1991. The owner-defendant’s position in that case, as seen from their closing submission at trial quoted in [22] of the judgment, was as follows: “ To dismiss Yu’s claim, the Court does not have to make a specific finding as to when, if not end of 1979, Yu started occupying the Land (if at all), as long as the Court cannot be satisfied that Yu has been in continuous adverse possession with animus for 12 years before the date of Writ (7 th Feb 2007). (Note: for counterclaim for possession, the counterclaim should be granted unless Yu proves adverse possession for 12 years before the date of counterclaim on 20 th March 2007)” That submission did not distinguish between the situations where adverse possession began before and after 1 July 1991. Insofar as it conceded that the period of limitation was 12 years even where the plaintiff had begun adverse possession prior to 1 July 1991, it would not, in our view, be a correct concession to make. 42. The defendant refers to Kwong Shook Ling (as sole executrix of the estate of Yu King Kwok, deceased) v The Occupants of Lot No. 841 in Survey District No. 3, Sai Kung, New Territories (unrep, HCMP 2859/2003, 28 July 2017) as a case following the dictum in Yu Siu Cheuk . It seems to us, however, that the way the issue was framed there, by consent, is consistent with the plaintiff’s construction rather than the defendant’s: see [40(2)]. 43. Similarly, in Chow Yuen Ling, administratrix of the estate of Chow Pui Kee, deceased v Kwan Lau Ying (unrep, DCMP 1203/2013, 30 July 2014), the passage in Yu Siu Cheuk was understood to mean that if the court found that the squatter had only come into adverse possession after 1 July 1991, then the limitation period would be 12 years: see [12]. In the result, the court found that adverse possession began from June 1991 and applied, in our view correctly, the limitation period of 20 years: [18]. 44. In Yip Kwok Sun v Poly-Style Ltd [2018] HKDC 437, the judge also seems to us to have correctly understood that the limitation period would be 20 years if adverse possession commenced before 1 July 1991 and 12 years if it commenced on or after 1 July 1991: see [85]-[86]. 45. A similar construction to that advocated by the defendant here was advanced by the squatter in Law Bing Kee v Person(s) in Occupation of RP & Another (unrep, HCMP 2270/2009, 8 March 2013). [16] The action there was commenced in November 2009. Counsel for the squatter-defendant argued that the cause of action in trespass accrued every day continuously and that the court need only be concerned with the relevant events within 12 years immediately before the commencement of the action. Recorder A Ho SC rejected that submission. After referring to the above passage in Yu Siu Cheuk , the Recorder said at [36]: “ What is relevant for consideration is when it is alleged the adverse possession began. In the present case, as adverse possession was alleged to have begun in the 1950s, the right of action would have first accrued before ‘the cutoff date of 1991’. The transitional provision under Section 38A is therefore engaged and the limitation period remains 20 years. It is only in cases where adverse possession is alleged to have begun after 1 July 1991 would the 12-year period be applicable.” In our view, although the Recorder referred to cases where adverse possession is alleged to have begun by a certain date, the same position may be applicable to cases where adverse possession was found to have begun by such date. As the passage in Yu Siu Cheuk suggests, where the objective fact as found by the court is that adverse possession began on or after 1 July 1991, the squatter may be able to rely on the shorter limitation period even though he had advanced a case of earlier adverse possession. Whether or not there may be valid pleading or procedural objections against that course will of course depend on the facts of each case, but as observed in Lau Wing Hong & Others v Wong Wor Hung & Another [2006] 4 HKLRD 671 at [145], it is always a matter of degree, and it can be unnecessarily demanding to require the party to plead in the prayer every possible permutation of the ultimate findings. Leaving aside the question of pleading, however, the Recorder in Law Bing Kee seems to us to have correctly focussed on the question of when the adverse possession began, which is relevant for the purpose of the transitional provision in s 38A(1). 46. Mr Miu has drawn our attention to Chau Mei Lee Fragrance v Ng Yee Tim & Another (unrep, CACV 97/1996, 18 December 1996). There the action was brought by an owner of a unit in a multi-story building to put a stop to another owner’s occupation of certain common areas in the building. The Recorder who tried the action found that it was time-barred based on adverse possession of 12 years from 1974. The adverse possession could not have begun earlier than 1 March 1974 and the writ was issued in January 1994. On this basis the Court of Appeal held the Recorder erred in applying a limitation period of 12 years and erred in holding the action was time-barred. Ching JA, who gave the judgment of the court, said: “ … the period of 12 years was substituted for the period of 20 years in 1991 but there were transitional provisions. Section 38A of the Limitation Ordinance provides that the period shall remain as it was before the amendment if the cause of action arose before 1 st July, 1991, which this cause of action clearly did. The Recorder was therefore in error in finding that the action was time barred. The limitation period was 20 years.” Since this was not a case with adverse possession lasting 12 years or more after 1 July 1991, it is not directly against Mr Chan’s submission in the present case, but it shows once again that, for the purpose of s 38A(1), the pivotal issue is the date when the cause of action accrued. 47. Mr Chan also prays an aid the legislative policy behind the 1991 amendment. It is said that cutting down the limitation period for the recovery of land from 20 years to 12 years was intended to be an amendment consequential upon the change brought about by the Conveyancing and Property (Amendment) Ordinance 1988, reducing from 25 years to 15 years the minimum period for which a vendor of land is required to produce documents to prove his title: see Legislative Council Brief on Limitation (Amendment) Bill 1990 dated 14 February 1990, paras 8-9; Hansard , 28 February 1990, p 21. Therefore, he submits, retaining the 20-year limitation period runs against the legislative intention to provide certainty in conveyancing practice and to avoid the risk of claims pre-dating the period in respect of which a vendor is required to show good title. 48. We acknowledge that the amendment to shorten the limitation period was put forward as a consequential amendment, but we do not think that this in itself can bear the weight the defendant seeks to put on it. There was in any event a gap between the amendment under the Conveyancing and Property (Amendment) Ordinance 1988, which came into effect in November 1988, and the relevant amendment under the Limitation (Amendment) Ordinance 1991, which took effect on 1 July 1991. Considerations of this kind cannot suffice to justify an interpretation of the statute which is opposed to the ordinary and natural meaning of the words used by the Legislature. 49. In this connection, it may be noted the Court of Appeal has applied the old limitation period of 20 years in a conveyancing case where any relevant cause of action would have arisen in April 1991: see Chun Tat Paper Co Ltd v Wong Ip Cheng [2013] 1 HKLRD 571. There a purchaser of property under two agreements both dated September 2010 alleged that the vendor had not properly answered a requisition relating to an equitable charge arising from a deed dated 25 April 1991 which had not formally been released. The Court of Appeal held, though the point was conceded, that limitation was not an answer since the date of the deed (on which the right of action accrued) was before 1 July 1991, “ so the transitional provision in s 38A of the Limitation Ordinance would apply to a cause of action which arose before that date and the applicable limitation period should be 20 years.” 50. For these reasons, we reject the defendant’s interpretation of the statutory provisions. As found by the Judge, the plaintiff’s cause of action accrued in about 1990 and before 1 July 1991. By virtue of s 38A(1) the applicable limitation period was 20 years. Ground 2 must therefore also fail. Conclusion 51. For the above reasons, the defendant’s appeal was dismissed except to the extent that the order for mesne profits to be assessed was to be substituted by an order for the defendant to pay nominal damages. It was unnecessary to and we did not hear submissions on the respondent’s notice. (MH Lam) (Thomas Au) (Godfrey Lam) Acting Chief Judge Justice of Appeal; Judge of the Court of the High Court of First Instance Mr Nelson Miu and Ms Jolie Kung, instructed by Hobson & Ma, for the Plaintiff Mr Johannes Chan SC (Hon) and Mr Tony Ko, instructed by George Y C Mok & Co, for the Defendant [1] The action was initially brought in the name of Tang Shau Ki. On 25 June 2014, the plaintiff obtained an order for him to represent the estate of Tang Shau Ki; on 25 July 2014, the title of the action was amended accordingly. [2] Subsequently amended on 12 December 2016. [3] 16 July 1991 being the date when a new structure S4 was seen from the aerial photograph of that date to have been erected on Lot 1 at the location of S2. [4] Paras 115 & 154 of the Judgment. [5] Paras 116-117 of the Judgment. [6] Lot Nos 64-67. [7] In January 2007, the defendant had become the Village Representative of the indigenous villagers of Wing Lung Wai. [8] Paras 144-146, 155-164 of the Judgment. [9] Citing Tang Kai Tung v Tang Wai Lun [2016] 3 HKLRD 96 at [54.1]-[54.4]. [10] Citing Hunter v Canary Wharf Ltd [1997] AC 655; Hong Kong Kam Lan Koon Ltd v Realray Investment Ltd (No 5) [2007] 5 HKC 122; St Marylebone Property Co Ltd v Fairweather [1963] AC 510; Wong Ka Fai v Wong Tin Choi (unrep, DCCJ 1607/2011, 1 November 2012); Mount Carmel Investments Ltd v Peter Thurlow Ltd & Another [1988] 1 WLR 1078. [11] Citing Hunter v Canary Wharf Ltd [1997] AC 655; Kirk v Sutherland [1949] VLR 33; Bayport v Watson [2002] VSC 206; Land Registration for the Twenty-First Century, A Consultative Document , published by the Joint Working Group of the Law Commission and the Land Registry of the UK in 1998, at [10.4]. [12] Para 96 of the Judgment. [13] See para 96 of the Judgement where the Judge said the father had his own ancestral property, that his house was house no 3 and that he and his wife later moved to house no 19. [14] ie any person other than the Government. [15] Not being the Government. [16] An application for leave to appeal out of time was rejected by Fok JA: HCMP 672/2013, 9 May 2013. Look up this case on Lawcite Noteup",
  "length": 39910,
  "headers_seen": [
    "Introduction",
    "Background",
    "The Judge’s decision",
    "The appeal",
    "Ground 1",
    "Ground 2",
    "Conclusion"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkca/2019/1102",
  "query": "adverse possession",
  "ts": "2025-10-17T10:44:08",
  "ok": true
}