{
  "title": "HSBC PRIVATE TRUSTEE (HONG KONG) LTD V. AU YEUNG CHUNG | [2008] HKCFI 954 | HKLII",
  "court": null,
  "year": 2008,
  "date": null,
  "content": "HKLII Databases Court of First Instance [2008] HKCFI 954 HSBC PRIVATE TRUSTEE (HONG KONG) LTD V. AU YEUNG CHUNG Judgment Information Date 27 Oct, 2008 Action No. HCA1662/2001 Neutral Cit. [2008] HKCFI 954 Download MS Word Judgment Reading Options Translation Toggle Highlight Appeal History HCA1662/2001 HCA001662E/2001 HSBC PRIVATE TRUSTEE (HONG KONG) LTD v. AU YEUNG CHUNG HCA 1662/2001 IN THE HIGH COURT OF THE HONG KONG SPECIAL ADMINISTRATIVE REGION COURT OF FIRST INSTANCE ACTION NO. 1662 OF 2001 ____________ BETWEEN HSBC PRIVATE TRUSTEE (HONG KONG) LTD (formerly known as BERMUDA TRUST (HONG KONG) LIMITED) Plaintiff and AU YEUNG CHUNG (for herself and on behalf of the estate of LAU HAK, Deceased) Defendant ____________ Before: Deputy High Court Judge Carlson in Chambers Date of Hearing: 27 October 2008 Date of delivery of Judgment: 28 October 2008 _______________ J U D G M E N T _______________ Introduction 1. This is the Plaintiff’s application for the assessment of mesne profits consequent upon its having obtained an order for possession of the land referred to in my order dated 4 January 2008, following my judgment in this action of the same date (pages 1 and 2-40 of the Hearing bundle). 2. The Plaintiff has put in expert evidence from a chartered surveyor and valuer which is at pages 44-69 of the same bundle. The claim for mesne profits is based on the open market rental value of the land from 19 December 1998 to 14 July this year when possession was given up, based on three-year agreements. The total amount assessed by Mr Chan, the Plaintiff’s expert is $3,446,000. It has been agreed that his assessment should be discounted by 20% which is $689,200 so as to have regard to a number of factors which the parties are agreed that Mr Chan should have had regard to which he does not appear to have done. If I award the Plaintiff what it seeks over the whole period that it is making its claim for, then it will get $2,756,800 plus interest. 3. As the parties are agreed on this aspect, I have not had to inquire into the basis of valuation and the validity of the comparables used by Mr Chan, in order to discover whether he has correctly assessed the open market value. Accordingly, I can put this part of the assessment to one side. The Dispute 4. In defending this assessment, Mr Szeto who appears for the Defendant, as he did at the trial of the action, has urged a number of matters the effect of which are that at best I should decline any mesne profits alternatively, that I should only award a nominal amount, presumably $1, or at worst, so far as he is concerned, only from November 2006 to 14 July 2008 which is the Plaintiff’s terminal date for its claim. 5. I propose to take Mr Suen’s, for the Plaintiff, argument first which I can take shortly and then go through Mr Szeto’s objections followed by Mr Suen’s reply and then come to my conclusions. 6. At the trial, I found that the Defendant had abandoned possession of the land in 1988 after which the Plaintiff had re-entered into possession and granted tenancies of it [paras 72-73 of the judgment, pages 38-39 of the Bundle]. The final tenancy expired on 18 December 1998 after which I held that the Defendant re-entered the land and proceeded to fence it and thereafter declined to give up possession upon being asked to do so on the Plaintiff’s behalf. She finally delivered possession on 14 July this year. 7. The basic principles of a claim for and an award of mesne profitsare well known. I need do no more than repeat here part of the relevant passage in Clerk & Lindsell [9 th Edition, paras.19-73]: “ Mesne profit In an action for the recovery of possession of land the claimant may join a claim for mesne profit (i.e. damages for wrongful occupancy). He is not, however, bound to do so, as a successful claim for possession is no bar to a subsequent action for mesne profits. When the claimant sues for such mesne profits alone, he must first enter to gain possession, and then the principle of trespass by relation enables him to sue for former profits. But if recovery of land is time-barred by adverse possession, the right to recover mesne profits is lost, just as is the right to recover rent. Under the head of mesne profits are included compensation for the value of the use and occupation of the premises, whether occupied by the defendant himself or by a tenant holding under him, and also any damage which has been caused to the premises themselves, for the term ‘ mesne profits’ is not confined to the profits which have accrued to the defendant, but extends to all loss that the claimant has sustained. ‘The principle need not be characterised as exclusively compensatory, or exclusively restitutionary; it combines elements of both’. In considering the value of the use and occupation the net annual value must be taken. … Mesne profits can be claimed up to the time when possession is given.” It is on this basis that the claim is now advanced and but for the objections raised by Mr Szeto to which I must shortly turn, I would have had no difficulty in making an award on this basis, the monetary value of the claim itself having been agreed by the parties. The Objections 8. The first ground advanced by Mr Szeto is that it is not now open to the Plaintiff to make such a claim. This should have been put forward and evidence in support of it led during the trial. It was not and therefore the Plaintiff should not be given a second bite at the cherry, as Mr Szeto describes it. What the Plaintiff is now seeking, says Mr Szeto, is in effect a split trial when no such order had been obtained. And so, as a matter of principle, I should not allow this application to proceed. 9. Related to this objection is the absence of a claim for mesne profits in the Statement of Claim although such a claim appears in the Plaintiff’s re-amended reply and defence to counterclaim, as a counterclaim to the Defendant’s counterclaim. Mr Szeto is not saying that he is taken by surprise because of the lack of a plea in the Statement of Claim but objects on the basis that this could and should have been done at one and the same time in the course of the trial. 10. I am bound to say as the trial judge that this has come as something of a surprise to me. I had rather proceeded on the basis that this was to be dealt with in the way that it has. I said so in the judgment and after I had ordered possession in the Plaintiff’s favour, I invited any application for mesne profits to be made which was to be preceded by a summons for directions. There was such a directions hearing in which leave was given for the preparation and admission of expert’s reports on valuation. This was not opposed at the directions hearing. Nor was there any indication at that time that this objection based as it is on principle would be raised on the Defendant’s behalf. Nevertheless, it now has and I must deal with it on its merits. Mr Szeto is right that both in opening the defence and in his closing submissions of the trial, he drew attention to the lack of a prayer for mesne profits. Whilst this is so, Mr Suen has, rightly in my view, drawn attention to the shape of the action which was a little unusual. When the action was first listed in November 2006, I allowed the Plaintiff to amend its pleadings to include a Basic Law claim for compensation in the event that it failed in its claim for possession. For a variety of reasons, which I need not go into, the trial was then adjourned. It was agreed that the question of whether the plea of adverse possession by the Defendant, this being the real issue in the case, should be tried first. If the Defendant were to succeed, I would then adjourn the trial and hear the Plaintiff’s claim for compensation under Article 6 of the Basic Law. This approach had guided the form of the proceedings which were to be tried in two parts and it was this which also caused the assessment of mesne profits, if that issue were to arise, to be tried after the resolution of the principal issue of adverse possession. 11. In my judgment, this is how this case was always going to be tried. Whist no formal order for a split trial has been made, this is the basis that I had always intended the matter to proceed hence my remarks to that effect in the judgment itself. 12. I am perfectly satisfied that the Plaintiff is entitled to have its assessment heard on its merits. 13. As to the failure to include a prayer for mesne profits in the Statement of Claim, I am going to give the Plaintiff leave to amend its statement of claim to include such a prayer which will in effect mean that it must transplant its prayer to this effect from its place in the Re-amended Reply and Defence to Counterclaim. The law is clear that the party can at its option once it has obtained possession bring a separate action for mesne profits. Where in this matter I am satisfied that this claim was being deferred to await the outcome on the question of adverse possession and the Defendant is not complaining and cannot complain that she has been taken by surprise by the lack of a prayer for mesne profits in the Statement of Claim, I propose to allow the prayer to be amended to include one. It is not sufficient for the prayer to be in the Re-amended Reply and Defence to Counterclaim. The costs, if any, of and occasioned by this amendment should be to the Defendant in any event. 14. This now brings me to the basis of the assessment of quantum. Mr Szeto has submitted that I should not entertain the assessment. This submission, I have just rejected for the reasons that I have given in the proceeding paragraphs. The argument now narrows itself down to the period during which the Plaintiff can claim mesne profits. 15. Mr Szeto says that at the very outside the Plaintiff should only be awarded a sum from the period November 2006 until 14 July 2008. Mr Suen’s position is that mesne profits should be payable for the whole of the period claimed. The fact is that although the Defendant had originally abandoned possession in 1988, after which on my finding the Plaintiff re-occupied the land and granted a series of tenancies. When those tenancies ended in December 1998, the Plaintiff re-took possession and fenced off the land, entry to which was now through a locked gate. This left the Plaintiff with no alternative but to issue these proceedings to obtain a possession order. This state of affairs continued until the possession order was made by me on 4 July this year consequent upon which possession was ultimately given up on 14 July. Based on that factual matrix, which is reflected in my judgment, the Plaintiff which has been deprived of its land since the end of 1998 must be entitled to be compensated from then until it had possession restored to it. Conclusion 16. Accordingly, I will award the Plaintiff mesne profits for the whole of the period that it claims for, on what is now an agreed basis of calculation, in the amount of $2,756,800 and I will now hear counsel on the question of interest and on costs. When I have done that Mr Szeto proposes to ask for a stay of execution which I will then hear and rule on. (Ian Carlson) Deputy High Court Judge Jenkin Suen, instructed by Messrs Deacons, for the Plaintiff Patrick Szeto, instructed by Messrs Ho, Tse, Wai & Partners, for the Defendant Look up this case on Lawcite Noteup",
  "length": 11375,
  "headers_seen": [
    "Introduction",
    "The Dispute",
    "The Objections",
    "Conclusion"
  ],
  "source": "HKLII",
  "url": "https://www.hklii.hk/en/cases/hkcfi/2008/954",
  "query": "mesne profits",
  "ts": "2025-10-16T12:11:14",
  "ok": true
}